[
  {
    "title": "The Basque derby - the friendliest rivalry in world football?",
    "desc": "With a sense of shared identity and fans mixing in the stands, is the Basque derby between Athletic Club and Real Sociedad the friendliest in the world?",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5b0d/live/9e44f6e0-fdf5-11f0-a8b8-bdd2c5f9bcad.jpg",
    "source": "BBC"
  },
  {
    "title": "Iran warns of regional conflict if US decides to attack",
    "desc": "The comment follows US President Donald Trump telling reporters aboard Air Force One that Iran is \"seriously\" talking to the US and hinted at a deal to avoid military strikes.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/703854",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Iran in 'serious discussions' with US, Trump says, as military threat looms",
    "desc": "Iran is expected to begin a live-fire naval exercise in the Strait of Hormuz, a key shipping route.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/106f/live/473c3c60-ff4d-11f0-861a-555f9d353c11.jpg",
    "source": "BBC"
  },
  {
    "title": "25-Year-Old Nigerian Singer, Ifunanya ‘Nanyah’, Dies After Snakebite Over Lack of Anti-Venom In Abuja Hospitals",
    "desc": "Ifunanya Nwangene, a 25-year-old Abuja-based classical, jazz, RnB, and soul singer, popularly known by her stage name Nanyah, has reportedly passed away after suffering a snake bite at her residence in the early hours of the morning. SaharaReporters gathered that the incident occurred at her home in Abuja when a snake attacked her, inflicting a bite that later proved fatal.",
    "image": "https://saharareporters.com/themes/custom/octavia_sahara/favicon.ico",
    "source": "Sahara Reporters"
  },
  {
    "title": "The HONOR 2.2 Feb-ibig Sale is here, featuring big deals on select smartphones",
    "desc": "To welcome Hearts Month, HONOR Philippines announced its 2.2 Feb-ibig Sale, featuring deals on three X-series devices.",
    "image": "https://www.ungeek.ph/wp-content/uploads/2026/02/honor-2.2-sale-2026.webp",
    "source": "UnGeek"
  },
  {
    "title": "Myanmar junta calls coup-protesting civil servants back to work",
    "desc": "After the military snatched power in a coup on Feb 1, 2021, tens of thousands of public workers, including doctors and government administrators, left their posts in a surge of civil disobedience.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/01/e70927a3-myanmar-election-04102026.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "'Blind to India’s real crises': How Rahul Gandhi, oppn leaders reacted to the Union Budget",
    "desc": "India Business News: NEW DELHI: Finance minister Nirmala Sitharaman on Sunday presented the Union Budget for the financial year 2026-27 in the Lok Sabha during the ongoing.",
    "image": "https://static.toiimg.com/thumb/msid-127837947,width-1280,height-720,imgsize-1062698,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "A mum and her two kids pose in a normal, loving family photo. Within days, they were all murderers",
    "desc": "Joanne Maxwell recruited her own kids, Liam Donlin and Amie Clegg, to kill a man on his doorstep",
    "image": "https://i2-prod.manchestereveningnews.co.uk/article33340508.ece/ALTERNATES/s1200/0_Amie-Clegg-Joanne-Maxwell-and-Liam-Donlin.jpg",
    "source": "Manchester Evening News"
  },
  {
    "title": "Watch as Jordan Ayew misses first in-game penalty of his career",
    "desc": "For a player long regarded as one of the most reliable spot-kick takers for club and country, Saturday, January 31, 2026, marked an unfamiliar moment for Jordan Ayew.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/428/42807275.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "DR Congo president outlines pre-conditions for a national dialogue",
    "desc": "Félix Tshisekedi reaffirmed his commitment to inclusive and peaceful talks between all the country's people.",
    "image": "https://images.euronews.com/articles/stories/09/63/42/93/1024x538_cmsv2_bbebe69c-9c0b-54cd-af0d-8d62a72b1a01-9634293.jpg",
    "source": "africanews.com"
  }
]