[
  {
    "title": "Growth riding on ‘horse’ power",
    "desc": "KUALA LUMPUR: The Year of the Horse signals strength and energy that can help spur economic growth and national development, says Datuk Seri Anwar Ibrahim.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/19/3775684.jpg",
    "source": "The Star"
  },
  {
    "title": "Live Updates: Players and teams to watch before the NBA season resumes tomorrow",
    "desc": "Enjoy players to watch, teams to consider and historic highlights as we gear up for the NBA season to resume tomorrow night.",
    "image": "https://cdn.nba.com/manage/2026/02/GettyImages-2259480952_cropped_processed_by_imagy-scaled.jpg",
    "source": "NBA"
  },
  {
    "title": "Level Agreement on the Eighth Review Under the Extended Credit Facility and Fourth Review Under the Resilience and Sustainability Facility",
    "desc": "An International Monetary Fund (IMF) staff team, led by Ms. Izabela Karpowicz, held virtual meetings with the Nigerien authorities between December 9, 2025 and February 10, 2026, in the context of the eighth review of the ECF-supported arrangement and the fourth review under the RSF.",
    "image": "https://www.imf.org/-/media/project/imf/shared/images/news/twitter-seal.png?h=405&iar=0&w=400",
    "source": "International Monetary Fund | IMF"
  },
  {
    "title": "Ras Mubarak: AU must deploy troops to combat terrorism in West Africa",
    "desc": "The Lead Campaigner of the Trans Africa Tourism and Unity Campaign, Ras Mubarak, has called on the African Union (AU) to take decisive action against",
    "image": "https://citinewsroom.com/wp-content/uploads/2026/02/RAS-2.png",
    "source": "CitiNewsroom.com"
  },
  {
    "title": "From crime heists to a BDSM love story, here's what's in cinemas this month",
    "desc": "Australians will also finally be able to catch Sirât and The Voice of Hind Rajab, two movies that will be vying for Best International Film at the Academy Awards next month.",
    "image": "https://live-production.wcms.abc-cdn.net.au/51bc0a5a3b1eb4cb48f3f6c6c0811422?impolicy=wcms_watermark_news&cropH=2025&cropW=3600&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "'We deserve it!' - Mikel Arteta admits Arsenal 'paid the price' for sloppiness in stunning collapse to Wolves",
    "desc": "Arsenal manager Mikel Arteta has called on his players to 'stand up' after they threw away a two-goal lead away at Wolves on Tuesday. The Gunners conceded deep into added time and were held to a 2-2 draw by the team sitting bottom of the table - the first time a side top of the Premier League has ever blown such an advantage against opposition in the relegation zone.",
    "image": "https://assets.goal.com/images/v3/getty-2262356862/crop/MM5DGMRQGA5DCOBQGA5G433XMU5DCORZGQ======/GettyImages-2262356862.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Trump family says U.S. dollar needs an upgrade, and they can do it",
    "desc": "Eric Trump and Donald Trump Jr. told CNBC on the sidelines of the World Liberty Forum to explain why they think the U.S. needs an alternative to the dollar.",
    "image": "https://image.cnbcfm.com/api/v1/image/108266809-1771430608345-Trump8.jpg?v=1771454211&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "UNC Awaiting Henri Veesaar's Return to Practice and Games",
    "desc": "A team spokesman confirmed that UNC's seven-footer is still being held out of practice, more than a week after suffering the injury.",
    "image": "https://on3static.com/uploads/dev/assets/cms/2026/02/18162411/0C1A0007-henri-veesaar-1.jpg",
    "source": "On3"
  },
  {
    "title": "Kansas, Idaho, Utah, Oklahoma in New Push to Restrict Transgender Rights",
    "desc": "In states that once focused mainly on health care and sports for transgender minors, debates now revolve around the validity of transgender identity.",
    "image": "https://static01.nyt.com/images/2026/02/18/multimedia/18nat-trans-states-1-wjft/18nat-trans-states-1-wjft-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "'People don't recognise me since I lost weight' - Gregor Fisher",
    "desc": "The actor best known for playing Rab C Nesbitt was recently diagnosed with diabetes and told to make some lifestyle changes.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/43f5/live/685b1a70-0c3f-11f1-b8ba-135d136c986f.jpg",
    "source": "BBC"
  }
]