[
  {
    "title": "Salman Khan, Ranbir Kapoor, Akshay Kumar, Vicky Kaushal and more celebs attend RSS centenary event in Mumbai. See pics",
    "desc": "Several Bollywood stars were spotted at a grand event in Mumbai to mark the centenary celebrations of the Rashtriya Swayamsevak Sangh (RSS). | Bollywood",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/08/550x309/ranbir_aamir_salman_RSS_1770549023581_1770549039361.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "From a massive living room to lavish bedrooms: A look at Samay Raina’s luxurious house",
    "desc": "Samay Raina, who is loved and known for his comic timing, recently shared a house tour. He appeared in a YouTube video with Archana Puran Singh’s son, Aaryamann Sethi, where he gave a glimpse into his home. The house has a chill zone, streaming room, dining area, and much more. Here’s a look at his lavish house:",
    "image": "https://static.toiimg.com/thumb/msid-128069693,width-1280,height-720,imgsize-28964,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "SBI, PNB, Bank of Baroda: PSU banks' profit to cross ₹2 lakh crore milestone in FY26, says DFS Secretary Nagaraju",
    "desc": "SBI share price: \"As I said, banks are the bellwether for the strength of the economy. Therefore, they are resilient. We have very prudent management systems in place under the regulator, the RBI. So we are not much worried about the external factors negatively impacting our banking sector,\" Nagaraju told PTI in an interview.",
    "image": "https://assets.upstox.com/content/assets/images/news/banking-stocks-feb-9.webp",
    "source": "Upstox"
  },
  {
    "title": "Pakistan boycott: PCB and ICC officials meet in Lahore",
    "desc": "Officials from the ICC and the PCB will meet in Lahore on Sunday for talks over Pakistan's planned boycott of their T20 World Cup match against India.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e3b8/live/0e9a0c20-04e3-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  },
  {
    "title": "Japan’s Takaichi set for landslide election win, exit poll shows",
    "desc": "Japanese Prime Minister Sanae Takaichi's ruling coalition is set for a landslide victory, exit polls showed, a move that may accelerate a defense build-up aimed at countering China.",
    "image": "https://images.gmanews.tv/webpics/2026/02/2026-02-08T004624Z_232586343_RC2CHJA0WWZ4_RTRMADP_3_JAPAN-ELECTION_2026_02_08_19_42_26.JPG",
    "source": "GMA Network"
  },
  {
    "title": "[PHOTOS] Ruto opens AIC Pipeline Church, gives choir Sh1 million",
    "desc": "Ruto vowed to support the singers with another set of uniforms, but with a light condition",
    "image": "https://cdn.radioafrica.digital/image/2026/02/bff75ef5-a970-460c-89c2-6076998cd4f4.jpg?1770556862979",
    "source": "the-star.co.ke"
  },
  {
    "title": "Osotsi slams President Ruto over alleged interference in ODM affairs",
    "desc": "Vihiga Senator Godfrey Osotsi has warned that the ODM risks implosion if internal disputes are not addressed through structured consultations and respect for party democracy.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/jOvqTtL4HOU16wfopRbhPrXJvRb22y8OwUgAcUUy.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "winning ticket as urgent appeal issued to players",
    "desc": "The ticketholder missed out on winning Saturday's €8.8 million jackpot by just one number - but still bagged themselves a life-changing sum",
    "image": "https://i2-prod.irishmirror.ie/article36474880.ece/ALTERNATES/s1200/0_nationallottery.jpg",
    "source": "Irish Mirror"
  },
  {
    "title": "Attacked with padlocks, helmets thrown: Police arrest 10 over violent clash at KL café",
    "desc": "KUALA LUMPUR, Feb 8 — An altercation at a café in Taman Beringin last night led to the arrest of 10 local men who were later involved in a violent clash using dangerous...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/08/324549.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "Gold (XAUUSD) Price Forecast: Price Prediction - Rally Launch Pad or Bull Trap?",
    "desc": "Gold rallies to $4964.62 as big money stays after margin hike. Gold rally hinges on 50-day moving average—launch pad for breakout or trigger for decline?",
    "image": "https://responsive.fxempire.com/v7/_fxempire_/2026/01/Neutral-Gold.jpg?func=cover&q=70&width=700",
    "source": "FXEmpire"
  }
]