[
  {
    "title": "Robotic Hand Detaches, Crawls, and Retrieves Items Independently",
    "desc": "The innovative robotic hand features reversible fingers, allowing for autonomous movement and multi-object handling, merging mobility with manipulation.",
    "image": "https://www.azorobotics.com/images/news/ImageForNews_16322_17701136678443790.jpg",
    "source": "AZoRobotics"
  },
  {
    "title": "Scatec JV reaches financial close for 80 MW BESS in the Philippines and prepares for construction start",
    "desc": "Oslo/Manila, 03 February 2026: SN Aboitiz Power (SNAP), Scatec ASA’s joint venture with Aboitiz Renewables, inc., the renewable energy arm of Aboitiz Power Corporation in the Philippines, has reached financial close and prepares for construction start of the 40 MW Binga (phase 2) and 40 MW Ambuklao battery energy storage systems (BESS). The battery systems…",
    "image": "https://www.scatec.com/en/wp-content/uploads/sites/2/2026/01/scatec-og-image-768x403.jpg",
    "source": "scatec.com"
  },
  {
    "title": "Uganda: How Uganda Is Building the Next Generation of Content Creators",
    "desc": "Uganda's creative economy is stepping into a new phase, driven by expanded digital infrastructure, targeted skilling programmes and growing collaboration between government and private sector players.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Best streaming stick deal: Save $20 on the Google TV Streamer 4K",
    "desc": "Get the best streaming deal. Save 20% on the Google TV streamer 4K at Amazon.",
    "image": "https://helios-i.mashable.com/imagery/articles/03Yf10AWbfz4ftO5nyUK0dT/hero-image.fill.size_1200x675.v1770105625.png",
    "source": "Mashable"
  },
  {
    "title": "Sandro Tonali: Newcastle midfielder 'very happy' at club amid Arsenal links",
    "desc": "Manager Eddie Howe says Sandro Tonali is \"very happy\" at Newcastle United after the midfielder was linked with a move to Arsenal.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e08e/live/f23667e0-00d2-11f1-a266-e3d9153f08c1.jpg",
    "source": "BBC"
  },
  {
    "title": "Sandro Tonali: Newcastle midfielder 'very happy' at club amid Arsenal links",
    "desc": "Manager Eddie Howe says Sandro Tonali is \"very happy\" at Newcastle United after the midfielder was linked with a move to Arsenal.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e08e/live/f23667e0-00d2-11f1-a266-e3d9153f08c1.jpg",
    "source": "BBC"
  },
  {
    "title": "Maharlika Investment Corp.’s Consing gets board seat in Asian Terminals Inc.",
    "desc": "Maharlika Investment Corp. (MIC), the state-run firm managing the county’s sovereign wealth fund, on Tuesday announced that its president and CEO Rafael Jose Consing Jr. was elected by shareholders of Asian Terminals Inc. (ATI) as an additional member of the ports operator’s Board of Directors.",
    "image": "https://images.gmanews.tv/webpics/2023/11/consing_2023_11_13_11_46_59.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Lab-grown, “living” heart tissues: a major breakthrough",
    "desc": "Described as “hearts on a chip,” the engineered tissues are produced through 3D bioprinting with a bio-ink developed in a laboratory at the UdeM-affilated CHU Sainte-Justine.",
    "image": "https://nouvelles.umontreal.ca/public/nouvelles/_processed_/1/d/csm_20260202_tissus-cardiaques_857ba5c35d.jpg",
    "source": "Université de Montréal"
  },
  {
    "title": "vivo X300 Ultra to offer improved night photography, claims rumor",
    "desc": "The X300 Ultra is rumored to feature dual 200MP cameras. The vivo X300 Ultra has seen its fair share of leaks and rumors. It is expected to offer improved...",
    "image": "https://fdn.gsmarena.com/imgroot/news/26/02/vivo-x300-ultra-camera-specs-new-leak/-952x498w6/gsmarena_000.jpg",
    "source": "GSMArena.com"
  },
  {
    "title": "Laws of Cricket: MCC allow bats which were previously 'illegal'",
    "desc": "Changes are to be made to the Laws of Cricket to permit bats previously deemed illegal in an effort to make the game affordable for amateur players.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/17e3/live/b75a0db0-0097-11f1-95a2-1bf59e80442d.jpg",
    "source": "BBC"
  }
]