[
  {
    "title": "By Design, Not by Drift: The Political Economy Uganda Must Deliberately Construct!",
    "desc": "Uganda is not Europe, not East Asia, not a blank slate, and certainly not a laboratory for ideological purity.",
    "image": "https://i0.wp.com/tanzaniatimes.net/wp-content/uploads/2026/01/uganda-political-economy.jpg?fit=1170%2C580&ssl=1",
    "source": "The Tanzania Times"
  },
  {
    "title": "Tower Semiconductor surges to $15 billion valuation, tripling Intel’s abandoned bid",
    "desc": "Shares are up more than 160% in six months as investors embrace the AI infrastructure story.",
    "image": "https://pic1.calcalist.co.il/picserver3/crop_images/2022/02/16/BkLNQV915/BkLNQV915_1_102_3000_1689_0_large.jpg",
    "source": "CTech"
  },
  {
    "title": "SIFFCY 2026 Begins in New Delhi With Inclusion Focus",
    "desc": "The 12th edition of the Smile International Film Festival for Children and Youth (SIFFCY) commenced in New Delhi today, reaffirming the role of cinema as a tool for socia",
    "image": "https://i0.wp.com/www.gktoday.in/wp-content/uploads/2019/05/logopeg.jpg?fit=32%2C32&ssl=1",
    "source": "GK Today"
  },
  {
    "title": "TANFORD sets the Trade and Logistics platform to promote Tanzania globally",
    "desc": "DUBAI: THE Tanzania Freight Forwarders Representation in Dubai (TANFORD) has organised a two-day forum scheduled to take place in Dubai, United Arab Emirates, aimed at promoting Tanzania in international markets and opening up business opportunities for Tanzanian traders. Speaking to journalists, TANFORD Chairperson, Hussein Jamal, said the forum, dubbed the Tanzania Trade and Logistics Forum",
    "image": "https://dailynews.co.tz/wp-content/uploads/2022/07/favicon.ico",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Trump wants to create conditions for ‘regime change’ in Iran - US sources",
    "desc": "CNN reports Iran balked at demand to curb its missile program, Trump wants powerful strike to force a deal; US, Israeli officials said to warn air power alone can't topple theocracy",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/01/AP26028672191491.jpg",
    "source": "timesofisrael.com"
  },
  {
    "title": "Israeli Researchers Develop New Treatment That May Reduce Epilepsy Seizures and Protect Brain Function",
    "desc": "A new treatment developed by Israeli researchers could […]",
    "image": "https://themedialine.org/wp-content/uploads/2025/11/3d-medical-background-with-male-figure-brain-e1763299574792.jpg",
    "source": "themedialine.org"
  },
  {
    "title": "Hewett into singles semis but loses in doubles",
    "desc": "Alfie Hewett continues his Australian Open singles title defence by beating Gordon Reid - before the British pair lose their doubles semi-final.",
    "image": "https://s.yimg.com/os/en/bbc_us_articles_995/9bdd0c307d68aa33705079bff5ecccfe",
    "source": "Yahoo Sports"
  },
  {
    "title": "Malaysia Airlines, Singapore Airlines formalise strategic joint business partnership",
    "desc": "KUALA LUMPUR: Malaysia Airlines Bhd (MAB) and Singapore Airlines (SIA) have formalised their joint business partnership which will allow them to deepen their commercial partnership, enhance connectivity and offer greater flexibility for customers travelling between Malaysia and Singapore.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/29/3744443.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Woman ‘murdered girlfriend and buried her in garden after she couldn’t afford gender reassignment surgery’",
    "desc": "A WOMAN murdered and buried her partner in the garden after she couldn't afford gender reassignment surgery, a court heard.\nAnna Podedworna is...",
    "image": "https://www.thesun.co.uk/wp-content/uploads/2026/01/newspress-collage-3qcnq9ph4-1769676231995.jpg?quality=90&strip=all&1769676260&w=1920&h=1080&crop=1",
    "source": "The Sun"
  },
  {
    "title": "Conor Coady: Charlton Athletic sign Wrexham defender on loan",
    "desc": "Charlton Athletic sign experienced central defender Conor Coady from fellow Championship club Wrexham on loan until the end of the season.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bff3/live/74be0550-fcf6-11f0-9c55-8bade468c676.jpg",
    "source": "BBC"
  }
]