[
  {
    "title": "The Manchester-made tool reducing space satellite crashes",
    "desc": "The tool links what a satellite needs to do, like capturing high‑resolution images, with collision risks.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bc6d/live/a3a7d1e0-0b36-11f1-89e7-89779f9c687a.jpg",
    "source": "BBC"
  },
  {
    "title": "made tool reducing space satellite crashes",
    "desc": "The tool links what a satellite needs to do, like capturing high‑resolution images, with collision risks.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bc6d/live/a3a7d1e0-0b36-11f1-89e7-89779f9c687a.jpg",
    "source": "BBC"
  },
  {
    "title": "Do Deewane Seher Mein Box Office Day 1: Siddhant Chaturvedi & Mrunal Thakur Deliver 5th Highest Bollywood Opener Of 2026!",
    "desc": "Siddhant Chaturvedi and Mrunal Thakur's Do Deewane Seher Mein lived up to predictions despite strong competition. Read box office updates!",
    "image": "https://www.koimoi.com/wp-content/new-galleries/2026/02/do-deewane-seher-mein-box-office-day-1-collection-01.jpg",
    "source": "Koimoi"
  },
  {
    "title": "How water project will transform Mwanza",
    "desc": "MWANZA: WATER is a vital resource for human life and overall social development. Without water, there can be no agriculture, no industry, and no safe living. In today’s world, where climate change and rapid population growth continue to affect access to water, its importance in boosting the economy and protecting public health has become even",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/image-10.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "How walking saved a Cornwall dad after burnout and addiction",
    "desc": "Dean Cooper shares how Cornwall's country lanes helped him deal with burnout and stress.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/334c/live/b3faf980-0e53-11f1-9d6e-2b202385ad19.jpg",
    "source": "BBC"
  },
  {
    "title": "How Rap and Hip-Hop are transforming the French and their everyday language",
    "desc": "On International Mother Language Day, we look at how rap and hip-hop artists are mixing languages and spreading a vernacular that captures the contemporary Francophone world: multi-ethnic, multilingual, and shaped by migration.",
    "image": "https://images.euronews.com/articles/stories/09/65/78/26/1200x675_cmsv2_3cdecfee-d437-5fd5-bc99-09f45215475e-9657826.jpg",
    "source": "Euronews.com"
  },
  {
    "title": "Devon actor 'never thought' he would be cast in Lord of the flies",
    "desc": "Tom Page-Turner plays Bill in the BBC new series and spent a number of months filming in Malaysia.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/20ca/live/1701e4e0-0e62-11f1-ac78-0950755f28c4.jpg",
    "source": "BBC"
  },
  {
    "title": "‘Bofrot, plantain chips sellers use plastics in frying to get them crispy’ - AMA officer",
    "desc": "The Director of Public Health at the Accra Metropolitan Assembly (AMA), Florence Kuukyi, has raised concerns over some dangerous practices by certain food vendors.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/763/76392350.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Hundreds tell BBC that medication triggered gambling and other addictions",
    "desc": "More than 250 people contacted us describing impulsive behaviour side effects from prescription drugs.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6fd3/live/29566790-0e5a-11f1-801d-ed3cff6bf876.jpg",
    "source": "BBC"
  },
  {
    "title": "The Genesis Invitational: Rory McIlroy one adrift of co-leaders Marco Penge and Justin Bridgeman as Scottie Scheffler extends cut streak",
    "desc": "Rory McIlroy shoots bogey-free 65 on day two in California, with four birdies and an eagle; Scottie Scheffler rallies on back nine to make his 68th successive cut; Marco Penge shares lead after seven-under 65; watch third round live on Sky Sports Golf from 3.15pm Saturday",
    "image": "https://e0.365dm.com/26/02/1600x900/skysports-rory-mcilroy-pga-tour-golf_7170702.jpg?20260221063945",
    "source": "Sky Sports"
  }
]