[
  {
    "title": "Creative Expression And Control",
    "desc": "Artists, States and the Struggle Over Freedom of Expression",
    "image": "https://www.thereporterethiopia.com/wp-content/uploads/2026/02/CREATIVE-EXPRESSION-AND-CONTROL.jpg",
    "source": "The Reporter Ethiopia"
  },
  {
    "title": "QC gov't expands road safety drive with AAP under Stay Bright campaign",
    "desc": "The Quezon City government has expanded its road safety program through a strengthened partnership with the Automobile Association of the Philippines (AAP)...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/14/79345.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "US pressure on Greenland is ‘totally unacceptable’, says Danish PM - Europe live",
    "desc": "Mette Frederiksen tells Munich Security Conference that Denmark is willing to work with the US, but ‘there are, of course, things that you cannot compromise on’",
    "image": "https://i.guim.co.uk/img/media/3a181ed186bf5bb4b4cb368a7225b1d95b924dfd/46_0_3245_2596/master/3245.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=c17e726e46c851a7668122ecdf98e3d4",
    "source": "The Guardian"
  },
  {
    "title": "Trump remains ‘very serious’ about taking over Greenland, Danish PM warns - Europe live",
    "desc": "‘I think the desire from the US president is exactly the same,’ Mette Frederiksen tells Munich Security Conference",
    "image": "https://i.guim.co.uk/img/media/3a181ed186bf5bb4b4cb368a7225b1d95b924dfd/46_0_3245_2596/master/3245.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=c17e726e46c851a7668122ecdf98e3d4",
    "source": "The Guardian"
  },
  {
    "title": "Trump remains ‘very serious’ about taking over Greenland, Danish PM warns - Europe live",
    "desc": "‘I think the desire from the US president is exactly the same,’ Mette Frederiksen tells Munich Security Conference",
    "image": "https://i.guim.co.uk/img/media/3a181ed186bf5bb4b4cb368a7225b1d95b924dfd/46_0_3245_2596/master/3245.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=c17e726e46c851a7668122ecdf98e3d4",
    "source": "The Guardian"
  },
  {
    "title": "Munich security conference live: Europe must be ready to fight Russia as ‘warning signs are there’, says Starmer",
    "desc": "Russia has shown ‘appetite for aggression’ and possible path for Europe’s future, UK prime minister says",
    "image": "https://i.guim.co.uk/img/media/6e4de0f996e420fcbb4ca72620b9cb5c78a633a4/35_0_3747_3000/master/3747.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=ff505a57c2c5c69cca849209c4c064a0",
    "source": "The Guardian"
  },
  {
    "title": "Valentine's Day: DCI issues safety advisory over first meetings from dating apps",
    "desc": "The DCI has urged Kenyans to prioritise their safety when meeting people they connect with through dating apps and social media platforms, warning that online interactions can sometimes expose users to crime.",
    "image": "https://citizentv.obs.af-south-1.myhuaweicloud.com/118496/conversions/LYNXMPEB1D008-og_image.webp",
    "source": "Citizen Digital"
  },
  {
    "title": "PT HEALTH WATCH: Untreated piles can lead to anaemia, severe pain - Expert",
    "desc": "The expert explained that haemorrhoids are swollen veins in the lower rectum or anus, a medical condition that is frequently dismissed or casually referred to as “piles”.",
    "image": "https://media.premiumtimesng.com/wp-content/files/2026/02/Untitled-design-64.jpg",
    "source": "Premium Times Nigeria"
  },
  {
    "title": "Researchers develop high-capacitance graphene films for improved supercapacitors",
    "desc": "Researchers from China's Dalian Jiaotong University and South China Academy of Advanced Optoelectronics have developed a graphene-based electrode for supercapacitors using a novel slit evaporation self-assembly process. The resulting freestanding sulfuric acid-treated reduced graphene oxide/commercial graphene (S-ATrGO/CG) films demonstrate excellent energy storage capabilities and durability, potentially benefitting graphene-enhanced supercapacitors. The team introduced a capillary slit-assisted self-assembly method that leverages narrow glass slits to guide the controlled stacking of graphene flakes during solvent evaporation. This process promotes highly ordered, laminated structures, reducing the common issue of flake restacking that limits ion transport in conventional graphene films. Capillary forces, combined with π–π interactions and electrostatic attraction, ensure that sulfuric acid-treated graphene oxide (ATGO) and commercial graphene (CG) align into continuous, freestanding films with high structural integrity. A mild sulfuric acid treatment plays a crucial chemical role by converting inert epoxy groups on graphene oxide into electrochemically active hydroxyl and carboxyl groups. These active sites enhance pseudocapacitance, while subsequent thermal reduction improves electrical conductivity. The result is a finely balanced electrode material that offers both fast charge transport and robust chemical stability.Electrochemical testing revealed impressive performance metrics:Areal capacitance: 1,589.78 mF·cm⁻² at 5 mV·s⁻¹Volume capacitance: 132.48 F·cm⁻³Energy density: 0.22 mWh·cm⁻²Power density: 8.69 mW·cm⁻²Cycle stability: 99.80% capacitance retention over 20,000 cycles at 50 mA·cm⁻²Compared with electrodes prepared by conventional drop-casting, the slit-assembled S-ATrGO/CG films demonstrate superior electron mobility, heat dissipation, and structural uniformity, all contributing to their enhanced electrochemical performance.This study offers a scalable route for producing freestanding, high-capacitance graphene electrodes, advancing the potential of supercapacitors in flexible electronics, micro-energy devices, and next-generation sustainable energy systems.",
    "image": "https://www.graphene-info.com/img/graphene-info-favicon.ico",
    "source": "Graphene-Info"
  },
  {
    "title": "Mercantile Introduces Pakistan’s Most Comprehensive Protection Plan for iPhone, Featuring Liquid Damage Coverage",
    "desc": "Mercantile, the Apple Authorized Distributor in Pakistan, is proud to announce the launch of the Mercantile Protection Plan powered by SureCover.",
    "image": "https://propakistani.pk/wp-content/uploads/2025/06/Mercantile.png",
    "source": "ProPakistani"
  }
]