[
  {
    "title": "'Will not take any step in secrecy': Former Assam Congress chief Bhupen Borah resigns ahead of assembly elections",
    "desc": "India News: NEW DELHI: Former Assam Congress chief Bhupen Kumar Borah resigned from the party ahead of the upcoming elections in the state.In his letter to the Co.",
    "image": "https://static.toiimg.com/thumb/msid-128410548,width-1280,height-720,imgsize-1316210,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Proceedings due to get under way in Natalie McNally murder trial",
    "desc": "Stephen McCullagh, 35, from Woodland Gardens, Lisburn, has denied murdering her.",
    "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjZcXFwvMDJcXFwvMTYwNjMxMTdcXFwvMi43MDU1MzUyOS5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvd3d3LmJyZWFraW5nbmV3cy5pZVxcXC9pXFxcL2JuLW5vaW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6ImRmNGNhY2E5ZGM3M2RjOTYzZTMzZjZkOTBmMzczZjg5MTk3OWE5ZWUifQ==/proceedings-due-to-get-under-way-in-natalie-mcnally-murder-trial.jpg",
    "source": "BreakingNews.ie"
  },
  {
    "title": "MUIS removes compounded fidyah payment and updates rate to $4 a day; zakat fitrah set at $5 or $8",
    "desc": "The new rate of $4 a day reflects the average cost of a moderate meal in Singapore, said MUIS. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/e9ccf4d4a71a96e84984ccafdc19e71e9d28585b911c988c7e33ec9755b31dc2",
    "source": "The Straits Times"
  },
  {
    "title": "'Little hands, big hearts': How a young family's community projects are inspiring others",
    "desc": "The family was mentioned by Prime Minister Lawrence Wong in his Budget 2026 speech as an example of how ground-up initiatives can make a difference.",
    "image": "https://dam.mediacorp.sg/image/upload/s--cWUL5gMV--/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/16/20260215_alyssa_littlehandsbighearts_4.jpg?itok=HSrYrwgT",
    "source": "CNA"
  },
  {
    "title": "NPA commander killed in clash",
    "desc": "BUTUAN CITY – A New People’s Army (NPA) commander was killed and an undetermined number of his comrades were wounded in an encounter in the border of Agusan...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/16/79627.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Concerns over autocracy in the U.S. continue to grow",
    "desc": "Is America still a democracy? Scholars tell NPR that after the last year under President Trump, the country has slid closer to autocracy or may already be there.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5577x3137+0+290/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F1e%2Fac%2Fb684398545cf825185f505cf70bf%2Fgettyimages-2258731686.jpg",
    "source": "NPR"
  },
  {
    "title": "Lesotho, Cote d'Ivoire Ministers Highlight Water Security and Sanitation as Pillars of Dev't",
    "desc": "Addis Ababa, February 16, 2026 (ENA)—Lesotho and Cote d'Ivoire Ministers have underscored the strategic importance of water resources and sanitation in driving socio-economic development across the continent.\nIn an exclusive interview with ENA, Lesotho Foreign Affairs Minister Lejone Mpotjoana, who is in Addis for the 48th Ordinary Session of the AU Executive Council, noted that water is a vital source for Southern Africa.\nThe Foreign Minister stressed that water remains not only one of Lesotho’s most important strategic resources but also that of the region.\n“This is one of the most important subjects for Lesotho as the water source for the Southern African region.”\nHe therefore called for broader consultation and cooperation with neighboring countries, including South Africa, Botswana, and Namibia as well as international organizations involved in water resource management.\nReaffirming his country’s support for multilateralism, Mpotjoana emphasized Lesotho’s active participation in the Southern African Development Community and cooperation with institutions such as the European Union.\n“As a smaller country, as a smaller economy, our voice is heard” through multilateral organizations, he said. “Together, two hands can only clap. A single hand cannot clap.”\nHe further warned that underdevelopment and over-reliance on external actors are key sources of conflict, urging African countries to strengthen domestic capacity and calling on the African Union to play a stronger role in advancing economic development across the continent.\nFor his part, Cote d'Ivoire Environment and Ecological Transition Minister, Abou Bamba, highlighted his country’s investments in water and sanitation.\n“My country is investing in the sector of sanitation and access to water for several reasons. Water plays an important role in our overall socio-economic development process,” he said.\nElaborating on this point, the Minister stated that water supports multiple sectors in the country. “We use water for navigation. We use water for energy. We use water for agriculture; and water is also an excellent strategic positioning for my country in the sub-region.”\nAccording to Bamba, Côte d’Ivoire is making steady progress toward universal access to safe drinking water.\n“We are almost at universal access to safe drinking water for the entire population in Côte d’Ivoire. So, we are very happy we’re making some progress,” he stated.\nHowever, he stressed that safe water access must be accompanied by improved sanitation systems. “Water is equally important as sanitation facilities because if we don’t have proper sanitation facilities, this could be a source of waterborne diseases and health issues across the nation.”\nBoth ministers emphasized that strengthening African-led solutions and deepening regional cooperation will be essential to ensuring universal access to safe drinking water and sanitation, describing water security as fundamental to sustainable development and public health across Africa.\nThe theme of the 2026 African Union is: “Assuring Sustainable Water Availability and Safe Sanitation Systems to Achieve the Goals of Agenda 2063.”",
    "image": "https://www.ena.et/documents/42142/0/lesetho+1.jpg/0818c3b6-1c83-6355-5d37-5a249635f77e?version=1.0&t=1771223372659&download=true",
    "source": "ENA English"
  },
  {
    "title": "Remembering Kim Sae Ron Who Passed Away A Year Ago At Age 24",
    "desc": "Actress Kim Sae Ron passed away one year ago. February 16, 2026, marks the first anniversary of Kim Sae Ron’s death at the age of 24. She was found dead…",
    "image": "https://image.koreaboo.com/2026/02/Kim-Sae-Ron-FI.jpg",
    "source": "Koreaboo"
  },
  {
    "title": "Planning a Safari? What You Need to Know About Namibia’s Latest Malaria Alert",
    "desc": "Malaria outbreak in northern Namibia affects safari regions like Etosha & Zambezi. Stay informed on precautions to take for a safe trip during the rainy season.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/Malria-Out-Break.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "Human musculoskeletal system was not built for ‘chair life’: Doctor reveals the hidden perils of modern living for young adults",
    "desc": "Health News: There was a time when being tired at the end of the day meant you had actually moved your body. Now it usually means you have been staring at a screen.",
    "image": "https://static.toiimg.com/thumb/msid-128410165,width-1280,height-720,imgsize-483455,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  }
]