[
  {
    "title": "Skyward Airlines Announces New Flights Route to Kenya's Vipingo Island",
    "desc": "Skyward Airlines launches direct flights from Nairobi to Vipingo, enhancing tourism, local enterprise, and investment in Kilifi County's premier coastal destination.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/5900e08c7607e9b3.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "NASA's Next Manned Moon Rocket May Have One Major, Dangerous Flaw",
    "desc": "During Artemis I, the heat shielding of the Orion crew capsule suffered major damage during reentry. This has raised concerns for the manned Artemis II flight.",
    "image": "https://www.slashgear.com/img/gallery/nasa-manned-moon-mission-orion-possible-dangerous-flaw/l-intro-1770904381.jpg",
    "source": "SlashGear"
  },
  {
    "title": "'Dora' decides: What to expect in Croatia",
    "desc": "Your guide to Croatia's pre-selection for Vienna",
    "image": "https://storage.googleapis.com/eurovision-com.appspot.com/renditions/public/cms/2505010_sarah-louise-bennett_ebu_25908_0doqp2ijpg/2505010_Sarah%20Louise%20Bennett_EBU_25908_0Doqp2i-focal_point%3D1624x440-focal_size%3D434x403-format%3Djpeg-width%3D1200-focal_point%3D1624x440-focal_size%3D434x403-format%3Djpeg-width%3D1200.jpeg",
    "source": "eurovision.com"
  },
  {
    "title": "Apple Martin opens up about getting 'crazy' lip filler",
    "desc": "Apple Martin, the daughter of Gwyneth Paltrow and Chris Martin, revealed the one and only time she got lip filler.In her Thursday, February 12 Vogue video, Stressed Out College Student, the...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-15/1392361_034116_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "'Our confidence probably isn't what it was'",
    "desc": "Stuart McCloskey has acknowledged that there's been a dip in confidence levels within the Ireland squad but remains hopeful that they are close to turning the corner.",
    "image": "https://www.rte.ie/images/0023e561-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Heat, Tight Clothing And Laptops: Everyday Habits That Could Be Reducing Male Fertility",
    "desc": "Expert claims that about 40 to 50 per cent of male infertility cases occur due to everyday lifestyles. Let's delve deeper to understand how these factors contribute to male fertility health. TheHealthSite.com",
    "image": "https://st1.thehealthsite.com/wp-content/uploads/2026/02/Causes-Of-Male-Fertility-Issues.jpg",
    "source": "TheHealthSite"
  },
  {
    "title": "Relief for productive sectors as EFTA launches 50bn/",
    "desc": "DAR ES SALAAM: EQUITY for Tanzania Limited (EFTA) has launched a 50bn/- corporate bond as a strategic move to strengthen financing for productive sectors through the capital markets. The bond officially launched recently in Dar es Salaam, bringing together key stakeholders from the financial sector, institutional investors, and capital market participants. The event sparked broader",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-15-at-12.33.03.jpeg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "South Africa Unites With Tunisia, Zimbabwe, Egypt, Morocco, Ethiopia, Kenya, And Nations In Orchestrating Africa’s Tourism Transformation With Record",
    "desc": "South Africa unites with Tunisia, Zimbabwe, Egypt, Morocco, Ethiopia, Kenya, and other nations in catalyzing Africa’s tourism renaissance by implementing innovative strategies that drive unprecedented growth in tourist arrivals, enhance visa accessibility, and introduce groundbreaking biometric technologies.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/a-daytime-architectural-photogra.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "What to know about the curling controversy at the Winter Olympics",
    "desc": "Controversy is swirling in curling at the Winter Olympics. It centers on whether the Canadian men’s and women’s teams are cheating by double-touching stones after they are released on the ice.",
    "image": "https://dims.apnews.com/dims4/default/b640918/2147483647/strip/true/crop/7394x4927+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F21%2Fb7%2Fa85746b83a036dec9dd96278c200%2F08321200a4c24acebcfea1cfc5c13994",
    "source": "AP News"
  },
  {
    "title": "Cassy Legaspi posts mystery guy on Valentine's Day",
    "desc": "Did Cassy Legaspi just post a soft launch?",
    "image": "https://images.gmanews.tv/webpics/2026/02/cassy_2026_02_15_18_30_53.jpg",
    "source": "GMA Network"
  }
]