[
  {
    "title": "COCOBOD allegedly procures 4 Land Cruisers, 110 pickups amid turmoil over failure to pay farmers",
    "desc": "The Ghana Cocoa Board (COCOBOD) has allegedly procured a number of vehicles despite the current challenges faced by the board in paying farmers from whom it has purchased cocoa beans.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/234/23462895.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "NASA will now allow astronauts to take their smartphones to space",
    "desc": "NASA astronauts can now take their personal phones with them to space.",
    "image": "https://s.yimg.com/ny/api/res/1.2/3..CXKBQx9wb76ao6z0Ixw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MjM-/https://s.yimg.com/os/creatr-uploaded-images/2024-12/38b8f3b0-b352-11ef-b5f7-44f86732a88a",
    "source": "Engadget"
  },
  {
    "title": "It Turns Out Waymos Are Being Controlled by Workers in the Philippines",
    "desc": "During a Congressional hearing, Waymo's chief safety officer, Mauricio Peña, was grilled over the company's reliance on overseas workers.",
    "image": "https://futurism.com/wp-content/uploads/2026/02/waymos-controlled-workers-philippines.jpg?w=1200",
    "source": "Futurism"
  },
  {
    "title": "London to get £1.5bn share of housing loan scheme",
    "desc": "Housing associations can take out low interest rate loans to build homes across the capital.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fe76/live/185f1fe0-036a-11f1-bab5-81d0d0b0abce.jpg",
    "source": "BBC"
  },
  {
    "title": "Fantasy Premier League: Gameweek 25 Q&A with expert Gianni Buttice - send us your questions",
    "desc": "Get all your Fantasy Premier League gameweek 25 tips and team news before Friday's deadline and send your questions to FPL expert Gianni Buttice.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/65a7/live/9e0a5510-036a-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  },
  {
    "title": "Shinedown Drop Off Rock the Country Festival",
    "desc": "Shinedown dropped off the Rock the Country festival in February 2026 — shortly after their drummer criticized Ludacris for doing the same.",
    "image": "https://townsquare.media/site/366/files/2026/02/attachment-shinedown-rock-the-country.jpg?w=1200&q=75&format=natural",
    "source": "Loudwire"
  },
  {
    "title": "Graham Norton joins star cast of Taylor Swift's new video",
    "desc": "The video for Opalite was inspired by Norton's chat show, after Swift appeared on the sofa last year.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e9c6/live/edd590e0-0366-11f1-bab5-81d0d0b0abce.jpg",
    "source": "BBC"
  },
  {
    "title": "Keith Duffy says Boyzone wasn’t offered an Irish stadium for upcoming reunion",
    "desc": "The band will play two shows at London’s Emirates Stadium this summer but Duffy said they weren’t offered a stadium in Ireland.",
    "image": "https://img2.thejournal.ie/article/6949549/river/?height=400&version=6949552",
    "source": "The Journal"
  },
  {
    "title": "Personalize your vivo X300 Series with Flip Cards",
    "desc": "Cameras might be their main focus for vivo X300 Series owners, but it's the lock screen that usually gets the most amount of viewership.",
    "image": "https://www.ungeek.ph/wp-content/uploads/2026/02/Personalize-your-vivo-X300-Series-with-Flip-Cards_11zon.webp",
    "source": "UnGeek"
  },
  {
    "title": "Pakistan Blast Live Updates: Suspicion Likely To Fall On Pak Taliban, Islamic State",
    "desc": "At least 69 people were killed, and 169 were injured after a suicide bomber detonated himself inside a shrine in Pakistan's capital, Islamabad.",
    "image": "https://c.ndtvimg.com/2026-02/c5d8uivo_pakistan-blast_650x400_06_February_26.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
    "source": "NDTV"
  }
]