[
  {
    "title": "Night sky tonight (Feb. 25): See the moon glow in the horns of a celestial bull",
    "desc": "Find out what you can see in the night sky for tonight, from planets and stars to dazzling meteor showers.",
    "image": "https://cdn.mos.cms.futurecdn.net/5X2sZoxaezNcaBdxcUyizS-1920-80.jpg",
    "source": "Space"
  },
  {
    "title": "Junior Boks bolstered by returning duo for rematch",
    "desc": "Junior Springbok head coach Kevin Foote has named a reinforced match-day squad for the second and final international against Georgia, drafting in key forward experience as the South Africans look to build on their clinical opening performance in Tbilisi on Friday.",
    "image": "https://saru-umbraco.azurewebsites.net//media/3djb5h5o/251112-siphosethu-mnebelele-junior-boks-training.jpg?anchor=center&mode=crop&width=945&height=472&rnd=134075859472230000",
    "source": "SA Rugby"
  },
  {
    "title": "Fuel prices Feb 26-March 4: Unsubsidised RON95, RON97, diesel in peninsula up 5 sen",
    "desc": "KUALA LUMPUR: The retail price of diesel in Peninsular Malaysia will rise by five sen to RM3.04 per litre, while prices in Sabah, Sarawak and Labuan will remain unchanged at RM2.15 per litre from Feb 26 to March 4.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/25/3787249.jpg",
    "source": "The Star"
  },
  {
    "title": "SOMALIA: One in three people facing severe food shortages as hunger surges towards 2022 peak",
    "desc": "One in three people are facing severe food shortages in Somalia as worsening drought, conflict, and soaring food prices drive up hunger levels, with the situation nearly as bad as in 2022 when the country was on the brink of famine.",
    "image": "https://i.stci.uk/dam/the-impact-of-more-frequent-severe-droughts-in-somalia-ch1686073.JPG/64p81l0bldf04135dy82n6204w3t1iw5.JPG",
    "source": "Save the Children"
  },
  {
    "title": "A year after NVS-02 satellite's failure, Isro explains what went wrong in space",
    "desc": "NVS-02, the second satellite in India’s NVS navigation series, was launched successfully on January 29, 2025 aboard the GSLV-F15 rocket.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/nvs-02-satellite-crash-033243372-16x9.jpeg?VersionId=5yS02ljViSCOL7kf1bu_sQF3H9iuVVwW",
    "source": "India Today"
  },
  {
    "title": "Gucci criticised for 'AI slop' images ahead of major fashion show",
    "desc": "Users of social media - where the marketing campaign has been launched - say it is out of keeping with Gucci's reputation for luxury.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1346/live/634a21e0-1237-11f1-b586-1ba1b8fe72ec.jpg",
    "source": "BBC"
  },
  {
    "title": "Top French and US oil giants drive $50B LNG expansion in Africa’s rising gas powerhouse",
    "desc": "Mozambique is set to solidify its status as one of Africa’s top natural gas nations with the resumption of liquefied natural gas (LNG) megaprojects on the Afungi peninsula in Cabo Delgado. | Business Insider Africa",
    "image": "https://ocdn.eu/pulscms-transforms/1/MVKktkpTURBXy83NjEwMjUzM2Q3NDAzN2M2MjUxNzJmYjQ5YjllMzJlNS5qcGeSlQMAzKrNBDjNAmCTBc0EsM0Cdg",
    "source": "Business Insider Africa"
  },
  {
    "title": "Caring teenager dies from rare illness after tummy bug",
    "desc": "An inquest finds Lois Francis,17, died from multiple organ failure caused by bacteria.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/13a6/live/57663a00-1235-11f1-b586-1ba1b8fe72ec.jpg",
    "source": "BBC"
  },
  {
    "title": "Award-winning photographer Tolani Alli storms Ghana for photography masterclass",
    "desc": "Global award-winning photographer, storyteller, and creative Tolani Alli held a masterclass on photography and visual communication in Accra, Ghana, on February 24, 2026.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/187/18707992.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Vudumane strikes again with heartfelt anthem 'Love No Dey'",
    "desc": "Following the success of his previous hits songs such as a “OH NO”, 'ON MY WAY”, 'SOMEBODY,” of which he featured Nigerians very own Davido amongst many other top notch artiste in the music scene such as Zlatan from (Nigeria), Kwabena...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/562/56294398.jpg",
    "source": "GhanaWeb"
  }
]