[
  {
    "title": "Life under Italian fascism ‘not so bad’, claims Mussolini heir",
    "desc": "Caio Mussolini is on tour with a new book as he seeks to challenge established views on his great-grandfather’s legacy and highlight his enduring appeal",
    "image": "https://www.thetimes.com/imageserver/image/%2F7446ddeb-2839-494c-ae35-44600f8894e5.jpg?crop=1600%2C900%2C0%2C0&resize=1200",
    "source": "The Times"
  },
  {
    "title": "Ukrainian athlete Vladyslav Heraskevych out of Winter Olympics over banned helmet",
    "desc": "Heraskevych came to the Olympics with a customized helmet showing the faces of more than 20 Ukrainian athletes and coaches who were killed during the war, a conflict that started shortly after the 2022 Beijing Games ended.",
    "image": "https://i.cbc.ca/ais/8ed01020-83ba-4a8d-a6ba-bd5792cf71a1,1770884782372/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C209%2C3549%2C1996%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Well-beaten Canada and UAE aim to reset their T20 WC campaigns",
    "desc": "Having lost their respective opening games comprehensively, both teams will look to grab two points against an opposition they fancy",
    "image": "https://static.cricbuzz.com/a/img/v1/540x303/i1/c855224/despite-posting-173-against-nz-uae-were-blown-away.jpg",
    "source": "Cricbuzz.com"
  },
  {
    "title": "Hextar Industries buys 51% stake in llaollao operator for RM177.5mil",
    "desc": "PETALING JAYA: Hextar Industries Bhd (HIB) is acquiring a 51% stake in food and beverage (F&B) company Woodpeckers Group Sdn Bhd for RM177.48mil.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/12/3767790.jpg",
    "source": "The Star"
  },
  {
    "title": "Tu Yaa Main advance booking opens ahead of Valentine’s Day release; makers promise a high",
    "desc": "Tu Yaa Main advance booking opens ahead of Valentine’s Day release; makers promise a high-stakes ‘datefright’ experience. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood News Hindi, Hindi Bollywood News at Bollywood Hungama.com.",
    "image": "https://stat5.bollywoodhungama.in/wp-content/uploads/2026/02/Tu-Yaa-Main-advance-booking-opens-ahead-of-Valentines-Day-release-620.jpeg",
    "source": "Bollywood Hungama"
  },
  {
    "title": "High Court Dismisses Mbeere Election Petition Against Leonard Wamuthende",
    "desc": "The court requested that the petitioners pay the responding party's costs not exceeding Ksh 800,000.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/leonard-wamuthende.jpg?itok=UeLOBLtD",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "Job quality assessed using ‘more objectively measurable’ labour market indicators: Koh Poh Koon",
    "desc": "Singapore’s Economic Strategy Review committees recently proposed seven recommendations to drive growth and create good jobs.",
    "image": "https://dam.mediacorp.sg/image/upload/s--z_a47Vcb--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/12/1770878533-image.jpg?itok=xqwP9umX",
    "source": "CNA"
  },
  {
    "title": "STRATCOMCOE report: 'neuro-warfare' threat requires urgent attention",
    "desc": "The Rīga-based NATO Strategic Communications Centre of Excellence (STRATCOMCOE) has a new publication available for download.",
    "image": "https://static.lsm.lv/media/2026/02/large/1/sozk.png",
    "source": "LSM"
  },
  {
    "title": "‘People ought to know’: Blue Boy Trial brings Japan’s trans history up to date",
    "desc": "Kasho Iizuka’s feature casts trans actors to revisit a notorious 1965 trial that made gender reassignment illegal for more than 30 years. He explains why the history remains unfinished",
    "image": "https://i.guim.co.uk/img/media/7e7029f2085d5b7986d8e02ad06c276d140906ce/0_0_1723_1378/master/1723.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=be0af3975a45538ba3e4877987fbbf85",
    "source": "The Guardian"
  },
  {
    "title": "Creating Impactful Teams through Diversity Using Session 0",
    "desc": "Diverse and empowered teams are impactful teams, Natan Žabkar Nordberg mentioned in his talk on creating impactful software teams at QCon London. A session 0 helps set expectations and ensures that ev",
    "image": "https://res.infoq.com/news/2026/02/create-impactful-teams-diversity/en/headerimage/generatedHeaderImage-1770636528408.jpg",
    "source": "infoq.com"
  }
]