[
  {
    "title": "New SpaceX long-duration crew arrives at International Space Station",
    "desc": "A crew of four astronauts, two of whom have never been into space, arrived on the International Space Station (ISS) on an eight-month science mission on Saturday (February 14).",
    "image": "https://assets.citizen.digital/165129/conversions/2026-02-14T230948Z_1_LOP560714022026RP1_RTRMADP_BASEIMAGE-960X540_SPACE-SPACEX-CREW-12-og_image.webp",
    "source": "Citizen Digital"
  },
  {
    "title": "OpenAI employee earning more than ₹2 crore says she won’t marry without a prenup",
    "desc": "As AI startups create new millionaires, millennials like OpenAI's Gujari Singh advocate for prenuptial agreements in relationships.",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/15/550x309/contract_1771140018972_1771140019168.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Rate cut back in play as consumer price index seen negative",
    "desc": "Economists forecast 0.1%-0.2% drop in January index, easing annual inflation toward 2% and reviving bets Bank of Israel could trim rates to 3.75% as shekel strengthens and airfares fall",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2024/12/10/H1zwqRHE1l/H1zwqRHE1l_0_248_3000_1689_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Linux 7.0 is adding mainline kernel support for, uh, Rock Band 4 guitars",
    "desc": "See, this is why I love FOSS.",
    "image": "https://static0.xdaimages.com/wordpress/wp-content/uploads/wm/2025/12/affinity-on-linux.jpg?w=1600&h=900&fit=crop",
    "source": "XDA"
  },
  {
    "title": "NASA confirms arrival of SpaceX Crew-12 astronauts at the International Space Station",
    "desc": "NASA has confirmed that four members of the SpaceX Crew-12 mission arrived and docked at the International Space Station on Saturday afternoon. The Crew-12 mission includes two astronauts, Jessica...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-15/1392342_121841_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "West Midlands measles vaccine plea ahead of half term",
    "desc": "The region accounts for more than a quarter of all cases in England, officials say.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/db30/live/48be09f0-08db-11f1-a0ee-935344cbfeb8.jpg",
    "source": "BBC"
  },
  {
    "title": "Indonesia to Quit Gaza Security Force if No Longer on the Same Page",
    "desc": "Indonesia also says that its troops will only use force as \"self-defense\" or \"last resort\".",
    "image": "https://img2.beritasatu.com/cache/jakartaglobe/960x620-w/2025/10/1759656595-5000x3333.webp",
    "source": "Jakarta Globe"
  },
  {
    "title": "The Instagram-friendly shopping centre delivering 'industry-busting' footfall",
    "desc": "Merry Hill is using leisure and entertainment to increase its customer base, the manager says.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/12c3/live/6f059a90-08bf-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "How an Accountant Orchestrated Ksh16 Million Sacco Fraud",
    "desc": "Detectives from the Banking Fraud Investigation Unit (BFIU) have arrested an accountant in connection with masterminding a fraudulent scheme that saw a local Sacco lose over Ksh16 million.",
    "image": "https://nairobileo.co.ke/storage/uploads/2026/02/IMG-20260212-WA0000-1770876135.jpg",
    "source": "Nairobi Leo"
  },
  {
    "title": "Prepare for the Future of Travel: 2026 ETIAS Border Changes and Digital Entry System Transform How You Access Europe’s Schengen Area – What Every Traveller Must Know",
    "desc": "Europe’s ETIAS travel authorisation and new digital border system reshape travel rules in 2026. Read confirmed dates and key details.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/low-angle-shot-famous-basilica-sacred-heart-paris-paris-france.jpg",
    "source": "Travel And Tour World"
  }
]