[
  {
    "title": "ICE eyeing Ohio next, where it is expected to target Haitian immigrants",
    "desc": "An estimated 12,000 to 15,000 Haitians live in Springfield, Ohio, a community that President Donald Trump and Vice President JD Vance targeted during the 2024 campaign, falsely accusing the community of eating cats and dogs.",
    "image": "https://res.cloudinary.com/msnow/images/f_auto,q_auto/v1769815112/260130-kristi-noem-es_11640715e01e_11640718cd6e/260130-kristi-noem-es_11640715e01e_11640718cd6e.jpg?_i=AA&w=1200&h=630&crop=1",
    "source": "MS NOW"
  },
  {
    "title": "Ottawa is giving greenhouses a tax break. Will it help lower food prices?",
    "desc": "A new federal tax program aims to boost greenhouse investment and increase domestic vegetable production to tackle high food prices. Industry officials welcome the support, but say food prices are hard to contain.",
    "image": "https://i.cbc.ca/ais/2c13f465-218d-49aa-9868-0b8a3b47fc60,1769808750513/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C211%2C3227%2C1815%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Here's how Elon Musk's SpaceX-Tesla merger could impact 20,000 bitcoin (BTC)",
    "desc": "Any deal involving SpaceX and Tesla would quietly consolidate one of the world’s largest corporate bitcoin holdings under a single roof.",
    "image": "https://cdn.sanity.io/images/s3y3vcno/production/4290d2e5ba7140f5d65f68d3183a9abb87c098a4-3840x2160.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "source": "CoinDesk"
  },
  {
    "title": "New study finds plastic pollution may contribute to harmful algae blooming",
    "desc": "A new study has found petroleum-based plastic pollution may be contributing to the blooming of harmful algae.",
    "image": "https://wastemanagementreview.com.au/wp-content/uploads/2026/01/AdobeStock_442234305.jpeg",
    "source": "Waste Management Review"
  },
  {
    "title": "Man seeks to be freed after his conviction was tossed in Jam Master Jay murder case",
    "desc": "A man whose conviction in the killing of Jam Master Jay was recently overturned is seeking release on a $1 million bond while prosecutors appeal",
    "image": "https://i.abcnewsfe.com/a/dd9567b0-c173-49e3-8ae6-5298427b1c8c/wirestory_3df05e67540e9d60f4148f888feedbcc_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Thousands Gather in San Francisco, Businesses Close as Part of Nationwide ‘ICE Out’ Protest",
    "desc": "Demonstrations took aim at the Trump administration’s immigration operations in Minneapolis, which have led to thousands of arrests and detentions and the deaths of two U.S. citizens.",
    "image": "https://cdn.kqed.org/wp-content/uploads/sites/10/2026/01/260130-ICEOutProtest-04-BL.jpg",
    "source": "KQED"
  },
  {
    "title": "NASA's Artemis 2 mission to the moon puts Crew-12 SpaceX launch in delicate dance",
    "desc": "SpaceX launch date of Crew-12 astronauts to the International Space Station will depend on the outcome of the Artemis 2 wet dress rehearsal and launch attempts.",
    "image": "https://cdn.mos.cms.futurecdn.net/qjFhWEU8YNq5fPZX6C7ENY-1366-80.jpg",
    "source": "Space"
  },
  {
    "title": "Live Updates: Raptors",
    "desc": "Friday night in the NBA will also feature Nuggets-Clippers and Lakers visiting Washington on League Pass.",
    "image": "https://cdn.nba.com/manage/2026/01/doncic.jpg",
    "source": "NBA"
  },
  {
    "title": "Amari Bailey ‘serious’ about returning to college after 10 games with Hornets",
    "desc": "Former Hornets guard Amari Bailey is looking to return to college basketball after playing 10 games in the NBA.",
    "image": "https://s.yimg.com/ny/api/res/1.2/mB_VE12f8p0rE.YcBfEckA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/clutchpoints_articles_939/6c6e1c1430adcb052823b052192e36f2",
    "source": "Yahoo Sports"
  },
  {
    "title": "The iPhone 18's delay is reconfirmed by another report",
    "desc": "Apple is significantly changing its iPhone release strategy. We've already heard a few times that Apple plans to delay the vanilla iPhone 18 until next...",
    "image": "https://fdn.gsmarena.com/imgroot/news/26/01/iphone-18-delay-reconfirmed/-952x498w6/gsmarena_000.jpg",
    "source": "GSMArena.com"
  }
]