[
  {
    "title": "Friday Update: West Bank Violations, Serious Injury And Abuctions",
    "desc": "Israeli forces invaded multiple areas of the occupied West Bank on Friday, seriously shooting a child near occupied Jerusalem, and shooting a young man near ...",
    "image": "https://imemc.org/wp-content/uploads/2026/02/invadenight-e1770432546871.jpg",
    "source": "- IMEMC News"
  },
  {
    "title": "Double to Beat Miami: Three Reasons Why They Won",
    "desc": "The Celtics did not look good in the first half against Miami, but they rallied in the second half, started hitting shots, and started finding the new guy on their way to a big comeback win.",
    "image": "https://images2.minutemediacdn.com/image/upload/c_crop,x_0,y_169,w_3793,h_2133/c_fill,w_1440,ar_1440:810,f_auto,q_auto,g_auto/images/ImagnImages/mmsport/inside_the_celtics/01kgv88hd04a1t0bx25x.jpg",
    "source": "Sports Illustrated"
  },
  {
    "title": "cyl, AACP, four variants, first look at the Flagship and Flagship X",
    "desc": "Ahead of its launch on February 11, Proton has opened the order books for the 2026 Proton S70 at all 3S and 4S centres nationwide starting from today. The refreshed sedan is also making a …",
    "image": "https://paultan.org/image/2026/02/2026-Proton-S70-MC1-Malaysia-Flagship-X-Ext-1-1200x801.jpg",
    "source": "Paul Tan's Automotive News"
  },
  {
    "title": "Australian schoolgirl Lilly Wal’s family demand justice after drowning death in Fiji",
    "desc": "An Australian schoolgirl has died while on holiday with her family in Fiji after being swept away and drowning at a popular tourist watering hole....",
    "image": "https://www.nzherald.co.nz/resizer/v2/GCXCZ3CJ6J4GXA3TE626X7LI6Q.jpg?auth=d35fd35d2213129111bd4f31bc8a09d5ead080f542058828a8cb411a3b05022f&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "European Union says video app TikTok must change ‘addictive’ design",
    "desc": "TikTok calls European Commission probe ‘meritless’, pledges to challenge findings the video platform harms minors.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2024/06/2024-05-30T192121Z_1437657028_RC291W9DK6B8_RTRMADP_3_TIKTOK-ALGORITHM-1719588352.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Municipality of Chegutu to impound stray dogs",
    "desc": "THE Municipality of Chegutu has started mass seizure of dogs found roaming the streets. In a public notice published recently, the local authority said it has partnered the Society for the Prevention of Cruelty to Animals (SPCA) on the joint operation, which started this week. “Notice is hereby given that the Municipality of Chegutu, in […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/28163131/dogs.jpg",
    "source": "newzimbabwe.com"
  },
  {
    "title": "From Hollywood to the homeland: Why African countries are courting black American stars",
    "desc": "Although their forefathers were seized from West and Central Africa centuries ago, the bond between African-Americans and their ancestral home has been a lasting one.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/c6a5a580-02a5-11f1-b7e1-afb6d0884c18.jpg.webp",
    "source": "MyJoyOnline"
  },
  {
    "title": "Couple go to bed each night wondering if they’ll still be alive in the morning",
    "desc": "A retired North Wales couple are living on a 'knife-edge' after a hillside began slipping",
    "image": "https://i2-prod.dailypost.co.uk/article33368205.ece/ALTERNATES/s1200/0_AFRDPR050226RockfallCottage.jpg",
    "source": "North Wales Live"
  },
  {
    "title": "Electric motorcycle riders in Kenya demand more flexible battery networks",
    "desc": "Electric motorcycles, also known as electric mobility bikes or e-bikes, are gaining ground throughout Africa",
    "image": "https://i.abcnewsfe.com/a/9aa6c960-98cd-4724-9b4c-83e9a0dcfbcd/wirestory_964b13f58358201a2b51818c9af2dd6c_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Brazil, Canada split Davis Cup opening matches",
    "desc": "An upset loss by Gabriel Diallo resulted in Canada splitting its opening singles matches Friday in the first round of Davis Cup Qualifiers.",
    "image": "https://www.tsn.ca/resizer/v2/EZTRNZEUVABHLRGPTZR5C56OWA.jpg?smart=true&auth=7f31ec0a4e8dd28a112c177d57bac422603cc1ed238d694b16b849b26435df0f&width=1200&height=630",
    "source": "TSN"
  }
]