[
  {
    "title": "Poem of the Week: The Sixty Second Poem",
    "desc": "A new work by Geraldine Mitchell",
    "image": "https://www.irishtimes.com/resizer/v2/HN7YVCVVJYPENIZPRB73SXLRXE.jpg?smart=true&auth=e2a0d2f0a95e1b49e841405eca27a82e4ae16f4b3bdba354f9ce180fbacb58eb&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Perak reports 100 tuberculosis cases in January, health authorities maintain vigilance",
    "desc": "Perak health authorities have recorded a total of 100 tuberculosis (TB) cases in the state during January, but officials emphasise that infections remain under...",
    "image": "https://media.thevibes.com/images/uploads/covers/_large/Perak_MOH_TB.jpg",
    "source": "The Vibes"
  },
  {
    "title": "Latest Epstein files documents reveal links to multiple monarchies",
    "desc": "The latest release of the so-called Epstein files has revealed the convicted child sex offender was in contact with members of — and people close to — monarchies across Europe and the Middle East.",
    "image": "https://live-production.wcms.abc-cdn.net.au/d1c40893c7ccd2ed5608e4d53a0d77df?impolicy=wcms_watermark_news&cropH=1120&cropW=1989&xPos=5&yPos=291&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Chisco begins local assembly of Yutong, Sinotruk vehicles in Lagos",
    "desc": "Chisco Transport Limited has commenced the local assembly of Yutong luxury buses and Sinotruk trucks in Lagos, aiming to expand its ro...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2026/02/Chisco.jpeg",
    "source": "Businessday NG"
  },
  {
    "title": "India US trade deal: US shares India map with POK Aksai Chin",
    "desc": "While releasing the trade deal details, the US trade representative's office released a map of India showing the entire Jammu and Kashmir, including Pakistan-occupied Kashmir (POK), as part of the country. Here's why it is important and marks a departure.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/the-map-shared-by-the-us-while-releasing-the-trade-deal-framework-071349611-16x9_0.jpg?VersionId=VwpsL.L9hZexTgxeadXBb.RiTP2UykRI",
    "source": "India Today"
  },
  {
    "title": "Smriti Mandhana's mom roasts Palash Muchhal after daughter’s WPL win; internet can't get enough of 'savage aunty'",
    "desc": "Smriti Mandhana's mom reshared a post roasting Palash Muchhal after her daughter's heroic efforts in the WPL final.",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/07/550x309/palash_muchhal_1764205686914_1764205687052_1770436835513.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "2-way player Daniss Jenkins scores 18 points as Pistons rout Knicks, 118-80",
    "desc": "Daniss Jenkins scored 18 points in his last game as a two-way player and the Detroit Pistons routed New York 118-80 on Friday night to end the Knicks’ winning streak at eight games",
    "image": "https://i.abcnewsfe.com/a/a32acf8f-4510-483a-be6f-c06d5bdb40e8/wirestory_dfa1ce684fa604fdbf3e99c97927dca4_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "BIGBANG's G-Dragon Finally Comments On His \"Scandalous\" Instagram Activity",
    "desc": "BIGBANG's G-Dragon indirectly addressed the recent social media incident where he liked—and then unliked—a stage video of BLACKPINK’s Jennie.",
    "image": "https://image.koreaboo.com/2026/02/gdragon-instagram-likes-fi.jpg",
    "source": "Koreaboo"
  },
  {
    "title": "Swatch unveils Valentine’s Day specials with a heart-powered design that reveals both sides of romance",
    "desc": "When it comes to Valentine’s Day, we’re always celebrating how love is patient, kind, romantic and magical, but it’s easy to forget that love can also be dramatic, messy, wild, and just blah. This is why Swatch is changing things up this romantic season, with a two special V-Day designs, inspired by love’s sweet chaos. […]",
    "image": "https://nylon.com.sg/wp-content/uploads/2026/02/swatch-vday-ad-header.jpg",
    "source": "nylon.com.sg"
  },
  {
    "title": "Celts rally from 22-point deficit to edge Heat, 98-96",
    "desc": "Jaylen Brown had 29 points while Payton Pritchard scored 24 points to help the Boston Celtics make their biggest comeback of the season, rallying from a 22-point deficit to defeat the Miami Heat 98-96",
    "image": "https://i.abcnewsfe.com/a/2c5a55ea-81bf-42a3-84c5-afc12d31e88e/wirestory_43a9fb558b951a2234fd49e11c1ba5ba_16x9.jpg?w=1600",
    "source": "ABC News"
  }
]