[
  {
    "title": "Vonn crashes, limps off in final test run week before Olympics",
    "desc": "Lindsey Vonn crashed in her final downhill Friday before the Milan Cortina Olympics and was left limping and keeping weight off her left knee.",
    "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0130%2Fr1607791_1296x729_16%2D9.jpg",
    "source": "ESPN"
  },
  {
    "title": "Bushfire Festival to ignite cultural celebration in the heart of Kgalagadi",
    "desc": "The Macheng Bushfire Festival is a vibrant celebration of cultural heritage, designed to promote unity and shared values through music, dance, poetry, sports, and tourism.",
    "image": "https://www.mmegi.bw/mmegi/uploads/images/2026/01/30/161928.jpg",
    "source": "Mmegi Online"
  },
  {
    "title": "New satellite view of Tibet’s tectonic clash",
    "desc": "A study on tectonic plates that converge on the Tibetan Plateau has shown that Earth’s fault lines are far weaker and the continents are less rigid than scientists previously thought. This finding is based on ground-monitoring satellite data.",
    "image": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2026/01/tibetan_plateau_vertical_ground_displacement/27087108-7-eng-GB/Tibetan_Plateau_vertical_ground_displacement_pillars.jpg",
    "source": "European Space Agency"
  },
  {
    "title": "Championship top two set for battle - live on BBC",
    "desc": "If you thought Heart of Midlothian against Celtic was good last Sunday, brace yourself for the latest instalment from the Scottish Championship...",
    "image": "https://www.businessghana.com/site/img/../../cms/img/news/2026-01-30-100845003.jpg",
    "source": "BusinessGhana"
  },
  {
    "title": "Police Kill four bandits in shootout in Benue",
    "desc": "The Nation Newspaper Police Kill four bandits in shootout in Benue",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/01/28054905/police-Nig.png",
    "source": "The Nation Newspaper"
  },
  {
    "title": "Alcaraz slugs out win over Zverev in over-five-hour semifinal",
    "desc": "Carlos Alcaraz overcame possible cramps and injury to fend off Alexander Zverev in an epic, momentum-swinging five-setter Friday, becoming the youngest man in the Open era to reach the finals of all four Grand Slam events.",
    "image": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0130%2Fr1607767_1296x729_16%2D9.jpg",
    "source": "ESPN Philippines"
  },
  {
    "title": "NACZ slashes registration and renewal fees for Arts sector",
    "desc": "The updated fee structure shows significant reductions for several key groups, while others remain unchanged.",
    "image": "https://3-mob.com/wp-content/uploads/2021/12/Dadza-D-Performing-live-on-stage-at-the-Let-At-Speak-Concert-Mabelreign-Harare.jpg",
    "source": "3-mob.com"
  },
  {
    "title": "'Whitewashing brutal invasions': BJP on ex-VP Hamid Ansari calling Mahmud of Ghazni 'Indian'",
    "desc": "India News: NEW DELHI: The Bharatiya Janata Party (BJP) on Friday strongly criticised former Vice President Hamid Ansari over his remarks describing Sultan of the.",
    "image": "https://static.toiimg.com/thumb/msid-127798359,width-1280,height-720,imgsize-755111,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Yishun residents rescue kitten stuck in HDB drain pipe with help of plumber",
    "desc": "A kitten was rescued by a group of residents in Yishun after being trapped in a drain pipe at a HDB void deck on Wednesday (Jan 28). In a TikTok video posted on Thursday (Jan 29), several people are seen hovering over the drain and trying to free the trapped cat. The user told Stomp that he was walking home...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Jan2026/cat-trapped-drainage-yishun.jpg?itok=lFQpWyMS",
    "source": "AsiaOne"
  },
  {
    "title": "Camila Osorio, Donna Vekic to battle for first Philippine Women’s Open trophy",
    "desc": "Colombian Camila Osorio and Croatian Donna Vekic arranged a finals showdown for the inaugural Philippine Women’s Open after advancing in the WTA 125 event in Manila.",
    "image": "https://images.gmanews.tv/webpics/2026/01/OSORIO_VEKIC_2026_01_30_18_41_41.png",
    "source": "GMA Network"
  }
]