[
  {
    "title": "How Sam Darnold Built an Unwavering Team Identity in Seattle",
    "desc": "The Seahawks immediately recognized the quarterback as the team’s leader and adopted his steady approach. Plus, GM John Schneider on the similarities between his two championship teams and more in Albert Breer’s notes",
    "image": "https://images2.minutemediacdn.com/image/upload/c_crop,x_0,y_0,w_1999,h_1124/c_fill,w_1440,ar_1440:810,f_auto,q_auto,g_auto/images/voltaxMediaLibrary/mmsport/si/01kh4k7anfvavex164z4.jpg",
    "source": "Sports Illustrated"
  },
  {
    "title": "US governors cancel White House meeting after Donald Trump didn’t invite Democrats: Report",
    "desc": "US News: The National Governors Association cancelled a meeting with US President Donald Trump later this month after the White House excluded Democratic gover.",
    "image": "https://static.toiimg.com/thumb/msid-128175370,width-1280,height-720,imgsize-25586,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Nearly half of xAI's founding team has now left the company",
    "desc": "Whatever the cause of the departures, the cumulative impact is alarming. There is a lot of work left to do at xAI, and an IPO will bring more scrutiny than the lab has ever faced before.",
    "image": "https://techcrunch.com/wp-content/uploads/2025/07/GettyImages-2223576505.jpg?resize=1200,800",
    "source": "TechCrunch"
  },
  {
    "title": "Dangerous incidents spiking sharply in childcare, data shows",
    "desc": "T﻿he productivity commission has found that serious incidents are on the rise as staff credentials shrink.",
    "image": "https://imageresizer.static9.net.au/Pl4BB0EjBu4XOdAApvyz-eZc5Tk=/171x54:1720x925/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fb2f541e3-64b9-4466-aa29-72816572b187",
    "source": "9News.com.au"
  },
  {
    "title": "‘I knew something was wrong’ - Ronald Araujo opens up on his mental health issues at Barcelona after red card at Chelsea",
    "desc": "‘Today I feel like a completely different person.‘",
    "image": "https://s.yimg.com/ny/api/res/1.2/Fc.8xw6gpDXcB93cvK4HgQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/sb_nation_articles_115/6ff85c16890e2a4008d28b1543d31717",
    "source": "Yahoo Sports"
  },
  {
    "title": "Growth of Spreading Pancreatic Cancer Fueled by 'Under-Appreciated' Epigenetic Changes",
    "desc": "In a lab-grown cell study focused on potential new treatment targets for halting the spread of most pancreatic cancers, Johns Hopkins Medicine scientists report they have found that a gene called KLF5 (Krueppel-like factor 5) fuels the growth of such spreading tumors.",
    "image": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2026/02/10/698b8a723d16d_VanessaFeb10KLF5pancreaticcancer.jpg",
    "source": "Newswise"
  },
  {
    "title": "Britney Spears Sells Music Catalog, Other Rights to Primary Wave",
    "desc": "Britney Spears has sold her song catalog and an unclear number of other rights to Primary Wave, two sources confirm to Variety.",
    "image": "https://variety.com/wp-content/uploads/2023/10/GettyImages-174722046.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Trump to gut US climate change policy and environmental regulations",
    "desc": "The White House says the Trump administration will revoke a scientific finding that long has been the central basis for U.S. action to regulate greenhouse gas emissions and fight climate change.",
    "image": "https://dims.apnews.com/dims4/default/4a8259b/2147483647/strip/true/crop/4583x3054+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F52%2F6d%2Fe72ba8d0f95ba0683dade1410d9f%2F6c88cc049333433d8fd8045567bffefc",
    "source": "AP News"
  },
  {
    "title": "‎Perfumed Baby Products Can Trigger Allergic Reactions, Physician Warns",
    "desc": "Dr Nkechi Nwibo, a paediatrician, has advised parents against the ‎use of perfumed baby products, saying they can trigger allergic reactions.",
    "image": "https://nannews.ng/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-10-at-2.05.33-PM.jpeg",
    "source": "News Agency of Nigeria"
  },
  {
    "title": "Hundreds protest over deportation of family in Dublin",
    "desc": "At least 300 people have protested at the Department of Justice over the deportation of a family from their community in south Dublin.",
    "image": "https://www.rte.ie/images/0023e005-1600.jpg",
    "source": "RTE.ie"
  }
]