[
  {
    "title": "New Pilot Scheme Supports Landowners in the MacGillycuddy Reeks",
    "desc": "Ireland’s Minister for Rural and Community Development and the Gaeltacht, Dara Calleary TD, has announced a new three-year pilot Upland Recreation Scheme for the MacGillycuddy Reeks, alongside additional funding to strengthen upland path management through the “Helping the Hills” network. The initiatives aim to support sustainable outdoor recreation, protect sensitive upland environments and recognise the",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Early Life Forms May Have Used Oxygen Pre-Atmosphere",
    "desc": "Oxygen is a vital and constant presence on Earth today. But that hasn't always been the case. It wasn't until around 2.3 billion years ago that oxygen",
    "image": "https://news.mit.edu/sites/default/files/images/202602/MIT-Aerobic-Firsts-01-press.jpg",
    "source": "Mirage News"
  },
  {
    "title": "EXCLUSIVE: Cos to Show Spring 2026 Collection in Seoul",
    "desc": "Cos is taking its show on the road once again, this time to the South Korean capital, where it also shot the star-studded spring 2026 campaign.",
    "image": "https://wwd.com/wp-content/uploads/2026/02/COS_ALEXANDER-SKARSGARD_SS26-CAMPAIGN.jpg?crop=0px%2C0px%2C8694px%2C4868px&resize=1000%2C563",
    "source": "WWD"
  },
  {
    "title": "Italian Style Meets Sport & Design",
    "desc": "Italian style meets sports and design at Milano Cortina 2026 Winter Olympics.",
    "image": "https://wwd.com/wp-content/uploads/2026/01/Milano_Cortina_2026_Cauldron_1.jpg?crop=0px%2C0px%2C3840px%2C2149px&resize=1000%2C563",
    "source": "WWD"
  },
  {
    "title": "Inside Ryan Wesley Routh's plan to kill Donald Trump and 'up",
    "desc": "As Donald Trump arrived at a golf course in September 2024, a would-be assassin had already been lying in wait for almost 12 hours.",
    "image": "https://live-production.wcms.abc-cdn.net.au/0da721c44b5eb13bc7c87d1e90f3f6e0?impolicy=wcms_watermark_news&cropH=1486&cropW=2641&xPos=0&yPos=138&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Brands invest in creators for reach as celebs fill the Big Game spots",
    "desc": "The Super Bowl is no longer just about day-of posts or prime-time commercials, but the expanding creator ecosystem surrounding it.",
    "image": "https://digiday.com/wp-content/uploads/sites/3/2021/02/football_2-02.jpg",
    "source": "Digiday"
  },
  {
    "title": "T20 World Cup: Will India miss Rohit Sharma’s calm - can ‘SKY’ emulate Hitman?",
    "desc": "Cricket News: MUMBAI: When Team India lines up for the National Anthem at the Wankhede Stadium prior to their T20 World Cup opener against USA on Saturday, they wil.",
    "image": "https://static.toiimg.com/thumb/msid-127970502,width-1280,height-720,imgsize-28040,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Moncler, Oskar Metsavaht Codesign Brazil's Olympics Opening Uniforms",
    "desc": "Moncler and Osklen’s Oskar Metsavaht codesigned uniforms for Team Brazil including Lucas Pinheiro Braathen for the Winter Olympics' opening ceremony.",
    "image": "https://wwd.com/wp-content/uploads/2026/02/Team-Brazils-uniforms-for-the-Milano-Cortina-2026-Winter-Olympics-opening-ceremony-co-designed-by-Moncler-and-Osklens-Oskar-Metsavaht._FW25_00009.jpg?crop=0px%2C145px%2C2000px%2C1119px&resize=1000%2C563",
    "source": "WWD"
  },
  {
    "title": "Appetite for radical change grows as voters’ patience wears thin over housing crisis",
    "desc": "Half of all voters say country’s problems are getting worse instead of better",
    "image": "https://www.irishtimes.com/resizer/v2/6NRN2QZUV5CJRMPEUOUJKYVHN4.jpg?smart=true&auth=e95ff3bdccb2eeaa98ecdb6aa393c9c2991a97fa7aff72f8a54cd4238b8a44f0&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "NZ citizen Sauni Sini becomes 501 deportee from Australia for family violence offending",
    "desc": "A New Zealand citizen’s claim to have hundreds of relatives and extensive family ties in Australia was not enough to prevent his deportation for a history of...",
    "image": "https://www.nzherald.co.nz/resizer/v2/DOGXCWQ3BNGILI3HDY7GKOWCLA.jpg?auth=59e6b3a10fe9dd8b512381fe48cb1ad1c34d3ff69f70e425f08af474cf574d9c&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  }
]