[
  {
    "title": "RTC grants demurrer to evidence; acquits Delfin Lee of Globe Asiatique, 4 others in P6.6-B Pag-IBIG loans",
    "desc": "A San Fernando City regional trial court (RTC) in Pampanga has acquitted Globe Asiatique (GA) founder Delfin S. Lee and four others in a estafa case for alleged...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/28/82609.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Irish and international art in the frame at Whyte's",
    "desc": "Des O'Sullivan previews exciting opportunities for collectors on March 9",
    "image": "https://www.irishexaminer.com/cms_media/module_img/9958/4979261_7_seoimageog_whytes_o_27conor.jpeg",
    "source": "Irish Examiner"
  },
  {
    "title": "Suicide Note Claims: Dada KD’s son details exactly what happened in his dying moments",
    "desc": "Gyimah Peterson, son of late Highlife legend Dada KD, has firmly denied claims that his father left behind a suicide note before his death, insisting that he knows the true circumstances surrounding the incident.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/435/43572545.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Resident Evil Requiem Tops 320,000 Steam Players on Day 1",
    "desc": "Resident Evil Requiem just launched as the latest game in Capcom's long-standing horror game franchise, and almost immediately upon launching, it skyrocketed its way to the top of the Steam Top-Sellers chart and pulled impressive player counts. At its launch day peak, there were 320,056 concurrent p...",
    "image": "https://www.techpowerup.com/img/mr9v99zpe4j6kGzU.jpg",
    "source": "TechPowerUp"
  },
  {
    "title": "equity rule for large property sales, says 'many ways' to execute deals",
    "desc": "The Employees Provident Fund (EPF) would have no difficulty in transacting in Malaysian real estate, its chief executive officer Ahmad Zulqarnain Onn said, in the face of a new requirement for government-linked companies and investment companies (GLCs and GLICs) to only dispose of properties valued at RM20 million and above to buyers with at least 50% Bumiputera ownership.",
    "image": "https://assets.theedgemarkets.com/20260120_PLA_EPF_KWSP_8_LYY_20260228130300_theedgemalaysia.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "Chaos At Bengaluru Airport As Passengers Protest Nepal-Bound Air India Express Flight's Diversions",
    "desc": "Passengers protested at Bengaluru’s Kempegowda International Airport after repeated diversions disrupted their Kathmandu-bound flight, leaving them stranded for nearly two days.",
    "image": "https://images.news18.com/ibnlive/uploads/2026/02/MixCollage-28-Feb-2026-10-34-AM-1425-2026-02-00bc8c50be08844b6099eaba33235932-1200x675.jpg",
    "source": "News18"
  },
  {
    "title": "More restrictions sought for 501 Jamie MacArthur, deported to NZ after Melbourne rape",
    "desc": "WARNING: This story details sexual offending and may be distressing for some readers. Two weeks after being deported to New Zealand, the man behind a...",
    "image": "https://www.nzherald.co.nz/resizer/v2/T45V5HU7QFD6FFEESLPAATWP3U.jpg?auth=3977f1c26073461421b0518fc868409839c3dfe2d086f871b2cacb56e4746993&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "30-year jail term for Kilifi man who killed wife over Instagram dispute",
    "desc": "The High Court in Mombasa has sentenced a man to 30 years in prison for murdering his wife in Majengo Kanamai, Kilifi County. In a judgment delivered by Justice Wendy Kagendo Micheni at the High Court in Mombasa, 40-year-old Murad Awadh Mbaraka was found guilty of killing his wife, Nuru Ibrahim, in 2022 following persistent […]",
    "image": "https://www.kbc.co.ke/wp-content/uploads/2026/02/kilifi.jpg",
    "source": "KBC Digital"
  },
  {
    "title": "Zambian delegation visits Ministry of Education to study Ghana’s ICT and STEM education reforms",
    "desc": "A delegation from the Ministry of Education in Zambia has paid a courtesy call on Ghana’s Ministry of Education to understudy the country’s education system, with particular focus on Information and Communication Technology (ICT) and Science,...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/507/50732652.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Nikola Jokic Goes Viral for Heated Reaction in Nuggets-Thunder",
    "desc": "Denver Nuggets star Nikola Jokic got heated on Friday night agains the OKC Thunder. His reaction went viral on social media.",
    "image": "https://heavy.com/wp-content/uploads/2026/02/MixCollage-31-Dec-2025-02-07-PM-4921.jpg?quality=65&strip=all",
    "source": "heavy.com"
  }
]