[
  {
    "title": "Time for PAS to play more prominent national role, says Samsuri",
    "desc": "PN chairman Ahmad Samsuri Mokhtar says GE15 results are a sign that PAS can no longer play only a supporting role in the coalition.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/11/8a2ecdb1-ahmad-samsuri-mokhtar-bernama-131125.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Poilievre to pitch new policies aimed at dealing with Trump in speech to business leaders",
    "desc": "Conservative Leader Pierre Poilievre is set to unveil a suite of policy proposals meant to address the uncertainty caused by U.S. President Donald Trump's administration, according to a member of his senior staff.",
    "image": "https://i.cbc.ca/ais/331fa8f6-aa84-40c2-be90-fc35ef943a54,1772060308070/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C98%2C6556%2C3687%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Sanju Samson all set to feature in India’s must-win clash vs Zimbabwe",
    "desc": "Cricket News: Defending champions India national cricket team are weighing changes to their struggling opening partnership ahead of a must-win Super Eights encounte.",
    "image": "https://static.toiimg.com/thumb/msid-128785103,width-1280,height-720,imgsize-62404,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "20 billion galaxies: new survey of the sky will reveal the universe in unprecedented detail",
    "desc": "The Rubin Observatory in Chile has the largest camera ever built – and is set to find objects never before seen by human eyes.",
    "image": "https://images.theconversation.com/files/713787/original/file-20260122-56-wxake.jpeg?ixlib=rb-4.1.0&rect=0%2C232%2C2050%2C1025&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "The Chicago roots of ‘Sinners’: Blues, blood and the broken promises of the Great Migration",
    "desc": "In ‘Sinners,’ Ryan Coogler pays tribute to Black Chicago.",
    "image": "https://cst.brightspotcdn.com/dims4/default/790f8e5/2147483647/strip/true/crop/2530x1444+496+0/resize/1461x834!/quality/90/?url=https%3A%2F%2Fchorus-production-cst-web.s3.us-east-1.amazonaws.com%2Fbrightspot%2F9c%2F8b%2Fa20acdbf4256812884575d27a8c1%2Ffilm-review-sinners.jpg",
    "source": "WBEZ Chicago"
  },
  {
    "title": "Wests Tigers star Terrell May caught up in social media leak of intimate images",
    "desc": "Lawyers called in as Wests Tigers star caught up in social media leak of intimate images",
    "image": "https://content.api.news/v3/images/bin/5d33fa68e4b830f61a3adfb2c69b883f",
    "source": "fox sports"
  },
  {
    "title": "Football gossip: Salah, Collins, Casemiro, Wirtz, Onana, Mainoo, Griezmann",
    "desc": "Mohamed Salah would be happy to stay at Liverpool until 2027, there are six Premier League clubs interested in Frankfurt's Nnamdi Collins, while Casemiro wants to keep playing in Europe.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1881/live/868be090-129f-11f1-b048-c9424b2cf5fd.png",
    "source": "BBC"
  },
  {
    "title": "Drug-resistant infections rising in Nigeria -NIMR expert",
    "desc": "Senior Research Scientist, Nigerian Institute of Medical Research (NIMR), Dr. Emelda Chukwu, has warned that antimicrobial (antibiotic) resistance (AMR) is fast becoming one of Nigeria’s most dangerous and underestimated health threats. He revealed that recent surveillance conducted in selected hospitals in Lagos State uncovered “alarmingly high resistance” to third-generation cephalosporins, a major class of antibiotics […]",
    "image": "https://d1jcea4y7xhp7l.cloudfront.net/wp-content/uploads/2026/02/L-R-Chukwu-Onwuamah-and-DG-Prof.-Oladapo-Obafunwa-at-the-event.jpg",
    "source": "The Sun Nigeria"
  },
  {
    "title": "Real Madrid 2-1 Benfica (Agg 3-1): Vinicius Jnr the difference maker as Real make last 16",
    "desc": "Real Madrid book their place in the last 16 of the Champions League with a 3-1 aggregate victory over Benfica; A week on from allegedly suffering racial abuse in the reverse fixture, Vinicius Jnr scored the decisive goal; Real will play either Sporting Lisbon or Man City in the last 16",
    "image": "https://e0.365dm.com/26/02/1600x900/skysports-vinicius-junior-real-madrid_7175178.jpg?20260225220124",
    "source": "Sky Sports"
  },
  {
    "title": "Jury deliberating case against Los Gatos mom in teen sex party scandal",
    "desc": "Jurors are now deliberating 63 felony and misdemeanor charges against a former Los Gatos woman accused of masterminding boozy, sex-filled parties for her teen son and friends, allegedly enabling girls to be sexually assaulted while inebriated.",
    "image": "https://www.mercurynews.com/wp-content/uploads/2021/10/SJM-L-LGMOMFOLO-1014-thum.jpg?w=1024&h=540",
    "source": "The Mercury News"
  }
]