[
  {
    "title": "Naravane memoir leak organised, entered global markets sans govt clearance: Cops",
    "desc": "Earlier this week, Delhi Police registered an FIR under charges of criminal conspiracy in connection to the memoir's leak. The move followed questions raised by India Today Digital over how an unpublished book reached Congress leader Rahul Gandhi.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/general-mm-naravane-four-stars-of-destiny-row-122205820-16x9_0.jpg?VersionId=ila3qj7akmMxVlccNT0vU0Ryz_gryRDd",
    "source": "India Today"
  },
  {
    "title": "1 runner resuscitated, more hospitalised during 2006 marathon – from the SCMP archive",
    "desc": "Twenty years ago on February 12, 2006, amid the worst air pollution in months, multiple participants in city’s annual race sought medical attention.",
    "image": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2026/02/11/94cc6b2c-5d0b-461f-8f22-ca04e9b9bb80_0fadba5c.jpg?itok=5DMYq2Fy&v=1770788899",
    "source": "South China Morning Post"
  },
  {
    "title": "FPT Recognized in Gartner® Market Guide for Microsoft 365 Implementation and Support Services 2026",
    "desc": "FPT, a global technology and IT services provider, has been listed among 14 Representative Vendors in the Gartner® Market Guide for Microsoft 365 Implementat...",
    "image": "https://mms.businesswire.com/media/20260211829399/en/2718036/22/Cert_M365_Support.jpg",
    "source": "Business Wire"
  },
  {
    "title": "Police want to hear from anyone with information about disgraced ex-priest",
    "desc": "Rowan Donoghue is awaiting sentencing for sexual offending involving teenage boys.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--4xDypmph--/t_tohu-badge-facebook/v1769550124/4JU3NPY_Media_8_jfif?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "DRC Launches Forum to Transform Minerals into Industrial Power",
    "desc": "The Democratic Republic of the Congo is preparing to move beyond mineral extraction into refining and manufacturing with the launch of the DRC Critical Minerals and Industrialisation Forum, scheduled for October 7 to 9, 2026 in Kolwezi. Organisers of the DRC Africa Battery Metals Forum unveiled the new co-located event…",
    "image": "https://www.newsghana.com.gh/wp-content/uploads/2024/08/logo-newsghana.png",
    "source": "News Ghana"
  },
  {
    "title": "Maintenance Palbociclib Extends PFS in HR-Positive, HER2-Positive Metastatic Breast Cancer",
    "desc": "Results from the phase 3 PATINA trial demonstrated that the adding palbociclib to maintenance anti-HER2 and endocrine therapy significantly improved progression-free survival in HR-positive, HER2-positive metastatic breast cancer. News",
    "image": "https://www.hmpgloballearningnetwork.com/sites/default/files/branding/favicon/Oncology-favicon.png",
    "source": "HMP Global Learning Network"
  },
  {
    "title": "Dangote refinery hits full production capacity",
    "desc": "The Dangote Petroleum Refinery has hit its full capacity of 650,000 bpd, marking a milestone for Africa's largest single-train refinery. Learn more.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/12025353/David-Bird-800x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "US Energy Secretary Chris Wright touts oil production on Venezuela visit",
    "desc": "Democrats introduce legislation to force Donald Trump’s administration to be transparent about Venezuelan oil sales.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/2026-02-11T185602Z_552205979_RC2UJJA4VFF7_RTRMADP_3_VENEZUELA-USA-OIL-1770845967.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Laughing gas canisters are causing explosions in waste facilities, firms say",
    "desc": "Discarded nitrous oxide canisters are exploding in waste incinerators causing staff safety concerns.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/192a/live/51a04480-0772-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Jordan Stolz wins his first gold medal in the weirdest way possible",
    "desc": "The U.S. speed skating star set an Olympic record but had to wait for a competitor to take a second skate before he could claim his victory.",
    "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RITMP2IIMD4VQ3ECY252K4Y7O4_size-normalized.jpg&w=1440",
    "source": "The Washington Post"
  }
]