[
  {
    "title": "Fitzgibbon's finest: Picking a joint UL-Mary I team from a decade of dominance",
    "desc": "UL and Mary I meet in Friday's Fitzgibbon Cup final. Bar UCC's two titles, the Limerick colleges have dominated the competition for a decade.",
    "image": "https://www.irishexaminer.com/cms_media/module_img/9932/4966349_5_seoimageog_fitzmontage.jpg",
    "source": "Irish Examiner"
  },
  {
    "title": "Seedance Goes Viral With AI Hollywood Videos",
    "desc": "Seedance 2.0, the new AI video model from TikTok's Chinese owner ByteDance, is going viral for regurgitating Hollywood IP on an epic scale.",
    "image": "https://deadline.com/wp-content/uploads/2026/02/Screenshot-2026-02-12-at-14.37.07-e1770907766400.png?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Meet the Star-Crossed Leads of",
    "desc": "Sarah Pidgeon and Paul Anthony Kelly discuss fashion, fame, and being trailed by real-life paparazzi on their set.",
    "image": "https://assets.vogue.com/photos/698e0c332ca625597c64761b/16:9/w_1280,c_limit/01_GALLERY_DOUBLE-SHOT.jpg",
    "source": "Vogue"
  },
  {
    "title": "Lawyers of Chicago woman shot by federal agents say documents show how DHS lies about investigations",
    "desc": "Marimar Martinez, a teaching assistant and U.S. citizen, was shot five times by a Border Patrol agent in October while in her vehicle. She was charged with a felony after Homeland Security officials accused her of trying to ram agents with her vehicle. But the case was dismissed after videos emerged showing an agent steering his vehicle into Martinez’s vehicle.",
    "image": "https://d3i6fh83elv35t.cloudfront.net/static/2026/02/2026-02-11T195111Z_1863572403_RC2UJJA4Y9KE_RTRMADP_3_USA-TRUMP-CHICAGO-1024x683.jpg",
    "source": "PBS"
  },
  {
    "title": "Apple Watch Ultra 2",
    "desc": "Apple’s premium smartwatch from 2023 is over 30% off at Best Buy, but this might be your last chance to get it before inventory runs out.",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-02/260212-dotd-apple-watch-mm-main-6ead4b.jpg",
    "source": "NBC News"
  },
  {
    "title": "Judge Temporarily Blocks Hegseth From Punishing Mark Kelly Over ‘Illegal Orders’ Video",
    "desc": "Judge Richard J. Leon found that attempts to discipline Mark Kelly for a video that warned against following illegal orders would violate the senator’s First Amendment rights.",
    "image": "https://static01.nyt.com/images/2026/02/12/multimedia/12dc-kelly-vmbp/12dc-kelly-vmbp-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Trucking and logistics stocks drop on release of AI freight scaling tool",
    "desc": "A new tool from AI company Algorhythm Holdings has made trucking companies the latest victim of the market's AI jitters.",
    "image": "https://image.cnbcfm.com/api/v1/image/106019817-1563216854569gettyimages-469718746.jpeg?v=1770917731&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Edo & LAPO Offer Free Cancer Screening to 200 Residents",
    "desc": "The Edo State Government partners with LAPO to provide free cancer screening for 200 residents, marking World Cancer Day with a major health initiative.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2025/03/19204548/LAPO.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Footballer Thomas Partey charged with two further counts of rape",
    "desc": "The Villarreal and former Arsenal midfielder Thomas Partey has been charged with two new counts of rape relating to an additional woman",
    "image": "https://i.guim.co.uk/img/media/6bb7ba5f4bc21c834704dd90e7aeec1d15ad7198/706_264_3430_2744/master/3430.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0401ad36b858b5a5e032f4e18f8635be",
    "source": "The Guardian"
  },
  {
    "title": "Nations League draw: England to face Spain and Croatia, Wales meet holders Portugal",
    "desc": "England will face Spain, Croatia and the Czech Republic in the 2026-27 Uefa Nations League group stage, while Wales are drawn with holders Portugal.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/24b3/live/7c4ff4e0-0840-11f1-a418-9d2f92813770.jpg",
    "source": "BBC"
  }
]