[
  {
    "title": "Inside Holger Rune's recovery from Achilles surgery",
    "desc": "Holger Rune opens up on his Achilles injury, recovery journey and renewed motivation as the Danish star works his way back toward an ATP Tour return.",
    "image": "https://www.atptour.com/-/media/images/news/2026/02/03/14/05/rune-february-2026-recovery-it-all-adds-up.jpg",
    "source": "ATP Tour"
  },
  {
    "title": "We look forward to making sure government executes its promises - Manhyia South, MP",
    "desc": "The Member of Parliament for Manhyia South, Nana Agyei Baffour Awuah, says Parliament will intensify efforts to hold government accountable to ensure it delivers on key promises made to Ghanaians, despite recent signs of economic stability",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/image-253.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Research Finds Interaction With Father, Not Mother, Affects Child Health",
    "desc": "A long-term study of 292 families linked fathers’ parenting style to their children’s heart health years later. To researchers’ surprise, no such link was found with mothers.",
    "image": "https://static01.nyt.com/images/2026/02/03/multimedia/23hs-fathers-coparenting-ptlw/23hs-fathers-coparenting-ptlw-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Dad called 'horse mouth' for years gets new confidence after Turkey teeth transformation",
    "desc": "Johnathon Pratt, from Halifax, was branded an undatable 'horse mouth' and was bullied over his appearance for years before he forked out £9,500 for a Turkey transformation",
    "image": "https://i2-prod.mirror.co.uk/article36663578.ece/ALTERNATES/s1200/1_HypePress_Turkey_Teeth_Dad-5A.jpg",
    "source": "The Mirror"
  },
  {
    "title": "Zambia’s Catholic Bishops urge priests and faithful to steer clear of partisan politics",
    "desc": "As Zambia prepares for the August Presidential and General Elections, the Catholic Bishops have issued a Pastoral Letter advising politicians, the ...",
    "image": "https://www.vaticannews.va/content/dam/vaticannews/multimedia/2026/02/03/Zambian-Bishops.jpg/_jcr_content/renditions/cq5dam.thumbnail.cropped.1500.844.jpeg",
    "source": "Vatican News"
  },
  {
    "title": "PepsiCo is cutting the price of Doritos, Cheetos and other snacks by 15%",
    "desc": "PepsiCo, the maker of popular brands like Doritos, Lays and Cheetos, is slashing the price of its snacks by 15% in response to customer complaints that they have become too expensive.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/pep001-copy.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Ruto, Kindiki meet Meru leaders at State House",
    "desc": "The two leaders engaged Meru leadership on strengthening UDA at the grassroots",
    "image": "https://cdn.radioafrica.digital/image/2026/02/d00cbaea-5851-4c9f-9e47-184291edf49c.jfif?1770124210490",
    "source": "the-star.co.ke"
  },
  {
    "title": "Over 3, 500 kids set to compete at the 2026 Sirikwa Classic",
    "desc": "Competition Director Kennedy Tanui said the expanded focus on young athletes reflects a long-term strategy to nurture future champions.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/fc43005f-d327-4d76-96c5-d9720c9db66c.jpg?1770134712257",
    "source": "the-star.co.ke"
  },
  {
    "title": "US$7 million fraud: High Court dismisses Mpofu and Chimombe's appeal, upholds lengthy prison sentences",
    "desc": "The High Court has dismissed attempts by convicted fraudsters, Moses Mpofu and Mike Chimombe, to challenge the lengthy prison sentence they received for defrauding the government of more than US$7.3 million under the Presidential Goat Pass-On Scheme. Justice Pisirayi Kwenda refused leave to appeal for Mpofu and Chimombe, convicted in December 2025. He found their […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/10/07061212/chimombe-mpofu-.jpg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "Renaming of Kotoka International Airport has no economic relevance - NPP MP",
    "desc": "The Ranking Member on Parliament’s Roads and Transportation Committee, Kennedy Osei Nyarko, has strongly criticised the government’s plan to rename Kotoka International Airport (KIA).",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/137/13767174.jpg",
    "source": "GhanaWeb"
  }
]