[
  {
    "title": "Couple plan to use R178m lottery winnings to travel overseas",
    "desc": "A young couple’s dream to travel overseas will now become a reality after they bagged more than R178m in a Powerball jackpot.",
    "image": "https://www.timeslive.co.za/resizer/v2/QI3N6CY4CBK47FIHZFYQQCML5M.jpg?smart=true&auth=1ea888b53400a4e26cb418e71761ae4b3809e7bec4aa7e84bad0106f8410f113&width=1200&height=630",
    "source": "TimesLIVE"
  },
  {
    "title": "Fresh flooding concerns as further weather warning issued",
    "desc": "Residents have been warned to prepare for more flooding as further heavy rain is forecast over the bank holiday weekend, according to emergency planners.",
    "image": "https://www.rte.ie/images/0023d1cb-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Trump says US will open Venezuela airspace by day end, Americans can visit soon",
    "desc": "US President Donald Trump said he had instructed US Transportation Secretary Sean Duffy and military officials to open Venezuela’s airspace by the end of the day. He further said that major American oil corporations would be flying in to scout locations.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202601/us-president-donald-trump-speaks-during-a-cabinet-meeting-at-the-white-house-in-washington--dc-re-293519640-16x9_0.jpg?VersionId=Kb_P.glGllmhNgCf0Ph62B8CPHKejzOL",
    "source": "India Today"
  },
  {
    "title": "Allegation that man signing-on at Cork garda station threatened to behead member of public",
    "desc": "A garda claimed in court that a member of the public told gardaí the accused had been repeating 'I will behead you' while he was sitting on a bench ...",
    "image": "https://www.echolive.ie/cms_media/module_img/9901/4950959_1_seoimageog_iStock-126236054_1_.jpg",
    "source": "echolive.ie"
  },
  {
    "title": "Youth urge President Mahama not to remove GTEC Deputy Director-General",
    "desc": "The youth of the Ketu South Constituency have appealed to President John Dramani Mahama not to bow to pressure to remove the Deputy Director-General of the Ghana Tertiary Education Commission (GTEC), Professor Augustine Ocloo.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/570/57064968.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "2026 A History of the Augustinian Order Webinar Series",
    "desc": "Join the Lay Augustinians for a four-part webinar series about the history of the Augustinian Order from the death of St. Augustine in the fifth century to approximately the close of the fifteenth century, when the Order reached the height of its theological, intellectual, and cultural influence.",
    "image": "https://augustinian.org/wp-content/uploads/2024/08/28_image-asset.jpg-1536x1093-1.jpg",
    "source": "augustinian.org"
  },
  {
    "title": "Weight loss jab users warned over rare but serious pancreas issue",
    "desc": "Symptoms to look out for include severe pain in the stomach and back which does not go away.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1cd3/live/a6ac34d0-fd2b-11f0-890b-55ca0a00c59d.jpg",
    "source": "BBC"
  },
  {
    "title": "WB, Ethiopia Agree to Strengthen Partnership, Support for Macroeconomic Reforms",
    "desc": "Addis Ababa, January 29, 2026 (ENA) -The World Bank and Ethiopia have agreed to strengthen their partnership and continuous support to sustain the macroeconomic reforms.\nAccording to a press release of Ministry of Finance, World Bank Vice President for the Eastern and Southern Africa Region, Ndiame Diop, and Finance Minister Ahmed Shide had talks on the sidelines of the 27th Horn of Africa Initiatives Ministerial Meetings in Mogadishu, Somalia.\nDuring the meeting, the Minister briefed the Vice President on the role Ethiopia plays in the region and the importance of investing in regional integration.\nHe also commended the World Bank for the strong partnership and portfolio performance.\nOn his part, the Vice President congratulated the Government of Ethiopia on the achievements from the implementation of the macroeconomic reforms.\nDiop further reaffirmed the World Bank’s commitment to supporting Ethiopia’s development aspirations.\nThe two parties have finally agreed on more collaboration to strengthen the partnership and continuous support to sustain the macroeconomic reforms, it was learned.",
    "image": "https://www.ena.et/documents/42142/0/wb+%283%29.jpg/bafc80f1-8045-7ab5-ef97-c5015cf1b93a?version=1.0&t=1769705245154&download=true",
    "source": "ENA English"
  },
  {
    "title": "Trump's Race to Space Superiority: 2 Rocket Stocks Ready to Take Off in 2026",
    "desc": "And these two space picks are seeing more profits in SaaS models.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853258%2Fsatellite.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Sonia Bompastor tracks back on 'WSL title gone' comments",
    "desc": "Chelsea manager Sonia Bompastor has tracked back on her comments saying the WSL title is \"probably over\" by insisting her side will \"never give up\".",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/63eb/live/d15fa4e0-fd2c-11f0-890b-55ca0a00c59d.jpg",
    "source": "BBC"
  }
]