[
  {
    "title": "Groom Shows Up to Wedding in Unique Motorcade, “He Cut His Coat According to His Cloth”",
    "desc": "A groom's unique wedding arrival on a unique motorcade, massively supported by friends and family, sparks online buzz for its creativity and personal touch.",
    "image": "https://cdn.yen.com.gh/images/1200x675/9f955fa6adb59a94.jpeg?v=1",
    "source": "Yen News"
  },
  {
    "title": "Starmer blames councils for scrapping elections",
    "desc": "Decision to scrap votes in 30 local authorities was ‘locally led’, insists PM",
    "image": "https://www.telegraph.co.uk/content/dam/news/2026/02/18/TELEMMGLPICT000464592194_17714194921060_trans_NvBQzQNjv4BqXgrBd0P19THPvf9738yRPf4Xpit_DMGvdp2n7FDd82k.jpeg?impolicy=OG-Standard",
    "source": "The Telegraph"
  },
  {
    "title": "Iran, War, and the Illusion of Control",
    "desc": "By Alon Ben-Meir* NEW YORK | 18 February 2026 (IDN) — As U.S.–Iran negotiations over Tehran's nuclear program continue under the shadow of possible military action, both Washington and Tehran must weigh carefully the potentially catastrophic regional consequences of failure.…",
    "image": "https://indepthnews.net/wp-content/uploads/2026/02/tehran-300x200.jpg",
    "source": "IDN-InDepthNews"
  },
  {
    "title": "Matheesha Pathirana ruled out of T20 World Cup; Dilshan Madushanka replaces him",
    "desc": "The speedster hobbled off four deliveries into his spell against Australia and did not take any further part in the game",
    "image": "https://static.cricbuzz.com/a/img/v1/540x303/i1/c865708/left-arm-seamer-madushanka-last-played-two-matches-in-the-one-day-series-during-the-tour-of-zimbabwe-in-august-2025.jpg",
    "source": "Cricbuzz.com"
  },
  {
    "title": "Indian AI lab Sarvam's new models are a major bet on the viability of open source AI",
    "desc": "The new lineup includes 30-billion- and 105-billion-parameter models; a text-to-speech model; a speech-to-text model; and a vision model to parse documents.",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/sarvam-launch.jpg?resize=1200,800",
    "source": "TechCrunch"
  },
  {
    "title": "Strong Outlook from Analog Devices Boosts Infineon and STM",
    "desc": "Shares of Analog Devices surged by 8 percent in pre-market U.S. trading on Wednesday, reaching a record high of nearly $365. The semiconductor manufacturer's results and outlook are exceptionally...",
    "image": "https://www.marketscreener.com/images/twitter_MS_fdblanc.png",
    "source": "marketscreener.com"
  },
  {
    "title": "Chivayo gifts Highlanders leadership vehicles after club's win over Dynamos",
    "desc": "Controversial businessman Wicknell Chivayo has gifted five new vehicles to the leadership of Highlanders FC following the club’s 1–0 victory over rivals Dynamos FC in the Jairos Jiri Charity Cup match played over the weekend. Chivayo, who has emerged as a key benefactor of the Bulawayo giants, said the victory was a strong indication that […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/02/18074552/fb_img_1771398694352.jpg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "GERD as Catalyst for Regional Energy Integration - EADB Acting DG",
    "desc": "Addis Ababa, February 18, 2026 (ENA) – East African Development Bank (EADB) Acting Director General Bernard Mono has lauded the Grand Ethiopian Renaissance Dam (GERD) as a proud continental initiative strengthening regional energy cooperation and advancing Africa’s collective drive toward power self-sufficiency and industrial growth.\nIn an exclusive interview with ENA on the sidelines of the African Union Summit, Mono highlighted the significance of the Grand Ethiopian Renaissance Dam (GERD), describing it as a proud continental initiative that strengthens Africa’s path toward energy self-sufficiency.\n“I’ve heard of that — a proud initiative by our nations.”\nHe stressed that power generation is fundamental to industrialization and manufacturing across the continent.\nHe said the project also brings to mind the Mwalimu Nyerere Dam which undertaken by Tanzania.\n“You can’t industrialize if you don’t have power. These initiatives are helpful to make sure that our countries are self-sustaining in power generation. They are tools and catalysts for development.”\nMono expressing hope that more African nations will pursue similar initiatives to ensure reliable electricity supply for economic transformation.\nRegarding Addis Ababa's transformation, Mono highlighted visible transformation and stressed the need for African nations to finance their own development through well-capitalized regional institutions.\n“I’ve seen the roads. I’ve seen a glowing city. So much construction going on — it shows something right is happening in this country.”\nHe said such investments signal strong political commitment to economic transformation and industrialization.\nRegarding African financial sovereignty, he argued that Africa must strengthen and capitalize its own development finance institutions to reduce dependency on external financing and reshape the narrative around investment risk on the continent.\n“We are judged with an eye that does not fully reflect our reality. That is why having homegrown institutions that are well capitalized and delivering at scale is very important.”\nAccording to him, African institutions should assess risk based on on-the-ground knowledge rather than external perceptions.\n“Some people assess risk based on what they read in newspapers or what they Google. But here, we know. The reality is that risk in Africa is perceived risk, not real risk.”\nHe called on governments, investors, and citizens to believe in African institutions — including national development banks — as engines of transformation.\nMono linked financial sovereignty to regional integration and the success of the African Continental Free Trade Area (AfCFTA), noting that Africa must finance its own producers if it is to trade effectively within the continent.\nHe emphasized collaboration among African development finance institutions — including EADB and other regional banks — to scale up financing for agriculture, manufacturing, SMEs, and infrastructure.\nHe stressed that Africa must trust its institutions and work together to deepen economic integration and support development from within.\n“If Ethiopia has excess wheat, why should we import from outside Africa? Let us finance our farmers and manufacturers so we trade among ourselves.”\nHe further said that, “If we are not producing, we continue importing from outside Africa. But if we finance manufacturers and farmers so that they produce quality products, why not import and export within Africa?”\nEast African Development Bank (EADB) is a development financier supporting infrastructure, agriculture, social sectors, and SME growth in Kenya, Tanzania, Rwanda, and Uganda.",
    "image": "https://www.ena.et/documents/42142/0/SELAM+%282%29.jpg/dc17aec8-5a0b-1c8f-8fd5-7c75509e2442?version=1.0&t=1771418935125&download=true",
    "source": "ENA English"
  },
  {
    "title": "King Michael reacts to Green Daddy's hospital outburst",
    "desc": "King Michael responds to Green Daddy's emotional outburst over newborn's death, addressing system failures and public perception.",
    "image": "https://mbu.ug/wp-content/uploads/2026/02/499735002_24569305295992693_4421349063970445563_n-edited.jpg",
    "source": "mbu.ug"
  },
  {
    "title": "M62 traffic STOPPED following fire on Greater Manchester motorway",
    "desc": "Lanes were closed",
    "image": "https://i2-prod.manchestereveningnews.co.uk/incoming/article33445645.ece/ALTERNATES/s1200/1_30142471.jpg",
    "source": "Manchester Evening News"
  }
]