[
  {
    "title": "Brook lied 'to protect team-mates' after nightclub bouncer incident",
    "desc": "England white-ball captain responds to confirmation that other England players were present on night out in Wellington",
    "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/411500/411599.6.jpg",
    "source": "ESPNcricinfo"
  },
  {
    "title": "The summary of the 54th stage of the Olympic Torch Relay, with arrival in Livigno",
    "desc": "On Friday, the Flame crossed some of the most evocative alpine landscapes between Trentino-Alto Adige and Lombardy, whitened by the heavy snowfall of the last few days.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/gpz9pfhtgmwpbotdk5pg",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "NPP Primary: The men who have more to lose than the contenders",
    "desc": "All is set for the New Patriotic Party (NPP) presidential primary on Saturday, January 31, 2026, to elect the party’s flagbearer, who would lead it into the 2028 general election.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/698/69866270.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Liverpool forced to wait on Nottingham Forest transfer as Inter talks open",
    "desc": "Inter Milan have opened talks over a potential loan deal for Liverpool midfielder Curtis Jones before the January transfer deadline that depends on Davide Frattesi joining Nottingham Forest",
    "image": "https://i2-prod.mirror.co.uk/article36646939.ece/ALTERNATES/s1200/0_JS392861914.jpg",
    "source": "The Mirror"
  },
  {
    "title": "Israeli strikes on Gaza reportedly kill at least 12, one of highest tolls since October agreement",
    "desc": "Attacks, which killed women and children, come day before border crossing is due to open in Gaza’s southern most city",
    "image": "https://i.guim.co.uk/img/media/f3c08eabb90241c6813b4e638e519f5d43b101d2/294_0_4412_3530/master/4412.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dd7faa4c7daa623c19f0ff8fac15ebb1",
    "source": "The Guardian"
  },
  {
    "title": "MOM urges employers to advise travelling helpers to take precautions against Nipah virus",
    "desc": "Helpers who feel unwell during or after travel should see a doctor immediately, said MOM. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/822d3b3e736bca8c04fe0ace0ae32ef68945fb2d9c808e8223309577f49dd147",
    "source": "The Straits Times"
  },
  {
    "title": "Security forces foil coordinated militant attacks across Balochistan",
    "desc": "Security forces on Wednesday thwarted a series of coordinated militant attacks at multiple locations across Balochistan, killing several assailants and regaining control",
    "image": "https://www.nation.com.pk/digital_images/large/2026-01-31/bla-terror-attacks-across-balochistan-foiled-security-forces-retain-control-1769844685-7906.png",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "Box office monster Dhurandhar tops Netflix India charts in record time",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/01/Dhurandhar-3.webp",
    "source": "123telugu.com"
  },
  {
    "title": "Irish Albums Celebrating 5 to 50 years in 2026",
    "desc": "With 2026 under way, 2fm's Dan Hegarty takes a look at some of the Irish albums turning five to 50 years old this year.",
    "image": "https://www.rte.ie/images/0023d14d-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Easy cheesy...Classic comfort food for the St Brigid’s weekend",
    "desc": "It’s the first bank holiday weekend of 2026 after the Christmas period, and Dianne Curtin has receipes for some simple, warming comfort food.",
    "image": "https://www.echolive.ie/cms_media/module_img/9903/4951640_2_seoimageog_WEEKEND_20FOODIE_20Mustard_20cheddar_20rarebit.jpeg.jpg",
    "source": "echo live"
  }
]