[
  {
    "title": "Ricky Gervais Reminds Stars to Leave Politics Out of Speeches",
    "desc": "After the 2026 Grammys were filled with politically-charged speeches from Bad Bunny and Billie Eilish, Ricky Gervais has decided to weigh in.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2026/02/Ricky-Gervais-getty-H-2026.png?w=1296&h=730&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "Man Utd news: Marcus Rashford snubbed for Barcelona team",
    "desc": "Manchester United were inactive in the January transfer window but have won three games in a row under new interim boss Michael Carrick",
    "image": "https://i2-prod.mirror.co.uk/article36664144.ece/ALTERNATES/s1200/0_Spain-La-Liga-Soccer-26031778455088.jpg",
    "source": "The Mirror"
  },
  {
    "title": "Decomposed body of man found in house in Villa, Embakasi, Nairobi",
    "desc": "The smell from his room attracted the neighbours who found the body lying on the bed",
    "image": "https://cdn.radioafrica.digital/image/2026/02/08371734-02db-4b07-81b0-6f65894d8517.jpg?1770185524440",
    "source": "the-star.co.ke"
  },
  {
    "title": "Advancing Health Security: Pandemic Preparedness Across Latin America and the Caribbean",
    "desc": "In Latin America and the Caribbean, health systems face mounting pressures from factors such as migration, tourism, and shortages of frontline workers, while rising temperatures and natural disasters increase the risk of waterborne and vector-borne diseases. This interconnectedness amplifies the region’s vulnerability to cross-border outbreaks, as demonstrated by recent dengue and Zika epidemics. Experts warn",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Sifuna: ODM's Linda Ground rallies are not financed by the party",
    "desc": "Asked about the origin of the funds, Sifuna said it was not his responsibility. “You will ask them. I can only account for monies that I am a signatory to.”",
    "image": "https://publish.eastleighvoice.co.ke/mugera_lock/uploads/2025/08/Edwin-Sifuna.jpg",
    "source": "eastleighvoice.co.ke"
  },
  {
    "title": "Court system at 'brink of collapse', former senior judge warns",
    "desc": "An independent review made 130 recommendations - including creating a new criminal justice adviser to the PM - to improve the efficiency of the system.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a2e9/live/5d12f8b0-014d-11f1-8364-29c6afed0faf.jpg",
    "source": "BBC"
  },
  {
    "title": "Criminal trial of ex-CEO of New Silkroutes Group Goh Jin Hian and another executive to start Feb 4",
    "desc": "The criminal trial for ex-CEO Goh Jin Hian and Kelvyn Oo Cheong Kwan of New Silkroutes Group for alleged market manipulation begins Feb 4. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/7cb6f0f27983853603b10d30f108d3927575c62989631031b3be594dda528cf5",
    "source": "The Straits Times"
  },
  {
    "title": "Trump renews lapsed trade subsidy pact with Africa",
    "desc": "First enacted in 2000, the African Growth and Opportunity Act (AGOA) allows qualifying sub-Saharan African countries to export over 1,800 products to the US duty-free. Export countries include Nigeria and South Africa.",
    "image": "https://static.dw.com/image/75792163_6.jpg",
    "source": "DW.com"
  },
  {
    "title": "Trump's failure to extend nuclear treaty leaves door 'wide open' to arms race",
    "desc": "The last remaining nuclear arms pact between the United States and Russia has come to an end at a time of global instability.",
    "image": "https://live-production.wcms.abc-cdn.net.au/2f380839edb57b9ec1e0ad46a5d8dc93?impolicy=wcms_watermark_news&cropH=619&cropW=1100&xPos=0&yPos=30&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Senate to Forcibly Summon Governor Muthomi Njuki Over Missed Audit Grilling",
    "desc": "His sudden disappearance from the building prompted the committee to dispatch the sergeant-at-arms to search for him and his staff, but he was nowhere to be found.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/senate_5.jpg?itok=kXdTkN_z",
    "source": "Kenyans.co.ke"
  }
]