[
  {
    "title": "Scientists uncover new mechanism initiating gene transcription",
    "desc": "Scientists at IOCB Prague are uncovering new details of gene transcription. They have identified a previously unknown molecular mechanism by which the transcription of genetic information from deoxyribonucleic acid (DNA) into ribonucleic acid (RNA) can be initiated.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/DNA_Genetics-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Bear Necessities: The past, present (and future) of SIA's teddy bears",
    "desc": "Meet Beary, Singapore Airlines' unofficial mascot, and the rage of collectors everywhere.",
    "image": "https://milelion.com/wp-content/uploads/2026/01/pxl_20260130_025153651.jpg",
    "source": "The MileLion"
  },
  {
    "title": "Stan Dogbe: Deputy Chief of Staff apologises after pushing soldier at military graduation",
    "desc": "Stan Dogbe: Deputy Chief of Staff apologises after pushing soldier at military graduation",
    "image": "https://www.graphic.com.gh/images/2025/sept/02/stannye.jpg",
    "source": "Graphic Online"
  },
  {
    "title": "Video of Bengaluru cop caught red-handed taking Rs 4 lakh bribe goes viral",
    "desc": "BENGALURU: A day after a police inspector was allegedly caught accepting a Rs 4 lakh bribe, a video of him screaming while being held by Lokayukta off.",
    "image": "https://static.toiimg.com/thumb/msid-127812991,width-1280,height-720,imgsize-2819758,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Metacognitive therapy speeds return to work and saves costs",
    "desc": "Many people with different mental health problems can be absent from work for a long time. But new results give hope that more people can recover and return to work sooner.",
    "image": "https://www.news-medical.net/images/tags/TagImage-1831-45296002389942131275-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Thai military fires warning shots at Cambodia after laser targeting incident near Phu Pha Lek base",
    "desc": "BANGKOK: Thai military fired warning shots near the Phu Pha Lek base after hearing an explosion and observing laser targeting from Cambodia's forces. Both sides have since coordinated to resolve the incident",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/31/3747451.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Your Daily Love Horoscope For Saturday, January 31, 2026",
    "desc": "The Saturday, January 31, 2026, love horoscope is here for your zodiac sign. Today, Chiron in Aries squares the Cancer Moon.",
    "image": "https://www.yourtango.com/sites/default/files/image_blog/2026-01/daily-love-horoscope-saturday-january-31-2026.png",
    "source": "YourTango"
  },
  {
    "title": "How a 6-year wait shaped a successful Lagos confectioner",
    "desc": "Meet Mojirade Bepo, a Lagos confectioner whose journey from a six-year academic delay to CEO of a thriving snack brand is a story of faith and focus.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/01/31003329/Bepo-1200x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Wastewater surveillance reveals hidden COVID spread beyond reported cases",
    "desc": "As COVID-19 testing becomes less routine, official case numbers can make outbreaks look smaller than they really are.",
    "image": "https://www.news-medical.net/images/tags/TagImage-1295-45841047278807879412-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Around 1,300 shorter waiting time flats to be offered across three projects in February BTO sales exercise",
    "desc": "One of the projects, Tampines Bliss, will have a wait time of just one year and 11 months, making it one of the fastest BTO projects to be completed since shorter waiting time flats were launched in 2018.",
    "image": "https://dam.mediacorp.sg/image/upload/s--CVQ3AoIo--/c_crop,h_898,w_1597,x_3,y_75/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/01/30/tampines-bliss_high-res.jpeg?itok=4l4uiUeq",
    "source": "CNA"
  }
]