[
  {
    "title": "Chalk Farm fire disrupts Euston station railway services",
    "desc": "There is major disruption on all rail services between Euston station and Watford Junction.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/fdc1/live/cbf129d0-fdd0-11f0-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Mortgage approvals to home buyers drop to lowest level in year-and-a-half",
    "desc": "Finance and property experts said they expect to see momentum rebuilding in the months ahead.",
    "image": "https://static.independent.co.uk/2026/01/30/11/4ae866ea1e13b1362207fc7b7397b13eY29udGVudHNlYXJjaGFwaSwxNzY5ODU2NjIw-2.21754240.jpg?width=1200&height=800&crop=1200:800",
    "source": "The Independent"
  },
  {
    "title": "Beyond Privacy Day: Why protecting personal data must remain national priority",
    "desc": "DAR ES SALAAM: EARLIER this week, on 28 January 2026, Tanzania joined the rest of the world in marking Privacy Day, a moment set aside to reflect on the value of privacy and the protection of personal data in an increasingly digital society. While the date has passed, the message should not. Privacy Day was",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/01/DTPRIV.webp",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Best robot vacuum deal: Save $150 on the Dreame L40 Ultra Gen 2 robot vacuum and mop",
    "desc": "As of Jan. 30, Prime members can score the Dreame L40 Ultra Gen 2 robot vacuum and mop for $499.99 at Amazon, 23% off its list price of $649.99.",
    "image": "https://helios-i.mashable.com/imagery/articles/05vFjvckdiJvvTiDCfWng1n/hero-image.fill.size_1200x675.v1769765504.jpg",
    "source": "Mashable"
  },
  {
    "title": "Early Permian terrestrial apex predator regurgitalite indicates opportunistic feeding behaviour",
    "desc": "Fossilised digestive remains (bromalites) provide unique insights into extinct animals’ behavioural ecology, physiology and diet. We describe fossilised regurgitated stomach content from the early Permian Bromacker locality (Thuringia, Germany) using micro-CT, osteological, chemical and taphonomical analyses. The regurgitalite consists of a compact cluster of 41 bones with a unique taphonomic signature, including sub-articulated, aligned long bones, an irregular overall shape, and low phosphorus contents in the near-bone matrix. The multitaxic elements comprise a maxilla attributed to the captorhinomorph Thuringothyris mahlendorffae, postcranial elements of the bolosaurid Eudibamus cursoris and an unidentified diadectid, along with several unassignable elements, indicating opportunistic feeding behaviour. The regurgitalite size and composition suggest an apex predator as producer, such as the sphenacodontid Dimetrodon teutonis or the varanopid Tambacarnifex unguifalcatus, both known from Bromacker. This specimen represents the geologically oldest terrestrial regurgitalite and reveals novel insights into the feeding behaviours and the trophic network in a late Palaeozoic continental ecosystem.",
    "image": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-025-33381-0/MediaObjects/41598_2025_33381_Fig1_HTML.png",
    "source": "Nature"
  },
  {
    "title": "‘World’s First True Hybrid Drone Propulsion System’ Breaks Cover in Israel",
    "desc": "Elbit Systems is outfitting its unmanned aerial vehicles with what it calls the “world’s first true hybrid” propulsion system.",
    "image": "https://i.thedefensepost.com/wp-content/uploads/2026/01/LH-01-Lowental-Hybrid-Propulsion-System-1.jpg",
    "source": "The Defense Post"
  },
  {
    "title": "Pharrell calls for empathy from US leaders after being honored at Black Music Collective event",
    "desc": "Pharrell Williams uses the Recording Academy stage to pray for U.S. leaders",
    "image": "https://i.abcnewsfe.com/a/d866ca2d-c8fd-4122-ae5a-af1f423e2f43/wirestory_886993c86f0f9ff2dc41c971a5aee76e_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Beyond keywords: Review flags bias and reliability gaps in disaster social media research",
    "desc": "Far from simply a source of unstructured online content, disaster management in the digital age can be supported by careful analysis of online social-media data, suggests a paper published in Natural Hazards and Earth System Sciences (NHESS) titled \"Social Media for Managing Disasters Triggered by Natural Hazards: A Critical Review of Data Collection Strategies and Actionable Insights.\"",
    "image": "https://scx2.b-cdn.net/gfx/news/hires/2026/how-social-media-data.jpg",
    "source": "Phys.org"
  },
  {
    "title": "Brand Engagement Network Secures $1.518M Premium Private Placement at $63.25 a Share, Strengthens Balance Sheet with $818K in Warrant Proceeds, Full Debt Repayment",
    "desc": "/PRNewswire/ -- Brand Engagement Network, Inc. (\"BEN\") (Nasdaq: BNAI), a provider of secure, enterprise-grade artificial intelligence solutions, today...",
    "image": "https://mma.prnewswire.com/media/2777074/Brand_Engagement_Network_LOGO.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "Tecno Camon 50 and Camon 50 Pro images and specs revealed by the Google Play Console",
    "desc": "The two are coming soon, perhaps launching at MWC in early March. The Tecno Camon 40 and Camon 40 Pro arrived last May, and now their successors are almost...",
    "image": "https://fdn.gsmarena.com/imgroot/news/26/01/tecno-camon-50-camon-50-pro-google-play-console/-952x498w6/gsmarena_000.jpg",
    "source": "GSMArena.com"
  }
]