[
  {
    "title": "Zimbabwe Joins Kenya, Morocco, Uganda, South Africa, Madagascar, and Over Forty Other African Countries in Confronting Record Decline in US Tourism Amid Economic Struggles",
    "desc": "Zimbabwe, Kenya, South Africa, and other African nations are leading a record decline in U.S. tourism, marking a crucial shift in travel dynamics. Here’s everything you need to know.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/a-cinematic-photograph-capturing-a-diver_3olf7TQQSuqzFpo2RQ_pwQ_uCvAJz7RTpmP0y8hHkPd1A.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "Budget, FASTag rules, tobacco prices: Key things to watch out for on Feb 1",
    "desc": "Union Finance Minister Nirmala Sitharaman will present the Union Budget in Parliament on the first day of the month",
    "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2024-07/19/thumb/fitandfill/1200X630/1721363800-8387.jpg",
    "source": "Business Standard"
  },
  {
    "title": "Public debt breaches limit by Rs17tr",
    "desc": "Debt-to-GDP rises to 70.7% as FBR misses targets despite slowing refunds",
    "image": "https://i.tribune.com.pk/media/images/21607800819-1/21607800819-1-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "'Border 2' box office collection Day 9",
    "desc": "Sunny Deol's 'Border 2' has achieved remarkable box office success, crossing Rs 300 crore globally within 10 days of its release, despite facing competition from 'Mardaani 3'.",
    "image": "https://static.toiimg.com/thumb/msid-127830728,width-1280,height-720,imgsize-15398,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Columbia astronauts' chilling final moments after learning they were about to die",
    "desc": "Seven astronauts died when NASA's Space Shuttle Columbia broke apart during re-entry on 1 February 2003, with the crew unaware of the danger until their final moments",
    "image": "https://i2-prod.irishmirror.ie/article36635751.ece/ALTERNATES/s1200/0_Columbia-space-shuttle-disaster.jpg",
    "source": "Irish Mirror"
  },
  {
    "title": "Molly Ringwald Says John Hughes Movies Shouldn't Be Remade",
    "desc": "Molly Ringwald doesn't think other directors should commit to remaking John Hughes movies like The Breakfast Club and Sixteen Candles.",
    "image": "https://deadline.com/wp-content/uploads/2026/01/GettyImages-2258344237.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Graft busters freeze RM1mil in accounts over e-waste probe, seizes RM170,000",
    "desc": "Graft busters have frozen two bank accounts worth an estimated RM1mil and seized about RM170,000 in cash following investigations into the management of electronic waste (e-waste).",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/01/3748373.jpg",
    "source": "The Star"
  },
  {
    "title": "Bangladesh end U19 World Cup campaign on winning note",
    "desc": "The Tigers scored a 74-run win over co-hosts Zimbabwe in Harare",
    "image": "https://images.icc-cricket.com/image/upload/t_ratio16_9-size20-webp/prd/zrz38n4hsmc0pt7khuzg",
    "source": "ICC"
  },
  {
    "title": "A 'chia seed' trend on TikTok promotes a 'quick fix' to weight loss, but is it safe?",
    "desc": "The health benefits of chia seeds have been well publicised, but health and internet experts are urging people to not believe everything you see on social media.",
    "image": "https://live-production.wcms.abc-cdn.net.au/1f7e8125816f55b866e3f7ca50951128?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Thousands converge at temples across Penang for Thaipusam",
    "desc": "GEORGE TOWN: Thousands of devotees are set to converge at temples across Penang for Thaipusam with a hive of rituals and gatherings already taking place since early hours of the morning.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/01/3748372.jpg",
    "source": "thestar.com.my"
  }
]