[
  {
    "title": "Exclusive: Positron raises $230M Series B to take on Nvidia's AI chips",
    "desc": "The investment comes from backers including the Qatar Investment Authority as demand for chips beyond Nvidia soars and as Qatar aims to build out its AI infrastructure.",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/positron.jpg?w=1200",
    "source": "TechCrunch"
  },
  {
    "title": "Viral student plea: Govt cracks down on daladala abuse of students",
    "desc": "Students and members of the public can report incidents through Latra’s toll-free lines or via WhatsApp by submitting photo or audio evidence.",
    "image": "https://www.thecitizen.co.tz/resource/image/5347786/landscape_ratio3x2/1200/800/559476a18b3b320fcfff97c97567db1c/YC/daladala-pic.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Remains of family of 5 found in burned Johor home; 2 men to be charged with murder",
    "desc": "Six human remains — including five from a family believed to have died more than three months ago — were found in a burned home at an oil palm plantation in Skudai, Johor last month. The victims include three young children aged two, five and nine, all of whom did not have school records, according to police. Speaking at a...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/police_malaysia_murder.jpg?itok=o1B_DMoR",
    "source": "AsiaOne"
  },
  {
    "title": "Supermarket loses title as Britain's cheapest 'big shop' for first time in over a year to major rival - and it's NOT Aldi or Lidl",
    "desc": "A supermarket has lost its title as Britain's cheapest for a big shop for the first time in over a year as a rival moved into the lead for the first time since December 2024, according to Which?.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/03/16/106058203-0-image-m-10_1770134983382.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Flight to US was forced to turn back when girl, 16, was sexually assaulted by passenger sitting next to her",
    "desc": "A farmer, 58, has pleaded guilty to sexually assaulting the then 16-year-old girl on board an Aer Lingus flight bound for Boston, triggering a costly diversion back to Shannon Airport in Ireland.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/04/07/106091325-0-image-a-10_1770190717980.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Mayor suspected of pocketing millions in donations named as Ashkelon's Tomer Glam",
    "desc": "City leader released to house arrest as police probe suspicions of bribery, fraud, theft and money laundering in connection to wartime donations that were allegedly misappropriated",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/02/F251124YS50.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Man Utd decide on three summer signings in £173m 'revamp', including Newcastle star",
    "desc": "Man Utd have decided on three players they want to sign in the summer transfer window as they look to 'revamp' their squad, according to reports.",
    "image": "https://d2x51gyc4ptf2q.cloudfront.net/content/uploads/2025/10/01092040/F365-Jim-Ratcliffe-with-Man-utd-badge-1.jpg",
    "source": "Football365"
  },
  {
    "title": "John Terry's daughter urges him not to post embarrassing reaction video which has made him a laughing stock for Arsenal fans after he hoped for a Chelsea goal... only to see Kai Havertz score!",
    "desc": "In his video, Terry is admonished by his daughter, Summer, 19, who says 'don't put that anywhere please' after he turns the camera towards her on the couch, while she tries to cover her face.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/04/08/106091557-0-image-m-30_1770192701274.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Governor launches environmental impact assessment at Bukalo",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% Zambezi governor Dorothy Kabula on Tuesday launched an environmental impact assessment for the development of 500 erven within the Bukalo Village Council’s boundaries.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-04-at-10.00.51-AM.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "Two terrorists killed in Basantgarh area of J-K's Udhampur: Army",
    "desc": "The officials said, \"the operation concluded successfully however, the area remains under surveillance.\"",
    "image": "https://greaterkashmir.imagibyte.sortdcdn.net/wp-content/uploads/2024/08/Encounter-2.webp",
    "source": "Greater Kashmir"
  }
]