[
  {
    "title": "From wagging tails to healthy tales: How pets improve mind and body",
    "desc": "In many Kenyan homes, animals have long served practical roles. Cats keep rodents away, dogs alert families to danger, while birds and rabbits are often kept quietly in backyards.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/CaTNJF3etc4jiEMYiImRSVbFnAjxlP0VVFi44XC4.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "Ukraine urges peace talks, says only Trump can make deal",
    "desc": "Kyiv's foreign minister has said the Ukrainian and Russian leaders need to meet in person to hash out the hardest remaining issues in peace talks, and that only US President Donald Trump has the power to ⁠bring about an agreement.",
    "image": "https://www.rte.ie/images/00238431-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Winter Olympics 2026: Vonn crashes out, Johnson wins downhill gold, snowboarding and more - live",
    "desc": "Lindsey Vonn’s brave bid for downhill gold ended in agony as Breezy Johnson topped the podium. Join our writers for updates from Milan Cortina",
    "image": "https://i.guim.co.uk/img/media/803618f8fe08ff1ed63d2ae036614ecb13e0ab89/150_0_1638_1310/master/1638.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=0ba1ecc352b28571d184321ecd635a31",
    "source": "The Guardian"
  },
  {
    "title": "Lindsey Vonn ⁠crashes out; Breezy Johnson wins downhill at Winter Olympics",
    "desc": "Skiing icon Lindsey Vonn fell seconds into her run of the women’s downhill just days after sustaining an ACL injury.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/GettyImages-2260513503-1770556566-e1770558664652.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Field study on heat transfer performance and thermo-mechanical properties of pre-bored PHC energy pile",
    "desc": "This paper introduces a type of pre-bored PHC energy pile which can increase the survival rate of heat exchange pipes as well as improve the heat exchange performance of energy pile through the unique installation method. A group of field tests were conducted to study the heat transfer performance and thermo-mechanical properties of pre-bored PHC energy pile, and the distributed fiber optic sensors (DFOS) were equipped in test pile to measure the variation of temperature and strain of pile shaft in the test process. The field test results showed that the installation method of pre-bored PHC pile largely increased the survival rate of heat exchange pipes; the average heat transfer efficiency of pre-bored PHC energy pile was 81.3 W/m under summer conditions, and 65.8 W/m under winter conditions. The maximum thermally induced stress in pile shaft was about 2 MPa under summer conditions, while the maximum thermally induced stress in pile shaft was − 1.6 MPa under winter conditions. The influence of tensile stress in pile shaft under winter conditions on the structural safety of pre-bored PHC energy pile should be specially considered as the tensile strength of PHC pile shaft was much smaller than its compressive strength.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Vietnam's Evolution Team Wins Crossfire Legends SEA Championship 2026",
    "desc": "The Crossfire Legends Southeast Asian Championship 2026 has concluded its final day in Makati City, with Vietnam Evolution Team emerging as the tournament",
    "image": "https://walastech.com/wp-content/uploads/2026/02/download-2.jpg",
    "source": "WalasTech"
  },
  {
    "title": "eagle rescued in Aurora",
    "desc": "BALER, Aurora – A Philippine hawk-eagle (Nisaetus philippensis) was rescued after colliding with a tree while diving for prey here on Saturday.Cesar Santiago,...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/08/77737.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Security operations in Turkana, Laikipia bearing fruit - Murkomen",
    "desc": "Interior and National Administration CS Kipchumba Murkomen has commended the ongoing security operations in parts of the Kerio Valley and Northern Kenya regions.",
    "image": "https://www.kbc.co.ke/wp-content/uploads/2026/02/Murkomen.jpeg",
    "source": "KBC Digital"
  },
  {
    "title": "BP faces calls for new strategy to end period of turbulence",
    "desc": "Full-year results expected to reveal weaker profits as company also faces investor pressure over climate U-turn",
    "image": "https://i.guim.co.uk/img/media/4716793e55448739d3c844f4c504b649bcd1fac0/96_0_3307_2646/master/3307.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=167cb9f97454d8a926d3689a49e1f7cf",
    "source": "The Guardian"
  },
  {
    "title": "Benguet rep withdraws from MUPH 2026",
    "desc": "LA TRINIDAD, Benguet — Miss Universe Philippines Benguet 2026 titleholder Longey has officially stepped down from her crown, effectively withdrawing from this y",
    "image": "https://media.assettype.com/tribune%2F2026-02-08%2F4lxyyoan%2F1000017526.jpg?rect=0%2C72%2C1080%2C567&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Daily Tribune"
  }
]