[
  {
    "title": "VP calls for increased innovation at DSE",
    "desc": "DODOMA: VICE-PRESIDENT Emmanuel Nchimbi has called on the Dar es Salaam Stock Exchange (DSE) to intensify efforts to mobilise investment and innovate market strategies as the country pursues its ambitious goal of building a 1 trillion US Dollars (equivalent to 2.5tri/-) economy by 2050. Dr Nchimbi made the remarks yesterday in Dodoma during a meeting",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/Makamu-wa-Rais-wa-Jamhuri-ya-Muungano-wa-Tanzania-Mhe.Balozi-Dkt.-Emmanuel-Nchimbi-amekutana-na-.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Is It Too Late To Reassess Allied Gold (TSX:AAUC) After A 216% One Year Run?",
    "desc": "If you are trying to work out whether Allied Gold is still reasonably priced after its run, the starting point is understanding what the current market is implying about its value. The share price recently closed at $42.89, with returns of 0.6% over 7 days, 13.4% over 30 days, 35.5% year to date and 216.3% over the last year. This will naturally raise questions about how much optimism is already reflected. Recent coverage of Allied Gold has focused on its position in the materials sector and...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/b3b5a2748dbe57dca97087f8af8726d5",
    "source": "Yahoo Finance"
  },
  {
    "title": "Day 8: What to watch with Team Canada at Milano Cortina 2026",
    "desc": "We’re into the second weekend of the Milano Cortina 2026 Olympic Winter Games.",
    "image": "https://olympic.ca/wp-content/uploads/2026/02/TC_MC26_DailyPreview_Day8_Feature.jpg?quality=100",
    "source": "Team Canada"
  },
  {
    "title": "Arundhati Roy pulls out of Berlin Film Festival over jury's ‘unconscionable' remarks on Gaza: ‘Jaw-dropping'",
    "desc": "Booker Prize-winning author Arundhati Roy reportedly said that she was “shocked and disgusted” by the celebrated German director's response to a question on war-torn Gaza.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/14/1600x900/logo/Arundhati_Roy_1771030436458_1771030436628.jpg",
    "source": "Mint"
  },
  {
    "title": "Hull City 0-4 Chelsea: Hat-trick hero Neto stars in FA Cup rout",
    "desc": "Liam Rosenior enjoyed a happy return to Hull City as his Chelsea team ran riot at The MKM Stadium in the fourth round of the FA Cup.",
    "image": "https://prod-media.beinsports.com/image/1771020002409_fe015319-a671-4230-a441-7ce365b94e53.1080.jpg",
    "source": "beIN SPORTS"
  },
  {
    "title": "USA advances to Olympic semifinals with win over Italy in women's hockey",
    "desc": "The Americans are headed to the women's hockey semifinals at Milano Cortina 2026.",
    "image": "https://www.sportsnet.ca/wp-content/uploads/2026/02/CP175790455.jpg",
    "source": "Sportsnet"
  },
  {
    "title": "Stephen Gogolev caps Olympic debut with immaculate free skate",
    "desc": "Stephen Gogolev saved his best career performance for his final appearance at Milano Cortina.",
    "image": "https://olympic.ca/wp-content/uploads/2017/09/team-canada-512x512.png?w=32",
    "source": "Team Canada"
  },
  {
    "title": "Japanese Archipelago Was Once a Refuge for Cave Lions",
    "desc": "Between 73,000 and 20,000 years ago (Late Pleistocene), the Japanese Archipelago was inhabited by cave lions (Panthera spelaea), according to a new genetic and proteomic analysis of fossilized felid remains previously attributed to tigers (Panthera tigris).",
    "image": "https://cdn.sci.news/images/2026/02/image_14557f-Cave-Lions.jpg",
    "source": "Sci.News"
  },
  {
    "title": "US military kills 3 in latest attack on boat in the Caribbean",
    "desc": "At least 133 people have been killed in US attacks on vessels in the Caribbean Sea and Pacific Ocean since September.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2025/10/Screenshot-2025-10-30-at-09.31.30-1761787921.png?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Married at First Sight star Jamie Marinos: Why she’s glad it ended with Dave and where she is now",
    "desc": "It’s hard to believe it’s been a year since Jamie Marinos first lit up our screens on Married At First Sight Australia . Back then, the bubbly, “boganic”...",
    "image": "https://www.nzherald.co.nz/resizer/v2/ANANPFLLQZG6BHWGLXTBU3CMQM.jpg?auth=6b5a644b4e3ef76cb43f8bfc62e3ea95a4127612aa29fa32eadff550089fa74d&width=1200&height=675&quality=70&focal=2266%2C1922&smart=false",
    "source": "NZ Herald"
  }
]