[
  {
    "title": "Kwankwaso: In 2019, I took Abba Yusuf to s'court judges after Kano election was declared inconclusive",
    "desc": "Rabiu Kwankwaso, the national leader of the New Nigeria People’s Party (NNPP), says he has never witnessed the form of injustice meted out on him and his political movement by Abba Yusuf, governor of Kano state.",
    "image": "https://www.thecable.ng/wp-content/uploads/2025/05/Abba-Yusuf-and-Kwankwaso--e1746445273702.jpeg",
    "source": "TheCable"
  },
  {
    "title": "Think video games are bad? New research says otherwise",
    "desc": "Unlock cognitive growth through strategic gaming while balancing mental health and social development. University of Oxford research indicates that moderated play enhances decision-making and teamwork, proving video games offer valuable benefits beyond simple entertainment.",
    "image": "https://www.thedailystar.net/sites/default/files/styles/social_share/public/2026-01/pexels-vladimirsrajber-15923754.jpg",
    "source": "The Daily Star"
  },
  {
    "title": "PayPal Makes Nigeria Comeback with Paga Integration",
    "desc": "PayPal has returned to Nigeria through a partnership with Paga, reopening inbound payments after years of restrictions that reshaped the country’s fintech ecosystem.",
    "image": "https://images.unsplash.com/photo-1616077168712-fc6c788db4af?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3wxMTc3M3wwfDF8c2VhcmNofDZ8fHBheXBhbHxlbnwwfHx8fDE3Njk1Mzg4NDZ8MA&ixlib=rb-4.1.0&q=80&w=2000",
    "source": "Techloy"
  },
  {
    "title": "Why Young People Are Choosing Protest",
    "desc": "NAIROBI – In early December, Kenyan environmental activist Truphena Muthoni made history by hugging a tree for 72 hours straight. The goal was not only to raise…",
    "image": "https://cdn.countercurrents.org/2026/01/Kenya-Protest.jpg",
    "source": "Countercurrents"
  },
  {
    "title": "‘It turned out I had a brain tumour …’ Six standup comics on what spurred them to get on stage",
    "desc": "When it comes to origin stories, comedians have some of the strangest – from performing for a £5 bet to getting back at their boss to making an unlikely pact with a friend",
    "image": "https://i.guim.co.uk/img/media/8da5e02583e69414a73d4a6e5e4258e3539ff399/87_0_2500_2000/master/2500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0d6205bf756bf3d57afd86821698aca3",
    "source": "The Guardian"
  },
  {
    "title": "Tea can improve your health and longevity, but how you drink it matters",
    "desc": "Drinking tea, particularly green tea, is linked to better heart health, improved metabolism, and lower risks of chronic diseases like diabetes and cancer. It may also help protect the brain and preserve muscle strength as people age. However, processed teas—such as bottled and bubble varieties—often contain sugars and additives that may cancel out these benefits. Moderation and choosing freshly brewed tea appear key.",
    "image": "https://www.sciencedaily.com/images/1920/happy-elderly-man-tea.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "India visit ahead, Canada's Carney on Trump tariffs and trade: ‘Nothing normal in US’",
    "desc": "Mark Carney is expected to visit India in March, a move aimed at expanding bilateral trade after over two years of strained ties with New Delhi| India News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/01/28/550x309/Canada-Commons-Carney-5_1769592937386_1769592945942.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Stroke prevention and treatment during and after pregnancy are key to women’s health",
    "desc": "A new American Heart Association scientific statement emphasizes aggressive blood pressure control, early recognition of stroke symptoms and prompt treatment for pregnant and postpartum women.",
    "image": "https://iprsoftwaremedia.com/67/files/20239/6525a4793d6332305ce09937_0111PregnantWomenSocialDeterminants_SC/0111PregnantWomenSocialDeterminants_SC_hero.jpg",
    "source": "www.heart.org"
  },
  {
    "title": "Night Owls Face Increased Heart Risk",
    "desc": "Research Highlights:Middle-aged and older adults — particularly women — who are naturally more active in the evenings may have worse cardiovascular",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1460925895917-afdab827c52f%3Fixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D702%26amp%3Bq%3D80",
    "source": "Mirage News"
  },
  {
    "title": "Aki to miss Ireland's clash with France due to disciplinary issue",
    "desc": "The 35-year-old centre is not with Andy Farrell’s squad at their training camp in Portugal.",
    "image": "https://img2.thejournal.ie/article/6940397/river/?height=400&version=6940410",
    "source": "The 42"
  }
]