[
  {
    "title": "Deadly Bhubaneswar rooftop blast caught on camera, 2 die during treatment",
    "desc": "Investigators believe the explosion occurred while explosive materials were being handled on the rooftop. Gunpowder was recovered from the site, strengthening suspicions that crude bombs were being assembled there.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/cctv-shows-moment-of-deadly-bhubaneswar-rooftop-blast-in-sundarpada-160411703-16x9_0.jpg?VersionId=iuPVrWs5VzYhM3n0ZVgpfcpLvDZYrmZj",
    "source": "India Today"
  },
  {
    "title": "SENSEX recovers 400 points from day's low, NIFTY50 above 25,450; TCS, Wipro, HCL Tech gains on value buying",
    "desc": "The SENSEX recovered as much as 405 points from the day's lowest level and NIFTY50 index touched an intraday high of 25,493 after hitting a low of 25,372.",
    "image": "https://assets.upstox.com/content/assets/images/news/nifty-sensex-nse-bse-buzzing-feb-4-2026.webp",
    "source": "Upstox"
  },
  {
    "title": "Woman charged with RM465,500 CBT over vehicle permit proceeds",
    "desc": "JOHOR BARU: A woman has pleaded not guilty in the Sessions Court here to five counts of criminal breach of trust (CBT) involving RM465,500 belonging to a car dealership.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/16/3772764.jpg",
    "source": "The Star"
  },
  {
    "title": "OPTEL and Techno Service Forge Partnership to Deliver Pharmaceutical Track",
    "desc": "/PRNewswire/ - OPTEL, a global leader in track-and-trace solutions, and Techno Service, Egypt's premier industrial systems expert, today announced an exclusive...",
    "image": "https://mma.prnewswire.com/media/2903824/Optel_Group_OPTEL_and_Techno_Service_Forge_Partnership_to_Delive.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "Shotgun seized amid ongoing Onehunga shooting investigation",
    "desc": "\"At this stage we are unable to confirm this firearm was involved in the original offending,\" Detective Senior Sergeant Matt Bunce said.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/police-seized-a-shotgun-during-a-search-of-a-mangere-propert-EAVEWZCTGZETJNG5BZ2YFS4DBY.png?auth=752ad88403be699ade3ff3c0d77fcdde493c171fa19921b627e755b62667a890&quality=70&width=600&height=315&focal=1522%2C584",
    "source": "1News"
  },
  {
    "title": "Woman throws straws at LiHo staff over alleged ice request in Hougang Mall; police report made",
    "desc": "A customer at a bubble tea outlet was seen throwing straws at a LiHo staff member after allegedly being denied a request for less ice on Monday (Feb 9).In a video shared on TikTok on Feb 14, a woman is seen standing at the counter of a LiHo store and throwing several straws, before escalating the incident by hurling an...",
    "image": "https://media.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/Liho-Hougang-Straw-Throwing.png?itok=2uhR2AnH",
    "source": "AsiaOne"
  },
  {
    "title": "Brooklyn Beckham cruelly mocked over 'weird' Valentine's Day post for wife Nicola Peltz",
    "desc": "Brooklyn Beckham posted a romantic Valentine's Day tribute to wife Nicola Peltz on Instagram, but the sweet gesture was met with criticism from fans who branded it 'weird' and questioned their privacy claims",
    "image": "https://i2-prod.mirror.co.uk/article36727112.ece/ALTERNATES/s1200/3_Premiere-Of-Lola-Arrivals.jpg",
    "source": "The Mirror"
  },
  {
    "title": "GameSir to launch GameHub for macOS, bringing Windows and Steam PC games to Mac",
    "desc": "GameSir has confirmed that its GameHub software is coming to macOS, expanding its PC game emulation capabilities beyond Android. Originally...",
    "image": "https://www.yugatech.com/wp-content/uploads/2026/02/HBLxKKaakAQU5d5.jpg",
    "source": "YugaTech"
  },
  {
    "title": "Beyond Rs 6 lakh crore selloff: How TCS, Infosys, other IT giants are reinventing to outlast AI disruption fears",
    "desc": "Indian IT giants are actively reinventing their strategies to counter fears of AI-driven disruption, which has led to a significant market value sell-off. Companies are embedding AI into transformation programs, focusing on outcome-led growth, and leveraging internal AI tools to maintain margins and deliver value to clients.",
    "image": "https://img.etimg.com/thumb/msid-128405924,width-1200,height-630,imgsize-2680961,overlay-etmarkets/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "State of the URC: High-flying Sharks hunt Lions",
    "desc": "A full Vodacom URC round takes place next weekend, but first the Lions host the Sharks in a rescheduled clash in Joburg on Saturday.",
    "image": "https://www.sarugbymag.co.za/wp-content/uploads/2026/02/Aphelele-Fassi-Angelo-Davids-3-January-2026-Steve-Haag-Gallo-Images-e1771141509353.jpg",
    "source": "SA Rugby magazine"
  }
]