[
  {
    "title": "Queensland real estate agents prepare for Anzac Day trading shutdown",
    "desc": "With Anzac Day falling on a Saturday this year, trading restrictions mean open houses and auctions will need to be rescheduled.",
    "image": "https://live-production.wcms.abc-cdn.net.au/711238393be8e275591d516ee5cb67c2?impolicy=wcms_watermark_news&cropH=2268&cropW=4032&xPos=0&yPos=334&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Not for those who abuse PM Modi: Ex-BJP MP refuses blankets to Muslims",
    "desc": "Ex-BJP MP Sukhbir Singh Jaunapuria also expressed displeasure towards his supporters for gathering people from the Muslim community for a charitable drive. When a villager objected to the BJP leader's behaviour, the latter asserted that the drive was not part of a government initiative and was sponsored by him in his personal capacity.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/ssjaunapuria-224220110-16x9_0.png?VersionId=VXXnrLReMCQHoKayxP_zF2QEEA9EZTW0",
    "source": "India Today"
  },
  {
    "title": "Cbf Demands “Exemplary Punishment” for Prestianni Following Vinícius Incident",
    "desc": "Exemplary punishment on the way? The CBF refuses to stand by, demanding a deep-dive investigation from FIFA and UEFA following the alleged racial slurs by Prestianni against Vinícius Jr. in Lisbon. Brazilian football is calling for a definitive turning point.",
    "image": "https://prod-media.beinsports.com/image/1771769343433_01327a95-d697-4450-86ba-eaf28580df71.1080.png",
    "source": "beIN SPORTS"
  },
  {
    "title": "Alan Cumming Apologizes At BAFTA Film Awards For Tourette’s Swearing",
    "desc": "Alan Cumming briefly halted the BAFTA Film Awards to thank the audience for their understanding amid interruptions from nominee with Tourette’s.",
    "image": "https://deadline.com/wp-content/uploads/2026/02/GettyImages-2262879520-e1771788118950.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Swimmer Strikes Again: 900-year-old Crusader Sword Found Off Israel's Coast",
    "desc": "The Amateur Swimmer Found the Sword on the Seabed Off a Northern Israeli Beach. Tests on the Sword Found That It Likely Belonged to a 12th-century Crusader Warrior Who Brought It From Europe",
    "image": "https://img.haarets.co.il/bs/0000019c-85cc-dc2c-a9bf-a7dd59f30000/1f/c7/a1631d624a49a224a5691d607a19/969551.jpg?precrop=2400,1395,x0,y0&width=1200&height=630&cmsprod",
    "source": "Haaretz"
  },
  {
    "title": "Indian movie ‘Boong’ bags BAFTA award for Best Children’s & Family Film",
    "desc": "Indian film ‘Boong’ wins BAFTA for Best Children’s & Family Film, directed by Lakshmipriya Devi and backed by Farhan Akhtar.",
    "image": "https://th-i.thgim.com/public/news/national/h4zm4g/article70664596.ece/alternates/LANDSCAPE_1200/ead9f1ae-e7c9-43bd-9ba3-83e64ee0a90f.jpg",
    "source": "The Hindu"
  },
  {
    "title": "The New African Scramble: Contracts, Not Colonies",
    "desc": "Africa critical minerals drive a new scramble via supply chain contracts, not colonialism, as nations seek cobalt, lithium, and platinum leverage.",
    "image": "https://rareearthexchanges.com/wp-admin/admin-ajax.php?action=rank_math_overlay_thumb&id=91546&type=rare-earth-exchanges&hash=c1e7ef1d5c50a027b0548b119353bbed",
    "source": "Rare Earth Exchanges"
  },
  {
    "title": "Arsenal answer title pressure with resounding derby win at Spurs",
    "desc": "Despite the growing pressure in the title race, Mikel Arteta's team responded with character to claim a 4-1 victory over their local rivals and deliver a message to their critics.",
    "image": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0222%2Fr1618654_1296x729_16%2D9.jpg",
    "source": "ESPN Singapore"
  },
  {
    "title": "Winter Olympics 2026: Sidney Crosby reflects on \"tough\" decision to sit out Olympic final after loss to USA",
    "desc": "The two-time Olympic champion recounted following the Canada-USA final from a training room in the arena and the thought process behind deciding to sit out what is likely to be his career's last Olympic match.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/hgeul0vvodokaivrikhx",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "With gold medal around his neck, Canadian skip Jacobs has a message for the haters",
    "desc": "Canada's Brad Jacobs addresses social media backlash against teammate Marc Kennedy during a press conference following their gold medal win in men's curling.",
    "image": "https://i.cbc.ca/ais/85ecb579-c944-44b6-b3f3-1c9ea5bbb2fa,1771786826231/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C61%2C4115%2C2314%29%3BResize%3D620",
    "source": "CBC"
  }
]