[
  {
    "title": "Israel’s Netanyahu says a Palestinian state in Gaza ‘will not happen’",
    "desc": "JERUSALEM: Israeli Prime Minister Benjamin Netanyahu vowed Tuesday that he would not allow the establishment of a Palestinian state in the Gaza Strip, asserting that Israel would maintain security control “from Jordan to the sea.” “I’m hearing that I will allow the establishment of a Palestinian state in Gaza — this hasn’t happened and it will not happen... I think you all",
    "image": "https://www.arabnews.pk/sites/default/files/styles/660x371_watermarkpakistan/public/main-image/2026/01/27/4679535-1247217313.png?itok=RsN9QQeK",
    "source": "Arab News PK"
  },
  {
    "title": "Pound nears five-year high against the dollar",
    "desc": "Traders continued to sell the dollar since President Trump threatened fresh tariffs on western allies over Greenland",
    "image": "https://www.thetimes.com/imageserver/image/%2F114642b7-6792-4a11-922f-0e955bacd96a.jpg?crop=4000%2C2250%2C0%2C51&resize=1200",
    "source": "The Times"
  },
  {
    "title": "Tapping the engines of cellular electrochemistry and forces of evolution",
    "desc": "In a paper published recently in Nature Materials, a team of researchers from WashU demonstrate how these constantly shifting clumps of protein material can generate electricity, delivering a new framework for engineering biomaterials that could power bioelectrochemical devices. Such devices could be used in a range of ways, from fighting infection to cleaning up pollutants.",
    "image": "https://www.newswise.com/android-icon-192x192.png",
    "source": "Newswise"
  },
  {
    "title": "Lego unveils 5 more Star Wars Smart Play sets: Price and preorder details",
    "desc": "Lego has unveiled five new Star Wars Smart Play compatible sets. They're now available for preorder starting at $40.",
    "image": "https://helios-i.mashable.com/imagery/articles/019YpeXPJtpU7twHklbVN6e/hero-image.fill.size_1200x675.v1769541629.jpg",
    "source": "Mashable"
  },
  {
    "title": "Claire Danes Recalls 'Meltdown' After Learning She Was Pregnant with Baby No. 3, Says She Called OBGYN in 'Convulsive Tears'",
    "desc": "The actress and her actor husband Hugh Dancy share three children together",
    "image": "https://s.yimg.com/ny/api/res/1.2/ji4oJVolIykQlPDrcS0Jhw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/people_218/06485a4ed47cabb0c4b28d1a4a58d420",
    "source": "Yahoo News UK"
  },
  {
    "title": "Washington Post staffers beg owner Jeff Bezos to spare their jobs amid plans to slash HUNDREDS of paper's staff... as his glam wife Lauren Sanchez flaunts couture outfits at Paris Fashion Week",
    "desc": "Up to 300 Post staffers are set to be affected by job cuts as CEO Will Lewis transforms the paper and reverse millons of dollars in losses each year, Puck reported.",
    "image": "https://i.dailymail.co.uk/1s/2026/01/27/18/105873111-0-Amazon_CEO_Jeff_Bezos_and_wife_Lauren_S_nchez_at_were_at_the_Chr-a-20_1769539717341.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Marcello Hernández Shuts Down Sabrina Carpenter Dating Talk",
    "desc": "On ‘Armchair Expert,’ host Dax Shepard asks Marcello Hernández about his relationship with Sabrina Carpenter, to which Hernández has a pretty blunt answer.",
    "image": "https://pyxis.nymag.com/v1/imgs/1e9/be6/9abd8367249e35583e22cd9c233ce1476e-Sabrina-Carpenter-Marcello-Hernandez.1x.rsocial.w1200.jpg",
    "source": "Vulture"
  },
  {
    "title": "Government pushes ahead with steps to scrap the Triple Lock",
    "desc": "Cabinet discussed the Defence Amendment Bill today.",
    "image": "https://img2.thejournal.ie/article/6940102/river/?height=400&version=6940129",
    "source": "The Journal"
  },
  {
    "title": "Bob Geldof reveals he's haunted by way he told his children their mum Paula Yates had died after fatal heroin overdose",
    "desc": "BOB Geldof has revealed he's haunted by the memory of telling his children their mother had died of a fatal overdose.\nThe Boomtown Rats...",
    "image": "https://www.thesun.co.uk/wp-content/uploads/2026/01/newspress-collage-dcgr5trzu-1769540766163.jpg?quality=90&strip=all&1769540792&w=1920&h=1080&crop=1",
    "source": "The Sun"
  },
  {
    "title": "Philip Glass Withdraws From Kennedy Center, as Its Symphony Vows to Play On",
    "desc": "Amid cancellations and turmoil, the National Symphony Orchestra is planning to stay. “I cannot make everybody happy,” its conductor said.",
    "image": "https://static01.nyt.com/images/2026/01/28/multimedia/27cul-kennedy-noseda-pktq/27cul-kennedy-noseda-pktq-facebookJumbo.jpg",
    "source": "The New York Times"
  }
]