[
  {
    "title": "Trump to exclude Democratic governors from usually bipartisan meeting at the White House",
    "desc": "President Trump is hosting an annual meeting with governors at the White House, but he will not invite any Democrats, only Republicans, breaking tradition.",
    "image": "https://i.abcnewsfe.com/a/a1a09750-3f6e-49da-9b6f-11668fdb0471/trump-ap-jef-260209_1770645519136_hpMain_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Drinking 2-3 cups of coffee a day tied to lower dementia risk",
    "desc": "Caffeinated tea also found to slow cognitive decline in study.",
    "image": "https://news.harvard.edu/wp-content/uploads/2024/01/cropped-favicon.png?resize=32%2C32",
    "source": "Harvard Gazette"
  },
  {
    "title": "First national plan to address violence against Indigenous women and children",
    "desc": "The first standalone national plan to tackle domestic violence against First Nations women and children was \"hard fought for by Aboriginal women\", an advocate says.",
    "image": "https://live-production.wcms.abc-cdn.net.au/4d7b4a745a99cf315998d6eadb50d47d?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=281&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Gabriel Martinelli shares how Arsenal players really feel about Viktor Gyokeres behind the scenes",
    "desc": "Gabriel Martinelli has revealed that 'everyone' at Arsenal really loves Viktor Gyokeres and is trying to give him the tools to succeed.",
    "image": "https://cdn1.arsenalinsider.com/uploads/19/2026/02/GettyImages-2242447760-scaled.jpg",
    "source": "Arsenal Insider"
  },
  {
    "title": "Physical pressure on the brain triggers neurons’ self-destruction programming",
    "desc": "An interdisciplinary team of researchers from the University of Notre Dame is investigating the mechanisms of neuron death caused by chronic compression — such as the pressure exerted by a brain tumor — to better understand how to prevent neuron loss.",
    "image": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2026/02/09/698a3a9868d9e_MLC1.9.26PatzkeLab011.jpg",
    "source": "Newswise"
  },
  {
    "title": "Olympic town warms as climate change puts Winter Games on thin ice",
    "desc": "The International Olympic Committee said last week it could move up the start date for future Winter Games to January from February because of rising temperatures.",
    "image": "https://d3i6fh83elv35t.cloudfront.net/static/2026/02/2026-02-07T120413Z_1158434107_UP1EM270UMS28_RTRMADP_3_OLYMPICS-2026-ALPINE-1024x686.jpg",
    "source": "PBS"
  },
  {
    "title": "Brazil: Scientists find heavy metals in food grown on soil from the Rio Doce estuary, an area affected by the Samarco dam collapse in 2015",
    "desc": "Check out this page via the Business and Human Rights Centre",
    "image": "https://media.business-humanrights.org/media/images/Mariana_Minas_Gerais_38732421445.2e16d0ba.fill-1200x630.jpg",
    "source": "Business and Human Rights Centre"
  },
  {
    "title": "Shafi Jan slams CM Punjab for ‘anti PTI’ comments",
    "desc": "DLP Report PESHAWAR Special Assistant to the Chief Minister of Khyber Pakhtunkhwa for Information and Public Relations Shafi Jan has strongly reacted to recent remarks made by Punjab Chief Minister Maryam Nawaz against the Pakistan Tehreek-e-Insaf (PTI). In a statement issued here on Monday, Shafi Jan dismissed Maryam Nawaz’s comments as part of an ongoing […]",
    "image": "https://leadpakistan.com.pk/news/wp-content/uploads/2025/12/Shafi-Jan.jpg",
    "source": "Daily Lead Pakistan"
  },
  {
    "title": "Weekly review of raw material market (January 17th-January",
    "desc": "Press release - ABNewswire - Weekly review of raw material market (January 17th-January 23rd) - published on openPR.com",
    "image": "https://cdn.open-pr.com/2/0/209683167_g.jpg",
    "source": "openPR.com"
  },
  {
    "title": "Decoding the nods to Latino culture in Bad Bunny’s Super Bowl performance",
    "desc": "From sugar cane fields to sparking electricity poles to a message of unity in small white writing, here are some of the messages in the Puerto Rican superstar’s performance you might have missed.",
    "image": "https://i.cbc.ca/ais/b63c2312-1d2d-42f5-a1df-a8bf35f8418c,1770648706080/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C900%2C8640%2C4860%29%3BResize%3D620",
    "source": "CBC"
  }
]