[
  {
    "title": "Ministry calls for increased public participation during National Sanitation Day exercise",
    "desc": "As part of efforts to sustain Ghana’s clean environment agenda, the Ministry of Local Government, Chieftaincy and Religious Affairs, on Saturday, February7, 2026, monitored sanitation activities across selected Municipal Assemblies during the...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/236/23652298.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "29 bus, PUV terminals flagged for safety violations",
    "desc": "MANILA, Philippines—The Land Transportation Franchising and Regulatory Board (LTFRB) has issued show cause orders (SCOs) and notices to comply to 29 operators of bus and public utility vehicle (PUV) terminals for failing to meet passenger safety and comfort standards.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/08/929288.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "‘Not talking to you b****, f*** you’: Coach’s wild blow-up in potential GF preview — NBL Wrap",
    "desc": "‘Not talking to you b****, f*** you’: Coach’s wild blow-up in potential GF preview — NBL Wrap",
    "image": "https://content.api.news/v3/images/bin/0eb66f49f1a1fe97d9a530d1826ad1ee",
    "source": "foxsports.com.au"
  },
  {
    "title": "Parts of Quezon, Bicol flooded due to rains from shear line",
    "desc": "Some areas in Quezon Province and the Bicol Region got flooded on Sunday due to heavy rains from a shear line.",
    "image": "https://images.gmanews.tv/webpics/2026/02/floodedareas_2026_02_08_09_27_31.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Canino downs Ordizo, seizes share of lead in National Women's Chess Championship",
    "desc": "Ruelle Canino downed Kate Ordizo to catch up on Woman Grandmaster Janelle Mae Frayna at the helm after 10 rounds of the Philippine National Women’s Chess...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/08/77691.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Falcons rookie James Pearce Jr. arrested on battery charges after alleged police chase",
    "desc": "Pearce recently appeared in San Francisco on Thursday to attend the pre-Super Bowl NFL Honors.",
    "image": "https://static01.nyt.com/athletic/uploads/wp/2026/02/07214845/GettyImages-2260155042-scaled.jpg?width=1200&height=630&fit=cover",
    "source": "The New York Times"
  },
  {
    "title": "James Harden makes mark in Cavs’ debut, helping Cleveland rally from behind in 132-126 win",
    "desc": "Harden and the Cavs rallied in the fourth quarter to escape with a 132-126 win over the crumbling Sacramento Kings on Saturday night.",
    "image": "https://www.cleveland.com/resizer/v2/GMZHLUVVH5BQJJ3HCH5L2N2MAM.jpg?auth=1fa69b4861bcaf26f3b9f1eeaee8c7b9d0996b9b43ca63f3330b0d6d0a3f5209&width=1280&smart=true&quality=90",
    "source": "Cleveland.com"
  },
  {
    "title": "Wall Street founder accuses 26-years-younger wife of affair in $100M divorce",
    "desc": "Wall Street honcho Jeffrey Leeds has accused his much-younger wife of carrying out an affair and squandering his fortune amid an ugly divorce battle.",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/08/550x309/jeff_leeds_1770529165925_1770529175476.png",
    "source": "Hindustan Times"
  },
  {
    "title": "Sixers Continue to Show Good Signs in Win Over Suns",
    "desc": "Joel Embiid extended his streak of games with at least 25 points to 10. Tyrese Maxey flirted with a triple-double. The Sixers won their third of four games on this west coast trip, splitting the season series against the Phoenix Suns.",
    "image": "https://images2.minutemediacdn.com/image/upload/c_crop,x_0,y_162,w_3454,h_1942/c_fill,w_1440,ar_1440:810,f_auto,q_auto,g_auto/images/ImagnImages/mmsport/all_76ers/01kgxw0q4rxg6ncv5cxv.jpg",
    "source": "Sports Illustrated"
  },
  {
    "title": "India, Malaysia renew pledges to boost trade, collaboration",
    "desc": "KUALA LUMPUR: India’s Prime Minister Narendra Modi and his Malaysian counterpart Anwar ​Ibrahim renewed pledges on Sunday to bolster trade and explore potential collaborations in semiconductors, defense and other fields. Modi is on a two-day visit to the Southeast Asian nation, his first since ‌the two ‌countries elevated ties ‌to ⁠a comprehensive ​strategic ‌partnership in",
    "image": "https://www.arabnews.pk/sites/default/files/styles/660x371_watermarkpakistan/public/main-image/2026/02/08/4682898-446584443.jpg?itok=GcVn1kHX",
    "source": "Arab News PK"
  }
]