[
  {
    "title": "New engine uses the freezing cold of space to generate power at night",
    "desc": "Engineers at UC Davis have built a remarkable device that creates power at night by tapping into something we rarely think about: the vast cold of outer space. Using a special type of Stirling engine, the system links the warmth of the ground to the freezing depths above us, generating mechanical energy simply from the natural temperature difference after sunset.",
    "image": "https://www.sciencedaily.com/images/1920/jeremy-munday-experimental-engine.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Free nursing course opens in Lodwar for Turkana residents, refugees",
    "desc": "KMTC, UNHCR partner to offer free nursing training",
    "image": "https://cdn.radioafrica.digital/image/2026/02/7623bac5-7e2a-4fde-9e12-6a88a5f11445.jpeg?1772187291363",
    "source": "the-star.co.ke"
  },
  {
    "title": "Ghosts feature film begins filming next month",
    "desc": "The Wait is Over… Ghosts: The Possession of Button House is coming to the big screen",
    "image": "https://ichef.bbci.co.uk/images/ic/1920x1080/p0fd110f.jpg",
    "source": "BBC"
  },
  {
    "title": "First glimpse of comet 3I/ATLAS from Juice science camera",
    "desc": "First glimpse of comet 3I/ATLAS from Juice science camera",
    "image": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2026/02/first_glimpse_of_comet_3i_atlas_from_juice_science_camera/27129229-1-eng-GB/First_glimpse_of_comet_3I_ATLAS_from_Juice_science_camera_pillars.jpg",
    "source": "European Space Agency"
  },
  {
    "title": "OCHA Funds Bring Clean Water to Displaced Communities in North Darfur",
    "desc": "In Daba Naira camp, Tawila, North Darfur, displaced communities have long struggled with limited access to clean water and sanitation. Two years after arriving, 47-year-old Ali Adam Mohammed leveraged his experience in water systems to lead the camp’s Water User Committee, coordinating repairs, overseeing maintenance, and promoting safe water and hygiene practices. Supported by the",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Dyson settles forced labour suit in landmark UK case",
    "desc": "Migrant workers alleged they were subjected to abusive treatment in a Malaysian factory for Dyson.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4853/live/3c2f46f0-13ac-11f1-a94f-8d618bc8415b.jpg",
    "source": "BBC"
  },
  {
    "title": "Alan Wake Remastered gets new patch to unlock up to 240 FPS gameplay, and much more, but only on one platform",
    "desc": "Alan Wake Remastered has recieved a new big update, which brings performance upgrades, visual improvements, and more.",
    "image": "https://www.pcguide.com/wp-content/uploads/2026/02/Alan-Wake-Remastered-gets-new-patch.jpg",
    "source": "PC Guide"
  },
  {
    "title": "US updates travel advisory to Israel, recommends departure",
    "desc": "According to an official statement by the US State Department, US citizens are advised against traveling to Israel.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/708292",
    "source": "The Jerusalem Post"
  },
  {
    "title": "How will March's sudden stratospheric warming affect our weather?",
    "desc": "A sudden stratospheric warming is when rapid warming occurs in the stratosphere, which can have a massive impact on our weather",
    "image": "https://www.rte.ie/images/0023e885-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Deloitte West Africa appoints Yomi Olugbenro as CEO",
    "desc": "His appointment takes effect from 1st June 2026. This will come after a transition period with the current CEO, Fatai Folarin, who retires at the end of May 2026.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Yomi-Olugbenro-headshot--862x1024.jpg",
    "source": "MyJoyOnline"
  }
]