[
  {
    "title": "Kaif takes Shoaib Akhtar to the cleaners, refuses to let him undermine India’s dominance: 'Had Pakistan won...'",
    "desc": "Mohammed Kaif voiced his disappointment regarding how Pakistan's lack of quality dominated the narrative around the India-Pakistan match. | Cricket",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/16/550x309/PTI02-15-2026-000915A-0_1771234889216_1771235037718.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Kyrie Irving wears PRESS shirt for Gaza journalists at NBA All-Star Game",
    "desc": "Basketball star honours media workers, nearly 300 of whom have been killed in Israeli attacks since October 2023.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/AFP__20260216__2261847694__v3__HighRes__75thNbaAllStarGame-1771228646.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Singapore presents holistic approach to stroke recovery aims to fast",
    "desc": "By integrating evidence-based rehabilitation, cognitive screening, and coordinated care pathways, NUHS aims to build a resilient stroke care ecosystem that helps survivors not only recover but also reintegrate into society meaningfully.",
    "image": "https://www.biospectrumasia.com/uploads/articles/nuh_holistic_approach_to_stroke_recovery_group_photo_credit_nuh_-27206.jpg",
    "source": "BioSpectrum Asia"
  },
  {
    "title": "First Impressions: Akatori Demo",
    "desc": "Akatori’s demo shows stunning pixel art and inventive Metroidvania mechanics, but combat responsiveness needs polish before launch.",
    "image": "https://www.nag.co.za/wp-content/uploads/2026/02/demo-07.jpg",
    "source": "nag.co.za"
  },
  {
    "title": "Meghan Markle friends extend support to Savannah Guthrie",
    "desc": "Savannah Guthrie has received a massive support from Meghan Markle’s friends as the US TV host issued fresh plea for the release of her mother Nancy.Savannah took to Instagram and shared a...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-16/1392470_024846_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "New Global Alliance Boosts Childhood Cancer Drug Availability Worldwide",
    "desc": "On International Childhood Cancer Day 2026, PAHO highlighted significant progress in childhood cancer care across the Americas, emphasizing improvements in early diagnosis, access to life-saving medicines, and regional cooperation. These advances, achieved through collaboration with national Ministries of Health and partners such as St. Jude Children’s Research Hospital, have strengthened care systems, improved patient outcomes,",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs"
  },
  {
    "title": "Global Partnership Boosts Availability of Childhood Cancer Drugs and Technical Support",
    "desc": "On International Childhood Cancer Day 2026, PAHO highlighted significant progress in childhood cancer care across the Americas, emphasizing improvements in early diagnosis, access to life-saving medicines, and regional cooperation. These advances, achieved through collaboration with national Ministries of Health and partners such as St. Jude Children’s Research Hospital, have strengthened care systems, improved patient outcomes,",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs"
  },
  {
    "title": "Troy Parrott on becoming Republic of Ireland’s hero and Mourinho’s impact",
    "desc": "After instilling belief in pursuit of World Cup 2026 qualification, Parrott tells Miguel Delaney about his newfound stardom, how he transformed his game and aspirations for the future",
    "image": "https://static.independent.co.uk/2025/11/16/16/f664cf0048ac3731ffc8e84e5f7dd4f5Y29udGVudHNlYXJjaGFwaSwxNzYzMzk2NjEz-2.82404821.jpg?width=1200&height=800&crop=1200:800",
    "source": "The Independent"
  },
  {
    "title": "An Islamist party becomes Bangladesh's main opposition for the first time",
    "desc": "An Islamist party has become Bangladesh's main opposition for the first time in the country's history, challenging the old dynastic political system despite persistent concerns among critics about the party's policies on women.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5842x3286+0+36/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff6%2Fb1%2F7908fb6343fea94eaf24e6881654%2Fgettyimages-2259937510.jpg",
    "source": "NPR"
  },
  {
    "title": "Anthropic India revenue run rate doubled since October; Enterprises key to last-mile AI integration, says Irina Ghose",
    "desc": "When asked about the recent sell-off in the Indian IT stocks due to Claude Cowork, Ghose told Moneycontrol the intent is to",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260216074711_irina-ghose.png",
    "source": "Moneycontrol"
  }
]