[
  {
    "title": "Trump Files Final Plans for White House Ballroom",
    "desc": "The president is seeking quick approval despite legal challenges and backlash over his demolition of the East Wing.",
    "image": "https://static01.nyt.com/images/2026/02/13/multimedia/13trump-news-ballroom-vcft/13trump-news-ballroom-vcft-facebookJumbo-v2.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Fiala taken from ice on stretcher during Switzerland loss",
    "desc": "Forward out for rest of Olympics with lower-body injury he sustained on hit by Wilson of Canada",
    "image": "https://media.d3.nhle.com/image/private/t_ratio16_9-size50/v1771022640/prd/ah7mvb8srhhtcjjsfib6.jpg",
    "source": "NHL.com"
  },
  {
    "title": "\"We were all scared,\" says child who ran as ICE operation unfolded near New Jersey school bus stop",
    "desc": "Dylan, who is a U.S. citizen, told CBS News the day seemed normal — until he heard his classmates suddenly start shouting \"ICE.\"",
    "image": "https://assets2.cbsnewsstatic.com/hub/i/r/2026/02/14/778f813e-9ae7-4dd2-b6d2-a017f6aed4bc/thumbnail/1200x630/b4f059c0eb7d761b11434fe67b9c18d1/cbsn-fusion-elementary-schoolers-flee-as-ice-agents-descend-on-bus-stop-in-new-jersey-thumbnail.jpg",
    "source": "CBS News"
  },
  {
    "title": "England Legend Michael Owen Gives Harry Kane Advice Ahead of 2026 World Cup",
    "desc": "Michael Owen has delivered tactical advice to Harry Kane and England manager Thomas Tuchel.",
    "image": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2026/02/1408/814/c004b7be-kane1.jpg?ve=1&tl=1",
    "source": "FOX Sports"
  },
  {
    "title": "Daniel Radcliffe Says 'Heated Wizardy' Spoof Was 'Funny and Sweet'",
    "desc": "Daniel Radcliffe confirmed he's seen SNL's Harry Potter, Heated Rivalry spoof, and called the sketch 'very funny and sweet.'",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2026/02/Heated-Wizardry-GettyNBC-H-2026.jpg?w=1296&h=730&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "JI, JUI-F urge govt to reject Trump's board",
    "desc": "He also stated that it is unacceptable for Pakistan to become part of ISF proposed to formed under Trump's Gaza plan",
    "image": "https://i.tribune.com.pk/media/images/fire-21770574035-0/fire-21770574035-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "League of Legends Riftbound: Spiritforged Expansion - First Hands-On Impressions of the New TCG Set",
    "desc": "Might makes right.",
    "image": "https://sm.ign.com/t/ign_ap/preview/l/league-of-/league-of-legends-riftbound-spiritforged-expansion-first-han_uhgf.1200.jpg",
    "source": "IGN Southeast Asia"
  },
  {
    "title": "Diversity and Distribution of Fish Species in the Upper Loémé Basin in Mayombe (Republic of Congo, Central Africa)",
    "desc": "This study was initiated to document fish species richness and distribution in the upper reaches of the Loémé basin. Carried out between February 2020 and September 2021, sampling targeted eight stations using a standardized gillnetting approach and collected 1356 specimens distributed across 24 species, 18 genera, 9 families, and 5 orders, with the Cyprinidae family (8 species) being the most represented. Species diversity through diversity indices was found to be low, with an unequal distribution of species (H' = 1.54; D' = 0.47; J' = 0.46) at the Bidounzi in Tsessi (TSBI) station where only two species, Enteromius camptacanthus and E. martorelli, dominate; and average in the remaining stations where species are equally distributed (H' > 2; D' J' > 0.5). The Loufouyou gorges constitute a geographic barrier to species dispersal. Brachyalestes kingsleyae, Bryconalestes longipinnis, Chrysichthys auratus, Hemichromis elongatus, Hepsetus lineata and Marcusenius moorii were only sampled in Loémé station in Bilinga (BILO) and Bilinga station downstream from the bridge (BAPO), two stations located downstream of the gorges. This study provides basic knowledge on both species diversity of the upper course of the Loémé basin and the influence of the Loufouyou gorges on their distribution. It also opens up perspectives for future studies of the ichthyological fauna of the latter.",
    "image": "https://file.scirp.org/image/nr2024061415541219.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Backstage at Kallmeyer Fall 2026 Ready-to-Wear Collection",
    "desc": "Backstage at the Kallmeyer Fall 2026 ready-to-wear show at New York Fashion Week, February 2025.",
    "image": "https://wwd.com/wp-content/uploads/2026/02/kallmeyer-backstage-s26-gg001.jpg?w=1000&h=563&crop=1",
    "source": "WWD"
  },
  {
    "title": "Indian writer Arundhati Roy's cult classic college film returns to spotlight",
    "desc": "Nearly 40 years on, the Booker prize-winning writer's debut campus satire is set to be screened in Berlin.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f2be/live/27cc86c0-08c9-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  }
]