[
  {
    "title": "'35 million would have died if...': Trump's new claim on India-Pakistan conflict",
    "desc": "US President Donald Trump further asserted that the situation could have spiralled into a nuclear war.| India News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/25/550x309/world_leaders_on_diwali_1761016007705_1761016022636_1771990903164.png",
    "source": "Hindustan Times"
  },
  {
    "title": "Global smartwatch shipments rebound in 2025, Apple posts robust growth",
    "desc": "New Delhi, Feb 25 (IANS) Global smartwatch shipments grew 4 per cent (year-on-year) in 2025, recovering from a decline in 2024, according to a new report on Wednesday.",
    "image": "https://d2lnbwhcsmj8tp.cloudfront.net/ianslive_watermark/fb65675b642365bb19e3b75567dc4eeb.jpg",
    "source": "IANS LIVE"
  },
  {
    "title": "Two new cases, more exposure sites confirmed in NSW",
    "desc": "Sydney's current measles outbreak is continuing to grow after two more cases of the disease were confirmed ...",
    "image": "https://imageresizer.static9.net.au/sTuTnA0FnJ4XBxrHvzT307-FQU4=/0x0:2307x1298/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F203bb502-3e3e-4e71-9e29-5d572f319574",
    "source": "9News.com.au"
  },
  {
    "title": "Semiconductor veterans back AI targeting physical design, a key constraint for fabless ecosystems",
    "desc": "Founded by IIT Madras alumnus Bragadeesh, Tattvam AI is building an AI abstraction layer over EDA tools from Cadence and Synopsys to shorten multi-year chip design cycles.",
    "image": "https://www.crnasia.com/india/news/2026/media_1bac027a337d77cd8c15431b0c01634cf0df956fc.png?width=1200&format=pjpg&optimize=medium",
    "source": "CRN Asia"
  },
  {
    "title": "Aaya Sher from The Paradise: Makers’ Decision Leaves Nani Fans Disappointed",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/02/The-Paradise-3.webp",
    "source": "123telugu.com"
  },
  {
    "title": "Donald Trump to address United States citizens in address",
    "desc": "The US President will deliver the 2026 State of the Union address at 1pm AEDT. Follow along to our live blog for updates.",
    "image": "https://static.ffx.io/images/$zoom_0.1571%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_42/t_crop_custom/q_86%2Cf_auto/0b0e1bcae03dc6917a748ecaf3396b16eed2b520",
    "source": "The Age"
  },
  {
    "title": "Ruto engages IFC on plan to mobilise Sh5 trillion for National Infrastructure Fund",
    "desc": "Ruto noted that the IFC’s technical expertise will be critical in building a strong and credible financing vehicle",
    "image": "https://cdn.radioafrica.digital/image/2026/02/944c9ccb-f175-4a7e-b06b-3631655aad65.jpg?1771994963309",
    "source": "the-star.co.ke"
  },
  {
    "title": "Central Otago grass fire threatens homes as crews battle blaze",
    "desc": "People have been evacuated because of a grass fire in Central Otago that is being attended by 13 crews and four helicopters. A police spokesperson said they...",
    "image": "https://www.nzherald.co.nz/resizer/v2/HPYFTOKFGVAMDAJUGI2PS2OWGI.jpg?auth=d9b27838c956a470625ac5f2252030c90a718b6261d1be5fdf886c13f9c7335d&width=1200&height=675&quality=70&focal=657%2C943&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Kuching High Court rules Petronas’ RM7.95 mln bank guarantee demand on Petros valid (Video)",
    "desc": "KUCHING (Feb 25): The High Court here has ruled that Petroliam Nasional Berhad’s (Petronas) demand for a bank guarantee of RM7.95 million from Petroleum Sarawak Berhad (Petros) was valid. Judge Datuk Farids Gohim Abdullah held that Petros had failed to prove that the call on the bank guarantee was either unconscionable or unlawful. On constitutionalRead More",
    "image": "https://www.theborneopost.com/newsimages/2021/04/Kuching-Court-Complex.jpeg",
    "source": "Borneo Post"
  },
  {
    "title": "Trump sets record for longest State of the Union speech",
    "desc": "US President Donald Trump delivered the longest-ever State of the Union address, beating former president Bill Clinton's record of one hour and 20 minutes.",
    "image": "https://www.rte.ie/images/0023f4bd-1600.jpg",
    "source": "RTE.ie"
  }
]