[
  {
    "title": "2 Monster Stocks to Hold for the Next 5 Years",
    "desc": "Nvidia and Broadcom are two monster stocks to own for the long term.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F854800%2Fgettyimages-1492319884.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Harry Kane Surpassed Cristiano Ronaldo in This Scoring Milestone",
    "desc": "In an era shaped by legendary goal scorers, Harry Kane continues to carve out his own place in football history. The Bayern Munich forward reached 500 official career goals, a milestone reserved for the game’s elite finishers. What makes the achievement even more striking is the speed at which the England captain reached it, surpassing the pace set by Cristiano Ronaldo when he hit the same total.",
    "image": "https://prod-media.beinsports.com/image/Cristiano%20y%20Kane.1080.png",
    "source": "beIN SPORTS"
  },
  {
    "title": "Housing sales volumes and prices both declined in January - REINZ",
    "desc": "Housing market makes weak start to 2026 with sales volumes and prices both softer in January",
    "image": "https://www.interest.co.nz/sites/default/files/2025-08/WellyHouses.jpg",
    "source": "Interest.co.nz"
  },
  {
    "title": "NRL confirms bombshell Origin eligibility overhaul as league chief ends rule that ‘makes no sense’",
    "desc": "NRL confirms bombshell Origin eligibility overhaul as league chief ends rule that ‘makes no sense’",
    "image": "https://content.api.news/v3/images/bin/62fcdea9c8ef1502a7f6e605c172ff62",
    "source": "fox sports"
  },
  {
    "title": "Hungary: Magyar launches anti-Orban election campaign",
    "desc": "Peter Magyar's opposition Tisza party is pledging to combat corruption in one of the European Union's poorest countries and reverse Budapest's pivot towards Russia.",
    "image": "https://static.dw.com/image/75982590_6.jpg",
    "source": "DW.com"
  },
  {
    "title": "Live weather: Evacuations, power cuts, roads closed as severe gales, rain batter lower North Island",
    "desc": "Air NZ has cancelled flights in and out of several major centres, while evacuations are underway at homes on Masterton's Lincoln Road due to the threat of falling trees.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--TBfQ6yCW--/t_tohu-badge-facebook/v1771191977/4JT4GV1_tree_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Ga Traditional Council praises Haruna Iddrisu for ‘statesmanship’ in Google AI language dispute",
    "desc": "GA Traditional Council praises Haruna Iddrisu for ‘statesmanship’ in Google AI language dispute",
    "image": "https://www.graphic.com.gh/images/2026/Feb/13/WhatsApp%20Image%202026-02-15%20at%209.15.30%20PM%201.jpeg",
    "source": "Graphic Online"
  },
  {
    "title": "Field Level Media - Professional sports content solutions | FLM",
    "desc": "Leylah Fernandez of Canada rallied to upset No. 13 Liudmila Samsonova 5-7, 7-5, 6-3 in the opening round of the Dubai Duty Free Championship in the United Arab Emirates on...",
    "image": "https://fieldlevelmedia.com/wp-content/uploads/2026/02/28043501-1024x683.jpg",
    "source": "Field Level Media"
  },
  {
    "title": "Building that caught fire in Ajax to be demolished",
    "desc": "Ajax’s Chief Building Official has issued an Emergency Order for the demolition of a property that caught fire earlier this month at a downtown shopping plaza.",
    "image": "https://www.cp24.com/resizer/v2/BKKIG5J5EJASTCZYYTPTMZW6FI.jpeg?smart=true&auth=20790104a81932e1afc66303f1a094681cac894c95a621ed7377166726c0899c&width=1200&height=630",
    "source": "CP24"
  },
  {
    "title": "Bondi criticised after saying all Epstein files have been released",
    "desc": "Lawmakers, including those who wrote the law requiring their publication, argue the release is insufficient.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/d134/live/2a2760c0-0ab8-11f1-99f8-175d6377faa5.jpg",
    "source": "BBC"
  }
]