[
  {
    "title": "Candace Owens attacks Erika Kirk again, claims Charlie Kirk ‘removed his wedding ring’ night before murder",
    "desc": "Candace Owens has made shocking claims about Charlie and Erika Kirk's marriage, saying he removed his wedding ring the night before he was assassinated.",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/12/550x309/bbhhuyg_1770878321898_1770878325959.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Emirates Expands Premium Economy to 99 Destinations by 2026",
    "desc": "Emirates is set to enhance passenger experience by expanding its Premium Economy service to 99 destinations by 2026. With refurbished aircraft and upgraded seating, travelers can enjoy more comfort on long-haul flights. Discover the new routes and aircraft updates as Emirates rolls out its network-wide retrofit program.",
    "image": "https://media.assettype.com/gulfnews%2F2026-02-12%2F0swou9in%2FPremium-Economy-A380?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Gulf News"
  },
  {
    "title": "Winter Olympics 2026: How to watch day 7 live - full schedule and medal events on Friday 13 February",
    "desc": "Ilia Malinin aims for men’s figure skating gold on Olympic debut, while Johannes Høsflot Klæbo chases history in his third cross-country skiing event of Milano Cortina 2026.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/xjc8tml17m9vilotbkc9",
    "source": "Winter Olympics"
  },
  {
    "title": "PA crushes DA to bag its third seat in George, IFP sees off ANC to retain uMzumbe ward in KZN",
    "desc": "The Patriotic Alliance easily picked off a DA-held seat in in the Western Cape to win its third seat in George in 2026, while the IFP retained a marginal seat in uMzumbe in the Ugu district of southern KwaZulu-Natal, in the first KZN by-election of 2026.",
    "image": "https://cdn.dailymaverick.co.za/i/na8d9UXVEuckXH2FMyyzy9dgW3U=/800x0/smart/filters:strip_exif()/file/dailymaverick/wp-content/uploads/2023/12/main-8-copy.jpg",
    "source": "Daily Maverick"
  },
  {
    "title": "Nature’s renewal has slowed down despite rising temperatures: Study",
    "desc": "Ecosystems slow down despite climate change, study reveals.",
    "image": "https://gumlet.assettype.com/downtoearth%2F2026-02-12%2Fxwfbtitw%2FAtlantic-Blue-Fin-Tuna.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Down To Earth"
  },
  {
    "title": "Two Chinese nationals accused of foreign interference granted bail in ACT Magistrates Court",
    "desc": "Police allege the two Chinese nationals, who are charged with reckless foreign interference for alleged spying on the Canberra branch of a Buddhist association, are linked to a woman arrested on the same charge last year.",
    "image": "https://live-production.wcms.abc-cdn.net.au/fa83e8107b8291b69171dda86795f25a?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Bangladesh Players React To Government's T20 World Cup U-Turn: \"Funny\"",
    "desc": "Asif Nazrul, sports advisor to the Bangladesh government, made a stunning U-turn as he claimed that the decision to pull out of the T20 World Cup 2026 was taken by the players and Bangladesh Cricket Board (BCB).",
    "image": "https://c.ndtvimg.com/2026-01/hbnahlg4_bangladesh-cricket-afp_625x300_25_January_26.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
    "source": "NDTV Sports"
  },
  {
    "title": "Support firms for Angus Taylor to win Liberal leadership, though Ley expected to achieve 'good result'",
    "desc": "Support is firming for Angus Taylor to topple Opposition Leader Sussan Ley, though her supporters still expect her to achieve a \"good result\".",
    "image": "https://live-production.wcms.abc-cdn.net.au/79445bb3aa6938ac6a008d39f27a87ce?impolicy=wcms_watermark_news&cropH=2685&cropW=4774&xPos=2404&yPos=681&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "My daughter's monster ex walked 28 miles to stab her & 9 year old son to death",
    "desc": "JUST before midnight in May 2021, Daniel Boulton left his hostel in Skegness and began a 28-mile foot-march to the home his ex-girlfriend Bethany...",
    "image": "https://www.thesun.co.uk/wp-content/uploads/2026/02/newspress-collage-fvhvzxt5k-1770812311432.jpg?quality=90&strip=all&1770812412&w=1920&h=1080&crop=1",
    "source": "The Sun"
  },
  {
    "title": "Police probe suspected arson at Alpha Hour convener’s church auditorium",
    "desc": "The Accra Regional Police Command has launched an investigation into a suspected arson incident at the auditorium of Grace Mountain Ministry, led by Alpha Hour convener Pastor Elvis Agyemang.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/669/66914928.jpg",
    "source": "GhanaWeb"
  }
]