[
  {
    "title": "Avalon Buried Again: High Winds and Heavy Disruptions",
    "desc": "Close to 20 cm of fresh snow is down on the Avalon, and that is causing a lot of issues on the roads. Some of ...",
    "image": "https://media-cdn.socastsrm.com/wordpress/wp-content/blogs.dir/900/files/2026/02/fox-nl511-traffic-cam-610-am-feb-22.png",
    "source": "VOCM"
  },
  {
    "title": "PN to ‘improve’ presidential council’s functions ahead of polls",
    "desc": "Agreement has been reached in principle to 'strengthen' the opposition coalition, says its deputy sec-gen.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/815c7a9e-mesyuarat-pn-fbpic-220226.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Another Tejas fighter jet crashes in India",
    "desc": "New Delhi: A domestically developed Tejas fighter jet of the Indian Air Force crashed while landing after a routine training sortie, officials confirmed. According to Kashmir Media Service, the Indian Air Force has ordered a high-level court of inquiry to ascertain the cause of the accident and has initiated a comprehensive technical inspection of …",
    "image": "https://kmsnews.org/kms/assests/2026/02/IMG_2021.jpeg",
    "source": "Kashmir Media Service"
  },
  {
    "title": "London Bridge attack hero police officer sacked for gross misconduct for using 'p*key' slur",
    "desc": "The panel concluded DC Mark Luker probably knew the language was “offensive” to a minority community and ruled it gross misconduct.",
    "image": "https://static.standard.co.uk/2022/06/03/10/e3d2ba5ed4289e265a9be8cfca6df75dY29udGVudHNlYXJjaGFwaSwxNjU0MzMxOTc3-2.48741788.jpg?width=1200&auto=webp&quality=75",
    "source": "London Evening Standard"
  },
  {
    "title": "Man City pile pressure on Arsenal",
    "desc": "Pep Guardiola’s side defeated Newcastle 2-1",
    "image": "https://i.tribune.com.pk/media/images/pg12-anchor1771752817-0/pg12-anchor1771752817-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Naval Hill implements biosecurity measures against FMD",
    "desc": "Naval Hill implements biosecurity measures to prevent the potential spread of foot and mouth disease",
    "image": "https://novanews.co.za/wp-content/uploads/2026/02/Naval-Hill.jpg",
    "source": "novanews.co.za"
  },
  {
    "title": "The prettiest looks of Carmelle Collado",
    "desc": "The doors of Pinoy Big Brother Celebrity Collab Edition 2.0 welcomed many talented and remarkable housemates who are making their mark in the showbiz industry, including Kapamilya singer Carmelle Collado.\nCarmelle, dubbed the Riles Diva of Camarines Sur, lit up the house with her talent and personality, which the housemates and viewers from outside world have come to love.\nAlthough her PBB Celebrity Collab Edition 2.0 has ended after she was evicted on Saturday, February 21, Carmelle is equipped with the talent and beauty that are sure to take her far in the industry.\nTake a closer look at",
    "image": "https://aphrodite.gmanetwork.com/entertainment/gallery/1200_675_main_22-02-2026-1724_-20260222172426.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Shabab facing financial crisis after targeted crackdown",
    "desc": "Mogadishu (HOL) — Somalia’s federal government says al-Shabab is experiencing mounting financial strain following the killing of senior operatives responsible for managing the group’s revenue networks and sustained efforts to dismantle its funding infrastructure.",
    "image": "https://www.hiiraan.com/uploads/2026/02/177174918020140904_Shabaab.jpg",
    "source": "hiiraan.com"
  },
  {
    "title": "The real reason Rawlings ordered killing of 3 former Ghana heads of state",
    "desc": "Ghana’s turbulent revolutionary period of 1979 reached its most dramatic and controversial turning point when the Armed Forces Revolutionary Council (AFRC), led by Flt Lt Jerry John Rawlings, ordered the execution of several senior military...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/941/94134235.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Ethiopian PM Abiy Says “Our Preparations Are Aimed at Guaranteeing Peace Across Africa”",
    "desc": "Addis Ababa, February 22, 2026 (ENA) –Prime Minister Abiy Ahmed, at the 65th Anniversary of Ethiopia’s Special Operations Command, underscored that Ethiopia’s defense build-up is designed to guarantee peace in East Africa and across the continent.\nThe anniversary celebration was held with grandeur at Hawassa International Stadium in Hawassa city, in the presence of the Commander-in-Chief of the Armed Forces, Prime Minister Abiy and senior military and government officials.\nAddressing the gathering, PM Abiy reaffirmed Ethiopia’s unwavering commitment to peace, security, and prosperity throughout Africa.\nHe emphasized that the country’s ongoing military preparations are pillars of stability intended to safeguard sovereignty and ensure regional harmony.\n“Our preparations are aimed at guaranteeing peace across the entirety of Africa,” the Prime Minister declared.\nHe further stated, “We intend to stand as a pillar of support, a protector, and a shield for the nations of our region.”\nHighlighting a significant strategic shift, the Prime Minister noted that Ethiopia has expanded its military training beyond land, mountainous terrain, and river operations to include maritime capabilities.\nHe described this transition as part of a broader national philosophy aimed at reclaiming Ethiopia’s connection to maritime access and redefining water not as a barrier, but as a source of life, development, and strategic opportunity.\nHe stressed that Ethiopia is overturning long-standing attitudes of distancing itself from water and is instead embracing it as a foundation for growth.\nCiting riverside development initiatives, dam construction, and the integration of artificial intelligence technologies, the Prime Minister said the country is demonstrating that “water is life and water is development.”\nPrime Minister Abiy also confirmed the establishment of a technologically advanced elite force equipped with drone reconnaissance systems and precision-strike capabilities, including loitering munitions.\nThe unit, he explained, is designed to secure strategic locations, neutralize emerging threats swiftly, and deter terrorism while protecting peaceful communities across the region.\nAccording to the Prime Minister, Ethiopia’s mission extends beyond its borders, supporting “brotherly peoples from the tip of Somalia to the tip of Massawa,” with the objective of eliminating maritime terrorism and strengthening regional prosperity.\nHe further emphasized that these institutions are being built to prevent instability before it emerges and, if necessary, to conclude conflicts decisively and efficiently.\nReferring to Ethiopia’s defense forces, which have earned international recognition through peacekeeping missions abroad, he described them as disciplined, technologically empowered, and ready to uphold national sovereignty.\nThe newly established elite force has been characterized as worthy of the “Red Beret” distinction, a force prepared to defend the honor of the flag, the dignity of the nation, and Ethiopia’s independence with intellectual rigor and physical excellence.\nConcluding his address, Prime Minister Abiy reaffirmed that Ethiopia’s defense force remains a reliable guarantor of national independence and African peace, today as it has been in the past.\n“Congratulations to all East African nations and to Africa as a whole,” he declared. “Together, we advance toward a future of security, unity, and shared prosperity.”",
    "image": "https://www.ena.et/documents/42142/0/aBIY+%2824%29.jpg/2644f0f6-d6f9-1fb1-29a4-320433c9f3c3?version=1.0&t=1771752867961&download=true",
    "source": "ENA English"
  }
]