[
  {
    "title": "Turkish F-16 Vipers Seen Operating Out Of Mogadishu's International Airport",
    "desc": "The Turkish F-16s arrived in Somalia as fighting with al-Shabab extremists heats up.",
    "image": "https://www.twz.com/wp-content/uploads/2026/02/F16-Turkey-.jpg?w=1200",
    "source": "The War Zone"
  },
  {
    "title": "Bowers & Wilkins adds the 707 S3 Prestige Edition to the 700 Series",
    "desc": "The 707 Prestige Edition, built on the same acoustic platform as the 707 S3 and more, the ultimate bookshelf loudspeaker you need.",
    "image": "https://robbreport.com.sg/storage/2026/02/niURPLFuirJxqmMGqts7Fh.jpg",
    "source": "Robb Report Singapore"
  },
  {
    "title": "Measles circulating undetected in Adelaide after infectious case identified, SA Health says",
    "desc": "South Australia's health department says undetected measles is circulating in Adelaide, after an infection was identified in someone who had not recently travelled.",
    "image": "https://live-production.wcms.abc-cdn.net.au/f226ef8f811f45ee207cc37a3acbd026?impolicy=wcms_watermark_news&cropH=1518&cropW=2699&xPos=0&yPos=138&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Exhibitions to see during Mexico City Art Week",
    "desc": "From audio-tape portraits to the mother-daughter relationship, we share some must-see shows",
    "image": "https://cdn.sanity.io/images/cxgd3urn/production/fab34d69e45e249e5fd05bab7bc80a721dd9251b-1350x1800.jpg?rect=0,240,1350,810&w=1200&h=720&q=85&fit=crop&auto=format",
    "source": "The Art Newspaper"
  },
  {
    "title": "Grand Theft Auto 6 Marketing Is Set To Start This Winter And The Release Date Looks Locked",
    "desc": "Grand Theft Auto 6 Marketing Is Set To Start This Winter And The Release Date Looks Locked",
    "image": "https://press-start.com.au/wp-content/uploads/2025/05/Grand-Theft-AUto-6666.jpg",
    "source": "Press Start Australia"
  },
  {
    "title": "Battling the other ‘Alzheimer’s protein’: Study shows how to prevent toxic tau in the brain",
    "desc": "Toxic tangles of the protein tau underlie more than two dozen neurodegenerative diseases. New research sheds light on what causes them and how to treat them.",
    "image": "https://www.newswise.com/android-icon-192x192.png",
    "source": "Newswise"
  },
  {
    "title": "Infectious Disease Special Edition: Investigational drug TBD09 holds promise for TB",
    "desc": "The investigational antibiotic TBD09, also called MK-7762, could have the potential to treat TB with less toxicity.",
    "image": "https://www.eatg.org/wp-content/uploads/2023/11/iwkcspbmwx8.jpg",
    "source": "European AIDS Treatment Group"
  },
  {
    "title": "Quezon City bet Asia Rose Simpson wins Miss World Philippines 2026 title",
    "desc": "Asia Rose Simpson of Quezon City was crowned Miss World Philippines 2026 while five other titles were handed out.",
    "image": "https://media.philstar.com/photos/2026/02/04/asia-rose-simpson-miss-world-philippines-2026_2026-02-04_08-22-33.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Game-Changer: ₱140M Farm-to-Market Road breaks ground in Lamut, Ifugao",
    "desc": "Lamut, Ifugao – Local farmers in Lamut, Ifugao will soon have improved access to markets following the recent groundbreaking of a farm-to-market road (FMR) project in the town.For many years, farmers from the upland sitios of Bannit and Nabanngan in Barangay Payawan, and Sitio Nunhabatan in Barangay Hapid, have struggled to transport their produce to markets due to poor road conditions.Long travel times, high transportation costs, and impassable roads during the rainy season have often resulted",
    "image": "https://static.wixstatic.com/media/493608_bee04e335b1c4625a7de9b530380ee68%7Emv2.png/v1/fill/w_192%2Ch_192%2Clg_1%2Cusm_0.66_1.00_0.01/493608_bee04e335b1c4625a7de9b530380ee68%7Emv2.png",
    "source": "Guru Press Cordillera"
  },
  {
    "title": "No, GTA 6 PS5 Physical Copies Won't Be Delayed",
    "desc": "\"That's not the plan\" - One rumour floating around in relation to GTA 6 is that physical copies of the PS5 title will not arrive until 2027 in order to avoid...",
    "image": "https://images.pushsquare.com/0701a34b905e1/large.jpg",
    "source": "Push Square"
  }
]