[
  {
    "title": "Timberwolves Fans Sound Off on Rudy Gobert Suspension News",
    "desc": "Since Rudy Gobert picked up another flagrant foul against the Mavericks, he is set to be suspended by the NBA.",
    "image": "https://heavy.com/wp-content/uploads/2026/01/GettyImages-2252827207-e1768254051823.jpg?quality=65&strip=all",
    "source": "heavy.com"
  },
  {
    "title": "Troops arrest Boko Haram drone supplier",
    "desc": "Nigerian troops have arrested a 64-year-old Boko Haram supplier, Dauda Gubula, who provided armed drones to insurgents, during a raid in Madagali.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/01/25160748/Army-Troops.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Penang's esplanade seawall, promenade project wins Unesco heritage award",
    "desc": "GEORGE TOWN: Penang's Esplanade Seawall and Promenade project has been internationally recognised in the 2025 UNESCO Asia-Pacific Awards for Cultural Heritage Conservation, receiving the New Design in Heritage Contexts award with Special Recognition for Sustainable Development.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/21/3779784.jpg",
    "source": "The Star"
  },
  {
    "title": "Tracking heavy snow in the Philadelphia; blizzard conditions possible near shore | Live Updates",
    "desc": "A Winter Storm Watch will go into effect on Sunday for a system that could bring snow to our area well into Monday.",
    "image": "https://cdn.abcotvs.com/dip/images/18627522_022026-wpvi-snow-totals-friday-night-img.png?w=1600",
    "source": "6abc Philadelphia"
  },
  {
    "title": "'I love my man': Mahieka Sharma's romantic reply to Hardik Pandya goes viral",
    "desc": "Cricket News: NEW DELHI: Indian star allrounder Hardik Pandya made Mahieka Sharma’s 25th birthday special with a heartfelt Instagram post — but it was Mahieka’s rep.",
    "image": "https://static.toiimg.com/thumb/msid-128632404,width-1280,height-720,imgsize-30182,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "UK university owed millions by Malaysian campus, says report",
    "desc": "University of Nottingham spokesman says this year's financial statements are 'not reliable' to determine the performance of the campus.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/5e0b58e8-university-of-nottingham-malaysia-fb-pic-210226.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "David Byrne and Taper Director on the Show Reaching L.A.",
    "desc": "David Byrne's musical 'Here Lies Love,' which hit Broadway in 2023, is opening in L.A. He and Mark Taper Forum director Snehai Desai discuss the show.",
    "image": "https://variety.com/wp-content/uploads/2026/02/01.-HERE-LIES-LOVE.-Photo-by-Jeff-Lorch.-.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Explainer: What charge might King Charles' brother face after his arrest?",
    "desc": "LONDON – King Charles' younger brother Andrew Mountbatten-Windsor was arrested on suspicion of misconduct in public office this week, over allegations that he sent confidential British government documents to disgraced financier Jeffrey Epstein.Thames Valley Police, whose detectives questioned the former prince all day on Thursday (Feb 19), have said they are looking into allegations that Mountbatten-Windsor had passed documents to...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/2102_andrew_newspaper.jpg?itok=hwG4e5RA",
    "source": "AsiaOne"
  },
  {
    "title": "New Mental Health, Eating Disorder Clinic Opens in Peel",
    "desc": "The Peel Community Mental Health Service and Kara Maar Specialist Community Eating Disorder Service clinic in Greenfields in Mandurah has now reached",
    "image": "https://www.parliament.wa.gov.au/webcms/webcms.nsf/resources/file-parliament-house-front-day/$file/parl-house-front-day.jpg",
    "source": "Mirage News"
  },
  {
    "title": "Cannabis use in adolescence associated with higher rates of psychiatric disorders",
    "desc": "Adolescents who use cannabis could face a significantly higher risk of developing serious psychiatric disorders by young adulthood, according to a large new study published today in JAMA Health Forum.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/Cannabis-620x480.jpg",
    "source": "News-Medical"
  }
]