[
  {
    "title": "Brazil: Tragic bus crash kills nearly 20",
    "desc": "A bus crash in Brazil killed nearly 20 people. The incident occurred while the bus was returning from a religious festival in northeast Brazil, veered off the road on a curve, and overturned,...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-04/1390978_113150_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "X to snub Oireachtas committee today, despite Taoiseach writing to company about its attendance",
    "desc": "TikTok and Meta reps will be questioned by politicians today but X has refused to attend today’s meeting.",
    "image": "https://img2.thejournal.ie/article/6945608/river/?height=400&version=6945967",
    "source": "The Journal"
  },
  {
    "title": "Obesity killing record numbers of pregnant women",
    "desc": "Weight issue risk should be recognised as ‘an urgent and growing public health challenge’, says doctors’ group",
    "image": "https://www.telegraph.co.uk/content/dam/briefs/2026/02/03/TELEMMGLPICT000460886671_17701357191380_trans_NvBQzQNjv4BqOLSIyYLmkFq7W-G_CKMXcbwbciLn0dlNSWIexE0d2P0.jpeg?impolicy=OG-Standard",
    "source": "The Telegraph"
  },
  {
    "title": "Louis Rees-Zammit: 'No bigger game' than Wales v England, says full-back",
    "desc": "Two years since his last Six Nations appearance, Louis Rees-Zammit is back and says \"there's no bigger game'\" than England against Wales.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8b90/live/33785080-002c-11f1-a507-573696841dbb.jpg",
    "source": "BBC"
  },
  {
    "title": "J-K LA adjourned for 15 mins over LoP's remarks on Pir Panchal",
    "desc": "The issue was raised by Congress MLA from Rajouri Iftkhar Ahmed when the debate on the motion of thanks on the Lieutenant Governor's address in the Legislative Assembly had just started.",
    "image": "https://greaterkashmir.imagibyte.sortdcdn.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-04-at-11.40.53-scaled.jpeg",
    "source": "Greater Kashmir"
  },
  {
    "title": "Cancer survivor turns trauma into art in short film",
    "desc": "Chloe Jacquet reimagines chemotherapy as an airline flight to redress the narrative around cancer.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b48d/live/86b279e0-0060-11f1-a8b8-bdd2c5f9bcad.png",
    "source": "BBC"
  },
  {
    "title": "Profits: Strategies to Boost Awareness, & Engagement",
    "desc": "In today’s digital-first environment, non-profit organizations face both constraints and opportunities as they work to raise awareness and secure funding. Limited budgets and staff capacity make it essential for non-profits to rely on smart, efficient digital marketing strategies to connect with supporters. Digital tools allow organizations to expand their reach, tell their stories effectively, and",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "AfCFTA Association of Commodities Exchanges marks new chapter with appointment of first Secretary",
    "desc": "The AfCFTA Association of Commodities Exchanges (A-ACX) continues to build momentum toward deeper integration and collaboration across Africa’s commodity markets.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Screenshot-2026-02-04-at-6.24.14-am.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Living costs rise for all but some hit harder, new ABS data finds",
    "desc": "Cost-of-living pressures are being felt by all households, but some have been hit harder than others as annual costs increased between 2.3 and 4.2 per cent in 2025, according to the Australian Bureau of Statistics.",
    "image": "https://live-production.wcms.abc-cdn.net.au/7c0d0d1b95081b9fee7107986af6298d?impolicy=wcms_watermark_news&cropH=1622&cropW=2884&xPos=0&yPos=38&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Halt renewal of expired mining leases for state ownership",
    "desc": "The Institute of Economic Affairs (IEA) has called on the government not to renew the mining licenses of multinational companies whose leases have expired,",
    "image": "https://citinewsroom.com/wp-content/uploads/2026/01/Mining-.jpg",
    "source": "CitiNewsroom.com"
  }
]