[
  {
    "title": "Today's NYT Wordle Hints, Answer and Help for Feb. 27 #1714",
    "desc": "Here's today's Wordle answer, plus a look at spoiler-free hints and past solutions. These clues will help you solve The New York Times' popular puzzle game, Wordle, every day.",
    "image": "https://www.cnet.com/a/img/resize/c2b8d1e2686bcca5e387fa0b6c89fa264d27a6c4/hub/2024/05/28/20480816-214e-4fcc-a9b4-b02f0ac71e7c/wordle-word-game-hints-puzzle-8667.jpg?auto=webp&fit=crop&height=675&width=1200",
    "source": "CNET"
  },
  {
    "title": "Chris Mason: Gorton and Denton by-election has been a three-way tussle",
    "desc": "Plenty think it could be a three-way tussle between Labour, Reform and the Greens, the BBC's political editor writes.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/22e4/live/752b49d0-1362-11f1-9120-a910fc22c6ac.jpg",
    "source": "BBC"
  },
  {
    "title": "Jesse Lingard to link up with former team-mate Memphis Depay as ex-Man Utd star closes in on shock transfer",
    "desc": "Former Manchester United star Jesse Lingard is reportedly in \"advanced talks\" over a transfer to Brazilian side Corinthians. The 33-year-old is set for a new challenge after leaving FC Seoul at the end of last year and now looks to be heading to South America. If the transfer goes ahead it would see Lingard link up with former Manchester United team-mate Memphis Depay.",
    "image": "https://assets.goal.com/images/v3/getty-1347736859/crop/MM5DKMBQGQ5DEOBRGU5G433XMU5DAORSGYYQ====/GettyImages-1347736859.jpg",
    "source": "Goal.com"
  },
  {
    "title": "China shifts cadre-appraisal metrics away from pure GDP growth, resetting mindsets",
    "desc": "Five-month campaign seen prioritising social welfare and long-term sustainability over economic expansion, with debt, fraud and vanity projects in crosshairs.",
    "image": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2026/02/26/d6edb7cb-5a1f-4b63-ad75-4458f53b72c5_b04a3ced.jpg?itok=_FISmrzh&v=1772096180",
    "source": "South China Morning Post"
  },
  {
    "title": "How the Epstein file saga is fueling extremist conspiracies",
    "desc": "Researchers of online extremism say lack of public accountability in relation to the release of the latest Epstein files has bred a worrying mixture of cynicism and nihilism in some online spaces.",
    "image": "https://www.whqr.org/favicon-32x32.png",
    "source": "WHQR"
  },
  {
    "title": "Brian Riemer remains hopeful that Patrick Dorgu will be available for World Cup play-offs in March",
    "desc": "Denmark manager Brian Riemer has provided a hopeful update on Manchester United star Patrick Dorgu regarding his injury.",
    "image": "https://cdn1.unitedinfocus.com/uploads/14/2025/12/GettyImages-2252865885-scaled.jpg",
    "source": "United In Focus"
  },
  {
    "title": "Two new Hans Christian Andersen adaptations prove fairy tales as relevant as ever",
    "desc": "Two wildly different shows, The Tree of Light by Slingsby Theatre Company and Meow Meow's The Red Shoes, re-imagine classic fairy tales by the famous Danish author.",
    "image": "https://live-production.wcms.abc-cdn.net.au/37be075ad2ea0b99b0dd67e4baa52195?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Astronomers just watched a star 1,540 times the size of our sun transform into a hypergiant. Will it go supernova?",
    "desc": "One of our universe's biggest stars has dramatically turned into a rare, yellow 'hypergiant' star, and astronomers aren't sure when it will go supernova.",
    "image": "https://cdn.mos.cms.futurecdn.net/hTJ5qiXjJQFJW3jj2fL9HK-1600-80.png",
    "source": "Space"
  },
  {
    "title": "Swastika Mukherjee Stars in Indo-American Co-Production 'Chheledhora'",
    "desc": "Principal photography is set to get underway March 1 on 'Chheledhora,' a Bengali-language thriller from writer-director Shieladitya Moulik.",
    "image": "https://variety.com/wp-content/uploads/2026/02/Swastika-Mukherjee.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Liberals survive confidence vote as House passes budget implementation bill",
    "desc": "The legislation enacts key measures proposed in the Liberals' 2025 federal budget, which passed a confidence vote for Prime Minister Mark Carney's government in November last year.",
    "image": "https://globalnews.ca/wp-content/uploads/2026/02/17cebeba85626011b53ca91643b672af39f894f0c428c5a02c0eaa032699a8eb.jpg?quality=65&strip=all&w=720&h=379&crop=1",
    "source": "Global News"
  }
]