[
  {
    "title": "Singaporean boy, 14, who simulated ISIS terror attacks on Roblox issued ISA restriction order",
    "desc": "SINGAPORE - A 14-year-old Singaporean boy who aspired to travel overseas to conduct armed violence and die a martyr has been issued a restriction order (RO) under the Internal Security Act (ISA).",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/28/3742443.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Joe Alwyn celebrates as Taylor Swift sends Travis Kelce wedding invites",
    "desc": "Joe Alwyn, who broke up with his popstar girlfriend Taylor Swift in 2023, still finds himself reminded of their time together, as he noted in his latest interview.However, the Stars at Noon actor was able to brush that all aside as he...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-01-28/l_647634_115706_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "LTA's new OBU alerts for safer roads",
    "desc": "LTA introduces new OBU alerts to notify motorists to slow down near certain streets and expressway exits, enhancing road safety. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/7578bf8e9c8b3398802c7d529b485750800e639cb1896c528b6355d73651d6b0",
    "source": "The Straits Times"
  },
  {
    "title": "Chinese ambassador hints at retaliation if Port of Darwin is returned to Australian control",
    "desc": "China's ambassador to Australia, Xiao Qian, questions the Albanese government's ethics in wanting to return the Port of Darwin to Australian hands.",
    "image": "https://live-production.wcms.abc-cdn.net.au/d6005c3c646de46c9013e5621152e1e6?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Zanzibar strengthens routine AMR surveillance and reporting",
    "desc": "The World Health Organization (WHO) is building a better future for people everywhere. Health lays the foundation for vibrant and productive communities, stronger economies, safer nations and a better world. Our work touches lives around the world every day – often in invisible ways. As the lead health authority within the United Nations (UN) system, we help ensure the safety of the air we breathe, the food we eat, the water we drink and the medicines and vaccines that treat and protect us. The Organization aims to provide every child, woman and man with the best chance to lead a healthier, longer life.",
    "image": "https://www.afro.who.int/sites/default/files/Logo%20EN.jpg",
    "source": "WHO | Regional Office for Africa"
  },
  {
    "title": "Israel’s Netanyahu conditions Gaza’s reconstruction on disarmament",
    "desc": "Israel will not allow Gaza’s reconstruction to take place before it is disarmed, Prime Minister Benjamin Netanyahu said late Tuesday. His remarks came during a",
    "image": "https://www.nation.com.pk/digital_images/large/2026-01-28/israel-s-netanyahu-conditions-gaza-s-reconstruction-disarmament-1769583199-6240.jpg",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "12 years on, Joschko awaits outcome of legal suit for loss of entire family",
    "desc": "ANTONIA Joschko, who was 16 years old when her family was killed in a car accident near Henties Bay on 29 December 2014, will have to wait...",
    "image": "https://informante.web.na/wp-content/uploads/2026/01/620105680_1208386231503768_4133472209869769873_n.jpg",
    "source": "Informanté"
  },
  {
    "title": "Smothering, bullying, stabbing: how it feels to be in one of the hottest places on Earth",
    "desc": "Everything felt like it was swelling, and despite my diligent consumption of water and Hydralyte, I couldn’t quite escape the persistent, low-level nausea. Even thinking took longer",
    "image": "https://i.guim.co.uk/img/media/08cbe0000c4ca900682429e56a92afe0ddc8a38a/456_0_4560_3648/master/4560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=82709e4a25c30850eb38747caead0614",
    "source": "The Guardian"
  },
  {
    "title": "These Are The 18 Most Romantic Restaurants In Victoria For 2026, According To Over 175,000 Diners From OpenTable",
    "desc": "The team at OpenTable has crunched the numbers to reveal the Top 50 Romantic Restaurants in Australia, and 18 Victorian venues made the list.",
    "image": "https://offloadmedia.feverup.com/secretmelbourne.com/wp-content/uploads/2026/01/28174104/Yugen-Restaurant_CREDIT-Marcel-Aucar-7-1.jpg",
    "source": "secretmelbourne.com"
  },
  {
    "title": "Consumers say tipping becoming 'less voluntary'",
    "desc": "Two thirds of consumers believe tipping is becoming \"less voluntary\", according to new research from the Competition and Consumer Protection Commission.",
    "image": "https://www.rte.ie/images/0023cf28-1600.jpg",
    "source": "RTE.ie"
  }
]