[
  {
    "title": "Mwanza Airport major expansion begins",
    "desc": "DODOMA: THE government has confirmed that a comprehensive assessment highlights the need to upgrade Mwanza Airport to international standards, with major expansion and redesign works now underway. Deputy Minister for Transport, Mr David Kihenzile, told the National Assembly in Dodoma yesterday that the ministry is currently conducting detailed designs for the construction of a new",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/494081690_18498088231030793_5669101302698710366_n.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Finding joy in simpler celebrations",
    "desc": "PETALING JAYA: As rising costs reshape festive habits, some celebrants are placing greater emphasis on quality food and family time rather than lavish decorations.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/07/3758860.jpg",
    "source": "The Star"
  },
  {
    "title": "Former MLB star Yasiel Puig found guilty of obstruction of justice, false statements",
    "desc": "A jury found the former Dodgers star guilty of lying to federal investigators about his knowledge of an illegal gambling operation.",
    "image": "https://static01.nyt.com/athletic/uploads/wp/2026/02/05140728/GettyImages-1999108308-scaled.jpg?width=1200&height=630&fit=cover",
    "source": "The New York Times"
  },
  {
    "title": "Company fined $300k after explosion leaves forklift driver with burns",
    "desc": "Several 9kg gas bottles at the Auckland Tank Test facility exploded in March 2024, subsequently fuelling a \"significant fire\".",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-scene-of-the-explosion-at-test-tank-in-2024-JOKNPDLO5VBQLBKY45AFRFYMFQ.jpg?auth=5d3684f209d40b944b09c2558aba26a891b0280c7c945331263263a8a7ab11b5&quality=70&width=600&height=315&focal=400%2C266",
    "source": "1News"
  },
  {
    "title": "Novel Technique to Detect Cloud Threat Actor Operations",
    "desc": "We introduce a novel method that maps cloud alert trends to MITRE ATT&CK techniques. The patterns created could identify threat actors by behavior.",
    "image": "https://unit42.paloaltonetworks.com/wp-content/uploads/2026/02/13_Cloud_cybersecurity_research_Overview_1920x900.jpg",
    "source": "Unit 42"
  },
  {
    "title": "Comparative Study Reveals Psychiatric Comorbidities Common in MOGAD, MS, and NMOSD, With Distinct Timing Patterns",
    "desc": "A new comparison study of patients with autoimmune diseases reported high rates of anxiety and depression, with notable differences in when psychiatric symptoms emerged relative to disease onset.",
    "image": "https://cdn.sanity.io/images/0vv8moc6/neurolive/56f535d6a7d77774b8a2de661202ef992979889f-1950x1021.png",
    "source": "NeurologyLive"
  },
  {
    "title": "Hidden UK island with a farmhouse and stunning views on sale for £350,000",
    "desc": "A PRIVATE island off the coast of Wales has gone on the market but buyers should know one crucial thing.\nYnys Gifftan is an idyllic 18 acre...",
    "image": "https://www.thesun.co.uk/wp-content/uploads/2026/02/newspress-collage-fpuacachh-1770417976763.jpg?quality=90&strip=all&1770417989&w=1920&h=1080&crop=1",
    "source": "The Sun"
  },
  {
    "title": "Trump signs executive order lifting 25% tariff penalty on India",
    "desc": "India Business News: US President Donald Trump on Friday signed an executive order revoking the additional 25 per cent tariff imposed on all imports from India over New De.",
    "image": "https://static.toiimg.com/thumb/msid-128013163,width-1280,height-720,imgsize-31894,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "old Jackson Mackay deadlifts into the record books",
    "desc": "In January, the Sunshine Coast boy claimed a world record with an 80-kilogram deadlift, beating the previous record of 72 kilograms.",
    "image": "https://live-production.wcms.abc-cdn.net.au/087e2314b07dfde2cea68fdc093f5da5?impolicy=wcms_watermark_news&cropH=1619&cropW=2879&xPos=0&yPos=158&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Heavy Atoms Defy Expectations As Relativity And Electron Interactions Combine Unexpectedly",
    "desc": "Researchers have demonstrated that calculating the energy required to remove an electron from heavy atoms, such as gold and radon, requires accounting for the complex interplay between relativity and electron correlation, as these effects are not simply additive and depend on the order in which they are considered.",
    "image": "https://quantumzeitgeist.com/wp-content/uploads/Image_fx-36-26.jpg",
    "source": "Quantum Zeitgeist"
  }
]