[
  {
    "title": "Nestle Health Science, Australian Catholic University set up start-up incubator",
    "desc": "Nestle Health Science and Australian Catholic University are setting up a start-up incubator to drive nutrition innovations in three areas, namely women’s health, healthy longevity and weight management.",
    "image": "https://www.nutraingredients.com/resizer/v2/Z2MY5XUCJFFAROIAEDAW3JBJZE.jpg?auth=233a0f5ee3daded99b3b609ddd73b27287ad546f12f45ed8ff0afde64b9595a0&width=1200&height=630&smart=true",
    "source": "NutraIngredients.com"
  },
  {
    "title": "Trade setup for Feb 18: Will NIFTY50 close above 25,800 on Wednesday? Check details",
    "desc": "The GIFT NIFTY futures indicate a positive momentum to continue in the NIFTY50 on Wednesday morning, due to positive global markets. The technical charts indicate bulls taking the grip of the markets with NIFTY50 closing above 20 EMA and 50 EMA levels on the daily charts.",
    "image": "https://assets.upstox.com/content/assets/images/news/smids-feb-9.webp",
    "source": "Upstox"
  },
  {
    "title": "Cathie Wood's Ark Invest Just Delivered Bad News for Quantum Computing Stock Rigetti Computing",
    "desc": "Investors piled into quantum computing stocks in 2025, but many of them are now declining sharply.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F856579%2Fa-digital-rendering-of-a-quantum-computer-in-action.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Galgotias under fire for displaying Chinese robodog as own at AI Summit, clarifies",
    "desc": "Galgotias University has addressed online criticism over claims of developing and showcasing a Chinese-made robotic dog as its own at the India AI Impact Summit in Delhi, clarifying it never claimed to have developed the technology.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/galgotias-robodog-180353722-16x9_0.jpg?VersionId=_XX4vrp81F7EqyMzg7h4Z02Fl5.U_4gm",
    "source": "India Today"
  },
  {
    "title": "Beating 'Heart-on-a-Chip' Could Help Fight The World's Leading Cause of Death",
    "desc": "Scientists have created a three-dimensional \"heart-on-a-chip\" (HOC) that could provide a breakthrough in the fight against the world's leading cause of death, cardiovascular disease.",
    "image": "https://www.sciencealert.com/images/2026/02/HeartDish.jpg",
    "source": "ScienceAlert"
  },
  {
    "title": "Trump news at a glance: Hillary Clinton urges Trump administration to release millions of withheld Epstein files",
    "desc": "‘We have nothing to hide,’ former secretary of state says ahead of her and Bill Clinton’s congressional depositions next week",
    "image": "https://i.guim.co.uk/img/media/8dfd02abcecd89e4e263972bba3ea79c56bae74f/385_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2c94e585504dc806f0d704972f5d40ae",
    "source": "The Guardian"
  },
  {
    "title": "Videos of Proud Parents Jubilating as Kids Are Crowned Prefects in School, Melt Hearts",
    "desc": "South African parents celebrated their kid's prefect appointments with joyful ceremonies, emotional displays, and extravagant gifts, captivating social media hearts.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/10f89e9d5026972b.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "Major outage on YouTube website",
    "desc": "Video sharing site YouTube has suffered a widespread outage, with hundreds of thousands of users reporting issues from around the world.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--NrP-Ci4x--/t_tohu-badge-facebook/v1643545168/4NI8NDG_image_crop_72804?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "In ebony and ivory, widow finds hope and a lifeline for her children",
    "desc": "Despite financial hardship, Loke Kim Yen shows unwavering love as she cares for her two children, one of whom has disabilities.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/4ad8ee0c-4_ykm_ziarah_kasih_loke_kim_yen_fmt_moganraj_10022026-copy.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Vietnam runners beat African elites to win record prizes at VnExpress Marathon All",
    "desc": "Vietnamese runners outpaced elite African competitors in both the men’s and women’s marathons at VnExpress Marathon All-Star 2026, claiming a combined VND200 million (US$7,700) in prize money. - VnExpress International",
    "image": "https://vcdn1-vnexpress.vnecdn.net/2026/02/18/PIC-3-1771377992-5206-1771378218.png?w=680&h=0&q=100&dpr=1&fit=crop&s=y9SEXNwdPvH_2caXeb7YOQ",
    "source": "VnExpress International"
  }
]