[
  {
    "title": "Entire new UK 'town' to be created - with its own train station",
    "desc": "A historic factory which employed over 5,000 workers will form the basis of the new 'town'.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/1/1200x630/6699520.jpg",
    "source": "Daily Express"
  },
  {
    "title": "Mum of new born rescued from Storm Chandra floods horror tells of family's ordeal",
    "desc": "Tot Ollie Micheal Kirwan, his parents Kasey Grant and Stephen Kirwan along with grandmother Elayne Grant were all rescued by boat from their apartment in Enniscorthy, Co Wexford",
    "image": "https://i2-prod.irishmirror.ie/article36625930.ece/ALTERNATES/s1200/0_JS394417903.jpg",
    "source": "irishmirror.ie"
  },
  {
    "title": "Devine denies Delhi Capitals in the final over again",
    "desc": "WPL 2025/26, GG Women vs DC Women Match Report: The win took Giants to second place on the points table and a big step towards the knockouts",
    "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/412500/412539.6.jpg",
    "source": "ESPNcricinfo"
  },
  {
    "title": "See how much snow fell - and where it broke records",
    "desc": "Maps show where snowfall reached extreme levels and broke records across the U.S.",
    "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7O2SAVDDMVHS3LVFIDTN3RNBGQ.jpg&w=1440",
    "source": "The Washington Post"
  },
  {
    "title": "Zelensky condemns deadly Russian drone strike on passenger train",
    "desc": "At least four people were killed when drones targeted a packed train in north-eastern Ukraine, officials say.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a666/live/9d5f2c20-fbc3-11f0-916f-2db82aa34170.png",
    "source": "BBC"
  },
  {
    "title": "Judge rules Massachusetts offshore wind project halted by Trump administration can continue",
    "desc": "A federal judge said Tuesday that a nearly completed Massachusetts offshore wind project can continue, as the industry successfully challenges the Trump administration in court. At U.S. District Court in Boston, Judge Brian Murphy halted the administration's stop work order for Vineyard Wind, citing the potential economic losses from the delays and the developers' likelihood of success on their claims. Vineyard Wind is one of five big offshore wind projects on the East Coast that the Trump administration froze days before Christmas, citing national security concerns— and the fourth that has since been allowed to go forward.",
    "image": "https://s.yimg.com/ny/api/res/1.2/gIGvRpNHv9LadeBf6OckAQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/ap_finance_articles_694/255c1b4ea63c85934a1d1df9c90a1908",
    "source": "Yahoo"
  },
  {
    "title": "Trump, seeking damage control, weighs less aggressive approach in Minneapolis",
    "desc": "US President Donald Trump is considering a softer immigration approach in Minneapolis as his administration seeks to ease tensions following a deadly enforcement operation.",
    "image": "https://dam.mediacorp.sg/image/upload/s--eos3h7eZ--/c_crop,h_900,w_1600,x_0,y_32/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/01/28/2026-01-27t170911z_1327181941_rc2t9jav7k4v_rtrmadp_3_usa-trump.jpg?itok=98oKO7q3",
    "source": "CNA"
  },
  {
    "title": "Donald Trump threatens Iraq against reelecting Maliki",
    "desc": "In a post on Truth Social, Trump warned that reinstalling Nouri al-Maliki would be a \"very bad choice\" for Iraq.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/703353",
    "source": "jpost.com"
  },
  {
    "title": "5 snubs and surprises that could impact the Oscar race",
    "desc": "Kate Hudson proves her Best Actress bonafides, while supporting actor victories for Amy Madigan and Delroy Lindo may have gotten more complicated.",
    "image": "https://www.goldderby.com/wp-content/uploads/2026/01/Amy-Madigan-Kate-Hudson.jpg?w=650",
    "source": "Gold Derby"
  },
  {
    "title": "B.C.'s attorney general urges Canadian businesses to 'think about their role' in supporting ICE operations",
    "desc": "B.C. billionaire Jim Pattison and Vancouver-based Hootsuite are among the Canadian companies facing backlash for business ties to United States Immigration and Customs Enforcement (ICE).",
    "image": "https://i.cbc.ca/ais/a36c8a78-8284-4d58-b00a-df99f14196dd,1769543942422/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C1920%2C1080%29%3BResize%3D620",
    "source": "CBC"
  }
]