[
  {
    "title": "Healthcare providers urged to conduct quality assessments",
    "desc": "DAR ES SALAAM: HEALTHCARE providers and facilities across the country have been urged to regularly assess the quality of services they offer in order to improve service delivery and meet international standards. The call was made yesterday by Tanzania Health Summit (THS) President, Dr Omary Chillo, during a ceremony to award a SafeCare Level 4",
    "image": "https://dailynews.co.tz/wp-content/uploads/2025/08/healthcare.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Mama Ida Odinga Reveals Her Net Worth",
    "desc": "Mama Ida Odinga has revealed that she is worth Ksh500 million.",
    "image": "https://nairobileo.co.ke/storage/uploads/2026/02/FotoJet (21)-1771575482.png",
    "source": "Nairobi Leo"
  },
  {
    "title": "Pokémon FireRed And LeafGreen Officially Revealed For Switch",
    "desc": "Coming next week - Nintendo has seemingly revealed Pokémon FireRed and LeafGreen for the Switch earlier than planned, as a whole bunch of eShop listings are...",
    "image": "https://images.nintendolife.com/27ebb367c8fdf/large.jpg",
    "source": "Nintendo Life"
  },
  {
    "title": "GERD Remarkable Continental Dev't Achievement, Symbol of African Capability - Renowned Economist",
    "desc": "The Grand Ethiopian Renaissance Dam (GERD) stands as a shining example of African capability and a remarkable continental development achievement, renowned economist and public policy expert Dr. Ogho Okiti said.\nConstructed on the Abay River in Ethiopia, the GERD is the largest hydroelectric power project in Africa. Since its launch in 2011, the project has been financed through domestic resource mobilization, including public contributions, bond sales, and government funding.\nBeyond its national significance, the GERD is envisioned as a transformative regional energy initiative aimed at expanding electricity access, promoting clean energy, and strengthening regional power interconnection.\nDr. Okiti, who also serves as a senior official at Nigeria’s Federal Ministry of Finance, noted that the GERD represents a living testament to what Africans can accomplish through determination and self-reliance.\nHe emphasized that the unwavering commitment demonstrated by Ethiopians in successfully advancing the construction of the dam through domestic capacity will remain an unforgettable chapter in Africa’s history.\n“For the Ethiopians themselves to mobilize the resources to complete that dam was fantastic, unique and unprecedented,” he noted.\nAccording to the expert, the active and broad-based participation of Ethiopians in the realization of the GERD has been both inspiring and exemplary, proving that Africans can mobilize their own resources to execute mega projects of continental significance.\nDr. Okiti further stated that Ethiopia’s resounding development achievement—realized through strong public mobilization—has helped reshape Africa’s future development and growth strategies.\n \n \nHe underscored that the success of the GERD clearly reflects the strong bond of trust and cooperation between the Ethiopian government and its people, demonstrated in practice through the implementation of a massive continental project.\n“It signals that people trust the government to deliver, that citizens can directly contribute, and that resources required can also be found domestically — not every time relying on debt or aid.”\nThe project, he added, has reinforced Ethiopia’s unity and practically confirmed that African nations can undertake and complete large-scale continental projects without overreliance on external loans and aid.\nThe success of the GERD, he said, serves as a model for achieving broader continental development goals.\nMoreover, the dam is an important indicator of the need to expand continental economic integration and partnerships by strengthening cooperation across Africa.\nLooking ahead, Dr. Okiti stressed that African countries are expected to work collaboratively to enhance trade and investment ties in order to realize shared continental development agendas.\nThe GERD, he concluded, exemplifies collective resolve and solidarity in fulfilling Africa’s development aspirations by fostering regional energy connectivity across the continent.",
    "image": "https://www.ena.et/documents/42142/0/reno+2.jpg/022ffa83-803e-3282-74cc-997b5a30fd25?version=1.0&t=1771574948019&download=true",
    "source": "ENA English"
  },
  {
    "title": "Anurag Kashyap's Kennedy finally releases in India, but with many cuts; Dawood Ibrahim, Donald Trump references deleted",
    "desc": "Anurag Kashyap's Kennedy has released in India this week, almost three years after it premiered at various film festivals around the world. | Bollywood",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/20/550x309/Sunny-Leone-in-Kennedy_1770979040554_1770979041003_1771575058447.webp",
    "source": "Hindustan Times"
  },
  {
    "title": "Zimbabwe: Magaya Ordered to Pay Back U.S.$3 Million in Crushing Legal Defeat",
    "desc": "In a fresh legal blow to Walter Magaya, the High Court of Zimbabwe has ordered the embattled Prophetic Healing and Deliverance leader to repay US$3 million to an Israeli businessman dismissing his attempt to use local exchange control laws to void the debt.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "US jets escort Russian military aircraft out of Alaska’s air defence zone",
    "desc": "NORAD says aircraft did not enter sovereign airspace and were not considered a threat.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2024/07/2023-06-08T053152Z_1578068177_RC2HE1AEYEDB_RTRMADP_3_USA-BRITAIN-SUNAK-1721883972.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Zimbabwe: Trial of Harare Headmaster Stalls As State Produces Fresh Evidence",
    "desc": "The trial of a headmaster at Ridge Primary School, Ridgeview Belvedere, Harare and his 71-year-old relative accused of defrauding the Registrar of Companies two years ago using a forged resolution for a local company T and J Investments (Pvt) Ltd failed to commence at the Harare Magistrates Court on Thursday after the State indicated it had just received new documents it intends to use during the trial.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "“Grave breach of public trust”: Ghana’s Catholic Bishops on Exposure of Corruption in Illegal Mining Operations",
    "desc": "Members of the Ghana Catholic Bishops' Conference (GCBC) have weighed in on allegations of entrenched corruption in illegal mining activities in the West African nation, warning that, if verified, the reported conduct would amount to “a grave breach of public trust.”",
    "image": "https://www.aciafrica.org/images/aci-africa-photo-edit-2026-02-20t090512_1771574947.jpg?w=1200&format=jpeg",
    "source": "aciafrica.org"
  },
  {
    "title": "Dollar Eyes Best Week Since October as Fed Rate",
    "desc": "The dollar is poised to notch its best week in four months as traders pare back expectations for Federal Reserve interest-rate cuts while geopolitical risks boost the currency’s haven appeal.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iIN55sf1usus/v0/1200x800.jpg",
    "source": "Bloomberg"
  }
]