[
  {
    "title": "Fossil hunters find a new dinosaur track site on South Africa’s coast - the youngest so far",
    "desc": "Dinosaur tracks from the Cretaceous period have been found in South Africa for only the second time.",
    "image": "https://images.theconversation.com/files/714618/original/file-20260127-76-k8vo4r.jpeg?ixlib=rb-4.1.0&rect=0%2C661%2C3949%2C1974&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "MEDIA ALERT: Pokémon Trading Card Game: Mega Evolution-Ascended Heroes Available Now, Featuring New Mega Evolution Pokémon",
    "desc": "Press releases and assets from across the games industry - screenshots, videos, logos, packshots, artwork, PR contacts, release dates",
    "image": "https://imgeucdn.gamespress.com/cdn/files/Pokemon/2024/03/220834-c067d7c6/Pokemon_TCG_Scarlet_Violet—Temporal_Forces_Logo.png?w=360&mode=max&otf=y&quality=90&format=png&bgcolor=transparent&sky=0884093af3146c58011115330426a9604ae4de3951db565924b794b24129c522",
    "source": "Games Press"
  },
  {
    "title": "Krystel Go on real life relationship with 'I'mPerfect' co-star Earl Amaba: 'Clingy siya sa akin'",
    "desc": "How is the relationship of Krystel Go with her “I’mPerfect” co-star Earl Amaba behind the cameras?",
    "image": "https://images.gmanews.tv/webpics/2026/01/krystel_2026_01_30_17_07_44.jpg",
    "source": "GMA Network"
  },
  {
    "title": "US military destroyer docks at Israel's Eilat port, Israeli media reports",
    "desc": "Read more about US military destroyer docks at Israel's Eilat port, Israeli media reports on Devdiscourse",
    "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/imagegallery/03_03_2020_19_06_33_8443168.jpg?width=920&format=jpeg",
    "source": "Devdiscourse"
  },
  {
    "title": "Jeep 2.0 Strategy Reaffirms Brand’s Long-term Commitment to India",
    "desc": "Jeep has announced its India and Asia Pacific strategic roadmap under Jeep 2.0, reinforcing the brand’s long-term commitment to the region with India at its core.",
    "image": "https://imgd.aeplcdn.com/642x336/n/cw/ec/216827/exterior-grille.webp?isig=0&art=1&q=80",
    "source": "CarWale"
  },
  {
    "title": "BMA says over 26,000 people attempted to enter SA illegally during the festive season",
    "desc": "The BMA and the Department of Home Affairs delivered their festive season report.",
    "image": "https://media-cache.primedia-service.com/media/n3kima4d/screenshot-2024-04-01-163206.png?width=1200&height=630",
    "source": "EWN"
  },
  {
    "title": "Boy, 13, mauled to death by shark near popular beach as beast 'almost ate entire leg'",
    "desc": "Deivson Rocha Dantas, a thirteen-year-old boy, has been killed in a horror shark attack while playing with his friends at a popular beach in Brazil as his cousin watched on",
    "image": "https://i2-prod.dailystar.co.uk/incoming/article36640861.ece/ALTERNATES/s1200/0_Deivson-Rocha-Dantas.jpg",
    "source": "Daily Star"
  },
  {
    "title": "Pep Guardiola misses Man City press conference as Pep Lijnders replaces him",
    "desc": "Manchester City manager Pep Guardiola will not be fulfilling his usual media duties before Tottenham as his assistant fills in",
    "image": "https://i2-prod.manchestereveningnews.co.uk/article32945854.ece/ALTERNATES/s1200/0_GettyImages-2247918729.jpg",
    "source": "manchestereveningnews.co.uk"
  },
  {
    "title": "House ethics panel to reopen case vs Kiko Barzaga on Feb. 3",
    "desc": "The House committee on ethics and privileges will reopen the case against suspended Cavite 4th District Rep. Francisco “Kiko” Barzaga on Tuesday, February 3, panel chairperson and 4PS Party-list Rep. JC Abalos said Friday.",
    "image": "https://images.gmanews.tv/webpics/2025/09/rep_kiko_barzaga_2025_09_10_18_38_53.GIF",
    "source": "GMA Network"
  },
  {
    "title": "Prisons Commissioner General urges safer security protocols, calls for financial literacy",
    "desc": "The Commissioner General also called for the registration of inmates at all prison stations under SHA",
    "image": "https://cdn.radioafrica.digital/image/2026/01/b2020ce6-cda8-4bb7-b797-12c7e924bfa9.jpeg?1769777250717",
    "source": "the-star.co.ke"
  }
]