[
  {
    "title": "MelGeek Debuts Horus with PAW3950 Sensor and True 8000Hz Wireless Polling",
    "desc": "MelGeek has officially entered the gaming mouse market with the Horus Lightweight Esports Gaming Mouse, signaling a technically focused expansion following the brand's recent innovations in mechanical keyboard design.\nWeighing approximately 49 grams, the mouse maintains structural rigidity witho...",
    "image": "https://www.techpowerup.com/img/hAmQyRUNJaOFtFQ6.jpg",
    "source": "TechPowerUp"
  },
  {
    "title": "Binastra’s latest data centre contract lifts order book to RM7bil",
    "desc": "Construction firm clinches a RM503 million contract to build a data centre in Kuala Lumpur, its sixth data centre-related project.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/c51bee73-binastra-logo-050226-1.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Peter Siddle: Ex-Australia international joins Notts Outlaws at the age of 41",
    "desc": "Former Australia pace bowler Peter Siddle joins Notts Outlaws at the age of 41 for this year's T20 Blast campaign.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/1246/live/7a5a6880-0284-11f1-989a-85fdf979a556.jpg",
    "source": "BBC"
  },
  {
    "title": "WBD, HBO, Theatrical, Home Video Windows",
    "desc": "David Ellison committed to HBO, theatrical and home video windows in a UK open letter in the battle for Warner Bros. Discovery, warning of Netflix.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2025/08/GettyImages-1258470450.jpg?w=1440&h=810&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "Neon Doctrine co-founders return with new developer services firm Goldpact Goblins",
    "desc": "Offering \"clever, practical, and inventive strategies\" for small and midsize devs, with no rev share",
    "image": "https://assetsio.gnwcdn.com/Full-Contained-KeyArt.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "source": "GamesIndustry.biz"
  },
  {
    "title": "A Namib Desert beetle runs to stay cool",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% The Namib Desert can be extremely hot with the surface temperature reaching over 50°C.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/Ants.jpg",
    "source": "The Namibian -"
  },
  {
    "title": "Autism rates between girls and boys challenged by new study",
    "desc": "Previous work on gender and autism estimated higher autism rates in boys and men, but this latest research suggests that may not be true",
    "image": "https://e3.365dm.com/26/02/1600x900/skynews-classroom-teaching_7156196.jpg?20260205103147",
    "source": "Sky News"
  },
  {
    "title": "No kids will be rejected, says Fadhlina on six-year-olds at Year One intake",
    "desc": "KUALA LUMPUR: Schools are ready and have the capacity to handle the influx of six-year-olds entering Year One, says Fadhlina Sidek.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/05/3756202.JPG",
    "source": "thestar.com.my"
  },
  {
    "title": "MAKUENI WINS THE EMERGING TOURISM DESTINATION AWARD.",
    "desc": "Makueni County on Wednesday evening shone on the national stage after clinching the Emerging Tourism Destination award at the 2nd Annual Kenya Tourism Awards Gala, marking a landmark achievement that highlights the county’s rapid rise in the tourism sector. The award was received by Trade, Marketing, Industry, Culture and Tourism CECM Waziri Nicholas Nzioka alongside […]",
    "image": "https://makueni.go.ke/sandbox/site/files/2026/02/MAKUENI-WINS-THE-EMERGING-TOURISM-DESTINATION-AWARD.3.jpg",
    "source": "Government of Makueni County"
  },
  {
    "title": "Hirano Ayumu's fourth Games is his toughest challenge yet",
    "desc": "Discover how the Games's reigning men's snowboard halfpipe champion from Japan has his work cut out at Milano Cortina 2026. Can the three-time medallist pull it off?",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/z3wj2lth9im8vrwgazuh",
    "source": "Milano Cortina 2026"
  }
]