[
  {
    "title": "Another Optus tech 'issue' affects hundreds of thousands of customers",
    "desc": "Optus says an issue is affecting mobile services for some customers, who are seeing \"no service\" or \"SOS\" on their device.",
    "image": "https://live-production.wcms.abc-cdn.net.au/68fcf87a84ea3e8a05a244f86d8d3911?impolicy=wcms_watermark_news&cropH=3240&cropW=5760&xPos=0&yPos=300&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Former Air NZ CEO tipped to lead major US grocer, reports",
    "desc": "Greg Foran was the chief executive officer of Air New Zealand from 2020 to 2025.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/greg-foran-pictured-in-2023-OW5TIUA3E5GKXKM5HETP2AXHTI.png?auth=abda7e810dbdc5d0fc04fbf9bc24c999aab1d15a6460358b0a4c2fecfcdffbc9&quality=70&width=600&height=315&focal=1112%2C405",
    "source": "1News"
  },
  {
    "title": "What Happens When Midwives Lead Abortion Care: Lessons from Sweden",
    "desc": "In Sweden, abortion is recognised as essential healthcare—built on decades of research and early innovation. More recently, reforms have enabled midwives to play a central role, making care safer, timelier, and more accessible.",
    "image": "https://internationalmidwives.org/wp-content/uploads/SMF9107-1.jpg",
    "source": "International Confederation of Midwives"
  },
  {
    "title": "Ancient Chinese medicine may hold the key to hair regrowth",
    "desc": "A centuries-old Chinese medicinal root is getting new scientific attention as a potential game-changer for common hair loss. Polygonum multiflorum, long believed to restore dark, healthy hair, appears to work on multiple fronts at once—blocking hair-shrinking hormones, protecting follicles from damage, activating natural regrowth signals, and boosting blood flow to the scalp.",
    "image": "https://www.sciencedaily.com/images/1920/baldness-hair-regrowth-before-after.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Global workwear giant sets up plant in Dar",
    "desc": "DAR ES SALAAM: IRELAND-BASED Portwest, a global leader in the design and manufacture of workwear and personal protective equipment (PPE), has invested 8.8 million US dollars to establish a new state-of-the-art manufacturing facility in Dar es Salaam. Operating under the name Afriport Apparel Limited, the plant is set to transform Tanzania into a regional export",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/Pesa-.webp",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Supreme Court Benches Depok Court Leaders Amid Land Dispute Bribery Probe",
    "desc": "Indonesia suspends two senior Depok judges after the KPK names them graft suspects over an alleged Rp 1 billion land dispute bribe.",
    "image": "https://img2.beritasatu.com/cache/jakartaglobe/960x620-w/2026/02/1770625434-960x540.webp",
    "source": "Jakarta Globe"
  },
  {
    "title": "Tiny particles reveal new clues about meteor behind Rajasthan's Ramgarh crater",
    "desc": "The Ramgarh crater is located near Ramgarh village in Baran district, southeastern Rajasthan, and is widely believed to be the result of an ancient impact.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/ramgarh-crater-09192957-16x9_0.jpg?VersionId=mp1qFRmibN5MkqZhowtu528sQBEEPMIA",
    "source": "India Today"
  },
  {
    "title": "Six Nations on road to perdition unless chastening Celtic wake-up call is heeded",
    "desc": "Championship risks becoming a two-tier affair as Ireland, Wales and Scotland all lose on the opening weekend for first time in 26 years",
    "image": "https://i.guim.co.uk/img/media/662331c79fdb195a132f3a52b5852cbe489cc346/112_441_2005_1604/master/2005.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2eb5c2d34ee2c6256dfde6673213a207",
    "source": "The Guardian"
  },
  {
    "title": "Protect your home, upgrade your space with PLDT Home Life’s Smart Home Starter Kit",
    "desc": "With way more modern and technologically advanced threats these days, smart home devices are a must when building a safer, more secure, and more convenient",
    "image": "https://dailyguardian.com.ph/wp-content/uploads/2026/02/Protect-your-home-upgrade-your-space-with-PLDT-Home-Lifes-Smart-Home-Starter-Kit-w.jpg",
    "source": "Daily Guardian"
  },
  {
    "title": "SolaDrive Supports Businesses That Rely on Fully Managed VPS Hosting",
    "desc": "Managed VPS hosting from SolaDrive keeps business systems reliable, secure, and supported with 24/7 monitoring, updates, and 100% uptime for peace of mind.",
    "image": "https://img.einnews.com/facebook/1048572/fully-managed-vps-hosting.jpeg",
    "source": "EIN Presswire"
  }
]