[
  {
    "title": "President Mahama's surprise praise stopped me from quitting acting - Dr Likee",
    "desc": "Popular Ghanaian comic actor Ebenezer Akwasi Antwi, widely recognised as Dr Likee, has revealed that an unexpected interaction with John Dramani Mahama convinced him to abandon plans to leave the entertainment industry.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/214/21432577.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Power supply largely restored after technical fault - Energy Ministry",
    "desc": "The Ministry of Energy and Green Transition has announced that power supply has been largely restored across several affected communities following the resolution of a technical fault that triggered outages in parts of Ghana’s power distribution...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/582/58253505.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Full fixtures for ICC Women’s T20 World Cup 2026 unveiled",
    "desc": "Twelve sides will compete in the 10th edition of the ICC Women’s T20 World Cup starting June 12.",
    "image": "https://images.icc-cricket.com/image/upload/t_ratio16_9-size20-webp/prd/sn7fpwu4lkd94lf7hfmz",
    "source": "ICC"
  },
  {
    "title": "Jeffrey Lim keeps the art of silverprint photography alive at Kanta Studio in GMBB",
    "desc": "Going through old family scrapbooks and photo albums is a tradition many of us grew up with, one gradually fading with time as smartphones take the place of cameras and print shops. While our metal rectangles equipped with a couple of hundred gigabytes of storage make it a breeze to store years’ worth of images, nothing quite compares to the experience of flipping through old photographs, catching glimpses of family gathered around dinner tables, friends connected at the hip and parents beaming ear to ear as children sporting graduation gowns cradle scrolls and plaques.",
    "image": "https://www.optionstheedge.com/sites/default/files/styles/banner/public/field/featured-image/2026/banner_pic.png?itok=-BN6QS2o",
    "source": "Options, The Edge"
  },
  {
    "title": "Iranian military helicopter crashes into fruit market, 4 dead: state media",
    "desc": "Helicopter came down in the city of Dorcheh, causing a fire that was put out by emergency services, the reports said.",
    "image": "https://i.dawn.com/large/2026/02/2413373047732cb.webp",
    "source": "Dawn"
  },
  {
    "title": "Women’s Rugby World Cup 2025 leaves powerful legacy as reports highlight positive impact on England and the global game",
    "desc": "In partnership with key partners and stakeholders, World Rugby has released two landmark publications – the Women’s Rugby World Cup 2025 Impact Report and the Impact Beyond 2025 Global Impact Report, presenting, for the first time, a unified and comprehensive picture of how the tournament has reshaped women’s rugby locally in England and globally across World Rugby’s 134 member unions and six regional associations.",
    "image": "https://resources.worldrugby-rims.pulselive.com/worldrugby/photo/2026/02/23/92f102ef-92fe-436b-a444-b6fe5c49e48c/RWC-2025-Impact-Report-Findings.png",
    "source": "rugbyworldcup.com"
  },
  {
    "title": "Football Bet of the Day: More goals in Madrid on Tuesday",
    "desc": "After making it four winners from my last five columns in Rome on Sunday, Tuesday’s Football Bet of the Day sees me focus on the second legs of the Champions",
    "image": "https://media.mrfixitstips.co.uk/main/2026/02/Football-Bet-of-the-Day.png",
    "source": "MrFixitsTips"
  },
  {
    "title": "PNP explores use of drones vs smuggling, operations in forested and coastal areas",
    "desc": "The Philippine National Police (PNP) is exploring the use of drones in enhancing maritime patrol against smuggling and other law enforcement operations in...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/24/81560.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Women’s T20 World Cup 2026: Bangladesh joins India, Pakistan in Group 1; ICC releases updated fixtures",
    "desc": "Bangladesh will be slotted alongside India and Pakistan in an explosive Group 1 as the International Cricket Council (ICC) on Tuesday announced the completed list of fixtures for the upcoming Women’s T20 World Cup 2026.",
    "image": "https://ss-i.thgim.com/public/incoming/ih8xjf/article70670516.ece/alternates/LANDSCAPE_1200/GettyImages-2179902518.jpg",
    "source": "Sportstar"
  },
  {
    "title": "Russia Is Executing Its Own Soldiers For Refusing Orders, Putin's Troops Say",
    "desc": "The horrifying revelations show the barbaric conditions the Russian army forces soldiers to work in.",
    "image": "https://s.yimg.com/os/en/huffpost_uk_744/6d5daf52967f9c20a419acb6b6a41afe",
    "source": "Yahoo News Canada"
  }
]