[
  {
    "title": "Gemini May Soon Let Users Bring Their ChatGPT History As Google Targets AI Switching Costs",
    "desc": "Google is experimenting with a feature for Gemini that could lower the friction for users moving over from rival AI chatbots.",
    "image": "https://techbuild.africa/wp-content/uploads/2026/02/Gemini-PNG.png",
    "source": "Tech Build Africa"
  },
  {
    "title": "UAE urges political solutions for Gaza and Iran, warns against new wars",
    "desc": "DUBAI: The United Arab Emirates has warned that stabilising Gaza requires simultaneous progress on Palestinian statehood and Israeli security, built through regional and international cooperation, saying that the same political urgency is...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-03/l_648766_020421_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Can men have menopause? Here’s what’s making you feel flat in February",
    "desc": "As many fall into a slump after New Year excitement, the drop in energy is not laziness but hormones and oestrogen levels",
    "image": "https://www.timeslive.co.za/resizer/v2/5PM263ZBUFJC7HUSACLDBOW6EQ.jpg?smart=true&auth=92652d5a3de87e372eaf4d583da97bcb0ccca7916cc518a51c1aa84481e2e2bb&width=1200&height=630",
    "source": "TimesLIVE"
  },
  {
    "title": "Jonas Adjetey completes transfer to VfL Wolfsburg after training with Totti Laryea",
    "desc": "Ghanaian defender Jonas Adjetey has joined VfL Wolfsburg after some days in Ghana during the Christmas holidays.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/558/55874133.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Organic chemist reveals if psyllium husk is a good dietary fibre; shares health benefits and ideal way to consume",
    "desc": "Dr Dan Gubler lists how incorporating psyllium husk in the diet improves overall health, but warns against consuming it without sufficient water.  | Health",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/03/550x309/Psyllium_husk_1770108017703_1770108017846.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "U.S. Carrier Abraham Lincoln Pulls Back to Southern Yemen, 1,400 km from Iran",
    "desc": "A knowledgeable military intelligence source has reported the repositioning of the U.S. Navy’s Abraham Lincoln carrier strike group to...",
    "image": "https://wanaen.com/wp-content/uploads/2026/01/1769763527146_copy_1200x800.webp",
    "source": "WANA News Agency"
  },
  {
    "title": "Africa Faces Rapid Sea-Level Rise Despite Minimal CO₂ Emissions (Report)",
    "desc": "Sea levels off African coasts have risen at a rate four times faster since 2010 than in the 1990s, driven mainly by ice-sheet melt.\nAbout 80% of the",
    "image": "https://www.ecofinagency.com/media/k2/items/cache/49c21b1aaf77334909249ed79d1dda9a_S.jpg",
    "source": "Ecofin Agency"
  },
  {
    "title": "Ethiopia, UK Sign Deals on Investment Reform and Green Energy",
    "desc": "Ethiopia and the UK signed two memorandums of understanding covering investment reform and green energy infrastructure.\nThe UK committed £17.5",
    "image": "https://www.ecofinagency.com/media/k2/items/cache/04337add03265f3b79f176813cb6a3d5_S.jpg",
    "source": "Ecofin Agency"
  },
  {
    "title": "Personal mobility scooters to be restricted to those with a medical need or above age 70 from June",
    "desc": "Come June, users of personal mobility scooters will face heightened regulations, including the need for a certificate of medical need and a reduction in their maximum speed on public paths, said Minister of State for Transport Baey Yam Keng in Parliament on Tuesday (Feb 3). \"Many of us have heard from residents who feel increasingly unsafe as larger, faster devices...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/baey_mddi.jpg?itok=S-vvBTzH",
    "source": "AsiaOne"
  },
  {
    "title": "Consumer Reports",
    "desc": "2025 came with some major failures, as Consumer Reports put out its “25 Worst Products” list. The list ranged from dishwashers to leaf blowers and many more.",
    "image": "https://www.brandsynario.com/wp-content/uploads/2026/02/consumer-reports-10-worst-appliances-of-2025.jpg",
    "source": "Brandsynario"
  }
]