[
  {
    "title": "Israel to scrap Friday classes, aligning schools with OECD five‑day week",
    "desc": "Finance Ministry launches a pilot to end Friday lessons in kindergartens and elementary schools, start the year on Aug. 15 and redirect 2 billion shekels to better-paid, higher-quality teachers in a bid to move from 'quantity to quality'",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/09/yk14674833/yk14674833_0_0_860_485_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "TNVS drivers earn more than minimum wage - study",
    "desc": "Transport network vehicle services (TNVS) riders and drivers receive above the mandated minimum wage in the Philippines, according to a recent study commissioned by the International Labor Organization (ILO).",
    "image": "https://media.philstar.com/photos/2020/06/01/ezgpcvou4aee7xo_2020-06-01_12-38-12.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Standard Chartered finance chief leaves for Apollo",
    "desc": "Diego De Giorgi was seen as in contention to succeed chief executive Bill Winters",
    "image": "https://images.ft.com/v3/image/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1cbb73d4-25bc-427a-809f-1550df4fad15.jpg?source=next-article&fit=scale-down&quality=highest&width=700&dpr=1",
    "source": "Financial Times"
  },
  {
    "title": "Anglo American has confirmed plans to exit De Beers",
    "desc": "Anglo American has confirmed plans to exit De Beers, triggering a $5bn bidding war.",
    "image": "https://europeanbusinessmagazine.com/wp-content/uploads/2026/02/dillon-wanner-LxAM5DiHWCo-unsplash-1024x683.jpg",
    "source": "European Business Magazine"
  },
  {
    "title": "Well-known pub in Enniscorthy placed up for sale",
    "desc": "A well-known pub in Enniscorthy, Co. Wexford, has been placed up for sale... Located across from Treacys Hotel, The Old House Pub has been vacant for a number of years and now offers significant potential for complete refurbishment and redevelopment, subject to the necessary consents. Wexford County Council erected a sign outside of the pub",
    "image": "https://wexfordweekly.com/wp-content/uploads/2026/02/old-house-1.jpg",
    "source": "Wexford Weekly"
  },
  {
    "title": "Tanzania unveils one of Africa’s largest CNG hubs to accelerate green transition",
    "desc": "The facility, launched by Puma Energy Tanzania, marks a decisive step in the nation’s journey toward clean, affordable, and reliable mobility",
    "image": "https://www.thecitizen.co.tz/resource/image/5354282/landscape_ratio3x2/1200/800/ea6bc454f4ae1d402154c43f39b3835c/To/cng-2.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Remittances Sent by Overseas Pakistanis Jump 15% to $3.5 Billion in January 2026",
    "desc": "Pakistan received $3.5 billion in overseas workers’ remittances in January 2026, showing a strong 15% year on year growth as compared with $3 billion",
    "image": "https://propakistani.pk/wp-content/uploads/2023/11/dollar.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Indonesia ready to collaborate with Pakistan in palm oil, agriculture, says minister",
    "desc": "Dar says visit comes after presidential exchanges as talks cover IT, trade, AI, defence cooperation",
    "image": "https://i.tribune.com.pk/media/images/indonesian-minister-of-investment-h-e-rosan-roesl1770704785-0/indonesian-minister-of-investment-h-e-rosan-roesl1770704785-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "The Clinical Value of Different Ultrasonographic Techniques in the Evaluation of Salivary Gland Involvement in Sjögren’s Syndrome",
    "desc": "Sjögren’s syndrome (SS) is an autoimmune disease that most commonly affects the salivary and lacrimal glands. At present, diagnosis mainly relies on salivary gland biopsy, which is an invasive and relatively complex procedure. In recent years, ultrasonography, as a noninvasive and convenient imaging modality, has been widely applied in the evaluation of salivary gland diseases. By assessing glandular parenchymal characteristics and blood flow distribution, ultrasonography enables evaluation of salivary gland involvement. This article reviews the clinical value of different ultrasonographic techniques in assessing salivary gland lesions in patients with SS from two aspects—parenchymal changes and vascular alterations—and discusses their prospects for clinical application.",
    "image": "https://file.scirp.org/image/jbm2024061816374557.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "The Case of Côte d’Ivoire",
    "desc": "Carbon neutrality, achieved by balancing anthropogenic GHG emissions and removals, offers a pathway to minimise climate impacts and foster a just transition to low-carbon economies. However, achieving carbon neutrality in West Africa requires an explicit integration of environmental-justice considerations that equitably distribute burdens and benefits among societal groups. Environmental justice demands that the burdens and benefits of transitioning towards carbon neutrality are equitably distributed among different societal groups. Historically, these countries have contributed minimally to global carbon emissions but often bear a disproportionate brunt of the consequences. Thus, any carbon neutrality efforts must prioritize addressing the needs and vulnerabilities of marginalized communities, ensuring that they are not further marginalized in the transition process. Côte d’Ivoire’s aspirations for economic growth and poverty alleviation are juxtaposed with the global imperative of carbon neutrality, necessitating a thorough analysis of justice considerations within its unique social, economic, and environmental landscape. Côte d’Ivoire stands at a crossroads, striving to balance substantial carbon emissions arising from sectors like energy, agriculture, deforestation, with its commitment to social equity and environmental. The concept of carbon neutrality offers a potential solution, though it requires careful scrutiny to ensure that benefits and burdens are equitably shared in the Society. Achieving carbon neutrality entails protecting and restoring these ecosystems, which is closely tied to the well-being of indigenous and local communities. Justice considerations require their active participation and inclusion in forest management. Côte d’Ivoire is already experiencing climate change impacts, such as sea-level rise and erratic weather patterns. Just transition strategies should encompass climate adaptation efforts that safeguard vulnerable communities and promote resilience, particularly among women and marginalized group. Achieving carbon neutrality necessitates international collaboration and financial support. Ensuring justice in this context involves advocating for fair climate financing mechanisms that prioritize the needs of developing countries like Côte d’Ivoire. The case of Côte d’Ivoire exemplifies the intricate interplay between carbon neutrality and justice within the specific dynamics of a West African nation. This study examines the intricate relationship between carbon neutrality justice in the specific context of Côte d’Ivoire, an African country facing the dual challenges of sustainable development and climate change. To reach this goal, we are going to base our analysis on juridical, economic and social approaches.",
    "image": "https://file.scirp.org/image/oalibj2016030109584288.jpg",
    "source": "SCIRP Open Access"
  }
]