[
  {
    "title": "AI music generator Suno hits 2M paid subscribers and $300M in annual recurring revenue",
    "desc": "Suno lets users create music using natural language prompts, making it possible for people with little experience to generate audio with little effort.",
    "image": "https://techcrunch.com/wp-content/uploads/2025/06/GettyImages-2159558534.jpg?resize=1200,837",
    "source": "TechCrunch"
  },
  {
    "title": "263 Nigerians repatriated from Niger as FG intensifies voluntary return drive",
    "desc": "No fewer than 263 stranded Nigerians have returned home from Agadez in the Niger Republic, landing at the Malam Aminu Kano Int'l Airport...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2024/12/Japa-.webp",
    "source": "Businessday NG"
  },
  {
    "title": "Here’s Pakistan’s Final Qualification Scenario for T20 World Cup Semi-Final",
    "desc": "Pakistan’s T20 World Cup 2026 campaign has come down to a simple objective, defeat Sri Lanka by a heavy margin. After England’s four-wicket win over New",
    "image": "https://propakistani.pk/wp-content/uploads/2026/02/Pakistan-1.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Pokémon turns 30 - how the fictional pocket monsters shaped science",
    "desc": "The Japanese media sensation has inspired generations of researchers in fields as diverse as evolution, biodiversity and research integrity.",
    "image": "https://media.nature.com/lw1200/magazine-assets/d41586-026-00441-y/d41586-026-00441-y_52128540.jpg",
    "source": "Nature"
  },
  {
    "title": "Why PDP still bigger than coalition - Gov Bala Mohammed speaks after meeting Tinubu",
    "desc": "The Bauchi State Governor, Bala Mohammed has said that the performance of the Peoples Democratic Party, PDP in the recently concluded council elections in",
    "image": "https://dailypost.ng/wp-content/uploads/2025/12/Bala-Mohammed-1-1.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Former Kerry garda station sold for €200,000 at auction",
    "desc": "The former garda station in Brosna was sold for €200,000 at an online auction yesterday, 13 years and one month after it closed for good.",
    "image": "https://img.resized.co/radiokerry-ie/eyJkYXRhIjoie1widXJsXCI6XCJodHRwOlxcXC9cXFwvaW1nLnJhZGlva2VycnkuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcL0Jyb3NuYS1zdGF0aW9uLmpwZ1wiLFwid2lkdGhcIjoxMjAwLFwiaGVpZ2h0XCI6NjI3LFwiZGVmYXVsdFwiOlwiaHR0cHM6XFxcL1xcXC93d3cucmFkaW9rZXJyeS5pZVxcXC9pbWFnZXNcXFwvbm8taW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6ImVlMmNhYjdlYTkzYTYxZTZiMDY2Mzc4Y2NlNzcwZmExMmViOWExOGIifQ==/former-kerry-garda-station-sold-for-200-000-at-auction.jpg",
    "source": "Radio Kerry"
  },
  {
    "title": "ECDE weaknesses threaten learning gains, Bitok tells Senators",
    "desc": "“An unhappy teacher cannot nurture a child’s mind. We must harmonise schemes of service,\" the PS said.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/7d74079a-f833-4f74-97d0-c30025a79378.jpg?1772216882072",
    "source": "the-star.co.ke"
  },
  {
    "title": "2026 UN SaferGuard Regional Training for Women Ammunition Technical Experts in Africa on the International Ammunition Technical Guidelines",
    "desc": "From 12 to 23 January 2026, the United Nations Office for Disarmament Affairs (UNODA), in collaboration with the Austrian Ministry of Defence and the Ammunition Management Advisory Team (AMAT), with substantive contribution from the Small Arms Survey, successfully hosted the 2026 UN SaferGuard Regional Training for Women Ammunition Technical Experts in Africa on the International Ammunition Technical Guidelines (IATG).",
    "image": "https://disarmament.unoda.org/themes/custom/unoda_disarmament/favicon.ico",
    "source": "United Nations Office for Disarmament Affairs (UNODA)"
  },
  {
    "title": "Natural Gas Prices Torn between Withdrawal Report and Winter Weather Forecasts",
    "desc": "Gas rates are holding steady in the LNG market as the price is pulled between withdrawal reports and cold weather forecasts.",
    "image": "https://dr46azxe5rdcu.cloudfront.net/wp-content/uploads/2026/02/27171144/QxaxO13QXNZIA4QtEhqq-0-qxvbp-1.jpg",
    "source": "FXLeaders"
  },
  {
    "title": "India, EU agree on 5-year Most Favoured Nation status, shows draft trade deal",
    "desc": "India and the EU will implement a free trade agreement that cuts tariffs on key goods and grants duty-free access to most Indian exports. The deal will also link a market of two billion people.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/as-per-an-official-statement--bilateral-merchandise-trade-between-india-and-the-eu-amounted-to-136-27005223-16x9.png?VersionId=g_wU1K1c3fDzwNwf4UlzMgSnnwNDcxje",
    "source": "India Today"
  }
]