[
  {
    "title": "LIV Golf Riyadh: Rookie Elvis Smylie Edges Jon Rahm by 1 in 1st LIV Golf Start",
    "desc": "Ripper GC rookie Elvis Smylie held off a hard-charging Jon Rahm to claim victory at LIV Golf Riyadh in his first LIV Golf start.",
    "image": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2026/02/1408/814/elvis1.jpg?ve=1&tl=1",
    "source": "FOX Sports"
  },
  {
    "title": "March 26, 2026 Prediction Moves Into Focus as Starlink IPO Nears",
    "desc": "James Altucher opens his new video presentation by introducing a company he says is tied to Starlink’s upcoming IPO.",
    "image": "https://cdn4.premiumread.com/?url=https://www.manilatimes.net/theme_manilatimes/images/TMT_1920x1008.jpg&w=1920&q=100&f=webp&v=1",
    "source": "The Manila Times"
  },
  {
    "title": "One Dietary Supplement Was Found to Reduce Aggression by Up to 28%",
    "desc": "Keep calm and try omega-3.",
    "image": "https://www.sciencealert.com/images/2025/11/angryman_supplements_header.jpg",
    "source": "ScienceAlert"
  },
  {
    "title": "Foreign Office to review Mandelson's US ambassador pay-off",
    "desc": "A pay-off given to Lord Mandelson after he was sacked as ambassador to the US is being reviewed, Foreign Office sources tell the BBC.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/cdfe/live/1e366460-0472-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  },
  {
    "title": "Jiuceng Art Gallery in Songyang, Zhejiang: Why visit",
    "desc": "A standout in Shanlong Village, Songyang: Jiuceng blends vernacular materials, mountain views and contemporary galleries – ideal for a weekend escape.",
    "image": "https://dam.mediacorp.sg/image/upload/s--0wasaFJx--/c_crop,h_1125,w_2000,x_0,y_438/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/04/jiuceng-art-gallery-songyang-shanlong-village-zhejiang.jpg?itok=lguHzxUW",
    "source": "CNA Luxury"
  },
  {
    "title": "Highlights from Saturday at the Olympic Winter Games Milano Cortina 2026",
    "desc": "Italy's Olympic campaign got off to a flying start with three medals: one gold, one silver, and one bronze.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/o8xvfma5xa0llwt4uid8",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Sylvan residents encouraged to \"Get Fit in February\"",
    "desc": "Residents are being encouraged to stay active during the winter months as the Town of Sylvan Lake launches its February Fitness Challenge at the NexSource Centre. The Recreation team is inviting community members to take part in a month-long series of activities designed to improve physical fitness and promote healthy lifestyles. The challenge runs until Feb. 28, 2026, and is open to participants of all fitness levels. One of the featured activities is the “Lap the Lake” challenge, which invites participants to race the equivalent distance around Sylvan Lake by swimming laps in the pool. Swimmers can track their progress toward the 35-kilometre distance and compare results with NexSource Centre lifeguards for bragging rights and a chance to win prizes. Distances will be recorded at the NexSource Centre reception. googletag.cmd.push(function() { if($(document).width()<900) { s = googletag.defineSlot('/50748803/lol-all-bigbox', [300, 250], 'div-gpt-1639495237215-bbm1'); s.setTargeting('URL', [window.location.pathname]); s.setTargeting('position', [1639495237215]) s.setTargeting('story_id', 'sylvan-residents-encouraged-to-get-fit-in-february'); s.addService(googletag.pubads()); googletag.pubads().refresh([s], {changeCorrelator: false}); } }); Participants can also take part in a Fitness Bingo Challenge, which encourages individuals to try a variety of activities. Those who complete their bingo card can enter a draw for prizes. In addition, the NexSource Centre is offering a range of drop-in activities and fitness classes throughout the month, providing options for residents who prefer alternatives to swimming or who are looking to explore new ways to stay active. Town officials say the February Fitness Challenge is intended to be a fun, community-focused initiative that helps residents remain active during the winter while offering a safe and motivating environment. The program aims to encourage physical activity, foster community participation, and help residents track their progress while staying motivated throughout February. googletag.cmd.push(function() { if($(document).width()<900) { s = googletag.defineSlot('/50748803/lol-all-bigbox', [300, 250], 'div-gpt-1639495237215-bbm2'); s.setTargeting('URL', [window.location.pathname]); s.setTargeting('position', [1639495237215]) s.setTargeting('story_id', 'sylvan-residents-encouraged-to-get-fit-in-february'); s.addService(googletag.pubads()); googletag.pubads().refresh([s], {changeCorrelator: false}); } }); **With information provided by The Town of Sylvan Lake Sign up to get the latest local news headlines delivered directly to your inbox every afternoon. Send your news tips, story ideas, pictures, and videos to news@centralalbertaonline.com. CentralAlbertaOnline encourages you to get your news directly from your trusted source by bookmarking this page and downloading the CentralAlbertaOnline app",
    "image": "https://dht7q8fif4gks.cloudfront.net/2026-02/nexsource.jpg",
    "source": "centralalbertaonline.com"
  },
  {
    "title": "After Close Friends, WhatsApp is now testing Custom Lists for status updates",
    "desc": "It's similar to the custom privacy control Facebook offers. Instagram introduced the Close Friends feature for Instagram Stories back in November 2018, and...",
    "image": "https://fdn.gsmarena.com/imgroot/news/26/02/whatsapp-custom-lists-status-update-development/-952x498w6/gsmarena_001.jpg",
    "source": "GSMArena.com"
  },
  {
    "title": "Botswana apologises to Bridgette Motsepe over terrorism and money laundering claims",
    "desc": "Botswana’s president, advocate Duma Boko, has ordered his government to issue an apology to powerful businesswoman Bridgette Motsepe over “false and reckless” allegations she had engaged in money laundering and terrorism financing.",
    "image": "https://www.sundaytimes.timeslive.co.za/resizer/v2/4PHTSVJF6BISXF3PKIBHNB7QSA.png?smart=true&auth=1efeab82cbca8fa1f2e0272346a52324c95e263a1f00d573d72d9851e4c5afd8&width=1200&height=630",
    "source": "TimesLIVE"
  },
  {
    "title": "Thousands Of Passengers Stranded In Asia As Japan, Korean, Singapore, ANA, AirAsia, Lion Air, and Other Airlines Cancel 143 and Delay 3,909 Flights Across Thailand, Singapore, Japan, South Korea, Indo",
    "desc": "Thousands of travelers were grounded in Asia today as over 4,050 flight cancellations and delays hit Tokyo, Singapore, Bangkok, Jakarta, Hong Kong, Seoul, more.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/AI-Generated-Image-512.jpg",
    "source": "Travel And Tour World"
  }
]