[
  {
    "title": "Winter Olympics 2026: Why Team GB are so good at skeleton",
    "desc": "No ice track, and yet the most successful nation in Olympic skeleton history - how Great Britain became a skeleton giant.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f547/live/4ad859a0-0937-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Why Pam Bondi and Jeanine Pirro can’t stop embarrassing themselves.",
    "desc": "Pam Bondi is a captive to the “audience of one.” The nation is too.",
    "image": "https://compote.slate.com/images/2c48150e-47c2-42d9-b2ac-1d83119f86c8.jpeg?crop=1560%2C1041%2Cx0%2Cy0&width=1560",
    "source": "Slate"
  },
  {
    "title": "Kenya’s Ezra Kering wins the 2026 Lagos City Marathon",
    "desc": "Kenya's Ezra Kering and Ethiopia's Meseret Dinke emerged as winners in the 2026 Access Bank Lagos City Marathon. See full results and top finishers.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/14114009/race.jpeg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Starmer and Reeves supported paedophile Labour councillor who sent naked pics to girl, 13",
    "desc": "The councillor believed he was speaking to a 13-year-old girl when he asked to see her in school uniform and whether she was 'home alone'.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/139/1200x630/6741823.jpg",
    "source": "Daily Express"
  },
  {
    "title": "Ernest Rubondo's Decade of Stewardship that Positioned Uganda for First Oil",
    "desc": "After ten years at the helm of the Petroleum Authority of Uganda (PAU), Ernest Rubondo, the institutional architect of Uganda’s oil sector, will step down in August 2026 when his contract expires, closing a defining chapter in Uganda’s oil and gas development. The Authority advertised the chief executive position in December 2025, with applications closing […]",
    "image": "https://softpower.ug/wp-content/uploads/2026/02/Rubondo-Ernest-670x560-1-e1771065456469.jpg",
    "source": "SoftPower News"
  },
  {
    "title": "MACC report filed over RM214mil fibre optic project",
    "desc": "The Telekom Malaysia Bhd project is said to have been awarded to the vendor through direct negotiation.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2024/03/c8e3bc39-1_sprm_macc_logo_fmt_140324.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "'It's pressure' - Semenyo speaks on Man City’s title race with Arsenal",
    "desc": "Ghanaian forward Antoine Semenyo has described the Premier League title race between Manchester City and Arsenal as a tense moment.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/366/36621669.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Malavika Mohanan clears air on stunt double row around Prabhas' The Raja Saab",
    "desc": "Malavika Mohanan has explained her use of a stunt double in The Raja Saab following online discussion sparked by behind-the-scenes images. She shared her perspective and experience with action scenes, providing insight into standard safety practices on film sets.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/malavika-mohanan-232127582-16x9.jpg?VersionId=bS1qAGaBWmjyGhO_aNhaMU8WyxZbDCMx",
    "source": "India Today"
  },
  {
    "title": "Honor's Pad X8b Debuts Quietly With 10,100 mAh Battery",
    "desc": "The Honor Pad X8 was introduced in 2022, and three and a half years later, Honor has quietly released its successor, the Honor Pad X8b, in Saudi Arabia.",
    "image": "https://propakistani.pk/wp-content/uploads/2026/02/Honor-Pad-X8b-1.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "A dual respiratory and auditory function for the coelacanth lung",
    "desc": "Since the discovery of Latimeria chalumnae, coelacanths have provided a critical comparative framework for reconstructing ancestral sarcopterygian anatomy. However, the function of several anatomical features in both extant and fossil coelacanths remains unresolved. Among these, the presence of large ossified chambers in the body cavity of fossil coelacanths has remained enigmatic, with different studies proposing respiratory or auditory functions. Here, we examine lung and inner ear anatomy based on new observations from synchrotron phase-contrast microCT scans of two 240-million-year-old latimerioid coelacanths, alongside multiple developmental stages of the extant L. chalumnae. These data, combined with archival histological sections of L. chalumnae and 3D reconstructions of a Devonian coelacanth, suggest that extinct coelacanths possessed an ossified lung capable of transmitting sound pressure to auditory sensory epithelia in the inner ear via a perilymphatic system. We propose that the lung of extinct coelacanths supported both respiratory and auditory functions. Synchrotron imaging of fossil and extant coelacanths reveals that the lung of extinct species likely served both respiratory and auditory functions, transmitting sound pressure to the inner ear via a specialized perilymphatic system",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  }
]