[
  {
    "title": "NCAA: Judiel Nitura-led Letran stays perfect with rout of San Sebastian",
    "desc": "Judiel Nitura shone from start to finish to help Colegio de San Juan de Letran dominate San Sebastian College-Recoletos, 26-24, 25-22, 25-17, and remain unscathed in NCAA Season 101 women's volleyball.",
    "image": "https://images.gmanews.tv/webpics/2026/02/7_2026_02_15_17_40_50.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Feng Shui artist ushers in Year of the Fire Horse with solo exhibit",
    "desc": "A recognized Feng Shui artist, Uychaco produces artworks that stand out for their authenticity — rooted in her Chinese-Filipino heritage and brought to life through a masterful use of mixed media.",
    "image": "https://media.philstar.com/photos/2026/02/15/story-2-photo-3-img1916jpeg_2026-02-15_17-41-23.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "'Emily Saw a Door': Learning to create spaces for each other with creativity, acceptance",
    "desc": "A story that encourages and empowers children to find the right place for them, or even to create their own. When Prof.",
    "image": "https://s.yimg.com/os/en/jerusalem_post_articles_818/dad257e3e5a30fbaaa28ea7459c966c5",
    "source": "Yahoo"
  },
  {
    "title": "Scrutinise banks’ performance amid governance reforms",
    "desc": "John Awuah, Chief Executive Officer of the Ghana Association of Banks, has advised depositors to utilise the Corporate Governance Directive Disclosure",
    "image": "https://citinewsroom.com/wp-content/uploads/2026/02/CEO-Mr-John-Awuah.jpg",
    "source": "CitiNewsroom.com"
  },
  {
    "title": "The Accra Reset Initiative: Reaffirming Ghana’s Leadership and Africa’s Agency in a Changing World.",
    "desc": "The Accra Reset Initiative, championed by the President of the Republic of Ghana, John Dramani Mahama, stands as a timely and profound statement of renewal, one that speaks not only to Ghana’s national aspirations but also to Africa’s collective future.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/President-JOhn-Mahama.jpeg",
    "source": "MyJoyOnline"
  },
  {
    "title": "PRC opens board exam applications for overseas workers",
    "desc": "OVERSEAS Filipino workers (OFWs) seeking to become licensed professionals may apply for the Special Professional Licensure Examinations (SPLEs)...",
    "image": "https://media.assettype.com/sunstar%2F2023-10%2F810b005f-9a00-4909-84b3-f4d4d935e349%2FPRC__1_.jpg?rect=0%2C15%2C800%2C420&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "SunStar Publishing Inc."
  },
  {
    "title": "Iran open to compromises to reach nuclear deal with U.S.: BBC",
    "desc": "Iran has said it is prepared to discuss curbs on its nuclear program in return for the lifting of sanctions.",
    "image": "https://image.cnbcfm.com/api/v1/image/108265927-1771146873921-gettyimages-2199541855-AFP_36Y32QG.jpeg?v=1771146887&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "'If he takes over, the better for everybody' - Speaker Bagbin endorses Bernard Ahiafor",
    "desc": "The Speaker of Parliament, Alban Bagbin, has expressed strong confidence in his First Deputy Speaker, Bernard Ahiafor, stating that the country and Parliament would greatly benefit if he succeeds him in office.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/194/19439966.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Transcript: Alvaro Arbeloa Happy for Fans After Real Madrid's Win vs Real Sociedad",
    "desc": "Head coach Alvaro Arbeloa spoke to the media after Real Madrid's excellent 4-1 win over Real Sociedad in La Liga.",
    "image": "https://images2.minutemediacdn.com/image/upload/c_crop,x_607,y_0,w_3939,h_2215/c_fill,w_1440,ar_1440:810,f_auto,q_auto,g_auto/images/voltaxMediaLibrary/mmsport/real_madrid_cf_on_si/01kgagvsg6p26tcq51vh.jpg",
    "source": "Sports Illustrated"
  },
  {
    "title": "All the Sheffield Shield squads for round eight",
    "desc": "Bird set to take flight for milestone match as the finals race heats up",
    "image": "https://resources.cricket-australia.pulselive.com/cricket-australia/photo/2026/02/15/cc1a5db3-a447-4523-ae82-c5d5a1bbb6fc/shield-squads-round-8.jpg",
    "source": "cricket.com.au"
  }
]