[
  {
    "title": "As Tharoor meets Rahul and Kharge for 2 hours, what happened behind closed doors?",
    "desc": "Meeting comes against backdrop of Tharoor skipping key meeting last week; sources say he conveyed his displeasure about a recent incident, was assured he is crucial to Congress.",
    "image": "https://images.indianexpress.com/2026/01/Photo-2026-01-29T141514.799.jpg",
    "source": "The Indian Express"
  },
  {
    "title": "‘Everybody counts’: how squad depth is becoming crucial in the WSL title race",
    "desc": "Manchester City’s ability to rotate players has been central to opening up a nine-point lead over the defending champions Chelsea",
    "image": "https://i.guim.co.uk/img/media/c4cb26fb1ee7e336ea37250385038935a1a75aa5/329_394_3042_2434/master/3042.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=72bea88c5d4bd3fd41aee1081ad16113",
    "source": "The Guardian"
  },
  {
    "title": "PropertyLimBrothers saga: Melvin Lim, Grayce Tan step down from leadership roles at second firm",
    "desc": "PropertyLimBrothers co-founder Melvin Lim and Grayce Tan have stepped down from leadership roles at KW Singapore amidst industry speculation. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/5accb2ec7bae3a56157467acdcb2911a0ad26228d915385d514f1453eb4f200c",
    "source": "The Straits Times"
  },
  {
    "title": "GOG Under Fire From Customers and Even One of Its Own Employees After Users Call Out 'Fully AI' Sale Image",
    "desc": "\"Continue speaking up...\"",
    "image": "https://sm.ign.com/t/ign_ap/news/g/gog-under-/gog-under-fire-from-customers-and-even-one-of-its-own-employ_1g1q.1200.jpg",
    "source": "IGN Southeast Asia"
  },
  {
    "title": "Solly McLeod, Robyn Malcolm, Katie Leung and Richard Roxburgh lead new thriller series Careless",
    "desc": "The thriller is currently filming in Glasgow and Sydney, Australia.",
    "image": "https://www.screen.scot/binaries/content/gallery/screenscot/filming-in-scotland/tv/careless/careless-header-16x9.jpg",
    "source": "Screen Scotland"
  },
  {
    "title": "Zimbabwe: Harare Duo in Court Over Whatsapp Hijacking Scam",
    "desc": "Two Harare men appeared in court for allegedly hacking Artemis Herbal Centre (Pvt) Limited's WhatsApp groups to seize administrative control and falsely advertise services such as forex trading, commodity broking, and property evaluations all of which fall outside the company's actual line of business.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Kristen Stewart Will Likely Leave US Because of Donald Trump",
    "desc": "Kristen Stewart recently revealed that she might consider leaving the United States if President Donald Trump continues imposing harsh tariffs on films made outside the country. She said the situation makes it difficult for her to work freely in the U.S., and she hopes to continue making films in Europe. While she acknowledges that things […] The post Kristen Stewart Will Likely Leave US Because of Donald Trump appeared first on Mandatory.",
    "image": "https://s.yimg.com/os/en/mandatory_995/593821f05074dec2cad6dda5f41be331",
    "source": "Yahoo"
  },
  {
    "title": "Finding a way out of the hell of the bottle: Waterford man shares his experience of alcoholism",
    "desc": "Looking around the room at his first meeting, he couldn’t believe that people who had been in the same position as him were now holding down jobs and ...",
    "image": "https://www.waterford-news.ie/cms_media/module_img/7662/3831279_6_articledetail_iStock-1423389956.jpg",
    "source": "waterford-news.ie"
  },
  {
    "title": "Tanzania invites Korean investors to boost the mining sector",
    "desc": "DODOMA: THE Tanzanian government has welcomed South Korean companies to invest in the country’s mining sector, opening the door to partnerships in mineral exploration, value addition, and modern extraction and processing technologies, particularly for strategic and critical minerals. The announcement was made in Dodoma by the Deputy Secretary General of the Ministry of Minerals, Msafiri",
    "image": "https://dailynews.co.tz/wp-content/uploads/2022/07/favicon.ico",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Post your questions for the Cardigans’ Nina Persson",
    "desc": "As the Cardigans go back on the road, their frontwoman will answer your questions on her remarkably varied career",
    "image": "https://i.guim.co.uk/img/media/6d445e0aa4087ef612fd4fcc7558e56a1a365196/295_1711_4975_3978/master/4975.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=de75444d0175a90f1fec43021124e65e",
    "source": "The Guardian"
  }
]