[
  {
    "title": "CS Duale urges counties to resolve bank account issues for SHA rollout",
    "desc": "CS Duale urged counties to fully implement the Facility Improvement Act, stressing that facility revenue should add to, not replace, their equitable allocation.",
    "image": "https://publish.eastleighvoice.co.ke/mugera_lock/uploads/2026/02/HA89cAgXQAAYaEu.jpeg",
    "source": "The Eastleigh Voice"
  },
  {
    "title": "BNP Celebrates Landslide Win in Bangladesh Election",
    "desc": "The Bangladesh Nationalist Party (BNP) has won a landslide victory in the recent election, with Tarique Rahman set to become prime minister.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/13111754/AFP__20260213__97C43GB__v1__MidRes__BangladeshPoliticsVote-1200x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Road to Sports Club Villa Elections: Aspiring presidential candidate Meywa set to launch manifesto",
    "desc": "Sports Club Villa is expected to conduct an elective assembly this year (exact date will be confirmed).",
    "image": "https://kawowo.com/wp-content/uploads/2025/09/Farouk-Meywa.jpg",
    "source": "Kawowo Sports"
  },
  {
    "title": "Singer takes on the spirit of the 80s for latest creation",
    "desc": "New restored 911 gets a host of mechanical upgrades.",
    "image": "https://www.irishnews.com/resizer/v2/AHCVQ57RLVK4DNZMGSKLPZNAWQ.jpg?smart=true&auth=2715becc3c44dea264df9db057ba70c4be6646b3f100c7895600398e421c3c7f&width=1200&height=630",
    "source": "The Irish News"
  },
  {
    "title": "The Fujifilm Instax Pal is a tiny compact camera with digicam vibes - and for $28, Walmart is practically giving it away!",
    "desc": "The Fujifilm Instax Pal mixes the compact camera trend with that lo-fi look – and it's heavily discounted right now",
    "image": "https://cdn.mos.cms.futurecdn.net/nQaZ6SN54QiRX8bknhHWNN-2560-80.jpg",
    "source": "Digital Camera World"
  },
  {
    "title": "Tanzania: GCCTC Advocates Inclusive Climate Decision-Making",
    "desc": "THE Coordinator of the Gender and Climate Change Tanzania Coalition (GCCTC), Maria Matui, has said the Climate Negotiations Guideline for Women and Youth will strengthen capacity building, improve coordination between the government and non-state actors, and promote inclusive climate decision-making.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Mattei Plan, in Addis Ababa, the test of maturity",
    "desc": "In the analysis by Arturo Varvelli, head of ECFR’s Rome office, and Kelly Petillo, ECFR programme manager for the Middle East and North Africa, the second Italy–Africa Summit is a decisive test to consolidate the Mattei Plan and Rome’s leading role in Europe’s strategy toward the continent. Italy aims to demonstrate concrete results through cooperation based on co-creation and integrated with the EU’s Global Gateway. Central is also the link between development and security, without which investments risk remaining ineffective.",
    "image": "https://decode39.com/wp-content/uploads/2025/04/Imagoeconomica_2419840-scaled.jpg",
    "source": "Decode39"
  },
  {
    "title": "ECOWAS foreign minister has instructed me to provide fugu for all African foreign ministers - Ablakwa",
    "desc": "Minister of Foreign Affairs, Samuel Okudzeto Ablakwa, has announced an international campaign to promote Ghanaian fabrics, particularly fugu and kente, following what he describes as overwhelming global demand.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/626/62651850.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "ABT Panels hands over house built at Okahandja Park in two days",
    "desc": "CHRIS KAUKEMUA ABT Panels has handed over a two-bedroom house at Okahandja Park that was built in only two days. According to a statement issued on […]",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-13-at-11.36.47-1024x768.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "Summit CSO Consultative Meeting on Gender Mainstreaming in the African Union and Member States – ACCORD",
    "desc": "Influencing policies that respond to access of water and sanitation from a gendered perspective.",
    "image": "https://www.accord.org.za/wp-content/uploads/2026/02/20260213_101205.jpg",
    "source": "accord.org.za"
  }
]