[
  {
    "title": "Boots first to offer weight-loss jabs service on the high street",
    "desc": "The pharmacy is launching a pilot scheme at 17 stores for customers to book consultations for Wegovy or Mounjaro",
    "image": "https://www.thetimes.com/imageserver/image/%2Fe998ca4a-b65d-4de5-8872-4800b52591f6.jpg?crop=1600%2C900%2C0%2C0&resize=1200",
    "source": "The Times"
  },
  {
    "title": "'Young' schoolboy in hospital after being hit by bus",
    "desc": "Emergency services were called to the scene",
    "image": "https://i2-prod.liverpoolecho.co.uk/article33418782.ece/ALTERNATES/s1200/1_Dovedale-Road-in-Mossley-Hill.jpg",
    "source": "Liverpool Echo"
  },
  {
    "title": "New astronauts launch to the International Space Station after medical evacuation",
    "desc": "CAPE CANAVERAL, Florida: A new crew rocketed toward the International Space Station on Friday to replace the astronauts who returned to Earth early in NASA’s first medical evacuation. SpaceX launched the replacements as soon as possible at NASA’s request, sending the US, French and Russian astronauts on an expected eight- to nine-month mission stretching until fall. The four",
    "image": "https://www.arabnews.pk/sites/default/files/styles/660x371_watermarkpakistan/public/main-image/2026/02/13/4684659-271600409.jpg?itok=v-kez8LU",
    "source": "Arab News PK"
  },
  {
    "title": "SHA Report: Missing documents cause most claim rejections",
    "desc": "Over 91,000 claims rejected between October 2024 and January 2026",
    "image": "https://cdn.radioafrica.digital/image/2026/02/d627abf7-10c1-429f-a92d-bfaae49ac3e0.jpg?1771012918198",
    "source": "the-star.co.ke"
  },
  {
    "title": "Nehru's bold bet: Why China pact ignored central border, reveals CDS Anil Chauhan",
    "desc": "At the Bharat Himalayan Strategy Forum (BHISM) in Dehradun, Chief of Defence Staff General Anil Chauhan revisited the historical context of India-China border policy, particularly decisions taken during the tenure of fromer Prime Minister Jawaharlal Nehru.",
    "image": "https://english.cdn.zeenews.com/sites/default/files/2026/02/13/1904686-custom-size-93.jpg",
    "source": "Zee News"
  },
  {
    "title": "Chinese Tech Offers Blueprint For Iran's Digital Crackdown, New Report Says",
    "desc": "Michael Caster, the head of Article 19's Global China Program, speaks with RFE/RL about the organization's new report looking at how Chinese technology underpins Iran’s internet control and what it means as Tehran looks to consolidate control after weeks of deadly protests.",
    "image": "https://gdb.rferl.org/4F99D7B2-8DBC-466D-B7B5-E18EDC3B655D.jpg",
    "source": "Radio Free Europe/Radio Liberty"
  },
  {
    "title": "Palace reacts to shocking reports of King Charles funding Andrew’s £12m settlement",
    "desc": "King Charles did not help pay the settlement made by his brother, Andrew Mountbatten-Windsor, to Virginia Giuffre, a source close to the King has claimed.The payment, believed to be about £12...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-13/1392171_035235_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "100 couples tie the knot in Manila's pre-Valentine's Day mass wedding",
    "desc": "Manila City Mayor Francisco",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/13/79160.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Carolyn Bessette-Kennedy: The true story behind the mysterious and tragic US icon",
    "desc": "Alongside husband JFK Jr, Carolyn Bessette-Kennedy was one half of America's great 1990s golden couple, before their untimely deaths. A new drama is set to explore her struggles.",
    "image": "https://ychef.files.bbci.co.uk/624x351/p0n0qyhv.jpg",
    "source": "BBC"
  },
  {
    "title": "2026 Milano-Cortina Winter Olympics: Who leads the medal count?",
    "desc": "Which country is doing best at this year's Winter Olympics, held in Italy's Milan and Cortina d'Ampezzo? Track the official medal standings as they are updated throughout the Games.",
    "image": "https://images.euronews.com/articles/stories/09/64/99/54/1200x675_cmsv2_f88a0d5b-f576-5a07-be64-7efe141871b9-9649954.jpg",
    "source": "Euronews.com"
  }
]