[
  {
    "title": "Alex Pretti Was the Type of American Country Singers Love to Valorize",
    "desc": "Country artists love to sing about the military and guns, but few have said anything about the death of VA nurse and legal gun owner Alex Pretti.",
    "image": "https://www.rollingstone.com/wp-content/uploads/2026/01/ice-veteran-country-music.jpg?crop=98px%2C185px%2C1681px%2C945px&resize=1600%2C900",
    "source": "Rolling Stone"
  },
  {
    "title": "FIS Alpine Ski World Cup 2025/26: Loic Meillard overtakes Lucas Pinheiro Braathen to claim giant slalom victory in Schladming",
    "desc": "The 29-year-old conquered the bumps and humps of a tricky course, earning his seventh World Cup giant slalom victory on Tuesday, 27 January",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/idhsumfwzoygvnrn9nfv",
    "source": "olympics.com"
  },
  {
    "title": "African champions AS FAR handed stern test against Arsenal in global debut",
    "desc": "AS FAR Rabat will step onto the global stage for the first time on Wednesday when they face reigning European champions Arsenal in the FIFA Women’s Champions Cup, a historic occasion that pits Africa’s standard-bearers against one of the most formidable sides in world football.",
    "image": "https://www.cafonline.com//media/wgdiwkzg/b25kuwm0376.jpg?width=1200",
    "source": "Confédération Africaine de Football"
  },
  {
    "title": "The Monk Who Recognised Halley's Comet First",
    "desc": "The comet bearing Edmond Halley's name may have been misnamed! New research from Leiden University reveals that an 11th Century English monk recognised the famous comet's periodicity centuries before the British astronomer. Eilmer of Malmesbury witnessed the comet's appearances in both 989 and 1066, linking the two observations and understanding they represented the same celestial visitor returning after decades, a realisation documented by the medieval chronicler William of Malmesbury but overlooked by scholars until now. The discovery challenges whether history's most famous comet should continue bearing Halley's name when a Benedictine monk beat him to the discovery by more than 600 years.",
    "image": "https://www.universetoday.com/article_images/1280px-Lspn_comet_halley_20260127_224432.jpg",
    "source": "Universe Today"
  },
  {
    "title": "Marcus Rashford true colours shown in response to Aston Villa transfer",
    "desc": "Barcelona star Marcus Rashford spoke out after Aston Villa made a transfer announcement.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/67/1200x630/6703342.jpg",
    "source": "Daily Express"
  },
  {
    "title": "A birthday present from Albert? Princess Charlene of Monaco debuts a new Tiffany & Co. brooch for Saint Devota celebrations",
    "desc": "Princess Charlene of Monaco appears to have added a new gem to her glittering jewellery box which might have been a birthday present from her husband",
    "image": "https://media.tatler.com/photos/69793ba86353736a12063813/16:9/w_1280,c_limit/2258479782",
    "source": "Tatler"
  },
  {
    "title": "Grant County cat dies from 'highly pathogenic' bird flu, WSDA emphasizes risk",
    "desc": "The WSDA advises pet owners to take precautions to reduce the risk of exposure.",
    "image": "https://komonews.com/resources/media2/16x9/3000/1320/0x157/90/eb78ba49-0504-4d78-906a-9ef0511bda9d-GettyImages92431052.jpg",
    "source": "komonews.com"
  },
  {
    "title": "2,000-Year-Old ‘Battery’ Discovered in Iraq: Could Ancient Civilizations Have Harnessed Power?",
    "desc": "Scientists are revisiting the ancient Baghdad battery, a 2,000-year-old artifact that might have been used as a primitive energy source, but new studies also suggest it could have been a part of religious rituals.",
    "image": "https://indiandefencereview.com/wp-content/uploads/2026/01/2000-year-old-battery-discovered-in-iraq-could-ancient-civilizations-have-harnessed-power-scaled.png",
    "source": "Indian Defence Review"
  },
  {
    "title": "Fighting leprosy with genomics",
    "desc": "Leprosy has afflicted humans since ancient times. Yet, perhaps surprisingly, this neglected tropical skin disease still impacts communities around the world today, with around 200,000 new cases reported worldwide each year",
    "image": "https://www.doherty.edu.au//uploads/news_img/World_Leprosy_Day.jpg",
    "source": "The Peter Doherty Institute for Infection and Immunity"
  },
  {
    "title": "The Liberals’ fatal flaw was becoming Nationals-lite. Here’s how they can come back from the brink",
    "desc": "If the conservative parties want to stop bleeding votes to One Nation and teals, their focus needs to be on economic management and housing, especially in urban seats",
    "image": "https://i.guim.co.uk/img/media/2538ce2b2cf78f651c64efb9031e84430350516c/706_0_4900_3921/master/4900.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=f2f74f2cac238d659beb1c63d3f18c86",
    "source": "The Guardian"
  }
]