[
  {
    "title": "Super Bowl 2026 predictions: Who will win, Seahawks or Patriots? Who will win MVP?",
    "desc": "Will the Seattle Seahawks of New England Patriots win Super Bowl 60? Our BBC Sport experts have their say plus you can make your pick.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c4f0/live/fc04b120-0440-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Somerset boy's life saved by blood transfusion in the womb",
    "desc": "Laura Fricker has spoken about her son, who had foetal anaemia and required a rare intrauterine procedure.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ff9/live/09e45a20-0360-11f1-bab5-81d0d0b0abce.jpg",
    "source": "BBC"
  },
  {
    "title": "Somerset boy's life saved by blood transfusion in the womb",
    "desc": "Laura Fricker has spoken about her son, who had foetal anaemia and required a rare intrauterine procedure.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/6ff9/live/09e45a20-0360-11f1-bab5-81d0d0b0abce.jpg",
    "source": "BBC"
  },
  {
    "title": "Showdown as Baba Jamal faces late MP’s widow, 3 others in NDC Ayawaso East primaries",
    "desc": "The Ayawaso East constituency is set for a decisive showdown on February 7, 2026, as the National Democratic Congress (NDC) holds its primaries to select a candidate for the March 3 by-election.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/248/24894164.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Four die and three others need liver transplants after eating Death Cap mushrooms in California",
    "desc": "According to Wild Food UK, the symptoms of eating a Death Cap include severe vomiting, diarrhoea and abdominal pains. In serious cases, symptoms can return after several days and end in death from kidney and liver failure.",
    "image": "https://e3.365dm.com/26/02/1600x900/skynews-amanita-phalloides_7157975.jpg?20260206233346",
    "source": "Sky News"
  },
  {
    "title": "Not just the Great Wall, the world's largest greenhouses are also visible from space! Details inside",
    "desc": "Trending News: It is an intriguing fact that the Great Wall of China is visible from the Moon.For years, schoolbooks and texts have sold the Great Wall of China as t.",
    "image": "https://static.toiimg.com/thumb/msid-128023550,width-1280,height-720,imgsize-892312,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Police release sketch to identify woman found near Unam",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% The police have released a composite sketch of a woman whose decomposed body was discovered near the Western Bypass, opposite the University of Namibia’s main campus.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-06-at-8.41.24-PM-768x1024.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "The Body Remembers",
    "desc": "Old Fears Resurface in Tigray After New Clashes",
    "image": "https://www.thereporterethiopia.com/wp-content/uploads/2026/02/THE-BODY-REMEMBERS.jpg",
    "source": "thereporterethiopia.com"
  },
  {
    "title": "D.A., DOT to lead PH participation in Green Expo 2027 in Japan",
    "desc": "By Brian Campued The Department of Agriculture (DA) and Department of Tourism (DOT) were tapped to lead the Philippines’ preparations and participation at the Green Expo to be held in Yokohama, Japan in 2027. This was formalized through the Administrative Order (AO) No. 41 issued by President Ferdinand R. Marcos Jr. on Feb. 4, designating […]",
    "image": "https://ptvnews.ph/wp-content/uploads/2026/02/502525221_1273913850769859_3028102367330442453_n.jpg",
    "source": "ptvnews.ph"
  },
  {
    "title": "'Nothing is stopping a flood,' say Midleton residents",
    "desc": "Business owners and residents in Midleton, Co Cork, are frustrated over the lack of a flood relief scheme after flooding caused by Storm Babet in October 2023 devastated the town, writes Paschal Sheehy.",
    "image": "https://www.rte.ie/images/001f015a-1600.jpg",
    "source": "RTE.ie"
  }
]