[
  {
    "title": "'Death to Khamenei' chanted during Iran state celebrations",
    "desc": "Latest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/904b/live/8c16c250-073c-11f1-b5e2-dd58fc65f0f6.png",
    "source": "BBC"
  },
  {
    "title": "Retiree who left urine-spiked drinks in Hong Kong supermarkets spared prison",
    "desc": "Court considers defendant's psychological health and accepts Social Welfare Department's recommendation to place him on probation for one year",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/11/3764938.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Cork author's viral book series set for TV adaptation",
    "desc": "Irish author Chloe Walsh's bestselling Boys of Tommen series is being adapted for the small screen, with Prime Video confirming it has commissioned a TV version.",
    "image": "https://www.rte.ie/images/0023e087-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Two neurosurgeons just raised $25 million betting brain cells can (someday) outcompute silicon",
    "desc": "The Biological Computing Co. (TBC) has raised $25 million in seed funding, Fortune has learned.",
    "image": "https://fortune.com/img-assets/wp-content/uploads/2026/02/Combined_Founder_headshots_176f59.png?resize=1200,600",
    "source": "Fortune"
  },
  {
    "title": "CS Duale pursues health security through science, innovation",
    "desc": "Health sector targets domestic vaccine production amid Africa’s 99 per cent import reliance",
    "image": "https://cdn.radioafrica.digital/image/2026/02/1f3d382f-3336-4639-91bf-133d495a9e90.jpg?1770819247115",
    "source": "the-star.co.ke"
  },
  {
    "title": "PM launches, hands over 21 tourism projects worth 114.62bn/-",
    "desc": "DAR ES SALAAM: Prime Minister Dr Mwigulu Nchemba has launched and handed over 21 tourism infrastructure projects worth 114.62bn/-. He said the projects, implemented under the Strategic Southern Tourism Circuit Development Programme, are part of President Dr Samia Suluhu Hassan’s vision to promote and expand the tourism sector in the country. “This has been President",
    "image": "https://dailynews.co.tz/wp-content/uploads/2025/12/Nchemba1.jpeg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Ayawaso East seat: NDC clears Baba Jamal to contest",
    "desc": "The National Democratic Congress (NDC) has confirmed Baba Jamal Mohammed Ahmed, popularly known as Baba Jamal, as its candidate for the Ayawaso East parliamentary by-election after deciding that annulment of the internal parliamentary primary was not an option",
    "image": "https://www.graphic.com.gh/images/2026/Feb/11/Jamal.jpg",
    "source": "Graphic Online"
  },
  {
    "title": "‘We’ll Have to Use Carrier Pigeons’: Russian Troops in Chaos as Telegram, Starlink Cut Off",
    "desc": "Russian soldiers face a communications blackout after Telegram is throttled and Starlink terminals are disabled. Russian volunteers slam authorities for sabotaging operations.",
    "image": "https://static.kyivpost.com/storage/2024/09/03/035a0e3f6038ffbe29ded512055196d6.jpg?w=1200&q=90&f=jpg",
    "source": "Kyiv Post"
  },
  {
    "title": "Driver, not Shivam Mishra, was behind wheel: Complainant's twist in Lamborghini case",
    "desc": "While the defence has submitted supporting affidavits, police continue to maintain that Shivam was behind the wheel. The court has reserved its order.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/kanpur-lamborghini-crash-105841318-16x9_1.jpg?VersionId=TDiS_wvjZePNlyTFqAXO7vghHn9HgY1E",
    "source": "India Today"
  },
  {
    "title": "Inside the Cork club providing a new social outlet for women",
    "desc": "When Edel Marples began to feel more isolated in her personal life, she decided to set up a walking group for like-minded women. She tells MARGARET ...",
    "image": "https://www.echolive.ie/cms_media/module_img/9927/4963502_1_seoimageog_ECHO_20FEATURES_20WoW_20_20Bestie_20Walking_20Club_20Cork_20on_20their_20recent_20Crosshaven_20Walk_20-_20Edel_20Marples_20at_20front_20in_20teal_20baseball_20cap.jpeg.jpg",
    "source": "echo live"
  }
]