[
  {
    "title": "Son of Iran's last shah urges US action at Munich rally",
    "desc": "The exiled son of Iran's last shah has said he is ready to lead the country to a \"secular democratic future\" at a rally in Munich, after US President Donald Trump said a change of power would be the \"best thing\".",
    "image": "https://www.rte.ie/images/0023e54d-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "India AI Summit: French President Macron to meet PM Modi as Rafale deal worth ₹3.25 lakh cr gains altitude",
    "desc": "French President Emmanuel Macron will visit India from February 17 to 19 to attend the India AI Impact Summit in Delhi and hold talks with Prime Minister Narendra Modi, as both countries deepen strategic ties. The summit, beginning Monday, will bring together global leaders, policymakers and AI experts.",
    "image": "https://img.etimg.com/thumb/msid-128375342,width-1200,height-630,imgsize-74024,overlay-etdefence/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Five arrested after incident at Alice Springs Hospital, police allege weapons brandished inside",
    "desc": "Police allege an aggravated assault took place outside of Alice Springs Hospital in the early hours of this morning, where they say a group of boys and men were brandishing bladed weapons.",
    "image": "https://live-production.wcms.abc-cdn.net.au/dd3d6bbd64efe08d4df953658f259f4b?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=334&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Driver stabs LASTMA officer with broken bottle in Lagos",
    "desc": "A commercial bus driver in Lagos stabbed a LASTMA officer with a broken bottle after being stopped for a traffic violation at the Ojota Interchange.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/15083736/Lastma-865x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "rain, thunder expected in city on February 17",
    "desc": "Dadu, Hyderabad, Thatta, Badin, Jamshoro, Larkana, Jacobabad, Khairpur, to also experience rain with thunder",
    "image": "https://i.tribune.com.pk/media/images/2043741-rain_karachifile-1566933472/2043741-rain_karachifile-1566933472-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "BAFTA winning BBC legend exits broadcaster after 37 years",
    "desc": "The star shared their 'sadness' at leaving.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/79/1200x630/6743046.jpg",
    "source": "Express.co.uk"
  },
  {
    "title": "Kenyans mourn one of last Mau Mau rebellion leaders",
    "desc": "Mourners attended the funeral of one of the last leaders of Kenya's Mau Mau resistance movement in Ngorika near the Aberdare mountains. Christopher Njora Muronyo died at the age of 106, still carrying three bullets in his body from his time as a rebel against the British in the 1950s.",
    "image": "https://images.euronews.com/articles/stories/09/65/15/82/1024x538_cmsv2_e5486817-7585-53a7-973e-073e5ddb8227-9651582.jpg",
    "source": "africanews.com"
  },
  {
    "title": "After overseeing rough handling of Palestinian prisoners, Ben Gvir posts proud video",
    "desc": "Far-right minister tours Ofer Prison with relatives of terror victims, boasts of tough policies as bound inmates paraded at gunpoint; prisoners' rights group decries 'revenge' tactics",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/02/3-combo-1-1.jpeg",
    "source": "The Times of Israel"
  },
  {
    "title": "Mrunal Thakur Drops Bomb: Marriage Yes, Dhanush No",
    "desc": "Mrunal Thakur says marriage is on the cards but firmly shuts down rumours linking her to Dhanush.",
    "image": "https://www.m9.news/wp-content/uploads/2026/02/mrunal-thakur-marriage-statement.jpg",
    "source": "M9.news"
  },
  {
    "title": "African Leaders Call to Scale Up Health Workforce, Commit to Deploy Two Million Community Health Workers by 2030",
    "desc": "Addis Ababa, 14 February 2026 – African Union (AU) Ministers of Health and Finance, together with Heads of Delegation, have called for urgent and sustained investment in Africa’s health workforce, including to build a two-million-strong community health worker (CHW) workforce by 2030. Leaders said the investment is critical to strengthen Africa’s health security and sovereignty […]",
    "image": "https://africacdc.org/wp-content/uploads/2026/02/Africa-CDC-by-kin-13022026-7933.jpg",
    "source": "Africa CDC"
  }
]