[
  {
    "title": "Halle Berry and Stephen Curry Ink Unscripted TV and Film Deal",
    "desc": "Halle Berry and Stephen Curry ink unscripted film and TV deal",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2026/02/Steph-Curry-and-Halle-Berry-Split-Getty-H-2026.jpg?w=1296&h=730&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "Arbitrator settles flight attendant wages at Air Canada, as labour dispute comes to official end",
    "desc": "An arbitrator reviewing wages for flight attendants at Air Canada has finalized rates at the airline, bringing an end to the labour dispute that saw travel disrupted for thousands of people last summer.",
    "image": "https://i.cbc.ca/ais/8250c766-152f-412a-9999-aaf1b4af4f4e,1771442067458/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C246%2C4714%2C2651%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "How Jesse Jackson Was Part Of June 12 Struggle - Bolaji Akinyemi",
    "desc": "How Jesse Jackson Was Part Of June 12 Struggle – Bolaji Akinyemi",
    "image": "https://www.channelstv.com/wp-content/uploads/2026/02/Jesse-Jackson-Bolaji-Akinyemi.jpg",
    "source": "Channels Television"
  },
  {
    "title": "Town of Victoria Park offering weekly $50 prize for sorting rubbish correctly as bin tagging begins",
    "desc": "Another Perth council will be searching residents’ bins to check that they are sorting their rubbish correctly.",
    "image": "https://images.perthnow.com.au/publication/C-21655576/d064e02c0f40287da7ef27d1f0a7e860b3921e72-16x9-x132y0w587h330.jpg?imwidth=1200",
    "source": "PerthNow"
  },
  {
    "title": "James Van Der Beek's Final Movie 'The Gates' Drops Trailer After Death",
    "desc": "James Van Der Beek's final movie appearance has been revealed in 'The Gates' trailer, which shows the late actor as an evil pastor",
    "image": "https://variety.com/wp-content/uploads/2026/02/The-Gates.jpg?w=855&h=493&crop=1",
    "source": "Variety"
  },
  {
    "title": "Israel's violations threaten lasting peace, resolution 2803 must be implemented, Dar tells UN",
    "desc": "Pakistan joins 8 Arab, Islamic states to uphold international law, ceasefire.Full implementation of UNSC resolution 2803 crucial for ending hostilities.Supports Palestinian self-determination, Gaza recovery, peace board.",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-19/l_651664_063010_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "This is when Samsung is restocking the Galaxy Z TriFold in the US",
    "desc": "There will probably be limited quantities available again. Samsung's Galaxy Z TriFold launched in the US in late January and sold out in minutes, due to...",
    "image": "https://fdn.gsmarena.com/imgroot/news/26/02/galaxy-z-trifold-restocking-date/-952x498w6/gsmarena_000.jpg",
    "source": "GSMArena.com"
  },
  {
    "title": "Starmer ‘not being honest’ on defence spending, say ex-military chiefs",
    "desc": "PM told ‘the time for action, not just words, is now’ as MoD forced to make cuts",
    "image": "https://www.telegraph.co.uk/content/dam/briefs/2026/02/18/TELEMMGLPICT000464648858_17714381479090_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQf_4Xpit_DMGvdp2n7FDd82k.jpeg?impolicy=OG-Standard",
    "source": "The Telegraph"
  },
  {
    "title": "Seahawks put up for sale - 10 days after Super Bowl win",
    "desc": "The Seattle Seahawks are officially put up for sale - 10 days after winning American football's biggest prize.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/738c/live/de5142d0-0cfe-11f1-a5ba-235333f36ff5.jpg",
    "source": "BBC"
  },
  {
    "title": "Ghana Sits on a Data Goldmine But Struggles to Spend It",
    "desc": "Ghana is accumulating digital data faster than it can turn it into economic value, and the window to build a competitive artificial intelligence (AI) industry before regional rivals consolidate their lead is narrowing, two technology experts have warned. Dr Eugene Frimpong, a data analytics and AI expert, and technology researcher…",
    "image": "https://www.newsghana.com.gh/wp-content/uploads/2024/08/logo-newsghana.png",
    "source": "News Ghana"
  }
]