[
  {
    "title": "Arslan Ash to Begin New Phase of His Career",
    "desc": "Arslan Ash, Pakistan’s globally renowned Tekken star, has relocated to Japan to train and compete at the highest level of professional esports, calling",
    "image": "https://propakistani.pk/wp-content/uploads/2024/07/arslan-ash-1.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Telstra to axe more than 200 jobs amid AI rollout",
    "desc": "Some jobs will be moved offshore in wake of telco’s $700m joint venture with tech consultancy Accenture",
    "image": "https://i.guim.co.uk/img/media/18f1e2d8bf1c992ff57d47f06323278cf9b04575/497_0_4974_3980/master/4974.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=80a290829cbf66263e61b0322fe8a9a2",
    "source": "The Guardian"
  },
  {
    "title": "17-year-old takes his chance to impress Liam Rosenior as Chelsea manager attends 'huge night'",
    "desc": "Chelsea wonderkid Ryan Kavuma-McQueen has taken his chance to impress Liam Rosenior during FA Youth Cup action.",
    "image": "https://cdn1.thechelseachronicle.com/uploads/17/2026/02/GettyImages-2260525148-scaled.jpg",
    "source": "The Chelsea Chronicle"
  },
  {
    "title": "Injured man (20s) dumped outside garda station and second man (30s) left in ‘serious’ condition after double stabbing in Longford",
    "desc": "Gardaí have launched a major investigation into the circumstances behind a double stabbing in a midlands town that has left two men in a serious condition in hospital.",
    "image": "https://focus.independent.ie/thumbor/u3JttEgPyUTM8_zRRGui1xtk6o0=/0x40:1920x1320/629x0/prod-mh-ireland/84330bbe-aef9-4e5c-b9cb-9537c6532735/665771c3-7c9e-4430-915e-2ea9e0ae6fae/84330bbe-aef9-4e5c-b9cb-9537c6532735.jpg",
    "source": "The Irish Independent"
  },
  {
    "title": "External Aid Cuts Affecting HIV Treatment Across Africa, Says UN",
    "desc": "Scale-backs and deep spending cuts within the US government and the Global Fund to Fight AIDS are hobbling HIV treatment programs across Africa, including in",
    "image": "https://www.thereporterethiopia.com/wp-content/uploads/2026/02/photo_2026-02-10_11-24-53.jpg",
    "source": "thereporterethiopia.com"
  },
  {
    "title": "ZIMURA executive director Polisile Ncube-Chimhini steps down",
    "desc": "Zimbabwe Music Rights Association (ZIMURA) executive director Polisile Ncube-Chimhini has stepped down with immediate effect, bringing to an end a tenure that spanned more than three decades at the organisation.",
    "image": "https://www.musicinafrica.net/sites/default/files/images/article/202602/polisilechimhini.jpg",
    "source": "Music In Africa |"
  },
  {
    "title": "Exynos 2700 To Enter Mass Production In H2 2026, Analyst Says SoC’s Adoption In Galaxy S27 Will Increase Drastically",
    "desc": "An analyst believes that the Exynos 2700 will enter full-scale mass production in the second half of 2026 and will be utilized in increased Galaxy S27 shipments",
    "image": "https://cdn.wccftech.com/wp-content/uploads/2026/02/Exynos-2700.jpg",
    "source": "Wccftech"
  },
  {
    "title": "“It’s hard to find an Apple product without an Israeli touch”",
    "desc": "Apple Israel manager Rony Friedman says local teams are embedded in chips, cameras, modems, and AI at the heart of the company’s devices.",
    "image": "https://pic1.calcalist.co.il/picserver3/crop_images/2026/02/09/r15AcXPw11x/r15AcXPw11x_1_71_1601_901_0_large.jpg",
    "source": "CTech"
  },
  {
    "title": "Roan leaves agency after Ghislaine Maxwell emails",
    "desc": "Pop star Chappell Roan says she is no longer represented by Wasserman, the talent agency led by Casey Wasserman, after renewed scrutiny of email exchanges between him and Ghislaine Maxwell.",
    "image": "https://www.rte.ie/images/0023df0d-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "LIVE: Netherlands close in on victory over Namibia",
    "desc": "Three games at the T20 World Cup on Tuesday, highlighted by Pakistan's contest against the USA in Colombo.",
    "image": "https://images.icc-cricket.com/image/upload/t_ratio16_9-size20-webp/prd/nt7rucclmum0hhlyceuf",
    "source": "ICC"
  }
]