[
  {
    "title": "Absence of price stabilisation fund leaves cocoa and gold exposed - GHEITI",
    "desc": "The recent 28.63 percent reduction in producer price for cocoa has reignited debate over the country’s ability to shield its key revenue earners from market shocks, with the Co-Chair of Ghana Extractive Industries Transparency Initiative (GHEITI),...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/438/43888943.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Farming Camp reveals gameplay in new trailer",
    "desc": "Press releases and assets from across the games industry - screenshots, videos, logos, packshots, artwork, PR contacts, release dates",
    "image": "https://imgeucdn.gamespress.com/cdn/files/Games%20Press/2026/02/180904-67f7db20/Farming_Camp_Your_Path.jpg?w=360&mode=max&otf=y&quality=90&format=jpg&bgcolor=white&sky=34a050a4896352d71f384fba1a2a690bfe9040dd2f76bbbae14804a8648117aa",
    "source": "Games Press"
  },
  {
    "title": "Arsene Wenger Reveals Why He Joined FIFA and Infantino’s Support in Football’s Global Development",
    "desc": "FIFA will celebrate 10 years of leadership under Infantino. Arsenal legend Arsene Wenger recently shared the core mission that convinced him to join world football’s governing body.",
    "image": "https://www.moroccoworldnews.com/wp-content/uploads/2026/02/b23jtfr0357-1.webp",
    "source": "Morocco World News"
  },
  {
    "title": "KPK Urges Finance Minister Purbaya to Report TikTok Gifts",
    "desc": "KPK advised Finance Minister Purbaya Yudhi Sadewa to report or consult over virtual gifts sent during a TikTok livestream.",
    "image": "https://img2.beritasatu.com/cache/jakartaglobe/960x620-w/2026/01/1767341381-5000x3333.webp",
    "source": "Jakarta Globe"
  },
  {
    "title": "PLDT firm on REIT listing plan for Vitro data center unit",
    "desc": "Telecommunications giant PLDT Inc. on Thursday is firm on its plan to list its data center business, under Vitro Inc., on the Philippine Stock Exchange (PSE) through a real estate investment trust (REIT) route.",
    "image": "https://images.gmanews.tv/webpics/2020/03/pldt_logo_2020_03_05_13_18_41.jpg",
    "source": "GMA Network"
  },
  {
    "title": "NCBA Sees Nedbank Tie Extending Reach for Wealthy East Africans",
    "desc": "Kenya’s fourth-biggest bank by assets plans to piggyback on its new anchor shareholder Nedbank Group Ltd. to woo high-net-worth East Africans looking to grow their wealth outside the continent.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ir0lxcycjkUY/v1/1200x800.jpg",
    "source": "Bloomberg"
  },
  {
    "title": "Managing director loses RM1.3mil to ‘ghost ship’ scam",
    "desc": "A local marine company director claims he was defrauded over a non-existent vessel cleaning contract and says the subcontractor has taken legal action against him.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/53834168-hishamuddin-hashim-mho-bernama-260226.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Ghanaians consuming more power than projected - PURC",
    "desc": "The Executive Secretary of the Public Utilities Regulatory Commission (PURC), Dr Shaffic Suleman, has revealed that electricity consumption in Ghana has exceeded the Commission’s projections.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/840/84080336.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "DVLA sets record straight on sending staff overseas for license services",
    "desc": "The Driver and Vehicle Licensing Authority (DVLA) has clarified that it will not deploy domestic staff abroad to provide driver licensing services, following public backlash over reports suggesting otherwise.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/440/44076329.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Ukraine responds to Kwesi Pratt's terrorism allegations",
    "desc": "The Spokesperson for Ukraine’s Foreign Affairs Ministry, Heorhii Tykhyi, has rejected claims made by veteran Ghanaian journalist Kwesi Pratt that Ukraine provided the “terrorists” responsible for the killing of eight Ghanaian traders in Burkina...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/789/78938756.jpg",
    "source": "GhanaWeb"
  }
]