[
  {
    "title": "Former first lady of South Korea sentenced to 20 months in prison",
    "desc": "A South Korean court has sentenced former first lady Kim Keon Hee to 20 months in prison for corruption.",
    "image": "https://dims.apnews.com/dims4/default/f8fa982/2147483647/strip/true/crop/6830x4551+0+104/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F30%2F5a%2Fc06dfa569b43b7de9db15f7c2e28%2F074cd1b9b86c4551826d451d3ca4b3e9",
    "source": "AP News"
  },
  {
    "title": "Lessons from Zimbabwe: Effectiveness of Public Procurement in IFAD’s Smallholder Agriculture Projects",
    "desc": "This study investigates the effectiveness and efficiency of public procurement processes in IFAD-supported agricultural projects in Zimbabwe, with a focus on the Smallholder Agriculture Cluster Project (SACP). Public procurement accounts for approximately 60% of Zimbabwe’s national budget, yet challenges such as corruption, political interference, capacity limitations, and insufficient transparency undermine its effectiveness. Using surveys and",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Man arrested after charging Rep. Ilhan Omar, spraying her with liquid during town hall: Police",
    "desc": "During a town hall Tuesday, a man charged the podium where Rep. Ilhan Omar was giving remarks, appeared to squirt a liquid at her and was then tackled to the ground.",
    "image": "https://i.abcnewsfe.com/a/63d3d0d9-bac8-42e4-a395-806b20bc4090/ilhan-omar-townhall_2_1769566454481_hpMain_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Palace: PBBM health ‘improving,’ still focused on critical duties",
    "desc": "President Ferdinand Marcos Jr. is showing steady improvement after being diagnosed with diverticulitis, Malacañang said Wednesday, dismissing claims",
    "image": "https://cdn.manilastandard.net/wp-content/uploads/2026/01/pbbm-visits-metro-pacific-fresh-farms.jpg",
    "source": "manilastandard.net"
  },
  {
    "title": "Reliance, ONGC shares jump up to 8% on pact for deepwater resource sharing",
    "desc": "ONGC shares surged nearly 8% on January 28 after announcing a resource-sharing agreement with Reliance Industries for deepwater exploration along India's eastern coast, particularly in the Krishna Godavari basin and Andaman region, promoting cost optimization and enhanced asset utilisation.",
    "image": "https://www.livemint.com/lm-img/img/2026/01/28/1600x900/logo/g9a7e3ebac7ed37d2b925f52313c25ea2329a9dc53d74853e4_1737365962708_1769584606913.jpg",
    "source": "Mint"
  },
  {
    "title": "Depression, anxiety putting women on the verge of disease",
    "desc": "Are you one of the women who suffered from Covid? There is a shocking link that has appeared between the disease and depression, anxiety. Older women who have a history of both depression and...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-01-28/1390099_121647_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "Driving Yemen’s Recovery: Key Achievements 2023-2025",
    "desc": "Sustainable development has become an urgent necessity, particularly in countries facing compounded crises like Yemen. Over the period 2023–2025, the United Nations Development Programme (UNDP) has continued to deliver results for Yemeni communities, demonstrating both the resilience of the people and UNDP’s commitment to supporting recovery and sustainable development. Despite ongoing humanitarian needs, economic fragility,",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Swiatek backs Gauff's Australian Open privacy complaint",
    "desc": "Following her quarter-final loss to Elena Rybakina, Iga Swiatek backed up Coco Gauff's complaints about a lack of privacy at the Australian Open by claiming tennis players are treated like zoo animals.",
    "image": "https://www.rte.ie/images/0023cf38-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Former Karamoja Affairs Minister Nandutu expected in court today",
    "desc": "By Ruth Anderah KAMPALA: The trial of former state minister for Karamoja Affairs Agnes Nandutu is expected to resume today with the highlighting of final submissions by both the prosecution and the defence. Nandutu, who faces corruption-related charges is expected to appear before Anti-Corruption Court Judge Jane Kajuga Okuo as both sides conclude their",
    "image": "https://www.music.kfm.co.ug/wp-content/uploads/2023/09/kfm-small2.png",
    "source": "kfm.co.ug"
  },
  {
    "title": "Nanyang Optical plans to enter into voluntary liquidation after 65 years, will close 4 of 6 stores",
    "desc": "The eyecare chain’s remaining two stores, which are under franchise arrangements, will continue operating and are unaffected",
    "image": "https://cassette.sphdigital.com.sg/image/businesstimes/f641b641934b97a594f9b857f281fe767af43f470d2447ef6f9aa8526813ba98?w=1200&f=webp",
    "source": "The Business Times"
  }
]