[
  {
    "title": "IFA members occupy Bord Bia office in Dublin",
    "desc": "Around 30 members of the IFA are continuing a sit-down protest inside the offices of Bord Bia in Dublin this evening, in an escalation of their protest calling for the removal of the agency's chair, Larry Murrin.",
    "image": "https://www.rte.ie/images/0023d7b8-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "‘Can barely walk’: Ollie Peake’s heroic hundred goes in vain as England end Aussie U19 World Cup defence",
    "desc": "‘Can barely walk’: Rising star’s heroic ton in vain as Aussie U19 title defence ends",
    "image": "https://content.api.news/v3/images/bin/42c5d2a020ab4dcad5225313b3a599fe",
    "source": "fox sports"
  },
  {
    "title": "Son of Norway's crown princess denies rape charges",
    "desc": "The son of Norway's crown princess has pleaded not guilty to rape and domestic violence, but admitted to lesser charges on the first day of his trial.",
    "image": "https://www.rte.ie/images/0023d7b4-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Lord of the Dance show at 3Arena to go ahead despite earlier cancellation",
    "desc": "Michael Flatley granted injunction by High Court in Belfast to allow 30th anniversary show to be staged in Dublin",
    "image": "https://www.irishtimes.com/resizer/v2/JXMJ3KWQ43VHWWAK3IC2D5KU3A.jpg?smart=true&auth=052aea956b287e7383f77286948e91fa52b76d457a32ebe792d33c58e84c0356&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "U.S. ski star Lindsey Vonn vows to race at Milano-Cortina Olympics despite 'ruptured' ACL",
    "desc": "Lindsey Vonn is \"confident\" she can compete at the Milan-Cortina Winter Olympics beginning this week despite the left knee injury she sustained in a crash four days ago.",
    "image": "https://i.cbc.ca/ais/ff8df4c2-fac4-4a4b-8520-e843d8495047,1770132181737/full/max/0/default.jpg?im=Crop%2Crect%3D%2820%2C0%2C1139%2C640%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Irish man in court after fatal stabbing of another Irishman in Bucharest - local reports",
    "desc": "The Department of Foreign Affairs is aware of the case and is providing consular assistance.",
    "image": "https://img2.thejournal.ie/article/6945286/river/?height=400&version=6945806",
    "source": "The Journal"
  },
  {
    "title": "West Bengal CM Mamata Banerjee to appear in Supreme Court tomorrow to argue SIR case",
    "desc": "Bar and Bench has seen the Supreme Court gate pass issued to West Bengal Chief Minister Mamata Banerjee for February 4, 2026",
    "image": "https://media.assettype.com/barandbench%2F2026-02-03%2Fe6awrz0c%2Funnamed.png?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Bar and Bench"
  },
  {
    "title": "Lack of pediatric data restricts use of life-saving antibiotics",
    "desc": "Life-saving antibiotics that could treat severe infections in babies and children aren't accessible due to a lack of data around safety and dosage, new research shows.",
    "image": "https://www.news-medical.net/images/tags/TagImage-3347-458389964760995353448-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Man pleads guilty to sexual assault of girl on flight",
    "desc": "A man has pleaded guilty to the sexual assault of a then 16-year-old girl on board an Aer Lingus flight bound for Boston.",
    "image": "https://www.rte.ie/images/000a35e7-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Butcher ‘killed her girlfriend with horse figurine, then cut her in two’",
    "desc": "Anna Podedworna says it was ‘the only way’ to hide Izabela Zablocka’s body",
    "image": "https://static.independent.co.uk/2025/06/02/22/02215824-92d6e636-96f7-4f0d-800f-1010bf95d393.jpg?width=1200&height=800&crop=1200:800",
    "source": "The Independent"
  }
]