[
  {
    "title": "Oseikrom Sikanii and Friends Allegedly Assault Two Security Men at East Legon Restaurant",
    "desc": "Rapper Oseikrom Sikanii was allegedly involved in a public altercation with security guards at Three05 restaurant in East Legon, sparking online reactions.",
    "image": "https://cdn.yen.com.gh/images/1200x675/9400b838e2844ff7.jpeg?v=1",
    "source": "Yen News"
  },
  {
    "title": "Local scientists make breakthrough in repair of damaged nerves",
    "desc": "The research team at CÚRAM at University of Galway were working alongside the Mayo Clinic in the US, and Queen Mary University in London.",
    "image": "https://img.resized.co/galwaybayfm-ie/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltZy5nYWx3YXliYXlmbS5pZVxcXC9wcm9kXFxcL3VwbG9hZHNcXFwvc2RzZnNkZi0xMDI0eDU1NS5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvaW1nLmdhbHdheWJheWZtLmllXFxcL3N0YWdpbmdcXFwvdXBsb2Fkc1xcXC9wbGFjZWhvbGRlci5wbmdcIixcIm9wdGlvbnNcIjpbXX0iLCJoYXNoIjoiZTgyMTlkZTJkZDYzOTg0N2QwZjY1YmM5Y2JmOWRmNGEyNGFlMDIxNSJ9/localscientistsmakebreakthroughinrepairofdamagednervesgalwaybayfm.jpg",
    "source": "Galway Bay FM"
  },
  {
    "title": "When control becomes responsibility",
    "desc": "DAR ES SALAAM: IN many Tanzanian neighbourhoods, danger rarely announces itself loudly. It hides in the small things like a loose balcony rail, a wet supermarket floor, an uncovered pit in a rental compound even exposed wiring in a bar then an accident happens, someone is injured and immediately the question rises quietly at first,",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/res.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Harare's Africa summit spotlights leadership, youth development priorities",
    "desc": "Iconic International Holdings, Pty Limited hosted the 2026 Iconic Africa Summit and Honours in Harare, Zimbabwe, bringing together...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2026/01/Africa.png",
    "source": "Businessday NG"
  },
  {
    "title": "Several Businesses, Services Closed; Residents Urged to Avoid Non-Essential Travel as Metro Digs Out",
    "desc": "The City of St. John's has not declared a State of Emergency but it has closed all municipal offices as crews ...",
    "image": "https://media-cdn.socastsrm.com/wordpress/wp-content/blogs.dir/900/files/2026/02/snow-metro-streets-covered.jpg",
    "source": "VOCM"
  },
  {
    "title": "Hubble Telescope identifies one of the darkest known galaxies",
    "desc": "In the vast tapestry of the universe, most galaxies shine brightly across cosmic time and space. Yet a rare class of galaxies remains nearly invisible – low-surface-brightness galaxies dominated by dark matter and containing only a sparse scattering of faint stars. One such elusive object, known as CDG-2, may be among the most heavily dark […]",
    "image": "https://it-online.co.za/wp-content/uploads/2026/02/dark-inside-1.jpg",
    "source": "it-online.co.za"
  },
  {
    "title": "Study: C-suite values determine whether corporate climate goals 'live or die'",
    "desc": "Environmental action much more likely at firms where top executives take the lead in driving sustainability measures",
    "image": "https://image.chitra.live/api/v1/wps/a75547b/156ef9b4-076c-4ab0-9459-c308c177223f/5/iStock-1347836309-370x229.jpg",
    "source": "BusinessGreen"
  },
  {
    "title": "Rainbow Six Mobile: Reinventing the FPS multiplayer?",
    "desc": "Rainbow Six Mobile brings Ubisoft’s tactical shooter experience to Android and iOS, launching first in India. With strong strategy elements, smooth performance, and improved gameplay since beta, it impresses overall—though weaker side modes and high season pass pricing hold it back.",
    "image": "https://media.telanganatoday.com/wp-content/uploads/2026/02/04.jpg",
    "source": "Telangana Today"
  },
  {
    "title": "Craig Lowndes reacts to first Team 18 Camaro laps",
    "desc": "Craig Lowndes cut his first laps in a Team 18 Chevrolet Camaro during today's ride day at Sydney Motorsport Park. - Australia's #1 motorsport news website - Speedcafe.com",
    "image": "https://speedcafe.com/wp-content/uploads/2026/02/2025-Sandown-500-RJC_5926-copy.jpg",
    "source": "Speedcafe.com"
  },
  {
    "title": "Shadab Khan's 'Pakistan will play the T20 World Cup 2026 final' claim goes viral - WATCH",
    "desc": "Cricket News: NEW DELHI: “Pakistan will play the final,” Pakistan allrounder Shadab Khan confidently told a fan, hinting at the Men in Green’s ambitions in the T20 .",
    "image": "https://static.toiimg.com/thumb/msid-128707525,width-1280,height-720,imgsize-50866,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  }
]