[
  {
    "title": "Michelin-recognised Japanese chef to open pasta eatery in Singapore",
    "desc": "If you're a fan of pasta, keep this new dining spot on your radar.Chef Shusaku Toba, chef-owner of Michelin-recognised Sio Aoyama in Tokyo, is opening a new pasta concept, Sio Pasta, in Singapore.The restaurant, which specialises in handcrafted pasta, will open on March 26 at Raffles City Shopping Centre. This marks the brand's first venture beyond Japan. \"At Sio Pasta,...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/sio%20pasta.jpg?itok=qK_Tz4iu",
    "source": "AsiaOne"
  },
  {
    "title": "All Chrome users placed on red alert and urged to restart their browsers now",
    "desc": "If you use Chrome, update your browser now.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/59/1200x630/6764277.jpg",
    "source": "Daily Express"
  },
  {
    "title": "NYT Connections Sports Edition hints and answers for February 25: Tips to solve Connections #520",
    "desc": "Connections: Sports Edition is a New York Times word game about finding common sports threads between words. How to solve the day's puzzle.",
    "image": "https://helios-i.mashable.com/imagery/articles/07u0Wn0L5J9pGBKBn6mlYf2/hero-image.fill.size_1200x675.v1772001687.jpg",
    "source": "Mashable"
  },
  {
    "title": "7 protein powders on Amazon for muscle building, recovery, and daily nutrition",
    "desc": "Whether you're building muscle, recovering faster, or eating better, Amazon has protein for every fitness goal. Save up to 45% during Protein Week on whey protein, plant-based options, and recovery supplements from brands like Optimum Nutrition, Isopure, and MuscleBlaze.",
    "image": "https://assets.aboutamazon.com/dims4/default/4d4c5a3/2147483647/strip/true/crop/2000x1000+0+167/resize/1200x600!/quality/90/?url=https%3A%2F%2Famazon-blogs-brightspot.s3.amazonaws.com%2F56%2Fbe%2Fc354e05643f3811c4954144384fc%2Fprotein-week-hero.jpg",
    "source": "About Amazon India"
  },
  {
    "title": "Woman, 32, found half-naked, dead in Murang’a house",
    "desc": "The body was moved to the mortuary pending postmortem and further investigations.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/2c049b80-1c77-4f34-8562-b11ae4d5b324.jpeg?1772002508947",
    "source": "the-star.co.ke"
  },
  {
    "title": "Arvid Lindblad: Britain's youngest ever F1 driver on his Indian and Swedish heritage and reaching F1 aged 18",
    "desc": "Arvid Lindblad tells BBC Sport about being shaped by his Indian and Swedish heritage and how he was fixated on reaching F1 from aged five.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/21f4/live/4cd9bd10-1239-11f1-b048-c9424b2cf5fd.jpg",
    "source": "BBC"
  },
  {
    "title": "Camogie Association to probe staging of Clare v Wexford",
    "desc": "The Camogie Association is \"investigating the circumstances\" around the staging of last weekend's Centra Camogie League clash between Clare and Wexford, following criticism of the playing surface after the game was moved to Meelick.",
    "image": "https://www.rte.ie/images/0023f4b2-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Fruition Earns monday.com Platinum Partner Status in APAC",
    "desc": "Fruition has officially attained a pinnacle of the monday Partner Program within 2.5 years since its operations began. Headquartered in Sydney, this consulta...",
    "image": "https://mms.businesswire.com/media/20260223954640/en/2728791/22/monday.com_Platinum_Partner_-_Fruition.jpg",
    "source": "Business Wire"
  },
  {
    "title": "Youths Chaplain in Southern Africa Proposes “emotional forgiveness”, Release of Mental Strain during Lent",
    "desc": "The Chaplain of the Interdiocesan Youth and Young Adults Ministry of the Southern African Catholic Bishops' Conference (SACBC) has urged Southern Africans to try emotional forgiveness during the Lenten Season as a way of addressing mental health challenges.",
    "image": "https://www.aciafrica.org/images/aci-africa-photo-edit-2026-02-25t073812_1772001611.jpg?w=1200&format=jpeg",
    "source": "aciafrica.org"
  },
  {
    "title": "Worldline to sell its Indian payment activities to BillDesk",
    "desc": "Payment services provider Worldline SA (EPA:WLN) today announced the proposed sale of its Indian payment activities to BillDesk.",
    "image": "https://fxnewsgroup.com/wp-content/uploads/2024/10/worldline.jpeg",
    "source": "FX News Group"
  }
]