[
  {
    "title": "Ramesh Damani flags defence, metals and pharma as investing opportunities beyond AI",
    "desc": "Veteran investor Ramesh Damani said sectors such as defence, metals, mining and pharmaceuticals may present opportunities even as global markets remain focused on AI-led themes.",
    "image": "https://images.moneycontrol.com/static-mcnews/2024/09/20240926060933_Ramesh-Damani-BSE-Member.jpg",
    "source": "Moneycontrol.com"
  },
  {
    "title": "‘If I had to do it again, I would do it’ - Sophia Akuffo on joining protest against govt",
    "desc": "Former Chief Justice Sophia Akuffo has stated that if given the opportunity to express her anger over issues affecting the country, she would gladly do so again.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/978/97881860.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Help humanity become better, PCS Mudavadi urges African church",
    "desc": "Africa must work in closer partnership to safeguard peace, uphold the rule of law and strengthen social cohesion amid emerging regional and global pressures.",
    "image": "https://www.kbc.co.ke/wp-content/uploads/2026/02/mudavadi-church.jpg",
    "source": "KBC Digital"
  },
  {
    "title": "SADC Council of Ministers to meet in Pretoria, South Africa on 12-13 March 2026 to deliberate on the implementation of regional programmes",
    "desc": "The Council of Ministers of the Southern African Development Community (SADC) will meet on 12 and 13 March 2026 in Pretoria, Republic of South Africa to deliberate on the implementation of regional integration programmes.",
    "image": "https://www.sadc.int/sites/default/files/favicon.png",
    "source": "SADC"
  },
  {
    "title": "Prudential Bank marks February with distribution of Ghanaian chocolate to customers",
    "desc": "Prudential Bank Limited distributed chocolates to customers across its branches nationwide in February as part of activities marking National Chocolate Month. The Ghana Tourism Authority and the Cocoa Processing Company designate February as National Chocolate Month to encourage the consumption of locally produced chocolate and promote Ghana’s cocoa industry.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/prudential_Chocolate1.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Led Environmental Monitoring (Maldives)",
    "desc": "Deadline: 10-Mar-2026 The United Nations Development Programme (UNDP) has launched a Call for Proposals under its Integrated Governance Programme III to support a community-led environmental monitoring and environmental justice initiative in the Maldives. One locally registered Civil Society Organization (CSO) will receive up to MVR 300,000 to implement a six-month project focused on environmental and",
    "image": "https://fundsforngosmedia.s3.amazonaws.com/wp-content/uploads/2023/12/19141120/icon.png",
    "source": "fundsforNGOs"
  },
  {
    "title": "UCL playoffs: Three Galatasaray players under fire after Juventus clash",
    "desc": "Former Beşiktaş forward, Nihat Kahveci, has criticized three Galatasaray players following their 3-2 defeat against Juventus in the UEFA Champions League",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/Osimhen-bags-two-assists-as-Galatasaray-thrash-Eyupspor-5-1.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "‘You're going to burn this $1 billion’: Satya Nadella recalls when Bill Gates doubted Microsoft's investment in OpenAI",
    "desc": "Satya Nadella, CEO of Microsoft, said in an interview with the tech-focused YouTube channel ‘TBPN’ that co-founder and former CEO Bill Gates had expressed his lack of confidence when the company invested in OpenAI, the owner of ChatGPT.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/27/1600x900/logo/Lddxfnhjf_1772173076406_1772173082295.jpg",
    "source": "Mint"
  },
  {
    "title": "Pokémon's fans are still trying to catch 'em all 30 years later",
    "desc": "In the years Pokémon Red and Pokémon Green were released in 1996 for Nintendo Game Boy in Japan, marking the debut of Pokémon, the franchise has taken over the globe with its animated shows, mobile games and highly coveted trading cards.",
    "image": "https://dims.apnews.com/dims4/default/5ed10fa/2147483647/strip/true/crop/4272x2847+0+18/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc0%2F27%2Fe73f35ce53e221fe5c300b5d2eca%2F95f67797f39e44a5b4d584e81998b5d3",
    "source": "AP News"
  },
  {
    "title": "Germany’s Merz meets China’s tech vanguard, including Alibaba and Unitree CEOs",
    "desc": "Hangzhou visit reflects Germany’s attempt to work further with the engines of China’s digital and robotics economy.",
    "image": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2026/02/27/d834fb16-e1eb-446a-ba52-c7f414ba7de6_5efd58b8.jpg?itok=iqK8seIn&v=1772174966",
    "source": "South China Morning Post"
  }
]