[
  {
    "title": "One Dublin One Book: meet the writers who got the capital reading",
    "desc": "The Irish Writers Centre in collaboration with Dublin UNESCO City of Literature, supported by Dublin City Council, has released the latest installment of its series Dublin, One City, Many Stories",
    "image": "https://www.rte.ie/images/0023c9f0-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "PUCC mandate for petrol withdrawn by Odisha govt!",
    "desc": "Odisha: The government has submitted an affidavit in the High Court in this regard. Petrol pumps can only ask for PUCC but cannot deny fuel. The government..",
    "image": "https://img-cdn.publive.online/fit-in/1200x675/odishatv/media/media_files/2025/12/24/pucc-2025-12-24-10-42-54.png",
    "source": "odishatv.in"
  },
  {
    "title": "Behind the Senators’ ‘Heated Rivalry’ jerseys that are flying off the shelves",
    "desc": "Ottawa is selling No. 81 \"Rozanov\" and No. 24 \"Hollander\" jerseys at its team store based on the two lead characters from the TV show.",
    "image": "https://static01.nyt.com/athletic/uploads/wp/2026/01/25235613/IMG_9960-scaled-e1769446652456.jpg?width=1200&height=630&fit=cover",
    "source": "The New York Times"
  },
  {
    "title": "NRM CEC endorses Among, Tayebwa for Speaker and Deputy",
    "desc": "Both Among and Tayebwa also drew support from CEC members due to the sacrifices that saw several independent-leaning NRM candidates who had contested against official party flag bearers step down.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/9314e085-d56d-4482-a5ea-34572091c8fc.jpg",
    "source": "NewVision.co.ug"
  },
  {
    "title": "‘She narrowly escaped three bullets’: Pakistan’s trans community shaken by attacks and killings",
    "desc": "A wave of violence has left transgender people afraid to go out, as experts say the global rise of far-right ideology is fuelling transphobia",
    "image": "https://i.guim.co.uk/img/media/f51992cce22fd3c6584dfe764ba569595a5feccc/853_0_4266_3413/master/4266.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a3b5df2d2f79d71d81b81475bd37f83a",
    "source": "The Guardian"
  },
  {
    "title": "Alex Vindman, key Trump impeachment witness, launches Florida Senate run",
    "desc": "Army veteran Alex Vindman, a key witness during President Donald Trump’s first impeachment trial in 2019, is running for the Senate in Florida as a Democrat",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2023-11/231116-Alexander-Vindman-al-1223-0bbaf9.jpg",
    "source": "NBC News"
  },
  {
    "title": "Some still tout ivermectin as a cure-all. Here's what the science says",
    "desc": "Ivermectin had a cult-like following during the COVID-19 pandemic. Did science ever prove it was an effective treatment?",
    "image": "https://san.com/wp-content/uploads/2023/04/Straight_Arrow_News_Logo_1200x675.jpg",
    "source": "Straight Arrow News - SAN"
  },
  {
    "title": "Venus may get a huge meteor shower this July, thanks to a long-ago asteroid breakup",
    "desc": "This coming July, Venus could plow through the dust generated by an asteroid breakup thousands of years ago, potentially sparking an impressive meteor shower.",
    "image": "https://cdn.mos.cms.futurecdn.net/BkrqFoJMoDQjWNvTAV4tQc-1920-80.jpg",
    "source": "Space"
  },
  {
    "title": "Valve to face UK class action lawsuit with proposed damages of £656m",
    "desc": "The case was filed back in 2024, but no date has been set for the trial yet",
    "image": "https://assetsio.gnwcdn.com/steam-logo-2028307190.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "source": "GamesIndustry.biz"
  },
  {
    "title": "Northern Ireland's new drivers to face major licensing changes from October",
    "desc": "Liz Kimmins says the introduction of graduated driver licences shows how serious officials are when it comes tackling road safety.",
    "image": "https://static.files.bbci.co.uk/core/website/assets/static/news/images/metadata/poster-1024x576.5f404a8b8b.png",
    "source": "BBC"
  }
]