[
  {
    "title": "Atletico Madrid vs Bodo/Glimt predictions: Hosts to make a fast impact",
    "desc": "Expert Atletico Madrid vs Bodo/Glimt predictions and three tips for this Champions League clash on Wednesday, 28 January at 21:00.",
    "image": "https://assets.goal.com/images/v3/bltc23518eccea2a1fa/Atletico%20Madrid%20vs%20Bodo%20Glimt%20predictions.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Why the NPP flagbearer race is tougher in 2026 - Kwabena Agyepong explains",
    "desc": "Aspiring flagbearer of the New Patriotic Party (NPP), Kwabena Agyei Agyepong, has described the party’s flagbearer race as significantly more demanding than previous contests, citing the expansion of the party’s Electoral College as a major...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/549/54935544.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Government announces major support package for struggling pubs",
    "desc": "Chancellor Rachel Reeves is responding to pressure to back the country's boozers as closures mount up, with 188 pubs lost in the final three months of last year",
    "image": "https://i2-prod.mirror.co.uk/article36530760.ece/ALTERNATES/s1200/6_Pint-of-draught-beer-being-poured.jpg",
    "source": "The Mirror"
  },
  {
    "title": "Former St Helens MP Conor McGinn charged with sexual assaulting woman",
    "desc": "McGinn served as MP for St Helens North from 2015 but was suspended by the Labour Party in 2022.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2fd8/live/ce1c7f60-fb8d-11f0-bd4c-9d8c48f8eab8.png",
    "source": "BBC"
  },
  {
    "title": "PreatLoc™ by Preat® is Now Available",
    "desc": "Preat Corporation introduces PreatLoc™, an overdenture attachment system providing compatibility, reliability and precise performance",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/01/27/914623.png",
    "source": "The Manila Times"
  },
  {
    "title": "This discovery could let bones benefit from exercise without moving",
    "desc": "Researchers have discovered a biological switch that explains why movement keeps bones strong. The protein senses physical activity and pushes bone marrow stem cells to build bone instead of storing fat, slowing age-related bone loss. By targeting this “exercise sensor,” scientists believe they could create drugs that mimic exercise at the molecular level. The approach could protect fragile bones in people who are unable to stay active.",
    "image": "https://www.sciencedaily.com/images/1920/osteoporosis-stages-hip-bone-strength.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "‘A militia that kills’: uproar in Italy over ICE security role at Winter Olympics",
    "desc": "Milan’s mayor says agents’not welcome’ in co-host city and that Italy can take care of security itself",
    "image": "https://i.guim.co.uk/img/media/1644854c45e3f9bf8bed3ff264c36f39a87f5f36/0_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=19e0824269f36283fd73bef0c658cde8",
    "source": "The Guardian"
  },
  {
    "title": "Namibia: RA Warns Drivers About Flood-Affected Roads",
    "desc": "Due to continuous rainfall, sections of the road between Bwabwata National Park and Kongola, as well as approximately 30 kilometres from Kongola towards Katima Mulilo, have developed potholes and sustained other forms of road surface damage.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "UPS to cut additional 30,000 jobs in Amazon unwind, turnaround plan",
    "desc": "UPS announced it will eliminate an additional 30,000 jobs as it winds down its partnership with Amazon.",
    "image": "https://image.cnbcfm.com/api/v1/image/108218270-1761689543201-gettyimages-2243862832-_l9a2658_dzqlylh1.jpeg?v=1761689575&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Australia firefighters battle 'emergency level' blazes",
    "desc": "Firefighters in Victoria are battling at least six major fires amid a record-breaking heatwave.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bc12/live/bdf0fa00-fb4f-11f0-8a3f-efae3b17f55b.jpg",
    "source": "BBC"
  }
]