[
  {
    "title": "Pakistan 'well-positioned' for IMF review to unlock $1.2b fund: FinMin",
    "desc": "Fund to carry out the third EFF review and the second Resilience and Sustainability Facility review",
    "image": "https://i.tribune.com.pk/media/images/aaa-canva-1200x900-41760459998-0/aaa-canva-1200x900-41760459998-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Huawei Unveils Latest Smart Retail Solutions at EuroShop 2026 to Accelerate Digital Transformation",
    "desc": "Huawei today unveiled its latest suite of smart retail solutions at EuroShop 2026, the world's leading retail trade fair, to accelerate digital transformation and enhance customer experiences across the retail industry.",
    "image": "https://e.huawei.com/marketingcloud/pep/asset/2000000101/images/news/2026/smart-retail-euroshop/preview_euroshop2026.jpg",
    "source": "Huawei Enterprise"
  },
  {
    "title": "US sends deadliest fighter jets to Israel as Iran war looms",
    "desc": "The F-22 fleet is the latest addition to the arsenal that the US has amassed in the region over the last few weeks.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/708261",
    "source": "The Jerusalem Post"
  },
  {
    "title": "A simple chemical tweak could supercharge quantum computers",
    "desc": "Quantum computers need special materials called topological superconductors—but they’ve been notoriously difficult to create. Researchers have now shown they can trigger this exotic state by subtly adjusting the mix of tellurium and selenium in ultra-thin films. That tiny chemical tweak changes how electrons interact, effectively turning a quantum phase “dial” until the ideal state appears. The result is a more practical path toward building stable, next-generation quantum devices.",
    "image": "https://www.sciencedaily.com/images/1920/futuristic-quantum-computer-system-glowing.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Connect with the diamond industry with MTE",
    "desc": "The Mining and Technical Exhibition (MTE) is inviting suppliers looking to grow their presence in Botswana’s mining sector to come and showcase their mining solutions at the upcoming Jwaneng show in March.",
    "image": "https://www.africanmining.co.za/wp-content/uploads/Jwaneng1.jpg",
    "source": "African Mining Online"
  },
  {
    "title": "Honor says its 4.8mm thick MagicPad 4 is the world's slimmest Android tablet",
    "desc": "Ahead of a full release at Mobile World Conference (MWC), Honor has teased the MagicPad 4 that it calls the world's thinnest Android tablet.",
    "image": "https://s.yimg.com/ny/api/res/1.2/qXcKBtdmrXUur.NzRsu45Q--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2026-02/def21940-1239-11f1-bbfc-61f66c56a281",
    "source": "Engadget"
  },
  {
    "title": "Wednesday’s analyst upgrades and downgrades",
    "desc": "Inside the Market’s roundup of some of today’s key analyst actions",
    "image": "https://www.theglobeandmail.com/resizer/v2/WR5X5VOKVVE7LAV4J2ZUF7EWJY.JPG?auth=272339cd3f9d5e46fc7010765b37d3fd7899eec0cda2a1f65bd94ba87e4da85f&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "depth research in reforming its education sector",
    "desc": "DAR ES SALAAM: THE Tanzanian government said it values various education research being conducted, saying they will help in making reforms in education a country that aims to prepare young people gain skills that make them self-employed or employable. The remarks came today, February 25, 2026, from the government, through the Ministry of Education, Science",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-25-at-13.21.51.jpeg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "At-home HIV care cuts new infections by 70%, research finds",
    "desc": "Some African nations have teams that provide door-to-door health checkups, but HIV testing and drugs are often only available at clinics.",
    "image": "https://img.semafor.com/5be92c06ee3422039c284b08e7d99c41bd2e547d-6000x4000.jpg?rect=0,425,6000,3150&w=1200&h=630&q=75&auto=format",
    "source": "Semafor"
  },
  {
    "title": "Dangerous Storm: February 25, 2026 - StarDate Online",
    "desc": "Wiping out orbiting satellites",
    "image": "https://stardate.org/wp-content/uploads/2023/07/cropped-favicon-32x32.png",
    "source": "StarDate Online"
  }
]