[
  {
    "title": "School boy's private battle: 'I've acknowledged that I can't change the past'",
    "desc": "Alec was diagnosed with Ewing's Sarcoma, a soft tissue cancer, when he was just eight years old.\nAnd while ...",
    "image": "https://imageresizer.static9.net.au/hqR9mjkJ7aT4FQIJH7m_U-3fDFc=/0x56:1512x907/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F9429c32c-efc7-4efe-8c5e-3ff68a4fc3e4",
    "source": "Nine Honey"
  },
  {
    "title": "Waiting Is No Longer an Option’: President Samia Urges World to Act on Climate Crisis",
    "desc": "By Adonis Byemelwa",
    "image": "https://panafricanvisions.com/wp-content/uploads/2026/02/tonz.jpg",
    "source": "pan african visions"
  },
  {
    "title": "Arista Networks Leans On AI Networking To Extend Record Growth Story",
    "desc": "Arista Networks (NYSE:ANET) reported record annual financial results for 2025, supported by rising demand tied to AI networking. The company raised its 2026 revenue outlook and highlighted a significant contribution from AI related revenues. Management pointed to strong international growth as a key factor in the full year performance. Arista introduced new networking solutions and expanded its product set aimed at AI and cloud infrastructure workloads. For you as an investor, the headline...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/01c84f40a23de7510333f39442abc670",
    "source": "Yahoo Finance"
  },
  {
    "title": "Charli xcx Brings 'Brat' to Berlin With 'The Moment' Premiere",
    "desc": "Charli xcx said she’s ready for a new era at the Berlin Film Festival premiere of 'The Moment' – but she’s still figuring out just what that is.",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2261663627.jpg?crop=0px%2C0px%2C6000px%2C3375px&resize=1000%2C563",
    "source": "Variety"
  },
  {
    "title": "Baidu Uber Robotaxis In Dubai Test Global AI Expansion Story",
    "desc": "Baidu and Uber are partnering to roll out Apollo Go autonomous ride hailing services in Dubai. The launch extends Baidu’s self driving footprint outside China, adding to services already operating in 22 cities. The move comes alongside international launches of Baidu Search and BaiduWiki as part of Baidu’s broader global AI push. Baidu, listed as NasdaqGS:BIDU, is pushing further into global markets while its shares trade around $137.01. The company’s 1 year return of 40.6% sits against a...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/6ddc1eebc0ae0570d413acd84bfde5dc",
    "source": "Yahoo Finance"
  },
  {
    "title": "Detective sues force for 'psychiatric injury' after policewoman fiancee cheats on him with colleague at the station - then sleeps with and marries the senior cop brought in to investigate",
    "desc": "For one of Britain's sleepiest police forces is at the centre of a real life thriller - and the lurid tale's twists and turns are set to be played out in court.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/14/22/106396031-0-image-m-9_1771109942873.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Angus Taylor faces leadership test in Farrer byelection as independent vows to ‘finish what we started’ and oust Liberals",
    "desc": "With backers including Climate 200, Michelle Milthorpe is confident she can win Sussan Ley’s south-western NSW seat",
    "image": "https://i.guim.co.uk/img/media/ca6a433f870ffd70a8c18eb9485b7e12bc88cbe1/152_0_1850_1480/master/1850.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a32454a385ffd3ee50e822fc4befbabc",
    "source": "The Guardian"
  },
  {
    "title": "Key suspect in murder of Mukono UCU dean of students a",
    "desc": "Tumwebaze will be buried on Sunday, February 15, 2026, at Rubaya Kegoshora in Kashari County in Mbarara.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/fca27968-5898-49d3-a1d1-63d7e43db802.jpg",
    "source": "NewVision.co.ug"
  },
  {
    "title": "Epstein files trigger fallout in Europe, less so in U.S. : NPR",
    "desc": "Unlike in Europe, officials in the U.S. with ties to Epstein have largely held their positions of power.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4583x2578+0+239/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fe4%2Fe3%2F8a5ed6c144a988756c09618e5964%2Fap26033470028233.jpg",
    "source": "NPR"
  },
  {
    "title": "Real Madrid 4-1 Real Sociedad: Trent Alexander-Arnold get assist on return",
    "desc": "Trent Alexander-Arnold claims an assist on his first start in more than two months as Real Madrid beat Real Sociedad to move top of La Liga.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3a81/live/6494f240-09f0-11f1-b95c-79d90fbdbf52.jpg",
    "source": "BBC"
  }
]