[
  {
    "title": "HAVELSAN Showcases Autonomous Swarm Drone Capabilities Under Its “Digital Troops” Concept",
    "desc": "https://youtu.be/7JwiWuv5WR8 HAVELSAN demonstrated its autonomous swarm drone capabilities through a live field activity conducted with a swarm of POYRAZ Quadcopter drones, showcasing kamikaze and multi-target engagement capabilities within a realistic operational scenario. The demonstration attracted strong interest from senior civilian and military officials. The activity validated the end-to-end performance of HAVELSAN’s distributed swarm architecture, which…",
    "image": "https://www.military.africa/wp-content/uploads/2026/01/Poyraz-2-1-scaled.png",
    "source": "Military Africa"
  },
  {
    "title": "'It's a baby boy and a baby girl': Ram Charan and Upasana Konidela welcome twins; Chiranjeevi shares the happy news",
    "desc": "Ram Charan and his wife Upasana Konidela are now parents of three. The couple welcomed twins—a baby boy and a baby girl—on Saturday, a development tha.",
    "image": "https://static.toiimg.com/thumb/msid-127827820,width-1280,height-720,imgsize-50320,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Harry Kane and Luis Diaz on target for Bayern but Vincent Kompany's side need goal-line clearance from Alphonso Davies to preserve point against Hamburg",
    "desc": "Bayern Munich dropped points in the Bundesliga for the second consecutive game as they struggled to a 2-2 draw against Hamburg in north Germany. Harry Kane and Luis Diaz had put the league leaders ahead after Fabio Vieira's first-half penalty, but the hosts battled back through the impressive Luka Vuskovic to take a point in a thrilling encounter at Volksparkstadion.",
    "image": "https://assets.goal.com/images/v3/blt1e9a13122ba6826d/GOAL%20-%20Multiple%20Images%20-%203%20Stacked%20-%20Facebook(12).jpg",
    "source": "Goal.com"
  },
  {
    "title": "Full circle: Former childhood cancer patient now a nurse at OSMH",
    "desc": "'I don't know who I would be without camp,' says Maram Muktar, who is returning to life-changing Campfire Circle as a caregiver this summer",
    "image": "https://www.vmcdn.ca/f/files/orilliamatters/images/health/marammuktar-1-28-26-1.jpg;w=1200;h=800;mode=crop",
    "source": "OrilliaMatters.com"
  },
  {
    "title": "Planet Labs PBC Director Sells 47K Shares Worth Over $1 Million",
    "desc": "A director of a planet-monitoring company recently sold over $1 million in shares amid the company's stock soaring to outer space, like their satellites.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fcdn.content.foolcdn.com%2Fimages%2F1umn9qeh%2Fproduction%2F1a599f395be31e2f508c3aa7decb988f9ce983b7-1401x1251.png%3Fw%3D1401%26h%3D1251&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "United Rugby Championship: Leinster come from behind to beat Edinburgh",
    "desc": "Leinster prove too strong for Edinburgh in the URC as the Irish side come from behind to earn a bonus-point win.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3a50/live/ad46a100-fedd-11f0-bde6-39dbeae3fac9.jpg",
    "source": "BBC"
  },
  {
    "title": "The young Australian who says he is the president of his own European country",
    "desc": "Daniel Jackson claims to be the youngest president in the world. The problem is that no other countries recognise him.",
    "image": "https://live-production.wcms.abc-cdn.net.au/8d0f508ccae8ff1b943ffcb90b65dcd2?impolicy=wcms_watermark_news&cropH=864&cropW=1536&xPos=0&yPos=83&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Chelsea player ratings vs West Ham: It's barmy at the Bridge! Blues miraculously recover from first-half abomination as history-making Enzo Fernandez winner saves Liam Rosenior's bacon",
    "desc": "Chelsea recovered to win a Premier League match from two goals down for the first time in their history as Enzo Fernandez's strike in stoppage time broke West Ham hearts - here's GOAL's player ratings",
    "image": "https://assets.goal.com/images/v3/blte0619f225b9e262d/GOAL%20-%20Multiple%20Images%20-%203%20Stacked%20-%20Facebook%20(1).jpg",
    "source": "Goal.com"
  },
  {
    "title": "Where Will Intel Stock Be in 1 Year?",
    "desc": "Can the chip giant convince investors once again that it is indeed capable of turning its fortunes around?",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853319%2Finside-intel-building-with-intel-logo-in-view_intel.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Danes Who Fought Alongside US Troops March Against Trump’s Comments",
    "desc": "In the latest anti-American gathering in Denmark, veterans who went to war alongside U.S. troops took to the streets of Copenhagen.",
    "image": "https://static01.nyt.com/images/2026/01/31/multimedia/31int-denmark-protest01-photo-vjkf/31int-denmark-protest01-photo-vjkf-facebookJumbo.jpg",
    "source": "The New York Times"
  }
]