[
  {
    "title": "The Commodities Feed: Further US-Iran talks set for this week",
    "desc": "Oil prices remain well supported as we head into another round of nuclear talks between the US and Iran",
    "image": "https://think.ing.com/uploads/hero/_w800h450/shutterstock_1913735710.jpg",
    "source": "ING THINK economic and financial analysis | ING THINK"
  },
  {
    "title": "Jan 2026 Malaysian vehicle sales down by 29%",
    "desc": "The Malaysian Automotive Association (MAA) has released vehicle sales data for the month of January 2026, which saw a total of 64,298 units being delivered to customers. This latest figure is 29% lower when compared …",
    "image": "https://paultan.org/image/2024/12/KLIMS-2024-highlights-and-displays-2-1200x745.jpg",
    "source": "Paul Tan"
  },
  {
    "title": "AGON by AOC Announces First-Ever Collaboration with Global Hit Anime DAN DA DAN",
    "desc": "AGON by AOC, the world’s No.1 gaming monitor brand for the sixth consecutive year¹, today announced its first strategic collaboration with the global hit IP,",
    "image": "https://walastech.com/wp-content/uploads/2026/02/image-1.jpeg",
    "source": "WalasTech"
  },
  {
    "title": "Japan Joins Germany, China, Vietnam, US, And Other Powerful Nations In Driving Unprecedented Long",
    "desc": "Japan has joined Germany, China, Vietnam, the US, and other powerful nations in boosting UAE tourism with an unprecedented surge in long-haul arrivals, driven by Emirates’ ambitious expansion plan.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/Emirates-5-850x567-4-1.jpeg",
    "source": "Travel And Tour World"
  },
  {
    "title": "Security team foils stock theft attempt in Samburu",
    "desc": "A security operation has thwarted a livestock theft incident in Samburu County, leading to the recovery of 50 goats after an armed confrontation between police officers and suspected raiders.",
    "image": "https://www.kbc.co.ke/wp-content/uploads/2026/02/samburu-e1771233280581.jpeg",
    "source": "KBC Digital"
  },
  {
    "title": "Australian women and children with links to ISIS forced to head back to camp in Syria",
    "desc": "The ABC can reveal Australian families with links to Islamic State fighters have left a camp in north-eastern Syria, and will try to begin their journey home to Australia.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ec561a81d95a4f09d68bdd15dd2113fa?impolicy=wcms_watermark_news&cropH=492&cropW=875&xPos=0&yPos=127&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "SAPS hunts Zimbabwe celebrity musician Malloti over armed robbery",
    "desc": "IOL The South African Police Service (SAPS) has confirmed to IOL that Zimbabwean musician and social media personality Malloti is wanted in South Africa on a charge of robbery with a firearm, with authorities now moving to have her extradited from Zimbabwe. Speaking to IOL, Western Cape SAPS spokesperson Captain F.C. Van Wyk confirmed that […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2025/02/26150458/malloti.jpg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "Hasina’s presence in India will not be a ‘deterrent’ to broader India-Bangladesh relation: BNP’s Mirza Fakhrul Islam Alamgir",
    "desc": "BNP's Mirza Fakhrul asserts Sheikh Hasina's presence in India won't hinder Bangladesh's broader relations with India.",
    "image": "https://th-i.thgim.com/public/incoming/6nprms/article70638138.ece/alternates/LANDSCAPE_1200/2018-12-28T022607Z_1898456341_RC1CC6AD0D50_RTRMADP_3_BANGLADESH-ELECTION.JPG",
    "source": "The Hindu"
  },
  {
    "title": "Why the Noise Master Buds Max are the headphones you didn’t know you needed",
    "desc": "If you’re tired of flat audio, weak bass, and average battery life, it’s time for an upgrade to the Noise Master Buds Max headphones.",
    "image": "https://stuff.co.za/wp-content/uploads/2026/02/Noise-Master-Buds-Max_header.png",
    "source": "Stuff South Africa"
  },
  {
    "title": "Rs1500 prize bond draw February 2026 results",
    "desc": "First prize winner receives Rs3,000,000, three second prize winners get Rs1,000,000 each",
    "image": "https://i.tribune.com.pk/media/images/1353514-imgwa-1489330443/1353514-imgwa-1489330443-640x480.webp",
    "source": "The Express Tribune"
  }
]