[
  {
    "title": "HP, Dell, Acer and Asus mull using Chinese memory chips amid supply crunch, Nikkei Asia reports",
    "desc": "Feb 5 (Reuters) - PC makers ‌HP, Dell, Acer and Asus are considering sourcing ‌memory chips from Chinese chipmakers for the first time ‌amid a global supply crunch that is threatening product launches and pushing up costs across the tech industry, Nikkei Asia reported on Thursday.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/05/3755280.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "Zimbabwe: Massage Parlour Cover Leads to Human Trafficking Arrest in Harare",
    "desc": "A 32-year-old woman appeared at the Harare Magistrates' Court after being accused of harbouring four Zambian female nationals whom she exploited for prostitution under the pretext of working in a massage parlour.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "HRW: Civilians Face Escalating Attacks and War Crimes in Ukraine",
    "desc": "Civilians in Ukraine continued to face grave conflict-related abuses in 2025, as increasingly targeted and indiscriminate Russian attacks led to rising civilian deaths, injuries, and widespread destruction, Human Rights Watch said in its World Report 2026. The report found that millions of Ukrainians remain displaced inside the country and abroad, many struggling to access essential",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "'GOT' alum Kit Harington all hearts for kids: 'All I want'",
    "desc": "Kit Harington is the father of two kids, whom he shares with wife Rose Leslie.According to a new report by PEOPLE magazine, the Game of Thrones alum spoke with Mr Porter and reflected on how...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-05/1391113_101234_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "Could a rural equivalent of Tinder attract doctors?",
    "desc": "There's a shortfall of at least 130 rural GPs nationwide.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--lomoq9ZM--/t_tohu-badge-facebook/v1643861143/4M1XP8B_image_crop_132803?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "National Gallery Singapore’s Southeast Asia Gallery to close from April 2026 for major revamp",
    "desc": "A smaller interim gallery featuring key highlights from the UOB Southeast Asia Gallery will open from October 2026, allowing visitors continued access during the revamp.",
    "image": "https://dam.mediacorp.sg/image/upload/s--0cRObpsq--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/05/national_gallery_uob_southeast_asia_gallery.jpg?itok=HzN8HwXj",
    "source": "CNA Lifestyle"
  },
  {
    "title": "Vance is in Milan for the Winter Olympics",
    "desc": "Vice President JD Vance landed in Milan to lead President Donald Trump’s delegation to the 2026 Winter Olympics.",
    "image": "https://dims.apnews.com/dims4/default/5c60aaf/2147483647/strip/true/crop/5088x3390+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F86%2F93%2F7f99f3e26bf6b4609063ec258184%2F0d1c9299e2d54f21a76b73285a10af89",
    "source": "AP News"
  },
  {
    "title": "Traveling and Eating Across Asia: 3 Favorite Food Cities and 1 to Skip",
    "desc": "Sophie Steiner says Tokyo is often miscast as the pinnacle of Japanese cuisine. For her, the long waits rarely justify the hype.",
    "image": "https://i.insider.com/6982c5f4e1ba468a96ab5aae?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "Defeating death: ‘Vitalists’ seek to rebrand the longevity movement",
    "desc": "he Vitalist Bay Summit ... hosted various events to explore tools—from drug regulation to cryonics—that might be deployed in the fight against death. One",
    "image": "https://geneticliteracyproject.org/wp-content/uploads/2026/02/ChatGPT-Image-Feb-4-2026-09_45_07-AM.png",
    "source": "Genetic Literacy Project"
  },
  {
    "title": "N4XT Experiences and SAP Partner to Power New Digital and Retail Infrastructure for NYFW",
    "desc": "As part of the partnership, SAP will support digital platform development, retail activations and designer-first tools.",
    "image": "https://wwd.com/wp-content/uploads/2024/10/Joseph-Altuzarra-Headshot-3.jpg?crop=0px%2C27px%2C7251px%2C4063px&resize=1000%2C563",
    "source": "WWD"
  }
]