[
  {
    "title": "Joburg man shot dead during ‘anti-drug operation’ by ‘Sizok’thola’ TV show",
    "desc": "ActionSA Ekurhuleni mayoral candidate Xolani Khumalo was present at Sunday's operation",
    "image": "https://www.timeslive.co.za/resizer/v2/6JXRDNHMCJJRTJIRLAAENZ4GIA.jpg?smart=true&auth=527984622dc466b834f1494e7c40e8144d4082a243d641ff5e7d0eb518165a1c&width=1200&height=630",
    "source": "TimesLIVE"
  },
  {
    "title": "Ex-Kaizer Chiefs coach replacement fired after three games with Premier Soccer League outfit after 'tactical hitch'",
    "desc": "Clubs are currently working hard to achieve their goal in the second half of the season. It explains why the tacticians are under pressure to deliver, with those failing to deliver getting replaced by the management. Most South African top-tier teams are competing in both top-flight games as well as the Nedbank Cup.",
    "image": "https://assets.goal.com/images/v3/bltf5388dd6f38e8922/Eric%20Tinkler%20and%20Gavin%20Hunt,%20Sekhukhune%20United%20vs%20Durban%20City.jpg",
    "source": "Goal.com"
  },
  {
    "title": "They went on a mission to Norway's twilight zone and found a curious tentacled animal in the gloom",
    "desc": "OceanX explorers filmed the drifting red helmet jellyfish in the deep waters off Norway’s coast.",
    "image": "https://c02.purpledshub.com/uploads/sites/62/2026/02/OceanX-Norway-mission.jpeg?w=1200",
    "source": "BBC Wildlife Magazine"
  },
  {
    "title": "These are My Top 5 Favourite OnePlus Smartphones",
    "desc": "There's news going around that OnePlus might not have much time left. But in the name of honouring its legacy, here are my top 5 OnePlus smartrphones, ranked in order.",
    "image": "https://soyacincau.com/wp-content/uploads/2026/02/260209-oneplus-top-5-smartphones-4.jpg",
    "source": "SoyaCincau"
  },
  {
    "title": "Monday’s analyst upgrades and downgrades",
    "desc": "Inside the Market’s roundup of some of today’s key analyst actions",
    "image": "https://www.theglobeandmail.com/resizer/v2/7ZA3WCK7VVDZDJUA7NIDGLC24Y.JPG?auth=0996453c4fd8ab889b640d6e32d57a67ac24b07cd75f8dced5ca45ad8fc75d15&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "Season Campaign Featuring Exclusive Offers on Premium Home Technology Across the region",
    "desc": "/PRNewswire/ -- Hisense, a leading brand in global consumer electronics and home appliances, today announced the launch of its \"Innovation That Brings Us...",
    "image": "https://mma.prnewswire.com/media/2889862/Hisense_Ramdan.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "A secret cell alliance may explain why ovarian cancer is so deadly",
    "desc": "Scientists have discovered why ovarian cancer spreads so rapidly through the abdomen. Cancer cells enlist normally protective abdominal cells, forming mixed groups that work together to invade new tissue. These helper cells lead the way, allowing cancer to spread faster and resist chemotherapy. The findings uncover a critical weakness that future treatments may target.",
    "image": "https://www.sciencedaily.com/images/1920/cancer-and-mesothelial-cells-form-hybrid-spheres.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Newport World Resorts marks Lunar New Year with dining, gifting and live entertainment",
    "desc": "Lunar New Year at Newport World Resorts unfolds through a full day of dining, cultural traditions and entertainment, positioning the property as a gathering...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/09/77964.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Nishat Hotels Withdraws Offer to Acquire Majority Stake in Rafhan Maize",
    "desc": "Next Capital Limited (PSX: NEXT) informed the Pakistan Stock Exchange on Monday that the Public Announcement of Intention (PAI) related to the proposed",
    "image": "https://propakistani.pk/wp-content/uploads/2024/12/62cf98b1f315a-scaled.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "How to Watch PSL Multan Sultans Auction",
    "desc": "The auction for the Pakistan Super League (PSL) franchise Multan Sultans is scheduled to take place today, Monday in Lahore. The ceremony will begin at 6",
    "image": "https://propakistani.pk/wp-content/uploads/2023/01/Multan-Sultans-2.jpg",
    "source": "ProPakistani"
  }
]