[
  {
    "title": "Wolverine and David Colton’s Captain America Clash in ‘Weapons of Armageddon’ #2 Preview",
    "desc": "Check out the preview for ‘Wolverine: Weapons of Armageddon’ #2 by Chip Zdarsky and Luca Maresca as the lead-in to this summer’s ‘Armageddon’ event continues.",
    "image": "https://cdn.marvel.com/content/1x/3cc3.jpg",
    "source": "Marvel.com"
  },
  {
    "title": "Validation of the Simplified Chinese Clear Communication Index Using Diabetes Education Materials: Instrument Adaptation and Validation Study",
    "desc": "Background: In the postpandemic context, the surge of digital health information has intensified public demand for clear and practical communication, particularly in China, where health literacy disparities persist. The Clear Communication Index, developed by the US Centers for Disease Control and Prevention (CDC), is a standardized tool for assessing the clarity and actionability of health materials, but no version adapted to the simplified Chinese context has been established.\nObjective: This study aims to translate and culturally adapt the Clear Communication Index into simplified Chinese, and subsequently validate its psychometric properties using diabetes health communication materials from provincial CDCs across Mainland China, a disease area with a substantial public health burden and strong reliance on health education.\nMethods: Following a standardized cross-cultural process (forward-back translation and expert review), we developed the simplified Chinese version of the Clear Communication Index (C-CCI) and finalized a 12-item scale across 4 dimensions (Main Message and Call to Action, Behavioral Recommendations, Numbers, Risk) with yes or no scoring (0‐100). One top-ranked diabetes health education material was sampled from each provincial CDC website in Mainland China (30/31 included; 96.8%) on May 18, 2025. Twelve raters with multidisciplinary backgrounds completed a 3-week standardized training program and independently evaluated each article (360 ratings). Structural validity was examined using exploratory factor analysis and confirmatory factor analysis. Content validity was assessed by the item-level content validity index and the scale-level content validity index/average. Reliability was evaluated by internal consistency (Cronbach α) and inter-rater agreement (Fleiss kappa), while convergent/discriminant validity was assessed using composite reliability and average variance extracted (AVE).\nResults: The 4-factor structure was supported. Content validity was high, with the scale-level content validity index/average values of 0.976 for clarity and 1 for relevance. Overall reliability was acceptable (Cronbach α=0.837), with particularly strong internal consistency in the Risk dimension (Cronbach α=0.910). Inter-rater agreement was substantial (κ=0.624). Convergent validity (composite reliability=0.897‐0.914; AVE=0.645‐0.831) and discriminant validity were satisfactory. Application to 30 provincial CDC websites yielded a mean C-CCI score of 53.84 (SD 29.74), well below the recommended threshold of 90. No significant regional differences were observed in total scores; however, Behavioral Recommendations scored slightly higher in western provinces than in eastern and central regions (η²=0.034), representing a small effect size with limited practical significance.\nConclusions: The C-CCI demonstrated good validity, reliability, and feasibility for evaluating simplified Chinese health communication materials. These findings underscore the need to strengthen health communication practices in China and encourage provincial CDCs to align material development with national health literacy goals. Integrating the C-CCI into routine CDC review protocols could support evidence-based quality assurance and advance clearer, more actionable public health communication nationwide.",
    "image": "https://asset.jmir.pub/assets/a35c0182d05e8858d304d37dbb42edfb.png",
    "source": "Journal of Medical Internet Research"
  },
  {
    "title": "Laya ups price of 65 of its policies by average of 4.7%",
    "desc": "Laya Healthcare is increasing the prices of 65 of its health insurance policies by an average of 4.7%, which it said is the equivalent of around €80 per adult annually.",
    "image": "https://www.rte.ie/images/00086f32-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "TrueFoundry Recognized as a Representative Vendor in Gartner Market Guide for AI Gateways",
    "desc": "TrueFoundry, an enterprise AI infrastructure platform, today announced its recognition as a Representative Vendor in the 2025 Gartner Market Guide for AI Gat...",
    "image": "https://mms.businesswire.com/media/20260220396246/en/2726634/22/TrueFoundry_Logo_1536x1000l.jpg",
    "source": "Business Wire"
  },
  {
    "title": "3.3 Million Pounds of Frozen Chicken Products Recalled",
    "desc": "A recall was just announced on 3.3 million pounds of frozen chicken fried rice products, including a Trader Joe’s favorite. Here’s what to know.",
    "image": "https://www.eatingwell.com/thmb/jFFdI8pWS4ZkCHAfLmsUq4FW77U=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Over-3-Million-Pounds-of-Frozen-Chicken-Products-Recalled-99aa675c519f44b29a15f9f40d0d1fed.jpg",
    "source": "EatingWell"
  },
  {
    "title": "Short-track speedskater stretchered off after Olympic opponent's blade slices her face",
    "desc": "A short-track speedskater was stretchered off the ice after an American skater's blade sliced her face during a fall at the Olympics on Friday. (AP Photo)",
    "image": "https://media.newscentermaine.com/assets/CCT/images/c3cf077f-2724-4a5a-ba0c-8f50d5bce892/20260220T203256/c3cf077f-2724-4a5a-ba0c-8f50d5bce892_1140x641.jpg",
    "source": "newscentermaine.com"
  },
  {
    "title": "Meta Focuses On Developers, Mobile In Major Horizon Worlds VR Shift",
    "desc": "Meta Focuses On Developers, Mobile In Major Horizon Worlds VR Shift - 02/23/2026",
    "image": "https://s3.amazonaws.com/static.mediapost.com/publications/images/mp-logo-fb.jpg",
    "source": "MediaPost"
  },
  {
    "title": "Zardari convenes joint session of parliament on March 2",
    "desc": "The government has decided to convene a joint session of Parliament on March 2 to mark the beginning of the new parliamentary year. According to sources, the Ministry of Parliamentary Affairs has forwarded a summary to the Prime Minister, who will send it to President Asif Ali Zardari for formal approval. President Zardari will address […]",
    "image": "https://dailytimes.com.pk/assets/uploads/2026/02/Zardari-2-copy-1.jpg",
    "source": "Daily Times"
  },
  {
    "title": "Fragile X Study Finds Brain Wave Link in Humans, Mice",
    "desc": "Numerous potential treatments for neurological conditions, including autism spectrum disorders, have worked well in mice but then disappointed in",
    "image": "https://news.mit.edu/sites/default/files/images/202602/mit-picower-mark-bear.jpg",
    "source": "Mirage News"
  },
  {
    "title": "Six cancers rising faster in younger adults than older ones",
    "desc": "Large new global study also shows two types — colorectal and uterine — are becoming both more common and more deadly among the young.",
    "image": "https://news.harvard.edu/wp-content/uploads/2026/02/021226_YoungCancer_039.jpg",
    "source": "Harvard Gazette"
  }
]