[
  {
    "title": "Post-Doctoral Fellow Alice Engelhard Publishes Article in Review of International Studies",
    "desc": "Dr. Engelhard’s article, titled “Imperial mobilities, errantry, and the displacement of the Chagos Islanders”, uses the 1968 displacement of Chagos Islanders by the British under the guise of claiming the Chagossians as “contract workers” to argue that apparently clear distinctions between “migrants” and “natives” obscure more mobile political relations. The article highlights the need to...",
    "image": "https://krieger.jhu.edu/poli-sci/wp-content/uploads/sites/55/2025/10/Engelhard_10-25-225x300.jpg",
    "source": "Political Science | Johns Hopkins University"
  },
  {
    "title": "Steve Rosenberg on the tightrope of reporting from Russia on Ukraine war",
    "desc": "The BBC's Russia editor reflects on the difficulties of working as a British journalist in Moscow.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/74c2/live/d3c20a60-fde6-11f0-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Men covertly filming women at night and profiting from footage, BBC finds",
    "desc": "The BBC went undercover to investigate an industry where women are filmed at night without their knowledge.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f3ca/live/0c831ee0-fc23-11f0-b36e-bd4784e89465.png",
    "source": "BBC"
  },
  {
    "title": "Cabinda separatists claim 'independence' from Angola",
    "desc": "The coastal province, sandwiched between the Democratic Republic of Congo and Congo-Brazzaville and separated from the rest of Angola by a narrow strip of land, produces three-fifths of Angola's oil.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/4ba6164f-d982-4500-8a8b-4da40e79037b.jpg",
    "source": "NewVision.co.ug"
  },
  {
    "title": "Kasese railway line to get upgrade to Standard",
    "desc": "“Our transport system is irrational. Roads are overcrowded with cars and cargo. This leads to slow movement, increased traffic and damaged roads. To solve this, cargo must move to railways and waterways, while petroleum products will be transported through pipelines,” Museveni said at the time.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/c527e28d-80a8-4606-a3c7-729c8b76d82b.jpg",
    "source": "NewVision.co.ug"
  },
  {
    "title": "Hidden detail found in Anne Boleyn portrait was ‘witchcraft rebuttal’, say historians",
    "desc": "Exclusive: Underdrawing suggests attempt to debunk myth that former wife of Henry VIII had sixth finger",
    "image": "https://i.guim.co.uk/img/media/7a02e5bc4700f739ddba08ca54428bcfc0574154/623_0_2700_2160/master/2700.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0af4c9612e3722e44dac69a35f5d5c4c",
    "source": "The Guardian"
  },
  {
    "title": "UK Sport urges BBC to boost coverage of Olympic sports between Games",
    "desc": "A survey commissioned by UK Sport has shown that 69% of the public wanted Olympic sports broadcast more regularly on free-to-air TV",
    "image": "https://i.guim.co.uk/img/media/a062b72858c90c602cdff48b44a904cc0a5f402f/619_132_4120_3296/master/4120.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=42f1229afc062622b96301de3ac45feb",
    "source": "The Guardian"
  },
  {
    "title": "Will Thailand Become More Democratic After the Vote?",
    "desc": "A more democratic Thailand after the 7 February elections must mean more than another competitive poll. It requires change in the constraints that determine whether popular mandates can be exercised and renewed.",
    "image": "https://i0.wp.com/fulcrum.sg/wp-content/uploads/CM26034-Smol-e1770003839884.jpg?fit=1200%2C538&ssl=1",
    "source": "fulcrum.sg"
  },
  {
    "title": "what to expect from Man City in transfer window end",
    "desc": "What is expected from Manchester City on the final day of the January transfer window after a busy month for Hugo Viana",
    "image": "https://i2-prod.manchestereveningnews.co.uk/article33342785.ece/ALTERNATES/s1200/0_GettyImages-2257412056.jpg",
    "source": "Manchester Evening News"
  },
  {
    "title": "Professor: Estonia has not invested enough in electricity production",
    "desc": "TalTech energy Professor Igor Krupenski said Estonia's high winter electricity prices show the country has made little investment in electricity generation over the past 15 years.",
    "image": "https://s.err.ee/photo/crop/2026/02/01/3174311h8acbt24.jpg",
    "source": "ERR"
  }
]