[
  {
    "title": "Mars Organics Can’t Be Fully Explained by Geological Processes Alone, NASA Study Says",
    "desc": "Known non-biological sources, from meteorites to surface chemistry, fall short of accounting for organic compounds detected by NASA’s Curiosity rover, according to a new study published in the journal Astrobiology.",
    "image": "https://cdn.sci.news/images/2025/03/image_13778f-Martian-Alkanes.jpg",
    "source": "Sci.News"
  },
  {
    "title": "St Pauli plotting their next miracle in tantalising Bundesliga survival battle",
    "desc": "An unlikely win over Stuttgart was an overdue reminder that unity remains St Pauli’s greatest strength in defying the odds again",
    "image": "https://i.guim.co.uk/img/media/19d0636f523be18166f2449a12c11913761691bc/57_0_3333_2667/master/3333.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f3cbedf8214feeb8e6803e205b3e2907",
    "source": "The Guardian"
  },
  {
    "title": "Tundu Lissu’s Treason Trial Resumes With Fierce Legal Debate Over ‘Secret Witness’",
    "desc": "Lissu’s treason trial resumes amid a contentious legal clash over the prosecution’s secret witness, which he decries as a mockery of justice.",
    "image": "https://thechanzo.com/wp-content/uploads/2026/02/TUNDU-LISSU-1280x853.jpg",
    "source": "The Chanzo"
  },
  {
    "title": "Man caught on video cutting community cat's fur with scissors in Everton Park",
    "desc": "A well-loved community cat in Everton Park was allegedly held down by a man who cut off patches of its fur with a pair of scissors. Closed-circuit television footage of the incident, which purportedly went on for six minutes, was posted on Sunday (Feb 8) on Instagram by @timmytheblackcat_, a page dedicated to the black cat named Timmy. In the...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/everton-park-man-cut-cat-fur.jpg?itok=z9esjNww",
    "source": "AsiaOne"
  },
  {
    "title": "Commander Shake-Up Speculation Drives Up Banlist Card Prices",
    "desc": "Speculation about today’s changes to the Commander ban list have caused upheaval in the card market as players speculate on what could be unbanned, with some cards nearly quintupling in price.",
    "image": "https://draftsim.com/wp-content/uploads/2026/02/Prophet-of-Kruphix-Illustration-by-Winona-Nelson.png",
    "source": "Draftsim"
  },
  {
    "title": "Statement from Christine Lagarde, President of the European Central Bank",
    "desc": "The European Central Bank (ECB) is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency.",
    "image": "https://www.ecb.europa.eu/press/shared/img/socialmedia/social-default.jpg?0ef1632c35edede913681bb76af694a4",
    "source": "European Central Bank"
  },
  {
    "title": "Trader to be charged over road rage following minor accident",
    "desc": "Kajang police chief Naazron Yusof says the 52-year-old will be charged with voluntarily causing hurt and criminal intimidation.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/cc20b5bd-tendang-warga-emas-fb-090226-1.webp",
    "source": "freemalaysiatoday.com"
  },
  {
    "title": "NERC seeks familiarisation of judges with state electricity laws",
    "desc": "The Nation Newspaper NERC seeks familiarisation of judges with state electricity laws",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2025/03/14144955/NERC.jpg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "Apply for Funded Traineeship for Young Graduates at the EU Delegation (Open to several nationalities) 2026",
    "desc": "APPLY FOR FUNDED TRAINEESHIP FOR YOUNG GRADUATES AT THE EU DELEGATION (OPEN TO SEVERAL NATIONALITIES) 2026. Apply below. When is Application Deadline: Internships",
    "image": "https://www.afterschoolafrica.com/wp-content/uploads/2024/05/eu.webp",
    "source": "After School Africa"
  },
  {
    "title": "PlayStation 60 Minute State of Play Confirmed for February, God of War News Likely",
    "desc": "PlayStation has announced a new State of Play and its believed a new God of War game, amongst other exclusives, will be announced as part of the line up",
    "image": "https://images.ladbible.com/ogimage/v3/assets/bltbc1876152fcd9f07/blt2efe53c213e6b112/6989e01d7a6c7337829e0ac3/State-of-Play-February.jpg",
    "source": "GAMINGbible"
  }
]