[
  {
    "title": "As Trump reshapes foreign policy, China moves to limit risks, reap gains",
    "desc": "President Trump's focus overseas may spare China for now, but Beijing still worries that his \"America First\" rhetoric hasn't softened what it calls U.S. \"military adventurism.\"",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3000x1688+0+156/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ff2%2F2d%2F9134f3a04f3fb1824194343a31f6%2Fgettyimages-871894532.jpg",
    "source": "NPR"
  },
  {
    "title": "Ethiopia to Advance Nat'l Interests at African Union, Italy-Africa Summits: Spokesperson",
    "desc": "Addis Ababa, February 5, 2026 (ENA)—Ethiopia has made full preparations to advance its national interests at the upcoming 39th African Union Summit and the Italy-Africa Summit that will take place in the capital city, Ministry of Foreign Affairs Spokesperson Nebiat Getachew said.\nThe Spokesperson briefed journalists today on the general arrangements made for the 39th African Union Summit and the Italy-Africa Summit.\nThe Ordinary Session of the Executive Council of the African Union will be held from 11–12 February, and the Summit on 14–15 February. The Italy-Africa Summit will take placed on 13 February, 2026.\nAccording to Nebiyat, Ethiopia has made comprehensive logistical arrangements and is prepared for active engagement at both diplomatic and economic levels.\nThe spokesperson emphasized the importance of both summits for fostering political and economic diplomacy.\nAccordingly, Ethiopia is preparing to actively participate in the summits on issues that promote its national interests, and enhance conference tourism that reflects Ethiopian culture and values by providing special hospitality for the participants.\nHe added that this year, as in the past, 179 young volunteers were recruited for the African Union Summit, demonstrating the principle that every citizen is a diplomat for his or her country.\nThe Spokesperson explained that this youth volunteer activity is being carried out in line with the Youth Volunteer Service Framework established by Prime Minister Abiy Ahmed, calling on all Ethiopians to extend their usual cooperation to ensure the success of summits.\nFurthermore, Nebiat stated that Ethiopia has made full preparations in terms of logistics, protocol, and security.\nRecalling that the theme of the year’s AU summit is “Assuring sustainable water availability and safe sanitation systems to achieve the goals of Agenda 2063,” he said Ethiopia has carried out many activities in line with this theme.\nEthiopia has made significant progress in water cooperation and remains committed to transforming the Nile Basin Cooperation Framework into a Commission, the Spokesperson noted.\nEthiopia has connected its neighbors through renewable energy, carried out water conservation efforts that have restored and enhanced water resources, and made significant contributions with the Green Legacy Initiative.",
    "image": "https://www.ena.et/documents/42142/0/FOREIGN+1.jpg/4a6f3e5f-45d7-6cfb-dd7a-2406319a5299?version=1.0&t=1770289764408&download=true",
    "source": "ENA English"
  },
  {
    "title": "Kenny Jacobs to 'voluntarily step down' as daa CEO",
    "desc": "The High Court has been told that Kenny Jacobs and daa have reached an agreement to settle their dispute, under which he will \"voluntarily step down\" from his role as chief executive.",
    "image": "https://www.rte.ie/images/0023d995-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Clean energy upgrades for hospitals and military sites",
    "desc": "£74 million for clean energy upgrades to cut bills for public buildings and create savings for frontline services.",
    "image": "https://www.wired-gov.net/wg/news.nsf/channel-social/DNWA-CPBDU3/$file/dnz_social.gif",
    "source": "Wired-Gov"
  },
  {
    "title": "INEC registers two new political parties",
    "desc": "The Independent National Electoral Commission (INEC) has registered two new political parties. Joash Amupitan, INEC chairman, announced the…",
    "image": "https://www.thecable.ng/wp-content/uploads/2025/12/INEC-chairman-Joash-Amupitan--e1767973744729.jpeg",
    "source": "TheCable"
  },
  {
    "title": "King Charles shocks Andrew by tightening restrictions after Royal Lodge eviction",
    "desc": "King Charles sets new rules for Andrew in surprise move after forcing him to leave Royal Lodge due to renewed fallout linked to the latest Epstein files.Former Prince Andrew was told to leave the...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-05/1391141_042730_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "Jon Rahm criticises move to limit LIV Golf world ranking points",
    "desc": "Jon Rahm says a ruling that will see only the top 10 finishers at LIV Golf events awarded world ranking points \"doesn't seem fair\".",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/62c5/live/67f74930-0273-11f1-8cb0-d70684951333.jpg",
    "source": "BBC"
  },
  {
    "title": "Google issues warning on malware affecting over 40% of Android devices",
    "desc": "Over a billion Android devices are vulnerable to malware and spyware due to outdated software. Google urges users to upgrade to Android 13 or newer immediately.",
    "image": "https://diplo-media.s3.eu-central-1.amazonaws.com/2026/01/android-smartphones-security-update-theft-protection.jpg",
    "source": "Digital Watch Observatory"
  },
  {
    "title": "Cladribine Maintains Efficacy, Safety Profile in Older Patients With Multiple Sclerosis",
    "desc": "Real-world phase 4 data show cladribine keeps relapse rates low and safety steady in relapsing MS patients, including those 65+.",
    "image": "https://cdn.sanity.io/images/0vv8moc6/neurolive/5f1c4427a73bff4e89de545457dabaad7dbd9cc5-1200x628.png",
    "source": "NeurologyLive"
  },
  {
    "title": "Fella Makafui speaks on securing 'Aníkúlápò' movie role, acting in Yoruba",
    "desc": "Popular Ghanaian actress Fela Makafui has revealed how she got a role in the popular Netflix-Nigerian series “Anikulapo: The Ghoul Awakens” and how she had to learn a language she knew nothing about; the Yoruba language.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/866/86602784.jpg",
    "source": "GhanaWeb"
  }
]