[
  {
    "title": "Trump tries humor, gets silence, at Alfalfa dinner with ‘people I hate’",
    "desc": "In a frenetic presidency marked by jarring contrasts, he added another Saturday night: suiting up in black-tie regalia amid mass immigration protests and telling jokes about invading Greenland.",
    "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MBTHJJCYJ3CX2JNTUFIHCKXIQE_size-normalized.jpg&w=1440",
    "source": "The Washington Post"
  },
  {
    "title": "'Send Help' Leading With Near $18M, 'Melania' 'A' CinemaScore",
    "desc": "Markiplier's Iron Lung could upset the Dylan O'Brien-Rachel McAdams movie Send Help at the box office, which also sees the debut of Melania.",
    "image": "https://deadline.com/wp-content/uploads/2026/01/Send-Help-use-Rachel-McAdams-Iron-Lung-Shelter-Jason-Statham-and-Melania.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Man City player ratings vs Tottenham: Advantage Arsenal - again! Erling Haaland endures another no-show as Cityzens throw away win against Dominic Solanke-inspired Spurs",
    "desc": "GOAL rates Manchester City's players from their 2-2 draw at Tottenham in the Premier League",
    "image": "https://assets.goal.com/images/v3/bltdb777514c14ca4c5/Cherki%20Haaland%20Solanke%20GFX.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Man City player ratings vs Tottenham: Advantage Arsenal - again! Erling Haaland endures another no-show as Cityzens throw away win against Dominic Solanke-inspired Spurs",
    "desc": "GOAL rates Manchester City's players from their 2-2 draw at Tottenham in the Premier League",
    "image": "https://assets.goal.com/images/v3/bltdb777514c14ca4c5/Cherki%20Haaland%20Solanke%20GFX.jpg",
    "source": "Goal.com"
  },
  {
    "title": "England's Vitality Roses well beaten by South Africa in netball series decider",
    "desc": "England lost out in their winner-takes-all encounter, falling to a 15-point defeat against the SPAR Proteas; it means South Africa win the series 2-1 following an entertaining three games; Fran Williams said the team was very disappointed with the nature of the loss on Sunday",
    "image": "https://e0.365dm.com/26/01/1600x900/skysports-fran-williams-netball_7151591.jpg?20260131185725",
    "source": "Sky Sports"
  },
  {
    "title": "'Wow, what am I doing here!’ - Phone call from NFL legend Tom Brady left Birmingham new boy Carlos Vicente stunned",
    "desc": "Birmingham City's new signing Carlos Vicente has revealed that a phone call with NFL icon and Blues minority owner Tom Brady helped make his mind up to complete a marquee transfer from La Liga side Deportivo Alaves to the Championship. Vicente joins up with the ambitious West Midlands side as they aim to push for promotion to the Premier League, sitting just five points off the play-off places as we enter February.",
    "image": "https://assets.goal.com/images/v3/getty-2172462604/crop/MM5DKMBQGQ5DEOBRGU5G433XMU5DAORSGYYQ====/GettyImages-2172462604.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Meath strike late to deny Cavan in Breffni humdinger",
    "desc": "A memorable two-pointer from Jack Flynn and a single from the outstanding Jordan Morris, all in the final minute, saw Meath plunder a win after an enthralling match before a crowd of 6,883 at Kingspan Breffni.",
    "image": "https://www.rte.ie/images/0023d5ad-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "ExtractoDAO Releases DUT Viscoelastic Continuum Creation Module for Cosmological Analysis",
    "desc": "The universe as a viscoelastic continuum explains cosmic evolution via quantum decoherence, not inflation, with predictions testable by Euclid (2027-2030).",
    "image": "https://img.einnews.com/facebook/1043147/the-dead-universe-theory-dut.jpeg",
    "source": "EIN Presswire"
  },
  {
    "title": "Mike Huckabee: US will coordinate any Iran attacks with Israel",
    "desc": "Huckabee said the decision on a strike had not been made, adding that President Donald Trump “hopes for the best outcome” and would pursue a deal if possible.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/698705",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Hard-to-synthesize materials revived using AI: An LLM-based materials redesign technology",
    "desc": "A research team led by Prof. Yousung Jung of the Department of Chemical and Biological Engineering at Seoul National University (SNU) has developed an innovative AI-based technology that uses large language models (LLMs) to redesign new materials that were previously difficult to synthesize into forms that are experimentally feasible.",
    "image": "https://scx2.b-cdn.net/gfx/news/2026/snu-researchers-revive.jpg",
    "source": "Phys.org"
  }
]