[
  {
    "title": "Instant Win Game Bonus Draw!",
    "desc": "You have the chance to win €5,000 in our Instant Win Game Bonus Draw just by playing any National lottery Instant Win Game online!",
    "image": "http://localhost:8080/undefined",
    "source": "Irish National Lottery"
  },
  {
    "title": "Critical injuries after dog attack in Christchurch",
    "desc": "Hato Hone St John said two people, one with critical injuries and one with serious injuries, had been transported to Christchurch Hospital.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/police-at-the-scene-in-christchurch-this-afternoon-VQXMPZR6BJDJDGH3YT4BBLR5FM.jpg?auth=426da07c84d3749cd62ce2226eb500dc0f67c1875c1a02e7c0174dae179851bd&quality=70&width=600&height=315&focal=960%2C540",
    "source": "1News"
  },
  {
    "title": "Notes from Training: Prepping for Inter Miami",
    "desc": "On a chilly Friday morning, two days after returning to Los Angeles following its 6-1 victory in Honduras in its Concacaf opener, LAFC wrapped up preparations for its MLS regular-season debut against Inter Miami at the LA Coliseum on Saturday night.\nTransitioning from the humidity and 80-degree temperatures of Honduras",
    "image": "https://images.mlssoccer.com/image/private/t_editorial_landscape_3_4_desktop/mls-lafc/teddayletxkci0o3gnwu.jpg",
    "source": "LAFC"
  },
  {
    "title": "Iraq Vows to Shock World in FIFA World Cup Playoff",
    "desc": "Iraq, led by coach Graham Arnold, aims to end a 40-year wait and qualify for the FIFA World Cup in their crucial playoff match, vowing to shock the world.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2016/10/17155511/punchlogo.png",
    "source": "Punch Newspapers"
  },
  {
    "title": "Top cat Baloucoune enjoying second of his nine lives",
    "desc": "If you were slightly taken aback to see Rob Baloucoune's name on the teamsheet for last weekend's win over Italy you weren't the only one.",
    "image": "https://www.rte.ie/images/0023eda6-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "NLEX, Converge, Meralco agree to three-team, five-player deal",
    "desc": "NLEX, Converge and Meralco have agreed to a three-team trade proposal involving five players and a pick on Saturday, Feb. 21. Under the agreement, the Road...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/21/80943.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Sining Manileño exhibit celebrates Manila's vibrant art and heritage",
    "desc": "The creative pulse of the capital took center stage as artists, cultural advocates, and art enthusiasts gathered for the successful opening of “Sining...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/21/80969.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Minister Steenkamp’s PhD: Balancing national duty, Covid-19 and academic excellence in education",
    "desc": "Education minister Sanet Steenkamp says she had to put her doctoral studies on hold during the Covid-19 pandemic due to the pressure of leading the country’s […]",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-21-at-10.44.54-AM-1024x743.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "Israeli officials believe US, Iran at unbridgeable impasse as they near open conflict",
    "desc": "Report says US might allow Tehran 'token' nuclear enrichment, but gaps between sides widely seen as irreconcilable; Congress may vote on curtailing Trump's ability to strike",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/02/AP26029228689293-e1771574544889.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Bishop of Lincoln arrested on suspicion of sexual assault",
    "desc": "Stephen Conway released on conditional bail and suspended from ministry",
    "image": "https://www.telegraph.co.uk/content/dam/news/2026/02/21/TELEMMGLPICT000465118878_17716637269660_trans_NvBQzQNjv4BqZWr1_qWoaTwAgOLID5KVUZDC9qEjEE2_8mvXXUi56xw.jpeg?impolicy=OG-Standard",
    "source": "The Telegraph"
  }
]