[
  {
    "title": "Social media exposure associated with steroid use intentions among boys and men",
    "desc": "A new study of more than 1,500 boys and men in Canada and the United States suggests that social media may play a meaningful role in shaping intentions to use anabolic-androgenic steroids (AAS), particularly when users are exposed to muscularity-focused content and engage in body comparisons online.",
    "image": "https://www.news-medical.net/images/tags/TagImage-6192-458320564315856468113-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "St. Benilde taps Topex Robinson as team consultant",
    "desc": "De La Salle head coach Topex Robinson tries to bring his championship experience and bolster College of St. Benilde as team consultant, the school’s official...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/21/80890.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Dockers stand tall, top draftees impress, young Eagle's knee fears",
    "desc": "West Coast's loss to Fremantle has been further soured by an injury to Noah Long",
    "image": "https://resources.afl.com.au/afl/photo/2026/02/21/66c4b796-dbb7-462d-918c-d1a96726b492/D1MWOTop.jpg",
    "source": "afl.com.au"
  },
  {
    "title": "Super Saturday: Sharks win big; Roosters v Eels; Storm v Titans",
    "desc": "Follow all the action from Round 3 of the 2026 Witzer Pre-Season Challenge on NRL.com's live blog.",
    "image": "https://www.nrl.com/siteassets/2026/pre-season-challenge/week-3/sharks-v-raiders/80243438_talakais-scores-a-try-celebration-celeb--260214_mg_003774_2026221172039.jpg?center=0.317%2C0.559&preset=share",
    "source": "NRL.com"
  },
  {
    "title": "Pakistan Coach Mike Hesson Finally Breaks Silence On 'Argument' Video With Captain Salman Algha At T20 World Cup",
    "desc": "Following Pakistan's recent match against Namibia, a footage of a tense moment between captain Salman Agha and the coach sparked speculation.",
    "image": "https://c.ndtvimg.com/2026-02/m43m0q9s_salman-agha-mike-hesson-afp_625x300_21_February_26.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
    "source": "NDTV Sports"
  },
  {
    "title": "Private Security Personnel Licensing Authority: Guard punched elderly man who looked at him",
    "desc": "A security guard punched an elderly man in the face several times because “the man was looking at him”. The violence means that Junior Sula can no longer...",
    "image": "https://www.nzherald.co.nz/resizer/v2/LARUXQUWUNHGZCNJ3HE2ZGNKNE.jpg?auth=2219e121bbdd6c9e8fb2858183bf3b8efb6d0628b35507b689b6d4a00ecabd8b&width=1200&height=675&quality=70&focal=1526%2C2791&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Supriya Pathak and Ratna Pathak Shah tackle obesity stigma in new ad. ‘It’s not a joke’",
    "desc": "The ad by Lilly India features links to research papers from the World Health Organisation and Columbia University.",
    "image": "https://staticprintenglish.theprint.in/wp-content/uploads/2026/02/ai-summit-pavilion-6.jpg",
    "source": "ThePrint"
  },
  {
    "title": "Alberta Premier defends controversial referendum questions on immigration",
    "desc": "Alberta Premier Danielle Smith is defending her proposed changes to immigration rules, that will be the subject of province-wide referendum in October.",
    "image": "https://globalnews.ca/wp-content/uploads/2026/02/smith-newser_1.jpg?quality=65&strip=all&w=720&h=379&crop=1",
    "source": "Global News"
  },
  {
    "title": "Bruno Mars Reveals ‘The Romantic’ Tracklist",
    "desc": "Bruno Mars has unveiled the nine-song tracklist for his fourth solo album, 'The Romantic', due Feb. 27.",
    "image": "https://www.billboard.com/wp-content/uploads/2026/02/Talent_826A9334-FULL_CreditJohnV.Esparza-Updated-e1771647956789.jpg?w=1024",
    "source": "Billboard"
  },
  {
    "title": "Cooperative Ministry Announces New Rules for SACCOs to Safeguard Members’ Funds",
    "desc": "SACCOs have in recent years faced challenges due to poor governance, leadership wrangles, and reported cases of financial mismanagement.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/people_queing_to_join_a_sacco.jpg?itok=pXdBZq88",
    "source": "Kenyans.co.ke"
  }
]