[
  {
    "title": "Who Is In the NBA All-Star Dunk Contest? 2026 Lineup, Time, How to Watch",
    "desc": "Here’s the full 2026 NBA All-Star Dunk Contest field, plus start time, TV/streaming info, and the two-round format at Intuit Dome.",
    "image": "https://heavy.com/wp-content/uploads/2026/02/GettyImages-2260332281-e1771103576479.jpg?quality=65&strip=all",
    "source": "Heavy Sports"
  },
  {
    "title": "Navalny was poisoned with 'rare toxin' - European states",
    "desc": "Five European countries, including Britain, France and Germany, have accused Russia of \"poisoning\" opposition leader Alexei Navalny in prison in 2024 using a \"rare toxin\", on the sidelines of the Munich Security Conference.",
    "image": "https://www.rte.ie/images/00224a87-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Bavarian Football Works",
    "desc": "FC Bayern stumbles to another win, extending their lead but leaving a lot to desire.",
    "image": "https://platform.bavarianfootballworks.com/wp-content/uploads/sites/24/2026/02/gettyimages-2261618703.jpg?quality=90&strip=all&crop=0%2C10.697167617268%2C100%2C78.605664765464&w=1200",
    "source": "Bavarian Football Works"
  },
  {
    "title": "Hotel evacuated as firefighters battle blaze",
    "desc": "The hotel was fully evacuated after a fire in a room",
    "image": "https://i2-prod.liverpoolecho.co.uk/article33427756.ece/ALTERNATES/s1200/1_Screenshot-2026-02-14-204528.jpg",
    "source": "Liverpool Echo"
  },
  {
    "title": "Bear Grylls plans his end-of-the-world escape at sea",
    "desc": "Bear Grylls, iconic adventurer who is best known for his wild nature, has shared that he bought a special escape boat to protect his family if the world ever turns dangerous. The TV star said that the boat is very strong and made of...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-15/l_650890_021245_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Allan: Willis, Luxon and the perils of trying to be too clever",
    "desc": "THREE KEY FACTS Heather du Plessis-Allan is the Drive host for Newstalk ZB. OPINION There are times when politicians try to be too clever and end up tripping...",
    "image": "https://www.nzherald.co.nz/resizer/v2/MX44JB4HDBCWLAIBUW7ULAFXUI.JPG?auth=1e374b6ee1781c3ac3b53fc994d7f5e0285648b89a81eac8e74fe79cb1e3b71c&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "'Wuthering Heights' Faces Unexpected Trouble",
    "desc": "The edgy movie adaptation of the iconic novel starring Margot Robbie and Jacob Elordi is at risk of coming in notably behind expectations.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2025/11/rev-1-WHE-T2-0061_High_Res_JPEG-H-2025.jpg?w=1296&h=730&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "Philip Morris International (PM) Valuation After Earnings Rebound And Smoke Free Growth Story",
    "desc": "Philip Morris International (PM) shares are back in focus after the company reported fourth quarter and full year 2025 results, shifting from a prior year loss to a profit and spotlighting smoke free products. See our latest analysis for Philip Morris International. The earnings rebound and focus on smoke free products have come alongside a strong share price run, with a 30 day share price return of 9.6% and a 1 year total shareholder return of 29.03%. This suggests positive momentum that is...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/c8b8327cfb7492ecc3fa3182988bf088",
    "source": "Yahoo Finance"
  },
  {
    "title": "Kano gov sacks Buba Galadima from polytechnic council",
    "desc": "Kano State Governor Abba Yusuf has sacked Buba Galadima as Chairman of the Kano State Polytechnic Governing Council, appointing the Emir of Gaya as his rep",
    "image": "https://cdn.punchng.com/wp-content/uploads/2023/09/04095959/Abba-Yusuf.jpeg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Meet the medalists from United States",
    "desc": "Meet all the medalists from the United States at the 2026 Milan Cortina Winter Olympics.",
    "image": "https://www.chicagotribune.com/wp-content/uploads/2026/02/CTC-Z-STOLZ-MEDAL.jpg?w=1024&h=683",
    "source": "Chicago Tribune"
  }
]