[
  {
    "title": "Fact Check: Claim That U.S. Wants to Remove Halal Certification in Indonesia Is Misleading",
    "desc": "Claims on social media that the U.S. seeks to eliminate Indonesia's halal certification are misleading; the U.S. merely noted regulatory complexities.",
    "image": "https://statik.tempo.co/data/2026/01/29/id_1456030/1456030_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "Target's new CEO is thrown into crisis mode on day one",
    "desc": "Michael Fiddelke takes over the Target CEO job on Sunday. He must deal with declining sales and civil unrest in the retailer's hometown, Minneapolis.",
    "image": "https://i.insider.com/697be121e1ba468a96ab0197?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "Rspack Releases Version 1.7: Final 1.x Update Before 2.0 Transition",
    "desc": "Rspack 1.7 has launched, enhancing performance and plugin compatibility as it prepares for a major version transition. Key features include improved SWC plugin compatibility, native asset importing as",
    "image": "https://res.infoq.com/news/2026/01/rspack-final-rust/en/headerimage/generatedHeaderImage-1769707579779.jpg",
    "source": "infoq.com"
  },
  {
    "title": "Russia Is Finding the Gaps in Ukraine’s Front Line",
    "desc": "The swift advance of Moscow’s forces into the town of Huliaipole showcases a central challenge for Kyiv: how to defend 700 miles with too few troops.",
    "image": "https://static01.nyt.com/images/2026/01/30/multimedia/30int-ukraine-frontline-01-gcql-promo/30int-ukraine-frontline-01-gcql-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Land-intensive carbon removal requires better siting to protect biodiversity, study warns",
    "desc": "New research looks at carbon dioxide removal—where carbon is absorbed from the atmosphere and stored—and finds that large-scale reliance on land-based methods, such as planting forests or bioenergy with carbon capture and storage (BECCS), can protect biodiversity by avoiding climate impacts, but could also compete with biodiversity protection unless site selection criteria are refined.",
    "image": "https://scx2.b-cdn.net/gfx/news/hires/2021/forest.jpg",
    "source": "Phys.org"
  },
  {
    "title": "The debate over saving a public parking spot after a snowstorm : NPR",
    "desc": "After the snowstorm this weekend dumped snow across large parts of the country, a key debate is raging on the streets: Can you save a public parking spot after you've dug your car out of it?",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3926x2208+0+204/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffd%2F91%2F0571ce8240009f65ae831f227340%2Fgettyimages-2257776207.jpg",
    "source": "NPR"
  },
  {
    "title": "Trump thinks a weaker dollar is great. Is he right? : NPR",
    "desc": "The president said this week that the value of the dollar is \"great\" despite a sharp tumble since last year. That may be true for certain parts of the economy — but not others.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3368x1895+0+262/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fa1%2F54%2F43041edb4bf38a9c1c00324875db%2Fgettyimages-2238300075.jpg",
    "source": "NPR"
  },
  {
    "title": "Figure skaters honor D.C. crash victims in Olympic year : NPR",
    "desc": "In the wake of the Jan. 2025 plane crash, some young skaters weren't sure they could continue. A year later, many have found that's the best way to honor those they lost.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3731x2099+627+556/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd9%2F68%2Fc08b5b8547fe9ff6e11dffd9f6ec%2F260119-skating-memorial-13.JPG",
    "source": "NPR"
  },
  {
    "title": "5 ways to get closer to your community : NPR",
    "desc": "If you've always dreamed of having a village but feel disconnected from your community, try these five tips. Plus: We want to hear from you. Tell us how you cultivate community where you live.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/4000x2250+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F6c%2F4e%2F098e137941e09cb2dae12e588452%2Flk-community-building-2-gettyimages-2212785103-1.jpg",
    "source": "NPR"
  },
  {
    "title": "Police arrests 12 suspects in major robbery cases",
    "desc": "The Ghana Police Service (GPS) has arrested 12 suspects in two separate robbery operations, including a highway attack on the Tamale–Buipe Highway and a violent robbery at Nkaseim in the Ahafo Region",
    "image": "https://www.graphic.com.gh/images/2026/January/30/Donkor.jpg",
    "source": "Graphic Online"
  }
]