[
  {
    "title": "Victor Smith takes aim at money politics",
    "desc": "Ghana’s Ambassador to the United States, Victor Smith, has warned that corruption in national life does not begin after politicians enter office, but starts much earlier—during the campaign season, when money and gifts are used to influence voters.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/01/image-664.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Super Bowl Tailgaters on Bad Bunny, Big Tech, and the Big Game",
    "desc": "We met up with attendees of Super Bowl LX’s pregame festivities to get their takes on the competing halftime shows, the potential for ICE actions, and the influence of Silicon Valley on the event.",
    "image": "https://media.wired.com/photos/69895bf47705d705abd39dd4/191:100/w_1280,c_limit/Super-Bowl-Tailgate-260208_RY_WIRED_SuperBowl_Tailgate_000134.jpg",
    "source": "WIRED"
  },
  {
    "title": "The Best AI Audio Tools in 2026: Free, Online, and High-Performance",
    "desc": "In the fast-paced digital world of 2026, audio to text technology has become an indispensable tool for students, professionals",
    "image": "https://worldbusinessoutlook.com/wp-content/uploads/2026/02/The-Best-AI-Audio-Tools-in-2026-Free-Online-and-High-Performance.png",
    "source": "World Business Outlook"
  },
  {
    "title": "IDF arrests Jamaa Islamiya terrorist on northern border",
    "desc": "The suspect was transferred to Israeli territory for questioning, and weapons were located in the same building, according to the IDF.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/679589",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Google Reclaims No. 1 Spot at the 2026 Kellogg School Super Bowl Advertising Review",
    "desc": "/PRNewswire/ -- Google Gemini took home the top spot in the 22nd Kellogg School Super Bowl Advertising Review with its 'New Home' ad, an emotional spot that...",
    "image": "https://mma.prnewswire.com/media/1979881/Kellogg_Logo.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "The Wayne Rooney Show: Tottenham Hotspur in relegation battle, says ex-England striker",
    "desc": "Tottenham Hotspur are in a relegation battle, says former England captain Wayne Rooney.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/421d/live/9999aa30-053b-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  },
  {
    "title": "Norway strengthens ties with Iloilo through maritime, trade, and energy partnerships",
    "desc": "Ambassador Christian Lyster and his trade and business team, Ana Florentino and Claus Gaasvig, visited Iloilo City to discuss Norway’s contributions to the...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/09/77856.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Government orders nationwide adoption of residential addressing system in Tanzania",
    "desc": "The system is also considered a critical pillar in the implementation of Vision 2050, which aims to build a knowledge- and technology-driven economy supported by reliable transport infrastructure...",
    "image": "https://www.thecitizen.co.tz/resource/image/5352758/landscape_ratio3x2/1200/800/642edbc3811ebbeee91fb7909799096a/Ff/local-pic.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Behind closed doors: South Africa's GBVF national disaster",
    "desc": "DESPITE government declaring gender-based violence and femicide (GBVF) a national disaster two months ago, frontline organisations report minimal impact on the ground with cases increasing in severity.",
    "image": "https://iol-prod.appspot.com/image/7be9cde8acb8ff7ac7d6438c51f7f69f3ba00766/1000/jpeg",
    "source": "thepost.co.za"
  },
  {
    "title": "Dubai-based Indian crorepati Satish Sanpal buys ‘3kg gold’ for wife every year, says ‘Money is not God’",
    "desc": "Tabinda Sanpal, wife of Indian-origin crorepati Satish Sanpal,  opened up about her husband’s love for gold in the trailer of Netflix's Desi Bling | Trending",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/09/550x309/satish_1770616871603_1770616883806.jpg",
    "source": "Hindustan Times"
  }
]