[
  {
    "title": "Assessing Kanematsu (TSE:8020) Valuation After Strong 1 Year Share Price Performance",
    "desc": "Kanematsu stock: recent performance snapshot Kanematsu (TSE:8020) has drawn fresh attention after a 2.3% decline over the last day, following a strong past 3 months where the share price return stands at 36.2%. Over the past month, the stock is up 11.2%, while the 1 year total return is 85.5%. That backdrop gives investors some recent context before weighing Kanematsu’s current earnings profile and valuation. See our latest analysis for Kanematsu. For Kanematsu, the recent 2.3% one day share...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/67199089f87ca6ea8b33765175d6b1ff",
    "source": "Yahoo Finance"
  },
  {
    "title": "Assessing Suzhou Ribo Life Science’s Valuation After Recent Share Price Weakness",
    "desc": "Recent share performance and business profile Suzhou Ribo Life Science (SEHK:6938) has drawn attention after a 5.4% one day decline to HK$70.05, extending a one month return of a 7.9% decline and a year to date return of a 14.7% decline. For context, the company focuses on researching and developing small nucleic acid drugs targeting cardiovascular, metabolic, renal, liver and other diseases, with several candidates in Phase I, Phase II and preclinical trials. See our latest analysis for...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/2b615bb0216a492e754128412857f305",
    "source": "Yahoo Finance"
  },
  {
    "title": "Mahama: We must end dollar dependence in Intra-African Trade",
    "desc": "President John Dramani Mahama has renewed calls for the immediate implementation of a Pan-African payment and settlement system, arguing that Africa cannot",
    "image": "https://citinewsroom.com/wp-content/uploads/2026/01/571554847_18435639325101399_4977451576238516962_n.jpg",
    "source": "CitiNewsroom.com"
  },
  {
    "title": "Ruto pushes expanded climate financing in talks with Green Climate Fund",
    "desc": "NAIROBI, Kenya, Feb 15 - President William Ruto has reaffirmed Kenya’s commitment to deepening cooperation with the Green Climate Fund (GCF), as the - Kenya breaking news | Kenya news today | Capitalfm.co.ke",
    "image": "https://www.capitalfm.co.ke/news/files/2026/02/IMG_0672.jpeg",
    "source": "Capitalfm.co.ke"
  },
  {
    "title": "Rolling Stones legend's Devon mansion could be yours",
    "desc": "He lived there for 40 years",
    "image": "https://i2-prod.devonlive.com/incoming/article10816001.ece/ALTERNATES/s1200/1_rolling-stones-1503924.jpg",
    "source": "Devon Live"
  },
  {
    "title": "Lagos Probes Ambulance Incident at City Marathon",
    "desc": "The Lagos State Government is investigating an incident where an ambulance struck a woman during the Access Bank Lagos City Marathon. The victim is stable.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/14194222/WhatsApp-Image-2026-02-14-at-7.40.36-PM.jpeg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Dubai aims to eliminate landfill sites by 2041, says energy council",
    "desc": "The second phase to expand the plant’s waste processing capacity will be launched later this year to further increase waste conversion for energy generation.",
    "image": "https://imgengine.khaleejtimes.com/khaleejtimes-english/2026-02-15/e6uqri0g/Dubai-waste-landfill-Shihab-photo.jpeg?width=1200&height=630&format=auto&ogImage=true&mode=crop&rect=2,0,1197,798",
    "source": "Khaleej Times"
  },
  {
    "title": "PNP highlights gains in anti-illegal drugs campaign",
    "desc": "PHILIPPINE National Police (PNP) underscored on Sunday, February 15,2026, the continued success of the government’s anti-drug campaign...",
    "image": "https://media.assettype.com/sunstar%2F2025-10-06%2Fp0da2g4s%2FJose-Melencio-Nartatez-Jr.jpg?rect=0%2C40%2C750%2C394&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "SunStar Publishing Inc."
  },
  {
    "title": "Israeli FM Saar to join Trump’s inaugural board of peace meeting",
    "desc": "Israeli Foreign Minister Gideon Saar is set to attend US President Donald Trump’s first official meeting of the Board of Peace on February 19, Israeli officials confirmed. Israel officially joined the board during Prime Minister Benjamin Netanyahu’s recent visit to Washington, marking a key step in regional peace diplomacy.",
    "image": "https://dailytimes.com.pk/assets/uploads/2026/02/15/2257750736.jpeg",
    "source": "Daily Times"
  },
  {
    "title": "Israeli airstrikes kill 9 in Gaza, including tent camp, Palestinian officials say",
    "desc": "Israel and Hamas have repeatedly accused each other of violating the ceasefire deal, a key element of US President Donald Trump's plan to end the Gaza war. | World News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/15/550x309/ISRAEL-PALESTINIANS-GAZA-5_1771146198466_1771146217375.JPG",
    "source": "Hindustan Times"
  }
]