[
  {
    "title": "Pakistan stock market KSE 100 index crashes nearly 2% on 'open war' with Afghanistan",
    "desc": "Pakistan stock market dropped 3,081 points, or 1.82 percent, to hit an intraday low of 165,811.88.",
    "image": "https://images.moneycontrol.com/static-mcnews/2019/05/Pakistan-Stock-Exchange.jpg",
    "source": "Moneycontrol.com"
  },
  {
    "title": "'They seized everything': Yemen's Houthi rebels drive aid groups to the brink",
    "desc": "Aid groups - a lifeline for millions of Yemenis - are being squeezed out of existence in areas under the control of the rebels, the BBC hears.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c8dd/live/c1681840-131d-11f1-b513-7d8d8ff19957.jpg",
    "source": "BBC"
  },
  {
    "title": "Quantum fluctuations from vacuums used to modify materials",
    "desc": "Columbia University researchers have proven that quantum fluctuations from a vacuum can modify nearby materials",
    "image": "https://www.openaccessgovernment.org/wp-content/uploads/2026/02/Low-Res_Cavity-Cover-Itai.jpg",
    "source": "Open Access Government"
  },
  {
    "title": "Deoghar Municipal Corporation results 2026: Will BJP retain seat the Mayoral seat?",
    "desc": "Deoghar Municipal Corporation results 2026: The corporation plays a crucial role in managing civic services, infrastructure, and urban planning in Deoghar. The last election was conducted in 2015.",
    "image": "https://resize.indiatvnews.com/en/resize/newbucket/1200_-/2026/02/deoghar-1772099647.jpg",
    "source": "India TV News"
  },
  {
    "title": "Man refuses to bear child of another man, shares ordeal on live TV",
    "desc": "A young Ghanaian man named Amoako Danso Fredrick has shared a painful personal experience on live TV, revealing how he discovered that his girlfriend was pregnant with another man's child and his refusal to take responsibility for the pregnancy.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/279/27944856.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "UNPOL officers build capacities among local counterparts on combatting electoral violence against women",
    "desc": "JONGLEI - John Akuoch knows that South Sudan’s elections, currently scheduled for December this year, will be both historic and challenging. As the Assistant Coordinator for the South Sudan",
    "image": "https://unmiss.unmissions.org/sites/default/files/styles/3_2_lg/public/2026-02/20260223_113439.jpg?h=837e10d2&itok=WwZHFA8Z",
    "source": "UNMISS"
  },
  {
    "title": "Petty theft on the rise in Latvia",
    "desc": "Crimes related to war justification, fraud, and petty theft are on the State Police's radar this year and were also common last year On Thursday, February 26th, the State Police leadership assessed la...",
    "image": "https://static.lsm.lv/media/2024/10/large/1/os6d.jpg",
    "source": "LSM"
  },
  {
    "title": "Feffe Bussi advises child stars on music careers",
    "desc": "Rapper Feffe Bussi advises Uganda's child stars to think twice before entering mainstream music, urging them to keep it age-appropriate.",
    "image": "https://mbu.ug/wp-content/uploads/2026/02/473559158_18472475743061332_5283851409224647767_n-edited.jpg",
    "source": "mbu.ug"
  },
  {
    "title": "Is human mission to Mars possible in 10 years? Jared Isaacman breaks it down",
    "desc": "NASA and private companies are competing to send humans to the Moon by planning future Mars missions. NASA, SpaceX and Blue Origin pursue their ambitious programmes to create a lunar base and...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-27/1393971_022026_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "‘Stranger Things’ star Gaten Matarazzo reveals how cleidocranial dysplasia affected his career",
    "desc": "Gaten Matarazzo, the star of Netflix hit Stranger Things has remained vocal about his experience with cleidocranial dysplasia .\n“My experience with cleidocranial dysplasia has been pretty...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-27/1393970_021225_updates.jpg",
    "source": "The News International"
  }
]