[
  {
    "title": "Another suspect arrested over killing of policeman at Zebilla",
    "desc": "Daily news from Ghana and local Accra news stories including crime, health, education and general news by Daily Graphic.",
    "image": "https://www.graphic.com.gh/images/2026/Feb/18/suspectkiller.jpg",
    "source": "Graphic Online"
  },
  {
    "title": "Google brings AirDrop support in Quick Share to the Pixel 9 series",
    "desc": "The feature was previously exclusive to the Pixel 10 lineup. Google introduced AirDrop support in Quick Share on the Pixel 10 series last year, making it...",
    "image": "https://fdn.gsmarena.com/imgroot/news/26/02/pixel-9-series-airdrop-support/-952x498w6/gsmarena_000.jpg",
    "source": "GSMArena.com"
  },
  {
    "title": "Princess Diana warned Prince William, Harry about uncle Andrew",
    "desc": "Princess Diana had reportedly warned her sons Prince William and his estranged brother Harry about their uncle former Duke of York Andrew, it has been claimed.According to the insiders, the late...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-18/1392740_020246_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "ECB and ONCE Foundation launch collaboration to ensure digital euro is accessible for everyone",
    "desc": "The European Central Bank (ECB) is the central bank of the European Union countries which have adopted the euro. Our main task is to maintain price stability in the euro area and so preserve the purchasing power of the single currency.",
    "image": "https://www.ecb.europa.eu/press/shared/img/socialmedia/social-default.jpg?0ef1632c35edede913681bb76af694a4",
    "source": "European Central Bank"
  },
  {
    "title": "Building Women-Led Futures in Open Knowledge: Meet the 2026 AFrica Wiki Women Leadership and Mentorship Fellows",
    "desc": "The Africa Wiki Women Leadership and Mentorship Fellowship Programme is back for its third cohort, empowering women across Africa to lead and contribute to Wikimedia projects. Running from January …",
    "image": "https://diff.wikimedia.org/wp-content/uploads/2026/02/Africa_Wiki_Women_Leadership_and_Mentorship_Fellowship_Program_2026_Cohort_3.png?fit=1080%2C1080",
    "source": "Wikimedia.org"
  },
  {
    "title": "Starmer has exposed the lie at the heart of the Online Safety Act",
    "desc": "The Government plans to give itself sinister Orwellian powers",
    "image": "https://www.telegraph.co.uk/content/dam/news/2026/02/17/TELEMMGLPICT000464322209_17713406607170_trans_NvBQzQNjv4BqG6-sc6dEAQCMWCxZ3jRHJMkJh8B52xMGZb76YZhf3jY.jpeg?impolicy=OG-Comment",
    "source": "The Telegraph"
  },
  {
    "title": "Brit Detective Drama 'Bergerac' Bought for U.S. by PBS Distribution",
    "desc": "The drama is a reboot of the iconic 1980s series starring John Nettles, this time with Damien Molony in the lead role",
    "image": "https://variety.com/wp-content/uploads/2026/02/BERGERAC_S2_MB_19_09_25_0146_GFXS2988.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "No trees, no food, shot for fun … yet Serbia’s imperial eagles are making an improbable return",
    "desc": "Less than a decade ago, the Balkan country had just one breeding pair of the eastern imperial species of raptor left. Now things are changing, thanks to the dogged work of conservationists",
    "image": "https://i.guim.co.uk/img/media/1133d306feb9cff42fd8bf216d559a65670a9c7e/0_0_2040_1633/master/2040.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8da5e53d8b9a3a01daaebd748d923e6d",
    "source": "The Guardian"
  },
  {
    "title": "Explosive global measles outbreaks pose risk to Canadian travellers, health officials warn",
    "desc": "The global spread of measles shows no signs of slowing down in 2026, including explosive outbreaks in travel hot spots like the southern U.S. and Mexico, prompting warnings from public health officials for Canadians to check their vaccination status before heading abroad this winter.",
    "image": "https://i.cbc.ca/ais/d782dc34-5fa5-4127-ba30-278163f6e1c9,1771350476735/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C275%2C5277%2C2968%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Plan to increase youth minimum wage could be delayed",
    "desc": "Government sources tell BBC News they could slow down plans to make minimum wage equal across age groups.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/af8f/live/e08e1510-0c9e-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  }
]