[
  {
    "title": "Thomson Reuters leans on proprietary data in AI race as disruption fears mount",
    "desc": "Company says its AI-enabled CoCounsel has reached one million users as professional companies seek greater efficiency",
    "image": "https://www.theglobeandmail.com/resizer/v2/66WEUXFE5VGBDKNREPQTEWT2IM.JPG?auth=1db12d1c9d2a9f394d5c26e4a9357da9bfcedc957f53827e696455e9c13452f6&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "Fed's Goolsbee calls for a hold on cuts as current rate of inflation is 'not good enough'",
    "desc": "The Chicago Fed president said Tuesday that cuts aren't appropriate until there's more evidence that inflation is on its way down.",
    "image": "https://image.cnbcfm.com/api/v1/image/108269124-1771945414451-108269124-1771945237620-gettyimages-2262823049-NABE_ECONOMIC_CONFERENCE.jpg?v=1771945423&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Morning Report | Sean O’Malley reacts to Conor Benn reported Zuffa deal: ‘I’m not making f*cking $15 million’",
    "desc": "Sean O’Malley admits Conor Benn making more than he’s ever made in UFC",
    "image": "https://platform.mmafighting.com/wp-content/uploads/sites/109/2026/02/gettyimages-2258040797.jpg?quality=90&strip=all&crop=0%2C4.5440664197089%2C100%2C78.499722094515&w=1200",
    "source": "MMA Fighting"
  },
  {
    "title": "Taiwanese actress Joe Chen marks CNY with hubby in M'sia, stuns in a RM10 dress from night market",
    "desc": "As festivities coincided with the holy month of Ramadan, the 'Fated To Love You' star paid a visit to a bazaar, where she sampled a wide array of traditional kuih.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/24/3784319.jpg",
    "source": "The Star"
  },
  {
    "title": "Vexcel Intelligence Gives AI Eyes, Making the World Searchable for the First Time",
    "desc": "/PRNewswire/ -- AI can summarize the internet. Now it can understand the Earth. Vexcel today launched Vexcel Intelligence, a breakthrough AI platform trained...",
    "image": "https://mma.prnewswire.com/media/2377848/VEXCEL_Data_Program_Logo.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "New vrCAVE game to let players swashbuckle from home",
    "desc": "Virtual-reality company vrCAVE is ramping up to launch Heroes Together VR, the company's first direct-to-consumer game.",
    "image": "https://taprootyeg.blob.core.windows.net/photos/2026/02/19/vrcave-5767.jpg",
    "source": "Taproot Edmonton"
  },
  {
    "title": "Starlight warped in the fabric of spacetime could help us find hidden black holes dancing together",
    "desc": "Flashes of gravitationally lensed starlight could act as cosmic lighthouses revealing the presence of binary supermassive black holes in close orbit.",
    "image": "https://cdn.mos.cms.futurecdn.net/VAGT8xLGFWzj5UeRpR7pEe-1400-80.png",
    "source": "Space"
  },
  {
    "title": "The Rumour Engine - 24th of February",
    "desc": "What could it be?",
    "image": "https://assets.warhammer-community.com/rumourengine-feb24-1-feature-7xz7kb8oso.jpg",
    "source": "Warhammer Community"
  },
  {
    "title": "Artificial Intelligence: Africa governments must adopt, adapt, and indigenise, but do not copy and paste",
    "desc": "Much of today’s global conversation is shaped by new technologies, including Artificial Intelligence (AI), digital transformation, and social media, and by the impact of these forces on democracy, peace, security, geopolitics, integration, and economic development.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/image-2137.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "BMW M Motorsport enters the GT World Challenge Europe with a strong line-up.",
    "desc": "+++ Twelve BMW M works drivers are fighting for victories and titles +++ Overall champions Charles Weerts and Kelvin van der Linde will once again drive the #32 BMW M4 GT3 EVO for Team WRT +++ ROWE Racing is competing for titles in the Endurance Cup with two BMW M4 GT3 EVOs +++",
    "image": "https://mediapool.bmwgroup.com/cache/P9/202509/P90618899/P90618899-valencia-esp-18-21-september-2025-gt-world-challenge-europe-powered-by-aws-sro-sprint-cup-gtwc-team--2249px.jpg",
    "source": "BMW Group"
  }
]