[
  {
    "title": "‘The best feeling’: Michael Dickson becomes second Australian NFL player to win a Super Bowl",
    "desc": "The king of Australia’s NFL punting expats starred for the Seattle Seahawks in their suffocating 29-13 Super Bowl victory over the New England Patriots",
    "image": "https://i.guim.co.uk/img/media/af932e4ef14ce816afce39a1c9ba61cf147cedff/431_0_2883_2306/master/2883.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4fd6e589e6562861762647a2d23fcd98",
    "source": "The Guardian"
  },
  {
    "title": "Travel bans only on PTPTN loan defaulters with successful careers, Dewan Rakyat told",
    "desc": "KUALA LUMPUR: Travel bans will only be imposed on National Higher Education Fund Corporation (PTPTN) borrowers who fail to settle their loans despite earning well or working overseas, the Dewan Rakyat was told.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/09/3761598.jpg",
    "source": "The Star"
  },
  {
    "title": "How Inflation Reshaped Wealth and Widened Gaps Across European Households",
    "desc": "IMF research shows that Europe’s 2021–22 inflation shock cut household welfare by nearly one-fifth on average, hitting poorer households hardest once housing and wealth effects are included. The real winners and losers depended less on prices or wages and more on whether rising house values offset inflation.",
    "image": "https://www.devdiscourse.com/remote.axd?https://devdiscourse.blob.core.windows.net/devnews/08_02_2026_13_48_31_6228558.png?width=920&format=jpeg",
    "source": "Devdiscourse"
  },
  {
    "title": "After singlehandedly winning battle for Philippine sports remittances, Yeng Guiao to be feted with PSA's 'President's Award'",
    "desc": "The man considered as the current knight in shining armor of Philippine sports will have his moment in next week’s San Miguel Corporation-Philippine Sportswriters Association 2025 Awards Night at the Diamond Hotel Manila.",
    "image": "https://media.philstar.com/photos/2026/02/09/spo2-yeng-guiao2019-02-2722-43-10_2026-02-09_12-23-11.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Super Bowl 2026: Seattle Seahawks beat New England Patriots, President Trump criticises Bad Bunny",
    "desc": "Super Bowl 60 had plenty of narratives to go at - this is how a thunderous evening in California panned out.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a92a/live/94e860e0-056c-11f1-9c47-91e6146aabf2.jpg",
    "source": "BBC"
  },
  {
    "title": "Driver fined $3.5k after colliding with 3 pedestrians jaywalking along Havelock Road",
    "desc": "The pedestrians had jaywalked across the road near an overhead bridge and a no-crossing sign. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/3600c0b3465e2297f8f0625fc87553b073252e9f8248ebc5e31640b2cbe7ef78",
    "source": "The Straits Times"
  },
  {
    "title": "Hong Kong media mogul Jimmy Lai sentenced to 20 years in landmark case",
    "desc": "Jimmy Lai, one of Hong Kong's most outspoken critics of China, has learned his fate after being sentenced this morning.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ea8f4188c3ded08714d9249c6521e190?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=154&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Sunghoon of K-pop group Enhypen carries torch for Milano Cortina 2026 Winter Olympics",
    "desc": "Enhypen's Sunghoon carried the torch for the Milano Cortina 2026 Winter Olympics on Friday, Feb 6, years after retiring as a competitive figure skater.",
    "image": "https://dam.mediacorp.sg/image/upload/s--bGSXRfI6--/c_crop,h_663,w_1179,x_1,y_550/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/09/img_5743.jpg?itok=6BA5_Gw2",
    "source": "CNA Lifestyle"
  },
  {
    "title": "Parliament Budget Session Day 9 updates: Both Houses adjourned, budget discussion to continue tomorrow",
    "desc": "Parliament Budget Session 2026 Day 9 Live Updates: Follow The Hindu for more updates.",
    "image": "https://th-i.thgim.com/public/incoming/k6i5uo/article70609891.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202026-02-09%20at%2012.11.48%201.jpeg",
    "source": "thehindu.com"
  },
  {
    "title": "GoComet spotlights AI-driven supply chain intelligence at Manila Horizon 2026",
    "desc": "Manila Horizon 2026, hosted by AI-first supply chain automation firm GoComet, convened senior supply chain leaders from some of the Philippines’ largest...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/09/77816.webp",
    "source": "Manila Bulletin"
  }
]