[
  {
    "title": "Navotas City names AboitizPower genco its top real property taxpayer for 9th straight year",
    "desc": "The Navotas City government has recognized Therma Mobile, Inc., a subsidiary of Aboitiz Power Corporation (AboitizPower), as the number one taxpayer of real...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/28/74872.webp",
    "source": "mb.com.ph"
  },
  {
    "title": "Five IPP prisoners to be referred to Court of Appeal",
    "desc": "New IPP sentences were scrapped in 2012, but remain in place for around 2,800 people.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f96f/live/bb7d96b0-fc18-11f0-a422-4ba8a094a8fa.jpg",
    "source": "BBC"
  },
  {
    "title": "Travel to New Zealand Made Easier: Millions of NZeTAs Issued Last Year",
    "desc": "Discover how New Zealand's NZeTA system and tourism policies helped issue over 1.6 million travel authorizations in 2025, boosting international travel.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/01/New-Zealand-passport-.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "Zelenskyy condemns 'terrorism' after Russia hits train",
    "desc": "A drone struck a train carriage carrying nearly 200 passengers in Ukraine, in an attack authorities blamed on Russia.",
    "image": "https://static.dw.com/image/75686990_6.jpg",
    "source": "DW.com"
  },
  {
    "title": "Avalanche hits J-K's Sonamarg tourist resort; officials say no casualty",
    "desc": "The massive avalanche was caught on CCTV camera, showing snow engulfing buildings, officials said",
    "image": "https://greaterkashmir.imagibyte.sortdcdn.net/wp-content/uploads/2026/01/Avalanche-caught-on-CCTV-in-Sonamarg-e1769572177658.jpg",
    "source": "greaterkashmir.com"
  },
  {
    "title": "MPs urged to stop education bill said to have unprecedented ministerial over-reach",
    "desc": "Submissions to Parliament's Education and Workforce Select Committee nearly all spoke against the Education and Training (System Reform) Amendment Bill.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--ucVFT_Yp--/t_tohu-badge-facebook/v1625034821/4N49A0X_TEACHER-GENERIC12_20725?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Northland teacher and sportsman Harry Darkins farewelled at Whangārei",
    "desc": "The family of Northland teacher and sportsman Harry Darkins have spoken of their “grief and gratitude” as they prepare an event to celebrate his full life....",
    "image": "https://www.nzherald.co.nz/resizer/v2/YOSTPEJQFBHMTII4UYBVZFWJII.JPG?auth=878625c398eb478d4adb0ec2c956bf5c8eeb8e09ef62a903fb9ac0389109d2e9&width=1200&height=675&quality=70&focal=914%2C523&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "24-hour ETS train service for festive rush, says Anthony Loke",
    "desc": "PUTRAJAYA: Malaysians can look forward to 24-hour Electric Train Service (ETS) train services during peak festive periods, starting this Chinese New Year, says Transport Minister Anthony Loke",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/28/3742153.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Purdue researchers discover new therapeutic target for triple-negative breast cancer",
    "desc": "A Purdue University team led by Kyle Cottrell has discovered a new therapeutic target for triple-negative breast cancer.",
    "image": "https://www.news-medical.net/images/tags/TagImage-1039-45840826385648151818-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "S'porean teen questions why mum’s citizenship application keeps getting rejected despite 20 years of residence",
    "desc": "A Singaporean teenager has taken to Reddit to seek answers after her mother's Singapore citizenship applications were repeatedly rejected.",
    "image": "https://mustsharenews.com/wp-content/uploads/2026/01/rejected-citizenship-1.jpg",
    "source": "mustsharenews.com"
  }
]