[
  {
    "title": "'The Night Agent' Creator Talks S3 Shocking Death, Gives Big S4 Clues",
    "desc": "'The Night Agent's Shawn Ryan talks with Deadline about Season 3's shocking death, gives major S4 clues & reveals the story behind 'FU' to President.",
    "image": "https://deadline.com/wp-content/uploads/2025/12/TNA_302_Unit_00027RC.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Fiji, Palau and Tuvalu set to show world leaders climate change impact ahead of COP31",
    "desc": "Fiji, Palau and Tuvalu look set to host world leaders and climate change ministers in the lead-up to COP31 in a bid to encourage larger countries to accelerate cuts to emissions.",
    "image": "https://live-production.wcms.abc-cdn.net.au/98261ebfaed7e51e2117cb63d12c0420?impolicy=wcms_watermark_news&cropH=2160&cropW=3840&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Jakarta to Intervene in Chili Prices Before Eid al-Fitr 2026",
    "desc": "Jakarta Governor Pramono Anung attributed the hike in chili prices to a supply shortage from several regions following heavy rainfall.",
    "image": "https://statik.tempo.co/data/2026/02/12/id_1458394/1458394_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "Denver Nuggets vs. Los Angeles Clippers (02-19-2026) game preview: When and where to watch, expected lineup, injury report, prediction, and more",
    "desc": "NBA News: The Denver Nuggets are now ready to face the Los Angeles Clippers. After the trade deadline, the Denver Nuggets should be deeper than the Los Angeles .",
    "image": "https://static.toiimg.com/thumb/msid-128581690,width-1280,height-720,imgsize-102790,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Asia-Pacific markets mostly fall, tracking Wall Street losses, as U.S.-Iran tensions take hold",
    "desc": "Investors will look at Japan inflation data, as well as China's loan prime rate decision.",
    "image": "https://image.cnbcfm.com/api/v1/image/108150444-1748310256318-gettyimages-912274822-dsc01512.jpeg?v=1748310279&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Security analyst calls on Mahama to name Zanetor Rawlings as defence minister",
    "desc": "Security analyst Dr Ishmael Norman is calling for a historic shift in Ghana’s defence leadership, urging President John Dramani Mahama to appoint a woman as the country’s next Minister of Defence.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/651/65193141.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Chelsea’s Rosenior calls for life bans from football for those found guilty of racism",
    "desc": "The head coach, reacting to Vinícius Júnior’s racism claims against Gianluca Prestianni, said: ‘Any racism in society, let alone football, is unacceptable’",
    "image": "https://i.guim.co.uk/img/media/f5568d3987ea12c177858959529eb3d782dfd8c7/322_18_2397_1917/master/2397.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bd92da646836def2e01b5474756f6f5a",
    "source": "The Guardian"
  },
  {
    "title": "Trump directs US government to prepare release of files on aliens and UFOs",
    "desc": "Trump says he will seek release of files on extraterrestrials, \"based on the tremendous interest shown\".",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f0ac/live/6302f260-0de7-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "The Role of the Gut Microbiome in Gastrointestinal Cancer Development",
    "desc": "From bacterial genotoxins to immune checkpoint modulation, this comprehensive synthesis reveals how gut microbes shape the molecular and immunologic landscape of gastrointestinal cancers—offering new insight into prevention, diagnosis, and precision treatment strategies.",
    "image": "https://www.news-medical.net/images/Article_Images/ImageForArticle_27225_17710141860298052.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Not just sport and car crashes: debunking 5 myths about traumatic brain injury in NZ",
    "desc": "Touching the lives of an average 110 people each day in Aotearoa, traumatic brain injury (TBI) is much more common than any of us would like it to be",
    "image": "https://images.unsplash.com/uploads/1412533519888a485b488/bb9f9777?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=1350&q=80",
    "source": "The National Tribune"
  }
]