[
  {
    "title": "Nairobi County to Introduce 'Conservancy Fee' in Water Bills, Sakaja Announces",
    "desc": "The fee is expected to be added on all water bills in the capital as part of the raft of changes Sakaja is implementing to boost revenues.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/Nairobi%20CBD%20aerial%20view.jpg?itok=L4BijjyD",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "Philippine journalist Frenchie Mae Cumpio denied bail, to remain in prison after 6 years",
    "desc": "New York, February 16, 2026—The Committee to Protect Journalists condemns a Philippine court’s decision to deny journalist Frenchie Mae Cumpio bail, and calls on authorities to drop all remaining charges against her and immediately end the judicial harassment. “Frenchie Mae Cumpio has been deprived of her freedom for more than six years. The latest ruling...",
    "image": "https://cpj.org/wp-content/uploads/2026/01/AFP__20260122__93KV3MQ__v1__HighRes__PhilippinesConflictMedai.jpg?fit=4096,4096&strip=all&quality=80",
    "source": "Committee to Protect Journalists"
  },
  {
    "title": "South Downs night sky images win photography competition",
    "desc": "An image of the Milky Way lighting up an abandoned barn scooped the top award in the competition.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c5ea/live/caa06500-0b04-11f1-90ed-df71cb736179.jpg",
    "source": "BBC"
  },
  {
    "title": "Ramadan events across north-west England",
    "desc": "The Islamic holy month of Ramadan starts with the new moon, when Muslims fast from dawn to sunset.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/67c7/live/b8a5c6c0-0a8b-11f1-8b85-1da9bd0ede97.jpg",
    "source": "BBC"
  },
  {
    "title": "Neimeth seeks patient capital, local patronage as profit hits N1.5 billion",
    "desc": "Neimeth Pharmaceuticals Plc has urged the Federal Government to facilitate access to patient capital for pharmaceutical manufacturers,",
    "image": "https://cdn.guardian.ng/wp-content/uploads/2026/02/CBN.webp",
    "source": "The Guardian Nigeria News"
  },
  {
    "title": "The Surprising Link Between Ghana and Zanzibar’s Tourism Growth : Find Out How It Benefits You",
    "desc": "Ghana’s tourism industry takes a bold step at Zanzibar’s Z-Summit 2026, creating new opportunities for multi-destination travel between West and East Africa.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/Zanzibar-Africa.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "BREAKING | Supreme Court 9-Judge Bench To Hear Sabarimala Reference Issues From April 7",
    "desc": "The Supreme Court 9-judge bench will commence hearing of the issues referred in the Sabarimala review on April 7, 2026. The hearing is proposed to be concluded on April 22.The composition of the...",
    "image": "https://www.livelaw.in/h-upload/2024/09/17/561322-750x450518276-1500x900358120-sabarimala-scjpg.jpg",
    "source": "Live Law"
  },
  {
    "title": "Kornél Mundruczó on Amy Adams, Being Blacklisted in Hungary",
    "desc": "‘At the Sea’ director Kornél Mundruczó talks Amy Adams and Murray Bartlett ahead of Berlinale premiere, being blacklisted in Hungary for years",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-09-Feb-2026-11-59-AM-4365.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Andrew probe takes stark turn as prosecutor sends brutal warning to royals",
    "desc": "Andrew Mountbatten-Windsor is not the only one under intense scrutiny as the royal family were given an important update on the ongoing investigation looking into the ex-prince's shady activities.King Charles's office had...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-16/l_651079_105507_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "JEE Mains Result 2026, Jeemain.nta.ac.in LIVE Updates: NTA releases Jan Session final answer key, 9 questions dropped",
    "desc": "nta.ac.in, JEE Mains Result 2026 Session 1 Scorecard Download Direct Link at Jeemain.nta.ac.in, examinationservices.nic.in LIVE Updates: Although the JEE Mains 2026 result link has already been generated, it is not active for students to check and download scorecards. Once activated, the result link will be available on jeemain.nta.nic.in.",
    "image": "https://images.indianexpress.com/2026/02/jee_mains_result_2026_live.jpg",
    "source": "The Indian Express"
  }
]