[
  {
    "title": "Oman's Offshore CCS: From global precedent to regional opportunities",
    "desc": "For Oman, offshore CCS aligns closely with its net-zero by 2050 commitment and broader energy transition strategy",
    "image": "https://static.zawya.com/view/acePublic/alias/contentid/YjY4MWJiYmUtODE5NC00/263/1488333510.jpeg?f=3%3A2",
    "source": "ZAWYA"
  },
  {
    "title": "France shock Denmark for European title to add new twist to Thomas Cup race",
    "desc": "PETALING JAYA: The Malaysian camp may need to tread carefully ahead of the Thomas Cup in April in Horsens as a new contender has emerged, with France making history by clinching the European title for the first time.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/16/3773293.jpg",
    "source": "The Star"
  },
  {
    "title": "'I went too far'",
    "desc": "American model Tyra Banks has admitted she \"went too far\" when she shouted at a contestant on America's Next Top Model, as she revisits the controversial reality show in a new Netflix series.",
    "image": "https://www.rte.ie/images/0023e699-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "‘I blew it’: Ilia Malinin and what happens when you fall short on the biggest sporting stage",
    "desc": "From Lindsey Jacobellis to Ilia Malinin, perceived failure on the world stage is public and permanent - but it's how you react that matters",
    "image": "https://static01.nyt.com/athletic/uploads/wp/2026/02/15062205/GettyImages-2261648788-scaled-e1771154581596.jpg?width=1200&height=630&fit=cover",
    "source": "The New York Times"
  },
  {
    "title": "COSAFA Women’s Championship: Malawi coach axes 12 players",
    "desc": "Malawi senior women’s national team coach Lovemore Fazili has made major changes to the squad for the forthcoming COSAFA Women’s Championship in South Africa.",
    "image": "https://www.panafricafootball.com/wp-content/uploads/2026/02/Malawi-senior-womens-national-team-coach-Lovemore-Fazili-e1771231633232.jpg",
    "source": "Pan-Africa Football"
  },
  {
    "title": "Steve Smith activated for Australia's T20 World Cup squad to replace injured Josh Hazlewood",
    "desc": "COLOMBO, Sri Lanka (AP) — Steve Smith has been added to Australia's squad at the Twenty20 World Cup officially as an injury replacement for fast bowler Josh Hazlewood.",
    "image": "https://s.yimg.com/ny/api/res/1.2/uj1mPMN4gspOu69jmQY_3g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/cp_sports_913/4cbeb264e5823da66331248f13fc75cb",
    "source": "Yahoo Sports Canada"
  },
  {
    "title": "Password Managers Less Secure Than Promised",
    "desc": "Researchers from ETH Zurich have discovered serious security vulnerabilities in three popular, cloud-based password managers. During testing, they",
    "image": "https://ethz.ch/en/news-and-events/eth-news/news/2026/02/password-managers-less-secure-than-promised/_jcr_content/pageimages/imageCarousel.imageformat.lightbox.1167258508.jpg",
    "source": "Mirage News"
  },
  {
    "title": "Ghana seeks extradition of Russian man over secret sex videos",
    "desc": "Ghana says it plans to seek the extradition of a Russian national accused of secretly filming intimate encounters with several women and posting the footage online without their permission.",
    "image": "https://images.euronews.com/articles/stories/09/65/24/17/1024x538_cmsv2_7db93011-1cd5-558f-b65a-923b74a745f2-9652417.jpg",
    "source": "africanews.com"
  },
  {
    "title": "Ethiopian Airlines to Connect Africa to Australia by 2028 - What This Means for Global Travel!",
    "desc": "Ethiopian Airlines to Connect Africa to Australia by 2028 – What This Means for Global Travel! Ethiopian Airlines, one of Africa’s largest and most reputable",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/ethiopian-airline.jpeg",
    "source": "Travel And Tour World"
  },
  {
    "title": "Six Nations: The weekend review",
    "desc": "Catch up on your favourite BBC radio show from your favourite DJ right here, whenever you like. Listen without limits with BBC Sounds.",
    "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p0lwzcxx.jpg",
    "source": "BBC"
  }
]