[
  {
    "title": "Record 129 journalists and media workers killed in 2025, mostly by Israel, says CPJ",
    "desc": "A record 129 journalists and media workers were killed in the course of their work last year, two-thirds of them killed by Israel, the Committee to Protect Journalists (CPJ) said on Wednesday.",
    "image": "https://images.gmanews.tv/webpics/2021/12/Committee_to_Protect_Journalists_composite_image_2021_12_09_15_10_50.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Murkomen outlines measures preventing officers interfering in extra-judicial killing cases",
    "desc": "CS Murkomen said the measures include mechanisms that prevent accused officers from accessing case files or witnesses, and the provision of witness protection p...",
    "image": "https://publish.eastleighvoice.co.ke/mugera_lock/uploads/2025/06/81c50d56-c2a0-4c19-a28a-db692256b0dc.jpg",
    "source": "The Eastleigh Voice"
  },
  {
    "title": "Man jailed for murder of girl, 9, as she played hula hoop in Lincolnshire street",
    "desc": "Deividas Skebas given minimum term of 25 years for killing Lilia Valutyte outside mother’s shop in Boston in July 2022",
    "image": "https://i.guim.co.uk/img/media/1d7abc620f0652f7f0343d9c68a645757bb30949/0_112_1561_1249/master/1561.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e205719ffd369875283f58eeab18f959",
    "source": "The Guardian"
  },
  {
    "title": "Larry Summers to resign from Harvard over Jeffrey Epstein ties",
    "desc": "The former US Treasury secretary says it was a \"difficult decision\" and he will leave at the end of the academic year.",
    "image": "https://live-production.wcms.abc-cdn.net.au/409f0c0aa7c1c8d305eeb43ca64bf800?impolicy=wcms_watermark_news&cropH=1741&cropW=3095&xPos=0&yPos=25&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Lyall Bay residents fear neglected Queen’s Drive property is a danger to passersby",
    "desc": "By Bill Hickman of RNZ Residents of Wellington’s Lyall Bay fear a neglected property in the seaside suburb‘s Queens Drive is in such a bad state it is a...",
    "image": "https://www.nzherald.co.nz/resizer/v2/TI52LAZWKZDYXGBZIBG247RIJI.webp?auth=59ac0a5a937a21949f93f50e231b19aa485203485d65d170a5d7416a97917ed3&width=1200&height=675&quality=70&focal=583%2C250&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Three-quarters of Australia’s new cars use more fuel than advertised lab rating, testing shows",
    "desc": "Cars with higher real-world consumption may add to Australia’s difficulties in reducing transport emissions",
    "image": "https://i.guim.co.uk/img/media/5844f3bf1c036eb83872377ce635fffdb11e2ba8/116_18_3288_2632/master/3288.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ad60615fb8e001833d9821887fed6f2d",
    "source": "The Guardian"
  },
  {
    "title": "Nvidia Earnings Slam Into Market With No Patience for AI Hiccups",
    "desc": "Nvidia Corp.’s earnings report on Wednesday afternoon comes at a critical time for the US stock market with investors increasingly nervous about the outlook for artificial intelligence.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iy0jUh0x3e7M/v1/1200x800.jpg",
    "source": "Bloomberg.com"
  },
  {
    "title": "Penguins' Sidney Crosby sidelined at least 4 weeks with lower-body injury",
    "desc": "The Pittsburgh Penguins placed Sidney Crosby on injured reserve Wednesday after the Canadian captain missed Sunday's Olympic gold-medal game with a lower-body injury. The veteran centre will be out at least four weeks, the NHL team said.",
    "image": "https://i.cbc.ca/ais/6c0c6833-0db5-4f9d-81f8-1a1a83b692bb,1772034047511/full/max/0/default.jpg?im=Crop%2Crect%3D%2820%2C0%2C1139%2C640%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Arc Pulse Brings Its Crazy Case to the Galaxy S26 Ultra",
    "desc": "Arc Pulse, the ultra-expensive two-piece case option that gained fame as a luxury item for iPhones, has introduced its new case for the Galaxy S26 Ultra today. Like previous models, this thing is indeed a pricey little guy, but there are also several options and metals to choose... #ArcPulse #Cases",
    "image": "https://www.droid-life.com/wp-content/uploads/2026/02/Galaxy-S26-Ultra-Arc-Pulse-2292x1200-cropped.jpg",
    "source": "Droid Life"
  },
  {
    "title": "Sudan: RSF targeted the disabled in el-Fasher, HRW alleges",
    "desc": "A new Human Rights Watch report accuses the Rapid Support Forces militia in Sudan of intentionally targeting and, in some cases, summarily executing civilians with disabilities during its 2025 takeover of el-Fasher.",
    "image": "https://static.dw.com/image/75931733_6.jpg",
    "source": "DW.com"
  }
]