[
  {
    "title": "Blizzard, winter storm warnings issued, could be biggest in decade | Live updates",
    "desc": "A powerful winter storm is expected to deliver the first blizzard to parts of the Tri-State area in almost a decade from Sunday afternoon through Monday morning, with heavy snow, strong winds and hazardous travel likely.",
    "image": "https://cdn.abcotvs.com/dip/images/18627710_022026-snowmap11pm.jpg?w=1600",
    "source": "ABC7 New York"
  },
  {
    "title": "Businessman Appeals For Support To Enyan Denkyira SHTS",
    "desc": "A 35-year-old businessman, Ebenezer Amponsah Omane, a native of Enyan Ankukrom in the Ejumako-Enyan-Esiam District of the Central Region, has appealed to the government, NGOs, and residents of the Enyan Denkyira Traditional Area to support the Enyan Denkyira Senior High Technical School. His call came after he donated musical instruments…",
    "image": "https://www.newsghana.com.gh/wp-content/uploads/2024/08/logo-newsghana.png",
    "source": "News Ghana"
  },
  {
    "title": "The British royal family faces its worst crisis in generations",
    "desc": "King Charles III' s brother was under arrest. Police were searching two royal properties, and news commenta...",
    "image": "https://imageresizer.static9.net.au/nOcPeozL-4oD9qZuaewbXAK83bQ=/0x0:3674x2066/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F677f07f3-83c3-41bd-bc30-e99b7e00033b",
    "source": "9News.com.au"
  },
  {
    "title": "KRA Reacts after Content Creator Displays Bundles on Kenyan Notes Online",
    "desc": "The Kenya Revenue Authority (KRA) found itself reacting to a post by content creator Kenyan Prince. He had posted bundles of notes on the X network.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/cf2260ad4ac9246f.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "Mark Ruffalo Fires Back at James Cameron Over Netflix-Warner Bros Deal",
    "desc": "Mark Ruffalo fired back at James Cameron after the 'Avatar' director said that Netflix buying Warner Bros. Discovery would be 'disastrous.'",
    "image": "https://variety.com/wp-content/uploads/2026/02/MixCollage-21-Feb-2026-12-33-PM-5129.jpg?crop=18px%2C19px%2C1163px%2C655px&resize=1000%2C563",
    "source": "Variety"
  },
  {
    "title": "Two people killed in Co Waterford road collision",
    "desc": "Man and woman (40s) fatally injured in incident on Tramore Road and two others taken to hospital",
    "image": "https://www.irishtimes.com/resizer/v2/KQ6CY4XA6RD23GDCDGE2XCFCMU.jpg?smart=true&auth=7444a2c61fef524ecb25b60e759ee300e850f9e2adab4d1112ea1d180aa3916d&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Webb Reveals Hidden Layers of Uranus’ Upper Atmosphere",
    "desc": "For the first time, astronomers have mapped the vertical structure of Uranus’ ionosphere, uncovering unexpected temperature peaks, weakened ion densities, and puzzling dark regions shaped by the planet’s extreme magnetic field.",
    "image": "https://cdn.sci.news/images/2026/02/image_14572-Uranus-Ionosphere.jpg",
    "source": "Sci.News"
  },
  {
    "title": "Quick Recap: Jays Beat Phillies",
    "desc": "Your best source for quality Toronto Blue Jays news, rumors, analysis, stats and scores from the fan perspective.",
    "image": "https://platform.bluebirdbanter.com/wp-content/uploads/sites/41/2026/02/imagn-28303540.jpg?quality=90&strip=all&crop=0%2C10.729455308229%2C100%2C78.541089383543&w=1200",
    "source": "Bluebird Banter"
  },
  {
    "title": "Norway's Johannes Klæbo is new Winter Olympics king",
    "desc": "Johannes Klaebo won all six cross-country skiing events at this year's Winter Olympics, the surpassing Eric Heiden's five golds in 1980.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3690x2076+0+192/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F76%2Ff0%2F21c4ce1d4717924c01fdb099f33d%2Fgettyimages-2262245661.jpg",
    "source": "NPR"
  },
  {
    "title": "5 key questions that need answering after the second 2026 pre-season test in Bahrain",
    "desc": "F1.com's Lawrence Barretto tries to answer the five key questions that came out of the second pre-season test at the Bahrain International Circuit.",
    "image": "https://media.formula1.com/image/upload/c_lfill,w_2048/q_auto/v1740000000/fom-website/2026/Pre-season%20test%202%20(Bahrain)/16x9%20single%20image%20-%202026-02-21T102613.146.webp",
    "source": "Formula 1"
  }
]