[
  {
    "title": "Berlinale Issues Statement Following Political Backlash",
    "desc": "Berlinale boss Tricia Tuttle has issued a statement following backlash, saying that artists should not Be 'expected to speak on every political issue",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2261202704-1.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Giant jellyfish is spotted off Argentinan coast",
    "desc": "The jellyfish has a bell size of up to one meter in diameter, and its four arms can reach lengths of up to about ten meters.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/581958",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Margot Robbie Good Genes or Good Docs?!",
    "desc": "Margot Robbie's looks over the years have soared to new Heights! The question is: Good Genes or Good Docs?!",
    "image": "https://imagez.tmz.com/image/1a/16by9/2026/02/10/1a166646556744179a7ae6f6ccea4f9a_xl.jpg",
    "source": "TMZ"
  },
  {
    "title": "England hope to avoid slip-up against Italy",
    "desc": "England have moved up to second in the table after a much-needed win over Scotland",
    "image": "https://static.cricbuzz.com/a/img/v1/540x303/i1/c860156/england-are-currently-placed-second-on-the-points-table.jpg",
    "source": "Cricbuzz.com"
  },
  {
    "title": "BDO offers zero percent medical installments",
    "desc": "BDO cardholders can pay hospital bills with 0 percent installment plans at partner hospitals until 30 June 2026.",
    "image": "https://media.assettype.com/tribune%2F2026-02-15%2F698jsukn%2FScreenshot-2026-02-15-at-4.33.07-PM.png?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Daily Tribune"
  },
  {
    "title": "'Absolute shocker' - Wayne Rooney slams VAR-less officials after series of errors in Newcastle's FA Cup win at Aston Villa",
    "desc": "Wayne Rooney launched a scathing attack on the standard of officiating in the FA Cup on Saturday, as Newcastle United overcame Aston Villa 3-1 in the fourth round despite multiple game-changing decisions going against them in the absence of VAR. The former Manchester United striker was particularly critical of a decision which saw a free kick given for a Lucas Digne handball which was clearly 'three yards inside' the penalty area.",
    "image": "https://assets.goal.com/images/v3/getty-2257258463/crop/MM5DKMBUGA5DEOBTGU5G433XMU5DMORYHA======/GettyImages-2257258463.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Russia's bid to derail Ukraine peace talks after making shock demand",
    "desc": "Russia appears to be once again trying to stall progress over a possible peace deal to resolve the Ukraine war.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/78/1200x630/6743121.jpg",
    "source": "Express.co.uk"
  },
  {
    "title": "Anne Curtis, Solenn Heussaff celebrate Georgina Wilson's 40th birthday in Shanghai",
    "desc": "Anne Curtis, Solenn Heussaff, and the rest of the It Girls, along with Raymond Gutierrez, BJ Pascual, Rajo Laurel, and more of their friends flew to Shanghai, China to celebrate Georgina Wilson's 40th birthday.\n\"This little trip reminded all of us that love and conversations is more than we need in our 40s :) so good to properly catch up with everyone and dance. Shanghai is such a magical place!\" Solenn wrote in an Instagram post.\nMeanwhile, Anne had a photoshoot during the trip inspired by Wong Kar-wai's film In the Mood for Love.\nShe wrote in her post, \"We all made it",
    "image": "https://aphrodite.gmanetwork.com/entertainment/gallery/1200_675_main_15-02-2026-1639_-20260215163942.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Handshake snub after fiery duel; NBA champ turns ‘monster’ for Hawks — NBL Wrap",
    "desc": "Handshake snub after fiery duel; NBA champ turns ‘monster’ — NBL Wrap",
    "image": "https://content.api.news/v3/images/bin/c483ef19124fec55e1cdf965438b31cf",
    "source": "fox sports"
  },
  {
    "title": "Sheep farmers call for more supports over dog attacks",
    "desc": "A Co Monaghan sheep-farming family is calling for new dog-control regulations and more supports for farmers who lose their sheep in dog attacks.",
    "image": "https://www.rte.ie/images/0023e550-1600.jpg",
    "source": "RTE.ie"
  }
]