[
  {
    "title": "Google: Hackers Are Trying to 'Clone' Gemini for Cyberattacks",
    "desc": "Private-sector entities hit Gemini with over 100,000 prompts to trick it into revealing its full reasoning processes, which Google says is a form of intellectual property theft.",
    "image": "https://i.pcmag.com/imagery/articles/041lPUPwukYoYVz6AtXEE4z-1.fit_lim.size_1200x630.v1770912491.jpg",
    "source": "PCMag"
  },
  {
    "title": "Canada regains scoring touch, defence in 5-0 win over Finns in Olympic women's hockey",
    "desc": "Emily Clark scored twice for Canada in a 5-0 win over Finland in Olympic women's hockey Thursday. Kristin O'Neill had a goal and an assist, and Jenn Gardiner and Darryl Watts added singles for Canada.",
    "image": "https://i.cbc.ca/ais/fc8b442e-bca6-4b6f-9e76-afbfb82e3ebd,1770910498604/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C299%2C4117%2C2315%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Justice Department’s antitrust chief has been fired, sources say",
    "desc": "Gail Slater, who ran the antitrust division for the Justice Department for nearly a year, was forced out by the Trump administration this week, two people familiar with the matter told CNN.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2198513645.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "The Milky Way Will Crash into the Andromeda Galaxy in 4.5 Billion Years and Scientists Think They Finally Know Why",
    "desc": "Simulations reveal dark matter arranged in a vast, flattened structure beyond the Local Group",
    "image": "https://cdn.zmescience.com/wp-content/uploads/2026/02/KY6QeEdwwfL6TPgrevdHGT-970-80.jpg",
    "source": "ZME Science"
  },
  {
    "title": "Joshua Oigara, Rebecca Mbithi take up new banking roles in shake-ups",
    "desc": "Mr Oigara's appointment takes effect next month as Ecobank Kenya also names a new managing director.",
    "image": "https://www.businessdailyafrica.com/resource/image/4719654/landscape_ratio3x2/1200/800/ee2df1beb7d0b4a4b3102ef4e64eee61/OK/oigara.jpg",
    "source": "Business Daily"
  },
  {
    "title": "House Passes Strict Voter ID Bill, Amplifying Trump’s Claims of Fraud",
    "desc": "The measure had no path forward in the Senate, where Democrats are all but certain to block it and Republicans have said they will not try to skirt filibuster rules to ram it through.",
    "image": "https://static01.nyt.com/images/2026/02/11/multimedia/11dc-voting-bwlj/11dc-voting-bwlj-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "4 Months Trapped in a Hospital for an Obsolete Way of Treating Their Disease",
    "desc": "Health workers in developing countries know that isolating tuberculosis patients is an outdated and potentially harmful practice, but lack the resources to move away from it.",
    "image": "https://static01.nyt.com/images/2026/01/30/multimedia/00HS-tb-cameroon-01-stillpromo/00HS-tb-cameroon-01-stillpromo-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Raheem Sterling joins Feyenoord for rest of season after Chelsea exit",
    "desc": "Raheem Sterling has signed for Feyenoord, who are managed by Robin van Persie, on a contract until the end of the season",
    "image": "https://i.guim.co.uk/img/media/52bea822a442775fdbd078c072f71d166578832f/190_141_1798_1438/master/1798.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2f788b7e96c94b048c569d15e11a4ab0",
    "source": "The Guardian"
  },
  {
    "title": "Tumbler Ridge shooting suspect had police visits over mental health struggles",
    "desc": "Police say the suspect's firearms licence expired two years ago, and exactly who owned the guns used in the attack is unclear.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6099/live/ddcf9510-082f-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  },
  {
    "title": "Namibia’s Onshore Drive: Emerging Opportunities Beyond The Deepwater Frontier - OpEd",
    "desc": "Namibia's upstream narrative has, until recently, been defined by deepwater success in the Orange Basin, where major offshore discoveries have transformed perceptions of the country's hydrocarbon potential. Galp's Mopane discovery, estimated to hold up to 10 billion barrels of oil equivalent, alongside TotalEnergies' Venus find, has firmly positioned Namibia on the global exploration map and...",
    "image": "https://www.eurasiareview.com/wp-content/uploads/2020/05/b-92.jpg",
    "source": "Eurasia Review"
  }
]