[
  {
    "title": "Team news: Four changes for trip to Brentford",
    "desc": "Find out who Mikel Arteta has selected for this evening's Premier League game against Brentford",
    "image": "https://www.arsenal.com/sites/default/files/styles/desktop_16x9/public/images/Mosq_kc3qipad.jpg?h=d3c32acb&auto=webp&itok=ffI4MTSz",
    "source": "Arsenal.com"
  },
  {
    "title": "Trump's bruised hand now 'swollen' as health fears soar",
    "desc": "The US President has faced scrutiny over his physical health.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/78/1200x630/6738903.jpg",
    "source": "Daily Express"
  },
  {
    "title": "England discover Nations League group with Three Lions handed brutal draw on return to League A",
    "desc": "England have been handed a brutal draw on their return to the top table of Nations League football. The Three Lions will take on Spain, Croatia, and Czechia in what could be seen as a Group of Death for Thomas Tuchel's men, who will first attempt to win the World Cup this summer.",
    "image": "https://assets.goal.com/images/v3/getty-2246321675/crop/MM5DIOBZG45DENZVGU5G433XMU5DAORTGI3Q====/GettyImages-2246321675.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Several African Leaders Arrive in Addis Ababa Ahead of 39th AU Summit and Historic Africa-Italy Summit",
    "desc": "Addis Ababa, February 12, 2026 (ENA)—Several African Presidents, Vice Presidents, and senior delegations arrived in Addis Ababa this evening to participate in the 39th Ordinary Session of the Assembly of Heads of State and Government of the African Union and the inaugural Africa–Italy Summit.\nAmong the arrivals were President Daniel Francisco Chapo of Mozambique, President Faustin-Archange Touadéra of the Central African Republic, and Vice President Sebastien Pillay of Seychelles.\n \n \nUpon arrival at Bole International Airport, the Presidents were warmly received by Minister of Planning and Development, Fitsum Assefa,Minister of Agriculture, Addisu Arega along with State Minister for Foreign Affairs, Ambassador Berhanu Tsegaye.\nAlso landing at Bole International Airport this evening was the Vice President of the Federal Republic of Nigeria, Sen. Kashim Shettima, who was warmly received by Minister of Innovation and Technology Belete Molla.\n \n \nThe leaders and their delegations will remain in Addis Ababa through Sunday to participate in summit deliberations, bilateral meetings, and related events.\nThis year’s AU Summit will be held under the theme “Assuring Sustainable Water Availability and Safe Sanitation Systems to Achieve the Goals of Agenda 2063,” and will bring together heads of state, government officials, and partners to advance continental priorities.\n \n \nConcurrently, Addis Ababa will host the historic Africa–Italy Summit—the first time the meeting is held on African soil—providing an additional platform for dialogue on trade, investment, migration, and development cooperation between African countries and Italy.\nEthiopia will also use the gatherings to showcase its recent achievements, highlighting progress in corridor development and successful riverside projects that have supported trade, transport, and local livelihoods.\nGovernment officials said the presentations will emphasize the country’s role as a gateway for regional integration and as a hub for infrastructure-led development in the Horn of Africa.\nSenior Ethiopian officials are expected to hold bilateral talks with visiting leaders during the summit period to strengthen cooperation on economic, security, and development matters.",
    "image": "https://www.ena.et/documents/42142/0/mozambique+1.jpg/dd0a99e7-3bcd-530c-db98-d9c0541dc516?version=1.0&t=1770924208786&download=true",
    "source": "ENA English"
  },
  {
    "title": "Norovirus cases up over 50% in a week, says HSE",
    "desc": "The HSE has urged the public to be aware of the signs and symptoms of norovirus as figures showed a sharp rise in cases.",
    "image": "https://www.rte.ie/images/00194e83-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Arsenal FC XI vs Brentford: Starting lineup, confirmed team news, injury latest for Premier League today",
    "desc": "Mikel Arteta has been dealt another injury blow ahead of crucial clash",
    "image": "https://static.standard.co.uk/2025/11/07/12/30/ArsenalXIpredictedArteta.jpeg?width=1200&auto=webp&quality=75",
    "source": "London Evening Standard"
  },
  {
    "title": "Michelle Yeoh Wipes Away Tears as She Accepts Berlinale Golden Bear and Reflects on a Career ‘Far Larger Than I Ever Dared to Imagine’",
    "desc": "Madame Morrible is a Golden Bear winner. Oscar-winning actress Michelle Yeoh added another prestigious award to her collection on Wednesday night in a very rainy Berlin, where she was presented with t...",
    "image": "https://s.yimg.com/os/en/variety.com/63556716389339fccccdfbb6a6148faf",
    "source": "Yahoo"
  },
  {
    "title": "Michelle Yeoh Wipes Away Tears as She Accepts Berlinale Golden Bear",
    "desc": "Michelle Yeah was awarded the Honorary Golden Bear for lifetime achievement at the opening night of the 2026 Berlinale",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2261287231.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Crossovers In Ice Planet Exploration",
    "desc": "Welcome to Astrobiology.com",
    "image": "https://astrobiology.com/wp-content/uploads/2026/02/miles-on-Ice.png",
    "source": "astrobiology.com"
  },
  {
    "title": "Mini-Tanking Test On Tap Following Artemis II SLS Leak Repair",
    "desc": "The Artemis II launch team prepared on Feb. 12 to test if repairs to stem a hydrogen leak that stopped a launch dress rehearsal nine days ago were successful.",
    "image": "https://aviationweek.com/sites/default/files/AWN_favicon_06122019.png",
    "source": "Aviation Week"
  }
]