[
  {
    "title": "Promising test to detect parasites in farmed deer",
    "desc": "Test could give a fast, accurate and cost-effective way to detect infections earlier.",
    "image": "https://www.farmersweekly.co.nz/wp-content/uploads/2026/02/deer_parasites-scaled.jpg",
    "source": "farmersweekly.co.nz"
  },
  {
    "title": "DNA marker reveals pyrethroid resistance in malaria mosquitoes",
    "desc": "A new study, jointly led by Liverpool School of Tropical Medicine and the Centre for Research in Infectious Diseases (CRID) in Cameroon, has detected a DNA marker in a gene encoding for a key enzyme, known as cytochrome P450, that helps mosquitoes to break down and survive exposure to pyrethroids, the main insecticides used for treating bed nets.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/Malaria_3-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Probe on sprinter’s ‘forced’ SEA Games withdrawal nearly done",
    "desc": "The investigation report will be completed in two weeks and submitted to the Malaysia Athletics president and youth and sports minister.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/12/0f771da1-danish-irfan-bernama-091225.webp",
    "source": "freemalaysiatoday.com"
  },
  {
    "title": "AFL integrity unit looking into why police visited Melbourne Demons player Steven May",
    "desc": "Melbourne veteran Steven May is being investigated by the AFL integrity unit, as the premiership defender stays away from Demons training.",
    "image": "https://live-production.wcms.abc-cdn.net.au/6eae42f84c4bb6ea16970b560215e349?impolicy=wcms_watermark_news&cropH=2282&cropW=4056&xPos=0&yPos=211&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "2026 Official Sepang MotoGP Test: Day 3 - LIVE UPDATES",
    "desc": "Live updates from the third and final day of the Official 2026 Sepang MotoGP Test - Yamaha returns to action.",
    "image": "https://cdn.crash.net/2026-02/gng_1289268_hires_1600x900.jpg?width=1600&aspect_ratio=16:9",
    "source": "crash.net"
  },
  {
    "title": "The sector with 17,000 more full-time jobs",
    "desc": "Unemployment has hit its highest level in a decade, but beneath the headline numbers some sectors are faring much better than others.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--ZoRUTR3_--/t_tohu-badge-facebook/v1644262523/4MU2PEC_copyright_image_229432?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Budget limits cap DOST scholarships to 8,500",
    "desc": "Despite a surge in applicants nationwide, the Department of Science and Technology’s Science Education Institute (DOST Science Education Institute) will accept only 8,500 new undergraduate scholars this year, citing budget constraints.",
    "image": "https://images.gmanews.tv/webpics/2025/01/1_2025_01_11_18_48_52.jpg",
    "source": "GMA Network"
  },
  {
    "title": "COVID vaccination not linked to reduced childbirth",
    "desc": "COVID-19 vaccination is not the cause behind a decrease in childbirth, according to a study from Linköping University, Sweden.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/Childbirth-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Bambu Lab strengthens PH presence through media roundtable and new retail partnership",
    "desc": "Bambu Lab, a consumer technology company established in Shenzhen, China, in 2020, continues to bring 3D printing closer to everyday users by strengthening its...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/05/76910.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Nutrition during cancer: Doctor busts food myths with medical facts",
    "desc": "As cancer care becomes more personalised, nutrition must follow the same path. Ms. Veena V’s message is clear: skip the fear-based food rules, nourish the body adequately, and trust evidence over trends because strength, not restriction, supports recovery.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/world-cancer-day-special-045153974-16x9_0.jpg?VersionId=kO4F8zXGEfDXX33Jh6rVJE0X1ne3Gi.h",
    "source": "India Today"
  }
]