[
  {
    "title": "One in two people facing cataract blindness need access to life-changing surgery",
    "desc": "The World Health Organization (WHO) is urging countries to accelerate efforts to ensure that millions of people living with cataract can access simple, sight‑restoring surgery – one of the most effective and affordable interventions to prevent avoidable blindness.",
    "image": "https://cdn.who.int/media/images/default-source/topics/health-and-well-being/disability/blindness-and-vision-impairment/cataract-operation.tmb-1200v.jpg?sfvrsn=e19544ee_2",
    "source": "World Health Organization (WHO)"
  },
  {
    "title": "Scientists Have Discovered a Protein That Reverses Brain Aging in The Lab",
    "desc": "Our brains age along with the rest of our bodies, and as they do, they produce fewer new brain cells.",
    "image": "https://www.sciencealert.com/images/2026/02/LargeNeuron.jpg",
    "source": "ScienceAlert"
  },
  {
    "title": "Exercise can be as effective as medication for depression and anxiety - new study",
    "desc": "Certain kinds of exercise were more effective at reducing symptoms. And some people benefited more.",
    "image": "https://images.theconversation.com/files/713068/original/file-20260119-56-8g96g7.jpg?ixlib=rb-4.1.0&rect=0%2C324%2C6000%2C3000&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "Live updates: Nancy Guthrie’s disappearance and latest on person in video",
    "desc": "Follow for live updates on the search for Nancy Guthrie, the mother of “Today” host Savannah Guthrie, which has entered its tenth day.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ha0icsnaaaujqwj.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Tumbler Ridge: Possible second suspect in active school shooting as air ambulance called",
    "desc": "An alert was issued to those living nearby which asked people to 'stay inside and shelter in place, lock your doors and refrain from leaving your home or business at this time'",
    "image": "https://i2-prod.mirror.co.uk/article36693929.ece/ALTERNATES/s1200/0_Cordon-Tape.jpg",
    "source": "The Mirror"
  },
  {
    "title": "Gold, Silver ETF assets triple in five months to cross Rs 3 lakh crore",
    "desc": "Gold ETF folios increased from 80.34 lakh to 1.14 crore, while silver ETF folios rose from 11.31 lakh to 47.85 lakh, representing growth of 43 percent and 323 percent, respectively.",
    "image": "https://images.moneycontrol.com/static-mcnews/2025/08/20250805152150_Gold-rep-2.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "Consult your physician first, patients told despite new medical price guide",
    "desc": "PETALING JAYA: Although there is now a price guide for procedures at private hospitals, patients are advised to consult their physicians over the actual cost of treatment and options available.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/11/3764854.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Eating well can boost fertility, says expert",
    "desc": "A balanced diet, healthy weight and stress control can support hormonal balance and improve egg and sperm quality.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/70957fdb-preggers-pregnart-woman-envato-elements-pic-100226.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "built high country bridges lost to fires, taking decades of history with them",
    "desc": "Volunteers are weighing the future of the High Country Rail Trail after the loss of 12 historic trestle bridges — and decades of work — to bushfires.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ba91be4eacbecbbb8f50201d92d0278b?impolicy=wcms_watermark_news&cropH=464&cropW=824&xPos=0&yPos=94&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Controversy! After 'India players have superior bats' remark, Sri Lanka’s Bhanuka Rajapaksa makes new post",
    "desc": "Cricket News: NEW DELHI: Sri Lanka batter Bhanuka Rajapaksa has clarified his recent comments about the bats used by Indian cricketers after they sparked major cont.",
    "image": "https://static.toiimg.com/thumb/msid-128167739,width-1280,height-720,imgsize-48586,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  }
]