[
  {
    "title": "Pakistan carries out strikes in Afghanistan after spate of suicide attacks",
    "desc": "Afghan sources say the Pakistani strikes hit the border provinces of Paktika and Nangarhar.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/2025-11-25T094514Z_2129341717_RC2L3IAMULO3_RTRMADP_3_AFGHANISTAN-PAKISTAN-ATTACK-1771720007.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Direct Access: Silly Nice Connects with Customers",
    "desc": "New York’s fast-moving cannabis brand invites customers to dial (929) 524-7033 for real answers, real product help, and real connection.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/22/946146.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "grandmother's garlic mushroom artwork puts new spin on managing food waste",
    "desc": "Meet the country artist putting a slightly unexpected spin on garlic mushrooms.",
    "image": "https://live-production.wcms.abc-cdn.net.au/677581257a6cc626e274175b0c1d6978?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "GLCH program helping locals recover and stay out of hospital",
    "desc": "When Helen Pollard returned home from her first – and last – cruise, she came down with a severe chest infection. Living in Sarsfield in the home she built with her late husband Denis, Helen found recovery challenging, especially after caring for Denis for many years until his passing in May last year.Thanks to a Support at Home package – a Federal Government–subsidised program that helps older people remain living independently – Helen was able to access an eight-week pulmonary rehabilitation program at Gippsland Lakes Complete Health's gym in Lakes Entrance.\"Now that program is really good,\" Helen said.\"I was nervous at first because I haven't exercised much for years, but it made a real difference.\"The Pulmonary Rehabilitation Program is designed for people living with chronic lung disease or other respiratory conditions. Combining exercise, education, and support, the evidence-based program helps participants improve breathing, strength, and confidence while safely managing symptoms.Exercise physiologist Nara Venkatesan said pulmonary rehab is vital in keeping people well and out of hospital, particularly in regional areas with limited specialist care.\"Pulmonary rehab helps people recover after respiratory illness, reduces breathlessness, and improves day-to-day function,\" she said. \"It also reduces the risk of hospital readmission.\"Chronic lung disease rates in East Gippsland are higher than metropolitan areas, driven by an ageing population and higher smoking rates. For Helen, the program has boosted both her fitness and strength and complemented her Support at Home package.\"I knew after Denis passed that my home was too big to manage alone,\" Helen said. \"I have a wonderful daughter, but she has a life and a family too. The help you get is very, very good. I just hope more people will take the message – I'm in my mid-80s, and a lot of people are too stubborn to ask for help, but it really makes a difference.\"To join the pulmonary rehabilitation program or learn more about support for lung disease and breathlessness, contact Gippsland Lakes Complete Health",
    "image": "https://bairnsdaleadvertiser.com.au/wp-content/uploads/2026/02/HelenPollardfrom_95936.jpg",
    "source": "Bairnsdale Advertiser"
  },
  {
    "title": "Marie Lueder Kicked off LFW Weekend With a Basement Rave",
    "desc": "After a 10a.m. showtime for her fall 2026 collection, the London-based designer brought her community of medieval sportswear-swathed models, city it-girls, and pop music subverters to party at Hackney’s LN-CC.",
    "image": "https://assets.vogue.com/photos/699a407fd9a8b8777df6544d/16:9/w_1280,c_limit/DSC06087.jpg",
    "source": "Vogue"
  },
  {
    "title": "dealer flees Australia, trying to evade justice in Far North",
    "desc": "An Australian drug-dealer tried to escape justice in his home country, moving in with a Northland woman and arranging to have $1 million paid into New...",
    "image": "https://www.nzherald.co.nz/resizer/v2/4LJKHJ57DBHCHDOOOMOREDRTUE.JPG?auth=352be1a91b55b8d09b19bc9480e4950abd56558067e7bdd26ac667b65ca7e7fe&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "Sterling One Champions $100bn Africa Investment Agenda",
    "desc": "Sterling One Foundation champions a $100bn Africa investment agenda, pushing for inclusive finance for women and youth at the African Union summit.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/22003033/Untitled.png",
    "source": "Punch Newspapers"
  },
  {
    "title": "Michael Galvin reflects on childhood, fame and three decades on Shortland Street",
    "desc": "Michael Galvin holds the New Zealand record for being the longest-serving actor in a soap opera. A graduate of Victoria University and Toi Whakaari: New...",
    "image": "https://www.nzherald.co.nz/resizer/v2/AOAMWRACNNGYTHAS6RLOYNMQRA.jpg?auth=acc98d7faf3d96aa5e198d761d070ffb41a14c4380139cf2491337ebc1a98f76&width=1200&height=675&quality=70&focal=940%2C405&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Chaz Mostert disqualified from Saturday at Sydney 500",
    "desc": "Walkinshaw TWG Racing driver Chaz Mostert has been disqualified from Saturday’s qualifying and race at the Dunlop Sydney 500. - Australia's #1 motorsport news website - Speedcafe.com",
    "image": "https://speedcafe.com/wp-content/uploads/2026/02/Supercars-Sydney500-Saturday-188-copy.jpg",
    "source": "Speedcafe.com"
  },
  {
    "title": "Don’t write Muhyiddin off just yet, says analyst",
    "desc": "Awang Azman Awang Pawi of Universiti Malaya says the Bersatu president's extensive political experience makes him far more resilient than many assume.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/09/a0fdc0cb-muhyiddin-yassin-bersatu-agm-8-8.webp",
    "source": "Free Malaysia Today"
  }
]