[
  {
    "title": "Why the NHS is unfairly rejecting you for help with your loved one's care fees - and how to fix it: Whistleblower reveals horrific reasons that can leave you thousands out of pocket",
    "desc": "The NHS offers full funding for people who need to live in a care home or have home carer visits - so long as they meet the criteria for what is called continuing healthcare.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/07/11/106185893-0-image-a-10_1770463598096.jpg",
    "source": "This is Money"
  },
  {
    "title": "Lindsey Vonn Olympic downhill ACL : NPR",
    "desc": "An ACL tear would keep almost any other athlete from competing -- but not Lindsey Vonn, the 41-year-old superstar skier who is determined to cap off an incredible comeback from retirement with one last shot at an Olympic medal.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/3268x1838+0+170/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Ffa%2F50%2F6a11451a483b8efb3ac2c5ef6c06%2Fap26037444285176.jpg",
    "source": "NPR"
  },
  {
    "title": "Army pulls out 10 retired generals in colourful Lagos parade",
    "desc": "The Nigerian Army Finance Corps honours 10 senior officers as the army pulls out retired generals in a colourful valedictory parade held in Lagos.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/07122715/HAi0m9WXQAAN0H1-1080x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Arsenal, City, & Man United in Acti",
    "desc": "Get the latest preview for EPL Gameweek 25. Key fixtures include Arsenal vs Sunderland, Man City vs Liverpool, and a big clash at Old Trafford.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2023/11/04212738/Arteta.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "McGuinness details illness prompting Áras race withdrawal",
    "desc": "Former EU commissioner Mairead McGuinness has revealed she was diagnosed with severe post-viral syndrome last year which prompted her to withdraw from the presidential election race.",
    "image": "https://www.rte.ie/images/0023dc4a-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Rahmanullah Gurbaz pulls out of PSL 11, citing 'personal commitments'",
    "desc": "Afghanistan batter Rahmanullah Gurbaz has withdrawn from the upcoming 11th edition of the Pakistan Super League , citing personal commitments.Gurbaz took to Instagram to upload a video in his native Pushto, explaining the reason for...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-07/l_649580_043157_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "When will it stop raining in the UK?",
    "desc": "Some parts of the UK have already seen more rain than they'd normally expect in the whole of February - so when will the wet weather end?",
    "image": "https://ichef.bbci.co.uk/ace/branded_weather/1200/cpsprodpb/b687/live/2a023ed0-0360-11f1-bab5-81d0d0b0abce.jpg",
    "source": "BBC"
  },
  {
    "title": "Super Bowl 2026 commercials: Athletes include Serena, more",
    "desc": "Breaking down the top commercials during Super Bowl LX that feature athletes.",
    "image": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0205%2Fr1610933_1046x588_16%2D9.jpg",
    "source": "ESPN"
  },
  {
    "title": "Alex Warren teases new song 'Fever Dream' release date: 'Really soon'",
    "desc": "Alex Warren continued to playfully tease fans about the release date of his upcoming song, Fever Dream, which might rival the success of his global hit Ordinary.Taking to his official Instagram, on Friday, February 6, the Grammy nominee...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-07/l_649574_044105_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "UFC Owners Contradict Dana White’s Court Statement While Revealing White House Event Progress",
    "desc": "Dana White’s court claims face scrutiny as UFC owners reveal new details on White House event preparations and fight lineup.",
    "image": "https://image-cdn.essentiallysports.com/wp-content/uploads/Dana-White-RFA.jpg",
    "source": "essentiallysports.com"
  }
]