[
  {
    "title": "PSX Geopolitics And Internal Security Concerns Mar Performance - OpEd",
    "desc": "Pakistan Stock Exchange (PXS) trended upwards for most of the week before adjusting by 3,703 points on Friday’s session, wiping out earlier gains to close the benchmark index at 184,130pts, down 45 points or 0.02%WoW. The decline was triggered by escalating geopolitical tensions over US and Iran, alongside adverse domestic security developments. Earlier in the...",
    "image": "https://www.eurasiareview.com/wp-content/uploads/2025/10/a-36.jpeg",
    "source": "Eurasia Review"
  },
  {
    "title": "Hock Kin urges BAM to fix programme that has failed to produce next Chong Wei",
    "desc": "PETALING JAYA: Could the Badminton Association of Malaysia (BAM) benefit from placing greater trust in local coaches?",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/08/3759960.jpg",
    "source": "The Star"
  },
  {
    "title": "Foreign Office to review Mandelson's US ambassador pay-off",
    "desc": "A pay-off given to Lord Mandelson after he was sacked as ambassador to the US is being reviewed, Foreign Office sources tell the BBC.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cdfe/live/1e366460-0472-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  },
  {
    "title": "Men’s snowboard big air: Weeks after arm break, Ollie Martin narrowly misses out on podium",
    "desc": "American teen Ollie Martin finishes fourth in his Olympic debut as Kira Kimura wins the men's snowboard big air gold.",
    "image": "https://static01.nyt.com/athletic/uploads/wp/2026/02/07174450/GettyImages-2259800426-scaled.jpg?width=1200&height=630&fit=cover",
    "source": "The New York Times"
  },
  {
    "title": "Tinubu to embark on two-day UK state visit - first by a Nigerian president in 37 years",
    "desc": "President Bola Tinubu is set to commence a two-day state visit in the United Kingdom on March 18, Buckingham Palace has announced.",
    "image": "https://www.thecable.ng/wp-content/uploads/2026/02/King-Charles-and-Tinubu.jpg",
    "source": "TheCable"
  },
  {
    "title": "Broadcom’s Wi‑Fi 8 Launch And Hyperscaler AI Builds Might Change The Case For Investing In AVGO",
    "desc": "In early February 2026, Broadcom announced the industry’s first enterprise Wi‑Fi 8 access point and switch platform, built on its new BCM49438 accelerated processing unit and Trident X3+ BCM56390 Ethernet switch to support AI-ready, multi-gigabit enterprise networks with unified security and analytics. The launch, combined with very large AI infrastructure spending plans from hyperscalers such as Alphabet and Amazon, underscores Broadcom’s role at the center of both custom AI accelerators...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/dfc5c49a1ab838a9c236bef742ffecf1",
    "source": "Yahoo Finance"
  },
  {
    "title": "One AI hub, fewer tabs - 1min.AI’s lifetime plan costs $99.99",
    "desc": "The 1min.AI Advanced Business Plan lifetime subscription is available for $99.99, delivering 81% off AI tools for writing, images, PDFs, audio, and video.",
    "image": "https://helios-i.mashable.com/imagery/articles/03JLGOH5sgpmbweNB0YpchZ/hero-image.fill.size_1200x675.v1770377702.jpg",
    "source": "Mashable"
  },
  {
    "title": "Olympic women's hockey roundup: U.S. stays undefeated with win over Finland",
    "desc": "Even a complete Finland squad was no match for Team USA.",
    "image": "https://www.sportsnet.ca/wp-content/uploads/2026/02/CP175746721.jpg",
    "source": "Sportsnet"
  },
  {
    "title": "Dozens of flood warnings in England after days of non-stop rain",
    "desc": "Rain has fallen in south-west England and south Wales every day of 2026 so far, the Met Office said.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1f92/live/680ea460-0479-11f1-b6a6-09172d2d2d74.jpg",
    "source": "BBC"
  },
  {
    "title": "'One Battle After Another' Wins at British Society of Cinematographers",
    "desc": "\"One Battle After Another's\" Michael Bauman has won the British Society of Cinematographers Feature Film Award.",
    "image": "https://variety.com/wp-content/uploads/2024/12/One-Battle-After-Another-Editing.jpg?w=900&h=563&crop=1",
    "source": "Variety"
  }
]