[
  {
    "title": "India Regulator Pursues Fund Diversion Allegations Against Zee",
    "desc": "India’s market regulator has issued a show-cause notice to Zee Entertainment Enterprises Ltd. and its leadership, reviving allegations of fund diversion and governance lapses that derailed its planned merger Sony Pictures Networks India.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ir6q9._qITxQ/v0/1200x800.jpg",
    "source": "Bloomberg"
  },
  {
    "title": "Pakistan, Philippines agree to boost multi-sector cooperation",
    "desc": "ISLAMABAD, Feb 20 (APP):Pakistan and the Philippines, at the second meeting of their Joint Economic Commission held in Manila, agreed to enhance cooperation",
    "image": "https://www.app.com.pk/wp-content/uploads/2026/02/Pakistan-e1771569967762.avif",
    "source": "Associated Press of Pakistan"
  },
  {
    "title": "Harrdy Sandhu returns to Punjabi cinema with Simrat Kaur",
    "desc": "Popular singer-actor Harrdy Sandhu is returning to Punjabi cinema with a new feature film, marking a significant shift back to his roots after achieving",
    "image": "https://minutemirror.com.pk/wp-content/uploads/og-cache/8f87169c5da27de80151e4628de491d8.jpg",
    "source": "Minute Mirror"
  },
  {
    "title": "Frustrated Hoops to begin season vs Pat's",
    "desc": "Shamrock Rovers will hope it is third time lucky tonight in beginning their SSE Men's Airtricity Premier Division season when St Patrick's Athletic visit Tallaght Stadium.",
    "image": "https://www.rte.ie/images/0023ec20-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "President Mahama told me I would be MCE but some people changed it - Alhaji Umar Sanda",
    "desc": "Independent candidate for the Ayawaso East by-election, Alhaji Umar Sanda Mohammed, has opened up about his political journey and the controversy surrounding his bid to become Municipal Chief Executive (MCE).",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/490/49088073.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Data Patterns, BDL, other defence stocks rise up to 5.5% on Macron's 'India to make Rafale jets with France' remark",
    "desc": "India's expected order for another 114 Rafales is a 'new step forward' in defence ties between the two countries and France hopes to see this replicated with submarines as well, French President told reporters at the end of a three-day visit to India",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260220064209_modi-macron.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "Pakistan coach Mike Hesson not spared, brutally exposed for horror show against India: ‘Free ke paise le raha kya bhai?’",
    "desc": "Mohammad Kaif tore into Pakistan coach Mike Hesson, questioning his coaching methods. Here's what he said.  | Cricket",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/20/550x309/PTI02-15-2026-000309B-0_1771568215839_1771568232647.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Pep Guardiola: Wayne Rooney wants Manchester City boss to stay at Etihad",
    "desc": "Former Manchester United captain Wayne Rooney says he hopes Pep Guardiola will stay at Manchester City beyond this season because he has set 'a benchmark' for all other managers.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/286f/live/edd4afd0-0dd5-11f1-ad76-15be5b81d03d.jpg",
    "source": "BBC"
  },
  {
    "title": "UK on track to undershoot borrowing forecasts after recording biggest ever budget surplus in January - business live",
    "desc": "Rolling coverage of the latest economic and financial news",
    "image": "https://i.guim.co.uk/img/media/ab7b3fe10809245754608dae2b26698ed5cea57b/0_0_4933_3949/master/4933.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=2a30ddee3eedb2a796cc941f5a1453f6",
    "source": "The Guardian"
  },
  {
    "title": "Punjab unveils Rs3bn electric fog cannon plan to fight smog",
    "desc": "The initiative is a component of province’s broader clean air and climate resilience strategy aimed at cutting pollution levels and strengthening environmental protection mechanisms",
    "image": "https://pakobserver.net/wp-content/uploads/2026/02/punjab-unveils-rs3bn-electric-fog-cannon-plan-to-fight-smog-pakobserver-739723.jpg",
    "source": "Pakistan Observer"
  }
]