[
  {
    "title": "Somalia: Government announces progress in fight against Al-Shabaab",
    "desc": "Somalia’s government has announced it is making progress in its long-running fight against the Al-Qaida linked Al-Shabaab militant group. Officials have announced they’ve reclaimed territory from the militants, which once controlled swathes of the country.",
    "image": "https://images.euronews.com/articles/stories/09/65/55/13/1024x538_cmsv2_233a6bb6-d700-568d-a0ac-91d2cc2c7ff7-9655513.jpg",
    "source": "africanews.com"
  },
  {
    "title": "PSEi, peso climb ahead of BSP policy meeting",
    "desc": "Philippine financial markets closed higher on Wednesday as investors positioned ahead of the policy meeting of the Bangko Sentral ng Pilipinas (BSP), where officials are set to assess whether to continue the current easing cycle.",
    "image": "https://images.gmanews.tv/webpics/2026/02/130102-thumb-phleconomy_2026_02_18_18_14_38.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Stand firm or fail the nation, Maraga tells lawyers ahead of polls",
    "desc": "He says the Law Society of Kenya holds a critical role, especially now that the country is headed into the 2027 general election.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/f542e2ba-3615-426b-830e-fabd807c4314.png?1771411353511",
    "source": "the-star.co.ke"
  },
  {
    "title": "More Riga Airport construction work begins",
    "desc": "Construction work has begun on Riga Airport's new apron 4 reconstruction project, dismantling outdated pavement slabs and equipment to begin construction of new engineering network infrastructure...",
    "image": "https://static.lsm.lv/media/2026/02/large/1/sqry.jpg",
    "source": "LSM.lv"
  },
  {
    "title": "Manslaughter trial set to begin for climber who ‘left his girlfriend to freeze to death’ on Austria’s highest mountain",
    "desc": "The trial of an Alpine climber charged with manslaughter after he left his girlfriend on Austria’s highest mountain before she froze to death, is due to begin on Thursday.",
    "image": "https://focus.independent.ie/thumbor/jZ3qxjANyBUZ26a3Psl2pAqtZyk=/0x50:724x533/629x0/prod-mh-ireland/a7da3a4c-37bb-43a6-a746-dbd522d07818/d9f98f56-4f1b-4345-9af4-4df0ae3da6bf/a7da3a4c-37bb-43a6-a746-dbd522d07818.jpg",
    "source": "The Irish Independent"
  },
  {
    "title": "Sudan: how warring factions gained influence in the country’s food system - and what it means for the current conflict",
    "desc": "Armed actors in fragile contexts typically engage in sectors where they can quickly extract profits.",
    "image": "https://images.theconversation.com/files/718504/original/file-20260216-56-wp6zyn.jpg?ixlib=rb-4.1.0&rect=0%2C23%2C1024%2C512&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "Philippines ranks near bottom globally in AI readiness, raising risks for BPO sector",
    "desc": "The Philippines lags behind its Association of Southeast Asian Nations (ASEAN)-5 peers and ranks among the bottom five countries globally in harnessing...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/18/80059.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Google Pixel Phones to Get iPhone Level of Face ID Unlock",
    "desc": "Google is reportedly working on upgraded facial recognition technology for the upcoming Pixel 11 lineup and future Chromebooks. The internal codename for",
    "image": "https://propakistani.pk/wp-content/uploads/2025/12/Google-Pixel.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Morocco Ministries and AXA Sign Strategic Partnership to Boost AI and Technology Competencies",
    "desc": "The collaboration aims to establish a YEROM-organized cooperative framework to strengthen national competencies in technology, data, and artificial intelligence (AI).",
    "image": "https://techafricanews.com/wp-content/uploads/2026/02/morocco-32.png",
    "source": "TechAfrica News"
  },
  {
    "title": "Deep learning-based semantic matching of cis-regulatory DNA sequences facilitates the prediction of gene function",
    "desc": "The rich information encoded in cis-regulatory DNA sequences has not been fully exploited for gene function prediction in reverse genetics. Here we show that orthologous cis-regulatory sequences that diverged approximately 160 million years ago share little sequence similarity, yet remarkably retain semantic similarity that can be effectively captured by a deep learning model, PhytoBabel. Although trained solely on orthologous cis-regulatory sequence pairs from 15 angiosperms, PhytoBabel implicitly learned spatio-temporal gene expression patterns, conserved noncoding sequences, semantically similar fragments and phylogenetic relationships among species. Furthermore, PhytoBabel enables the discovery of evolutionarily unrelated but semantically similar cis-regulatory sequences, facilitating the identification of novel genes with functions of interest. As a proof of concept, we identified somatic embryogenesis-related morphogenic regulators in maize that exhibit semantic similarity to known Arabidopsis morphogenic regulators. By bridging the gap in the cis-regulatory sequence → semantics → gene function information chain, PhytoBabel provides a valuable tool for gene function prediction in reverse genetics. PhytoBabel is an AI model designed to capture the semantic similarity of cis-regulatory sequences across phylogenetically distant plant species, thereby establishing an approach for cross-species knowledge transfer and gene function prediction.",
    "image": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41477-026-02231-w/MediaObjects/41477_2026_2231_Fig1_HTML.png",
    "source": "Nature"
  }
]