[
  {
    "title": "Common pneumonia bacterium may fuel Alzheimer’s disease",
    "desc": "A common bacterium best known for causing pneumonia and sinus infections may also play a surprising role in Alzheimer’s disease. Researchers found that Chlamydia pneumoniae can invade the retina and brain, where it sparks inflammation, nerve cell death, and the buildup of amyloid-beta—the hallmark protein linked to Alzheimer’s. Higher levels of the bacterium were found in people with Alzheimer’s, especially those carrying the high-risk APOE4 gene, and were tied to more severe cognitive decline.",
    "image": "https://www.sciencedaily.com/images/1920/neuroscience-brain-inflammation-disease.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Android 16 arrives painfully late on Motorola’s flagship Razr foldables",
    "desc": "Only eight months late",
    "image": "https://static0.anpoimages.com/wordpress/wp-content/uploads/wm/2025/05/moto-razr-ultra-review-4.jpg?w=1600&h=900&fit=crop",
    "source": "Android Police"
  },
  {
    "title": "Kawhi Leonard ruled out of Lakers clash with ankle injury",
    "desc": "The Clippers have now lost two starters, John Collins and Kawhi Leonard, to injury during their Friday night clash against the Lakers.",
    "image": "https://wp.clutchpoints.com/wp-content/uploads/2026/02/Kawhi-Leonard_d7ca9f.jpg",
    "source": "ClutchPoints"
  },
  {
    "title": "Man stabs father to death in Ilocos Sur",
    "desc": "A 29-year-old man allegedly suffering from mental illness stabbed his father to death inside their house in Barangay San Vicente, Lidlidda, Ilocos Sur on...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/21/80905.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "DOST to launch National AI Center",
    "desc": "Seeking to unify the country’s artificial intelligence (AI) initiatives, the Department of Science and Technology (DOST) will launch the National Artificial...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/21/80904.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "LaLiga: Simeone reveals two special qualities that set Lookman apart from other forwards",
    "desc": "Atletico Madrid manager, Diego Simeone has revealed two special qualities that set Ademola Lookman apart from other forwards. Lookman has been impressive",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/Diego-Simeone.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Body of drowned Chinese national found",
    "desc": "Police say a search team found the victim lying face down in the water near Pulau Cabang this morning, about 50m from where he was last seen.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/02/49c746ea-lemas-drowned-freepik-pic-090225-resize.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "The rs3024839 and rs2227483 polymorphisms with immune pathomechanism offers a starting point for diagnosis and susceptibility testing of myocardial infarction",
    "desc": "Long-term primary prevention of myocardial infarction faces challenges, but genetic risk assessment may change this dynamic. We sought for genetic risk loci influencing myocardial infarction and underlying pathomechanisms. AS-PCR used for mutation detection (STAT4_ rs3024839 and IL22_ rs2227483) and confirmed positives by sequencing and Digital PCR. STAT4 and IL22 mRNA levels and chromatin accessibility at SNP sites were evaluated. We assessed SNPs for association with myocardial underlying comorbidities as well as their predictive performance ability. The population flow-sorted CD4+ FOXP3+ Tregs and the level of Foxp3 mRNA were measured and TGF-β1 quantified using ELISA and intracellular staining assay. Immunophenotyping used to identify p53 expression, pro-inflammatory monocytes and circulating endothelial cells. More than 99% samples were positive for mutations. Significant differences in the mutated allele and genotype frequencies were identified at a p value cutoff of 0.05. Analyses identified SNPs as risk factors for comorbid factors with the ability in distinguishing high and low-risk individuals (AUC > 0.9). Differentially accessible chromatin regions influencing STAT4 and IL22 expression were found in risk loci. Lower circulating CD4+ FOXP3+Tregs, Foxp3 expression decline, decreasing TGF-β1 level, increased p53 level, inflammatory state and endothelial dysfunction were further validated. Discovered genotypes open novel opportunities for MI prediction.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Trial into puberty blockers for children paused over 'wellbeing concerns'",
    "desc": "Recruitment to the study will be postponed until the issues have been resolved with the sponsor, King's College, and it is concluded that it is \"both safe and necessary\", a spokesperson for the Department of Health and Social Care.",
    "image": "https://e3.365dm.com/26/02/1600x900/skynews-istock-teenager-dark_7170698.jpg?20260221043153",
    "source": "Sky News"
  },
  {
    "title": "Ghana, Burkina Faso deepen security ties after terrorists kill 8 Ghanaians in Titao",
    "desc": "Minister for Foreign Affairs Samuel Okudzeto Ablakwa has announced plans to strengthen security cooperation with Burkina Faso following a deadly extremist attack that claimed the lives of eight Ghanaians in Titao.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/vlcsnap-2026-02-21-05h34m17s405-e1771652463680.png",
    "source": "MyJoyOnline"
  }
]