[
  {
    "title": "Richardson shines but Webster puts Tasmania in charge",
    "desc": "Sheffield Shield 2025/26, West Aust vs Tasmania Match Report: The quick bowler produced a superb opening burst and returned to make further inroads, but Western Australia face a tough chase",
    "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/412900/412986.6.jpg",
    "source": "ESPNcricinfo"
  },
  {
    "title": "Sexagenarian nabbed for raping granddaughter 105 times",
    "desc": "CAMP MARCELO A. ADDURU, Tuguegarao City, Cagayan – Police arrested a 67-year-old man for allegedly raping his granddaughter 105 times in Allacapan, this...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/06/77390.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "27 dacoits killed, 123 arrested in ongoing Katcha operations: Sindh IGP",
    "desc": "15 abductees recovered, some of whom had been held captive for up to three years",
    "image": "https://i.tribune.com.pk/media/images/untitled-design-21770364961-0/untitled-design-21770364961-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "2026 trade deadline numbers to know",
    "desc": "After deals dot the landscape, find out which stats don't lie and who stands to help their team the most.",
    "image": "https://cdn.nba.com/manage/2024/06/harden-garland-1920-2205930469.jpg",
    "source": "NBA"
  },
  {
    "title": "Karachi Public Shocked With Explicit Adult Content Displayed on Roadside",
    "desc": "Karachi residents were left stunned after explicit adult content was allegedly displayed on roadside digital advertising screens in the DHA area,",
    "image": "https://propakistani.pk/wp-content/uploads/2026/02/dha-karachi.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Ruto joins locals at kibanda for lunch",
    "desc": "The action has sparked mixed reactions online from critics and supporters.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/8f2cdbda-9fad-4aad-a6fa-d02c03f04c18.jpeg?1770400870965",
    "source": "the-star.co.ke"
  },
  {
    "title": "JMIR Publications launches Karma Reviewer Rewards Program",
    "desc": "Programme aims to introduce structured framework prioritising the quality and rigour of reviews over volume",
    "image": "https://www.researchinformation.info/wp-content/uploads/2025/02/GetFTR.jpeg",
    "source": "Research Information"
  },
  {
    "title": "Honouring a Legacy of Impact: The Search for the next Amnesty International Kenya Executive Director is on",
    "desc": "Friday 6 February 2026 After eight transformative years of service, Irũngũ Houghton will conclude his tenure as Executive Director of Amnesty International Kenya in June 2026. Under his relentless stewardship, our membership grew eightfold to establish 165 Circles of Conscience across 35 counties. This growth was matched by financial resilience. Our budget grew 150% and […]",
    "image": "https://www.amnestykenya.org/wp-content/uploads/2026/02/Irungu-Headshot-3-1.jpeg",
    "source": "Amnesty Kenya"
  },
  {
    "title": "backed KUMON programme transforms maths learning at Ebenezer Baptist Christian School",
    "desc": "The initiative uses KUMON Connect, a tablet-based learning software that enables pupils to study mathematics at their own pace while nurturing focus, discipline, and time management, which are key skills for lifelong learning.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/image-610-1024x732.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Ashlean McGeehan is new Deputy Principal for Finn Valley College",
    "desc": "FacebookTweetLinkedInPrint Donegal ETB has appointed Ms Ashlean McGeehan as the new Deputy Principal of Finn Valley College in Stranorlar.  She…",
    "image": "https://www.donegaldaily.com/wp-content/uploads/2026/02/Newly-appointed-Finn-Valley-College-Deputy-Principal-Ashlean-McGeehan.png",
    "source": "Donegal Daily"
  }
]