[
  {
    "title": "Child malnutrition hits catastrophic levels in parts of Sudan",
    "desc": "Acute malnutrition among children has reached catastrophic levels in parts of Sudan’s North Darfur and Greater Kordofan, UN-backed analysts warned on Thursday, as conflict, mass displacement and denials of aid push the country deeper into a famine-risk emergency.",
    "image": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Collections/Embargoed/26-02-2025-UNICEF-Sudan-02.jpg/image770x420cropped.jpg",
    "source": "UN News"
  },
  {
    "title": "Davis Cup qualifying: Jack Draper beats Viktor Durasovic and Cameron Norrie wins to give Great Britain 2-0 lead over Norway",
    "desc": "Jack Draper says he is \"winning by being here\" as he makes an emphatic return to help Great Britain take control of their Davis Cup qualifying tie against Norway.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3831/live/e1028f50-02ba-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "The SPIRou Legacy Survey: Detection Of A Nearby World Orbiting In The Habitable Zone Of Gl725B",
    "desc": "Welcome to Astrobiology.com",
    "image": "https://astrobiology.com/wp-content/uploads/2026/02/The-SPIRou-Legacy-Survey.png",
    "source": "astrobiology.com"
  },
  {
    "title": "Winter Olympics 2026: Marathon legend Eliud Kipchoge relishes chance to hold up Olympic flag at Opening Ceremony",
    "desc": "Two-time gold medallist from Kenya, scheduled to serve as one of the eight flag bearers at Milano San Siro Olympic Stadium on Friday (February 6), speaks of his love for winter sports like ice hockey and cross-country skiing",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/mgvu25ch9oqkbprtjxad",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "PDS Health Highlights Link Between Oral Health and Heart Health During American Heart Month",
    "desc": "/PRNewswire/ -- During American Heart Month in February, PDS Health®, a leading integrated healthcare support organization, raises awareness about why visits...",
    "image": "https://mma.prnewswire.com/media/2708873/pds_health_Logo.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "Carney Increases E.V. Investments as Trump’s Trade Policy Disrupts Canada’s Auto Industry",
    "desc": "Prime Minister Mark Carney announced several measures Thursday aimed at making Canada a global leader in electric vehicles and rescuing an industry ravaged by U.S. trade policy.",
    "image": "https://static01.nyt.com/images/2026/02/05/multimedia/05canada-autos-lzpm/05canada-autos-lzpm-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "February 6, 2026: Daily Predictions for All Zodiac Signs",
    "desc": "Check today’s horoscope for February 6, 2026. Find out what the stars have in store for Aries, Taurus, Gemini, Cancer, Leo, Virgo, Libra, Scorpio, Sagittarius, Capricorn, Aquarius and Pisces.",
    "image": "https://media.assettype.com/deccanherald%2F2026-02-05%2F039r0kh1%2FiStock-2224854506.jpg?rect=0%2C0%2C3868%2C2031&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop",
    "source": "Deccan Herald"
  },
  {
    "title": "Thousands of buildings checked after corrupt registration schemes exposed",
    "desc": "Builders convicted of involvement in construction licensing scams are being banned from the industry as thousands of properties are checked for faults and safety concerns.",
    "image": "https://static.ffx.io/images/$zoom_0.1426%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_110/t_crop_custom/q_86%2Cf_auto/f42ed8a58f1270ca3ba1192f772bbccdc2c6a0d6",
    "source": "The Age"
  },
  {
    "title": "Locals rally to keep goats grazing in Ringwood",
    "desc": "After goats were introduced along Mullum Mullum Creek last year to manage weed-infested bushland, Maroondah Council plans to call time on the initiative.",
    "image": "https://static.ffx.io/images/$zoom_0.19353070175438597%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/q_86%2Cf_auto/a0ba342ab0c482883cdc75c2bbfecd054d196685",
    "source": "The Age"
  },
  {
    "title": "Today in history, February 6: The Manchester United team that perished in the Munich air disaster of 1958",
    "desc": "On a snowy February afternoon in 1958, the football team that many were calling the greatest that Britain had ever produced stopped to refuel at Munich Airport. The plane would never take off, and the Flowers of Manchester would take years to bloom again.",
    "image": "https://live-production.wcms.abc-cdn.net.au/a140fa6335f44bd807c393efbccda476?impolicy=wcms_watermark_news&cropH=1890&cropW=3360&xPos=0&yPos=175&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  }
]