[
  {
    "title": "Randy Abbey is going nowhere - NEIP boss defends COCOBOD CEO amid NPP calls for dismissal",
    "desc": "The Chief Executive Officer (CEO) of the National Entrepreneurship and Innovation Programme (NEIP), Eric Adjei, has strongly rejected demands by the opposition New Patriotic Party (NPP) Minority for the removal of Ghana Cocoa Board (COCOBOD) CEO,...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/949/94979150.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Africa’s trade blocs were designed to unite the continent: four reasons they haven’t delivered",
    "desc": "Africa’s leaders must urgently rationalise the mission of regional integration and ensure that common political values underpin its ambitions.",
    "image": "https://images.theconversation.com/files/716801/original/file-20260206-56-2xt97v.jpg?ixlib=rb-4.1.0&rect=0%2C333%2C3999%2C1999&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "Box office bust? The show may be over for another Hong Kong cinema",
    "desc": "IFC Mall is reportedly looking at the big picture as it explores potential tenants to replace upscale movie theatre Palace IFC",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/15/3770275.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Geldermans Maintains 24/7 Support Services to Assist Clients",
    "desc": "Bristol, United Kingdom , Feb. 15, 2026 (GLOBE NEWSWIRE) -- Geldermans.com is a financial services company that provides full support and administrative solutions for individuals and organizations seeking steady and clear financial operations. The company continues to place strong attention on access to help, keeping assistance services available at all hours of the day and throughout the week. This constant availability reflects a wider effort to ensure that questions linked to accounts, records, and general use of financial services can be addressed without delay, regardless of time or location.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/15/938580.png",
    "source": "The Manila Times"
  },
  {
    "title": "T20 World Cup 2026",
    "desc": "West Indies captain Shai Hope wins toss, chooses to bowl against Nepal in T20 World Cup 2026 match.",
    "image": "https://th-i.thgim.com/public/incoming/qhiugc/article70634782.ece/alternates/LANDSCAPE_1200/Nepal_West_Indies_T20_WCup_Cricket_30394.jpg",
    "source": "The Hindu"
  },
  {
    "title": "‘She chose to marry someone else’: WhatsApp text, 15-year relationship and more; chilling details in Noida’s Valentine’s Day car murder",
    "desc": ": A WhatsApp message purportedly typed by Sumit hours before he was found dead alongside his girlfriend has emerged as a key element in the probe into Noida’s Valentine’s Day deaths, even as grieving family members allege the couple may have been murdered.\nThe bodies of Sumit (32), a resident of Trilokpuri in Delhi, and Rekha (26), from Sector 101 in Noida, were discovered on Saturday with gunshot wounds inside a locked car near Sector 107. Police said a pistol was recovered from Sumit’s hand, and preliminary assessment points towards a possible suicide.\nInvestigators are examining a WhatsApp text allegedly typed by Sumit at 3.39pm on Friday. In the message, he reportedly wrote that the two had been in a relationship for 15 years and had planned to marry.\nHowever, he claimed Rekha had recently decided to wed someone else, a development he linked to taking an extreme step. It remains unclear whether the message was sent to anyone or saved as a draft.\nSumit’s relatives questioned the suicide theory, alleging the couple had faced caste-based hostility and threats. “We believe both were murdered and were victims of casteism,” a cousin said. Family members stated that Sumit and Rekha had been together for over a decade, that both families were aware of the relationship, and that Rekha had attended several family functions. They also claimed the man’s family had received threatening calls, including from international numbers.",
    "image": "https://static.toiimg.com/thumb/msid-128372742,width-1280,height-720,imgsize-2075704,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Pakistan takes on India in marquee game at T20 World Cup. Unbeaten West Indies fields against Nepal",
    "desc": "India and Pakistan meet at the T20 World Cup in Colombo, with tension high and uncertainty aplenty still surrounding world cricket’s marquee matchup",
    "image": "https://a57.foxsports.com/statics.foxsports.com/static/orion/images/defaults/1408/814/story-card.jpg?ve=1&tl=1",
    "source": "FOX Sports"
  },
  {
    "title": "Salceda: Marcos admin assembling most comprehensive industrial policy toolkit",
    "desc": "Joey Salceda praises the Marcos industrial policy toolkit as the most comprehensive to date, highlighting CREATE MORE and key foreign investments.",
    "image": "https://politiko.com.ph/wp-content/uploads/2024/07/salceda-JULY10.jpg",
    "source": "politiko.com.ph"
  },
  {
    "title": "5 artists from Southeast Asia to add to your playlist",
    "desc": "Southeast Asia is filled with rising artists to watch out for, with fun beats and impactful lyrics that are worth a listen or more.",
    "image": "https://images.gmanews.tv/webpics/2026/02/No_Na_2026_02_15_13_33_31.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Live: Wild weather warnings issued across NZ, five districts in states of emergency",
    "desc": "Five districts have now declared a state of emergency - Manawatū, Rangitīkei, Tararua, Waipā and Ōtorohanga.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--9w1CvD1Z--/t_tohu-badge-facebook/v1771131928/4JT5R6Y_metserved_jfif?_a=BACCd2AD",
    "source": "RNZ"
  }
]