[
  {
    "title": "Russian drone attack in Ukraine kills 4 family members, pregnant mother survives",
    "desc": "A Russian drone has struck a home in Ukraine's Kharkiv region in an attack that killed a father and his three small children.",
    "image": "https://dims.apnews.com/dims4/default/8497009/2147483647/strip/true/crop/2000x1333+0+84/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F23%2Fc88b62eeabb339943e32ad40355a%2F82e03c6f656c450e9933690631d44b91",
    "source": "AP News"
  },
  {
    "title": "Winter Olympics 2026: Issa Laborde - Kenya's lone ranger living his dream at Milano Cortina",
    "desc": "The Kenyan teenager, who has previously represented his country at the Winter Youth Olympic Games (YOG) Gangwon 2024, says competing in Milano Cortina is the ultimate experience: \"I hope it's the beginning of something bigger for all the African nations\"",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/sls6bgcjmas4hrm9qwon",
    "source": "olympics.com"
  },
  {
    "title": "NACOC to begin licensing for medicinal, industrial cannabis cultivation",
    "desc": "The Narcotics Control Commission (NACOC) has announced that it will soon begin issuing licences for the cultivation of cannabis strictly for medicinal and industrial purposes in Ghana.",
    "image": "https://ghanaiantimes.com.gh/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-11-at-14.48.15.jpeg",
    "source": "Ghanaian Times"
  },
  {
    "title": "Prasad overruled FDA staff to reject Moderna flu vaccine application",
    "desc": "The rejection of Moderna's flu shot application is the latest example of Vinay Prasad overruling career FDA scientists to place vaccines under harsher scrutiny.",
    "image": "https://www.statnews.com/wp-content/uploads/2025/05/20250523_Prasad_Vinay_3200x2133_Flag-1024x576.jpg",
    "source": "statnews.com"
  },
  {
    "title": "Iran’s president denies it seeks nuclear weapon and admits ‘shame’ after mass protests",
    "desc": "Masoud Pezeshkian tries to convey message of national unity as negotiations with US hang in balance",
    "image": "https://i.guim.co.uk/img/media/2245ccbbacd71fa8a9325881d91974e01faef80d/1093_52_4027_3221/master/4027.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5e65ca9651de6461f0f0b731c5f2c949",
    "source": "The Guardian"
  },
  {
    "title": "The Pogues announce death of drummer Andrew Ranken",
    "desc": "The Pogues have announced the death of their drummer Andrew Ranken, aged 72, with \"deep sadness\".",
    "image": "https://www.rte.ie/images/0023e127-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Ghana risks dropping to top 10 most expensive countries for air passenger charges",
    "desc": "Speaking at the 5th AviationGhana Breakfast Meeting, Stellamarie Ndunge of the Board of Airline Representatives, Ghana (BAR-GH), said the new levy would make air travel less attractive and further constrain route expansion by airlines operating in and out of the country.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Airport-500x356-1.webp",
    "source": "MyJoyOnline"
  },
  {
    "title": "Pam Bondi testifies before House Judiciary Committee : NPR",
    "desc": "The attorney general's appearance before the House Judiciary Committee comes one year into her tenure, a period marked by a striking departure from traditions and norms at the Justice Department.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/8192x4608+0+428/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F92%2F1a%2F1804d3034b76b2812d099a4b4348%2Fgettyimages-2261073042.jpg",
    "source": "NPR"
  },
  {
    "title": "RBI looks to ban sales incentive to bank staffers from third party",
    "desc": "RBI proposes banning incentives to bank staff from third parties, mandates refunds for mis-selling and bars use of dark patterns in marketing financial products",
    "image": "https://bsmedia.business-standard.com/_media/bs/img/article/2026-01/20/thumb/fitandfill/1200X630/1768876840-6284.jpg",
    "source": "Business Standard"
  },
  {
    "title": "Cyclone Gezani kills at least 31 as it tears through Madagascar's port of Toamasina",
    "desc": "Madagascar's disaster management says roads are inaccessible with trees uprooted, power poles down and ninety percent of roofs ripped off.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2f9f/live/c9b26390-0777-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  }
]