[
  {
    "title": "Auckland community leader tired of telling governments how to combat youth offending",
    "desc": "A new Ministry of Justice report has shown that Pacific youngsters before the Youth Court are more likely to be remanded into custody than others.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--9uRmBtye--/t_tohu-badge-facebook/v1712524230/4KSCU7U_30_with_Guyon_Espiner_20240402_Dave_Letele_0005_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Bengaluru airport chaos: Air India Express flight with 180 passengers stuck for 18 hours; flyers protest",
    "desc": "BENGALURU: Chaos erupted at KIA after Nepal-bound passengers were stranded for over 18 hours following repeated diversions of an Air India Express fli.",
    "image": "https://static.toiimg.com/thumb/msid-128873641,width-1280,height-720,imgsize-3541286,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Luci4 Had 'Erratic Behavior' at LAX Night Before Death, Cops Tell Family",
    "desc": "Up-and-coming rapper Luci4 was found dead in an L.A. residence on Sunday ... and now we're learning more about his movements hours prior to his death.",
    "image": "https://imagez.tmz.com/image/b7/16by9/2026/02/27/b7cf7baa08864ea8a26a12b9420418d2_xl.png",
    "source": "TMZ"
  },
  {
    "title": "Powell, Heat's leading scorer, sidelined by groin injury",
    "desc": "All-Star guard Norman Powell is sidelined with a groin injury and will be re-evaluated in a week's time.",
    "image": "https://cdn.nba.com/manage/2026/02/GettyImages_normpowell.jpg",
    "source": "NBA"
  },
  {
    "title": "Rent tops £1,000 a month in more areas - find out where",
    "desc": "The cost of renting privately has surged in the last five years, but tenants may now see a slowdown.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/d595/live/ac048930-1317-11f1-9b9a-9d7ed2eef502.jpg",
    "source": "BBC"
  },
  {
    "title": "Mexico Area Presidency Invites Prayer and Fasting for Peace and Harmony",
    "desc": "The Mexico Area Presidency of The Church of Jesus Christ of Latter-day Saints has invited Church members to dedicate their fast on March 1, 2026, to peace and social harmony in Mexico.",
    "image": "https://newsroom.churchofjesuschrist.org/media/640x480/Oracion-Mujer-grande-2[1].jpeg",
    "source": "newsroom.churchofjesuschrist.org"
  },
  {
    "title": "Ballon d'Or 2026 Power Rankings: Kane Remains On Top; Haaland Back to His Best",
    "desc": "GOAL's Ballon d'Or Power Rankings continue to track the likeliest winners of the Golden Ball over the coming weeks and months.",
    "image": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2026/02/1408/814/NEW20Ballon20d_Or20Power20Rankings201.jpg?ve=1&tl=1",
    "source": "FOX Sports"
  },
  {
    "title": "Student Remains in Honduras After ICE Vows to Deport Her Again",
    "desc": "Any Lucia López Belloza was deported by mistake. A judge ordered her return by Friday. When the Trump administration sent a plane, she decided not to get on.",
    "image": "https://static01.nyt.com/images/2026/02/27/multimedia/27dc-immig-vbjq/27dc-immig-vbjq-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Federal prosecutors in Luigi Mangione case won't appeal ruling that took death penalty off the table",
    "desc": "Federal prosecutors signaled in a letter to the court Friday they would not appeal.",
    "image": "https://i.abcnewsfe.com/a/b9384790-2fdb-4f82-84cc-9569fdd965b8/luigi-mangione-1-rt-gmh-260206_1770383877392_hpMain_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Claudia Winkleman's new BBC chat show bans chavvy clothes for the audience as rules are revealed",
    "desc": "The presenter's programme will launch on screens from Friday, March 13 at 10.40pm and tickets are already on sale for a seat in the crowd.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/28/00/106743319-0-image-m-98_1772237440043.jpg",
    "source": "dailymail.co.uk"
  }
]