[
  {
    "title": "Watch: Night of horror for Philippines as devastating fire leaves thousands homeless in Bongao islet",
    "desc": "Rest of World News: A catastrophic fire destroyed more than a 1000 homes in the coastal city of Bongao in southern Philippines. The fire, which started on Tuesday night, .",
    "image": "https://static.toiimg.com/thumb/msid-127923102,width-1280,height-720,imgsize-3468716,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "5 Home Decor Trends Malaysians are obesessed with in 2026",
    "desc": "Discover the top 5 home decor trends in Malaysia for 2026, from bamboo furniture to smart lighting amd indoor grenery, these ideas will refresh your home stylishly and sustainably",
    "image": "https://media.says.com/2026/02/Untitled-design-2026-02-04T113532.832.png",
    "source": "SAYS"
  },
  {
    "title": "I quite like it: Nasser Hussain backs Bangladesh, Pakistan over World Cup boycott",
    "desc": "Nasser Hussain has lambasted the ICC and the BCCI over the ongoing uncertainty in the cricketing world. Nasser says that he quite likes the fact that the board stood up for their players.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/nasser-hussain-051848412-16x9_0.jpg?VersionId=Gzq.rPb3aA5WtiiUN6BQ.c3XZ_Vi16PZ",
    "source": "India Today"
  },
  {
    "title": "Boeing layoffs: Planemaker to cut 300 jobs from defence division, to notify affected workers this week",
    "desc": "The concerned jobs that will be eliminated are in the supply chain section of the defence division, and workers who are terminated will be notified this week, according to a new report.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/05/1600x900/logo/BOEING-LAYOFFS--0_1770261664424_1770261695876.JPG",
    "source": "Mint"
  },
  {
    "title": "Australia charges teen over online threat as Israeli president due to visit",
    "desc": "‘Mass, peaceful’ demonstration are planned across Australia to protest the visit of Israel’s President Isaac Herzog.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/2026-01-16T091453Z_105820339_RC282JARE1DH_RTRMADP_3_ISRAEL-PALESTINIANS-AUSTRALIA-1770260064_c0627a-1770260293.jpg?resize=1200%2C630&quality=80",
    "source": "Al Jazeera"
  },
  {
    "title": "Disappearance of Gus Lamont declared a major crime by South Australia Police",
    "desc": "Gus Lamont disappeared off a South Australian outback property in September. His parents are not under investigation.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--EMu79nqr--/t_tohu-badge-facebook/v1760560586/4JZGC3B_GUS3_avif?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Lim Guan Eng urges RM50m Chinese MSME loans to be managed by BSN, not SME Bank",
    "desc": "KUALA LUMPUR, Feb 5 — DAP’s Bagan MP Lim Guan Eng said Bank Simpanan Nasional (BSN) has a stronger capacity than Small Medium Enterprise Development Bank Malaysia Berhad (SME...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/05/323944.JPG",
    "source": "Malay Mail"
  },
  {
    "title": "Stock Market Today: Dow, S&P Live Updates for February 5",
    "desc": "A global rout in technology stocks snowballed into Asia as mounting anxiety over frothy valuations and massive artificial intelligence spending drove investors to trim exposure.",
    "image": "https://assets.bwbx.io/s3/lightsaber/_next/static/media/social-markets.e062a0c0.jpg",
    "source": "Bloomberg.com"
  },
  {
    "title": "Countries using internet blackouts to boost censorship: Proton",
    "desc": "As countries step up their use of internet shutdowns to muzzle dissent, some are also taking advantage of the blackouts to increase censorship firewalls, internet privacy company Proton warned in an…",
    "image": "https://s.france24.com/media/display/6f8a2bf4-0241-11f1-9f2a-005056bfb2b6/w:1280/p:16x9/0400dac6cb4ae35f07ea113381db59c86877c47b.jpg",
    "source": "France 24"
  },
  {
    "title": "Supervised Machine Learning Predictive Modeling of Survival Times of Malignant Glioma Patients",
    "desc": "Gliomas are the most cancerous tumors arising from the brain, accounting for approximately 78% of all primary brain tumors. The progression of malignant gliomas significantly reduces both survival duration and quality of life, with long-term survival achieved by fewer than 5% of patients, with a significant portion facing a grim outlook within 1.5 years, despite standard treatment. To improve survival prediction and support clinical decision-making, this study analyzes real-world data from the SEER (Surveillance, Epidemiology, and End Results) database of the National Cancer Institute (NCI). In this study, we identified a well-defined probability distribution that characterizes the survival times of patients with Malignant Glioma (3-Parameter Generalized Pareto Probability Distribution) and derived its cumulative distribution function (CDF) and survival function, providing estimates of the probability of patient survival. This information proves invaluable to healthcare professionals and the families of patients, addressing questions raised about patients, such as the patient’s survival probability given survival beyond a specified time, or the patient’s risk or intensity of death (hazard) at time t after surviving to that point. This study developed an Artificial Neural Network (ANN)-based survival analysis model, with a binary classifier predicting patient survival less than 12 months or beyond, and a multiclass model predicting survival within the first 12 months, between 12 and 24 months, or beyond 24 months. Model performance is evaluated using multiple metrics and compared with other machine learning algorithm approaches.",
    "image": "https://file.scirp.org/image/jdaip2025010716305067.png",
    "source": "SCIRP Open Access"
  }
]