[
  {
    "title": "Dewormer ivermectin as cancer cure? RFK Jr.'s NIH funds \"absurd\" study.",
    "desc": "There's no reason to think ivermectin cures cancer, but RFK Jr's NIH is on it anyway.",
    "image": "https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-1232983095-1152x648.jpeg",
    "source": "Ars Technica"
  },
  {
    "title": "Operations halted as EALA MPs go three months without pay",
    "desc": "Operations at the East Africa Legislative Assembly, EALA, have been disrupted after member states delayed fund remittances, leaving MPs and staff unpaid for the past three months.",
    "image": "https://citizentv.obs.af-south-1.myhuaweicloud.com/134257/conversions/money-og_image.webp",
    "source": "Citizen Digital"
  },
  {
    "title": "Mohamed Salah's Saudi transfer saga begins! Liverpool star in talks with Pro League giants over summer move after shift in stance",
    "desc": "Mohamed Salah is reportedly in talks with Saudi Pro League giants Al-Ittihad over a potential move in the summer transfer window. The Egyptian has been a long-term target for Saudi Arabian clubs since the Public Investment Fund first started pouring cash into the country's top league and Salah, who has endured a tetchy and difficult season at Liverpool, is wanted as their next marquee signing this year.",
    "image": "https://assets.goal.com/images/v3/getty-2258735031/crop/MM5DIMZWGM5DENBVGQ5G433XMU5DAORRG44A====/GettyImages-2258735031.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Sharge’s new power bank can charge two laptops while putting on a light show",
    "desc": "Sharge’s new Shargeek 300 power bank can charge up to four devices simultaneously including a pair of power-hungry laptops.",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/shargeek300_1.jpg?quality=90&strip=all&crop=0%2C10.706541858374%2C100%2C78.586916283251&w=1200",
    "source": "theverge.com"
  },
  {
    "title": "Malinowski concedes to Mejia in House Democratic primary in New Jersey : NPR",
    "desc": "With the race still too close to call, former congressman Tom Malinowski conceded to challenger Analilia Mejia in a Democratic primary to replace the seat vacated by New Jersey Gov. Mikie Sherrill.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/6000x3375+0+313/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F87%2F57%2F787675934b92ab77a20bbf05fe8c%2Fgettyimages-1483339837-1.jpg",
    "source": "NPR"
  },
  {
    "title": "Canadian pairs team Stellato-Dudek, Deschamps will compete at Olympics",
    "desc": "Canadian pairs team Deanna Stellato-Dudek and Maxime Deschamps will get their chance at Olympic glory after all. The pair will leave Montreal on Wednesday and arrive in Milan on Thursday after Stellato-Dudek was cleared to compete, Skate Canada announced Tuesday.",
    "image": "https://i.cbc.ca/ais/a57982d0-202f-4721-a4f4-77e69b678d8a,1770739048901/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C327%2C6476%2C3642%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Scheme to compensate Stardust survivors 'disappointing'",
    "desc": "A solicitor acting for survivors of the Stardust fire has called a scheme to compensate them a \"very disappointing development\".",
    "image": "https://www.rte.ie/images/00043b76-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Earth's core may contain as much as 45 oceans' worth of hydrogen, scientists find",
    "desc": "Picture all of Earth's oceans, which cover about 70% of the planet and are mostly made of hydrogen. Now multiply that by nine. That may be the amount of hydrogen in Earth's core.",
    "image": "https://img.ksl.com/slc/3143/314396/31439664.jpg?filter=kslv2/responsive_story_lg",
    "source": "KSL News"
  },
  {
    "title": "'Victim of unspeakable cruelty and deliberate evil': Coroner's findings on Malachi Subecz death",
    "desc": "Everything possible went wrong for 5-year-old in the last six months of his life, as he was tortured, and no one noticed.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--i58nEDhL--/t_tohu-badge-facebook/v1651018736/4LSO74H_malachi_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Ashley Farquharson wins bronze for second-ever U.S. Olympic medal in women’s luge",
    "desc": "Farquharson sealed the bronze medal with a strong fourth run, earning just the seventh U.S. Olympic luge medal ever, men or women.",
    "image": "https://static01.nyt.com/athletic/uploads/wp/2026/02/10131957/GettyImages-2260926906-scaled.jpg?width=1200&height=630&fit=cover",
    "source": "The New York Times"
  }
]