[
  {
    "title": "Our Royal Patron attends special dinner event in support of young autistic people",
    "desc": "We were delighted to welcome our Royal Patron, HRH The Duchess of Edinburgh, at a dinner event entitled ‘Inclusive Futures: Education, Employment, and Autism’.",
    "image": "https://s4.chorus-mk.thirdlight.com/file/24/dOqrfbUdOmmeh3ldO-bfdO6sI78/width=280/height=280/format=PNG/fit=stretch/crop=0x0+600x600/rev=0/baseRev=1/NAS-square-symbol-600x600-with-text.png",
    "source": "National Autistic Society"
  },
  {
    "title": "PS3 emulator RPCS3 nears milestone with most PlayStation 3 games now at least 'Ingame'",
    "desc": "The developers behind the PlayStation 3 emulator RPCS3 have shared a new compatibility update. This emulation software is now closer than ever to getting all PS3 games not only to boot but also to get past the menus.",
    "image": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc5/PS3-emulator-RPCS3-nears-milestone-as-more-PlayStation-3-games-reach-at-least-Ingame.jpg",
    "source": "Notebookcheck"
  },
  {
    "title": "Economists vs. Environmentalists: Why Their Views Matter",
    "desc": "Imagine someone has chronic pain. One doctor focuses on the body part that hurts and keeps trying to fix that single symptom. Another uses a more",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1526256262350-7da7584cf5eb%3Fixid%3DMXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%253D%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1350%26amp%3Bq%3D80",
    "source": "Mirage News"
  },
  {
    "title": "DOST ready to assist in talks, plans for nuclear power plant initiatives",
    "desc": "DAGUPAN CITY, PANGASINAN – The Department of Science and Technology (DOST) on Monday said it is ready to assist in any discussions on tapping nuclear energy in the country.",
    "image": "https://images.gmanews.tv/webpics/2018/05/Bataan_Nuclear_Power_Plant_2018_05_23_07_11_39.JPG",
    "source": "GMA Network"
  },
  {
    "title": "Manchester United: Sir Jim Ratcliffe immigration fallout analysed",
    "desc": "Sports editor Dan Roan analyses the potential fallout of Manchester United co-owner Sir Jim Ratcliffe's comments on immigration.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/68f2/live/b3edb120-0b34-11f1-89e7-89779f9c687a.jpg",
    "source": "BBC"
  },
  {
    "title": "Trailer driver to cover GH¢2.5m North Dzorwulu footbridge repairs",
    "desc": "The Ministry of Roads and Highways has disclosed that the trailer driver responsible for crashing into the North Dzorwulu Pedestrian Footbridge will fully",
    "image": "https://citinewsroom.com/wp-content/uploads/2026/02/hjukiyhhh.jpg",
    "source": "CitiNewsroom.com"
  },
  {
    "title": "US immigration lawyer shares tips on protecting Filipinos’ rights vs ICE",
    "desc": "Amid the ongoing crackdown by the administration of US President Donald Trump on undocumented immigrants, a US-based immigration lawyer on Monday offered advice to Filipinos on how to protect their rights when dealing with agents of US Immigration and Customs Enforcement (ICE).",
    "image": "https://images.gmanews.tv/webpics/2026/02/GURFINKEL_2026_02_16_20_49_32.png",
    "source": "GMA Network"
  },
  {
    "title": "I replaced Windows with Linux, and there's only one feature I miss",
    "desc": "Switching from Windows to Linux is easy, they say. But here's what they don't tell you.",
    "image": "https://www.zdnet.com/a/img/resize/b3df4c0ec0dedc7a8ebfb153d1efcf0e649b6b15/2026/02/16/f1b0820e-8e0b-47cd-985c-ec8cccc0d7ba/gettyimages-2168524456.jpg?auto=webp&fit=crop&height=675&width=1200",
    "source": "ZDNET"
  },
  {
    "title": "Canada set to face Switzerland in women’s hockey semifinal at 3pm ET on TSN",
    "desc": "Canada’s women’s hockey team will take on Switzerland on Monday, looking to set up an eighth straight trip to the Olympic final, dating back to when the event was introduced at Nagano 1998.",
    "image": "https://www.tsn.ca/resizer/v2/KPQ47Q6VFWQH2U6EFVM2BUIHGM.jpg?smart=true&auth=afb3295bd7a3eac2f6ebd1b2d26bb2f1c88e2e745de9834d1636b766cbb07ef0&width=1200&height=630",
    "source": "TSN"
  },
  {
    "title": "SEC warns public against unlicensed Mekanism Investment Scheme",
    "desc": "The Securities and Exchange Commission (SEC) has warned the investing public against engaging with an unlicensed investment scheme being promoted by Mekanism",
    "image": "https://citinewsroom.com/wp-content/uploads/2026/02/amnn.webp",
    "source": "CitiNewsroom.com"
  }
]