[
  {
    "title": "Pension Fund Eyes Securities Exchange In Bid To Exercise New Investment Clause",
    "desc": "The government agency in charge of administering the pensions of private sector employees is eyeing investment in the securities exchange as attempts to gain",
    "image": "https://www.thereporterethiopia.com/wp-content/uploads/2026/02/Pension-Fund-Eyes-Securities-Exchange.jpg",
    "source": "thereporterethiopia.com"
  },
  {
    "title": "Photothermal therapy offers an alternative to traditional cancer therapies",
    "desc": "Original story from NYU Abu Dhabi New light-based nanotechnology could enable more precise, less harmful cancer treatment. Researchers at NYU Abu Dhabi have developed a new light-based nanotechnology that could improve how certain cancers are detected and treated, offering a more precise and potentially less harmful alternative to chemotherapy, radiation, and surgery. The findings were […]",
    "image": "https://www.oncology-central.com/wp-content/uploads/2025/12/Feature-image-1-4.png",
    "source": "Oncology Central"
  },
  {
    "title": "Wait for IIUM study on KL mayoral elections, urges Nga",
    "desc": "The housing and local government minister calls for patience, says the Cabinet will decide on the best approach based on the study.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/08/f8e904a4-nga-kor-ming-akta-psb-pc-1.webp",
    "source": "freemalaysiatoday.com"
  },
  {
    "title": "Fresh flying of flags in Moseley leaves community divided",
    "desc": "Those against them in Moseley say they cause division, while others say it is about national pride.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1f91/live/62e608b0-036c-11f1-bab5-81d0d0b0abce.png",
    "source": "BBC"
  },
  {
    "title": "RM2.4mil foreign currency smuggling bid foiled at KLIA",
    "desc": "PETALING JAYA: An attempt by a foreign man to smuggle foreign currencies worth RM2.4mil was foiled when he was arrested by the Malaysian Border Control and Protection Agency (AKPS) at Kuala Lumpur International Airport (KLIA), following an inspection operation at the Terminal 1 arrival hall on Friday (Feb 6).",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/07/3759091.jpeg",
    "source": "The Star"
  },
  {
    "title": "US plans Board of Peace meeting on Feb. 19 to fundraise for Gaza reconstruction",
    "desc": "Diplomats say 26 countries invited to meeting, overlapping with Netanyahu's Washington visit; doubts persist over Hamas disarmament, Israeli withdrawal and Gaza postwar governance",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/01/AFP__20260122__93M42TP__v1__HighRes__SwitzerlandUsPoliticsEconomyDiplomacy.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Hit first, ask questions later: India's new-age batting faces its T20 World Cup test",
    "desc": "Cricket News: There was a time when India entered T20 World Cups carrying a quiet anxiety. Should it continue to attack through the middle overs if the Powerplay do.",
    "image": "https://static.toiimg.com/thumb/msid-128024959,width-1280,height-720,imgsize-59724,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "When Customer Care Fails, Business Reputation Suffers",
    "desc": "IN TODAY’S HIGHLY competitive business environment, customer care is no longer a soft skill, it is a strategic imperative. Like many countries around the world, Namibia […]",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/poor-customer-service1.jpg",
    "source": "The Namibian -"
  },
  {
    "title": "Namibia trade gap shrinks to N$393m in December",
    "desc": "NAMIBIA exported goods worth N$10.7 billion and imported N$11.1 billion worth of goods in December last year, incurring an improved trade deficit of N$393 million for […]",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2025-02-04-at-12.32.51-PM.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "Spotify makes changes to developer mode: How it affects you?",
    "desc": "Spotify is altering its Developer Mode APIs, necessitating a premium account and reducing the number of test users and API endpoints.",
    "image": "https://i.cdn.newsbytesapp.com/images/l69520260207115534.jpeg",
    "source": "NewsBytes"
  }
]