[
  {
    "title": "Indonesia faces scrutiny over permit revocations following deadly floods and landslides",
    "desc": "Environmental science and conservation news",
    "image": "https://imgs.mongabay.com/wp-content/uploads/sites/20/2025/12/18164313/Permukiman-hancur-akibat-banjir6-2048x1366-2.jpg",
    "source": "Mongabay"
  },
  {
    "title": "Urban Vs Rural: Decoding India’s Women’s Mental Health Gap",
    "desc": "India’s mental health conversation is growing louder, but not evenly. While urban centres have made progress in normalising conversations around therapy and diagnosis, similar distress in rural communities often presents as physical complaints or remains unspoken altogether. The difference is rarely in the level of suffering, but in how effectively it is identified.This uneven recognition has structural roots. In many rural settings, primary healthcare systems lack the training and bandwidth to identify psychological distress, especially when it appears as fatigue, pain, or sleep disturbances. Without adequate screening or mental health literacy at the community level, women’s emotional strain is often treated symptom by symptom rather than addressed holistically, leaving much of it unseen.The invisible diagnostic divideIn urban settings, women are more likely to have psychological symptoms identified and diagnosed. Emotional exhaustion, anxiety, sleep disturbances, and persistent low mood are increasingly recognised as indicators of mental health conditions rather than dismissed as personal weakness. This recognition enables timely clinical intervention, allowing women to access therapy, psychiatric care, and structured support.In rural settings, however, distress often follows a different path. Women frequently present with physical symptoms such as chronic fatigue, body pain, headaches, digestive discomfort, or menstrual irregularities as seen during our screening in collaboration with local district hospital. These symptoms are real and distressing, but their psychological origins may remain unexamined. Emotional suffering is expressed through the body, particularly in communities where mental health vocabulary is limited and stigma discourages open discussion.Large-scale community screening efforts conducted across multiple districts in Maharashtra under project Samvedana illustrate this gap. Over 170,000 individuals were assessed through decentralised outreach, yet only about 2 per cent were formally identified as being at risk for mental health conditions. This figure does not reflect the lower prevalence of distress. Instead, it highlights how easily mental health conditions can remain undetected when diagnostic systems rely heavily on verbal expression of psychological symptoms.Frontline healthcare providers often manage overwhelming patient loads and prioritise visible physical illness. Without specialised training in mental health identification, underlying depression, anxiety, or trauma may remain unrecognised. This represents a systemic limitation rather than individual oversight.Women’s vulnerability across biological and social transitionsWomen’s mental health is shaped by an interplay of biological and psychosocial factors across the lifespan. Hormonal transitions during puberty, pregnancy, the postpartum period, and menopause are associated with changes in mood regulation and stress response. Clinical evidence shows that these phases can increase vulnerability to depressive and anxiety disorders. The World Health Organisation estimates that nearly one in five women in low- and middle-income countries experience depression during pregnancy or after childbirth. Yet emotional symptoms during these stages are often interpreted as expected changes, particularly in non-urban settings, delaying timely identification and care.Beyond biology, social determinants further influence outcomes. Financial dependency, caregiving demands, restricted mobility, and chronic stress contribute cumulatively to psychological strain. For many women, this gap reflects not only service availability but also early recognition within existing healthcare systems.Field observations by Mpower suggest that when awareness improves, engagement follows. Community-based screening across districts has reached more than 367,000 individuals. Women consistently account for nearly two-thirds of those screened. Nearly 38 per cent of individuals identified as requiring care follow through with referrals when pathways are clearly explained and barriers are reduced.These findings indicate that willingness to seek support is present. Variability in awareness, access, and diagnostic sensitivity plays a more decisive role in shaping care outcomes.Recognition is the foundation of equitable careBridging India’s women’s mental health gap requires strengthening detection at the primary healthcare level. The World Health Organisation has emphasised integrating mental health screening into routine healthcare services, particularly maternal and community care. Training frontline providers to recognise psychological distress, including when it presents through physical symptoms, is essential to improving early identification.Improving mental health literacy within communities is equally important. When emotional distress is understood as a health concern rather than a personal failing, women are more likely to seek timely support.India’s mental health progress will depend not only on expanding services but on strengthening early identification across healthcare settings. Integrating routine mental health screening into primary care and equipping frontline providers to recognise psychological distress can reduce gaps in detection. When communities understand emotional distress as a legitimate health concern, recognition improves and access to care follows.",
    "image": "https://static.businessworld.in/1607595062_l6mRMz_Mental_Health.jpg",
    "source": "BW Healthcare"
  },
  {
    "title": "OpenAI CEO Sam Altman calls out tech companies for mass layoffs; says: Can't blame everything on...",
    "desc": "Tech News News: OpenAI CEO Sam Altman has called out a growing corporate trend of blaming artificial intelligence for layoffs that have little to do with the technolo.",
    "image": "https://static.toiimg.com/thumb/msid-128590154,width-1280,height-720,imgsize-622536,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Pangasinan vote recount controversy could impact national polls, Primicias-Agabas warns",
    "desc": "House Deputy Majority Leader Pangasinan 6th district Rep. Marlyn Primicias-Agabas is calling for an inquiry on a regional trial court (RTC) ruling saying the...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/20/80638.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Mohammad Amir Says India Won't Qualify For T20 World Cup Semifinals. Explains Why",
    "desc": "After calling Abhishek Sharma a 'slogger', ex-Pakistan cricketer Mohammad Amir has fired a warning to the Indian team.",
    "image": "https://c.ndtvimg.com/2026-02/2ufc9cac_mohammad-amir-afp_625x300_20_February_26.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
    "source": "NDTV Sports"
  },
  {
    "title": "Hypoxia rewires red blood cells to clear excess glucose",
    "desc": "In a 2023 paper on hypoxia and glucose metabolism, our lab showed how organisms rewire their metabolism to adapt to low oxygen levels-such as those found at high altitudes.",
    "image": "https://www.news-medical.net/image-handler/picture/2016/5/3d_rendered_illustration_of_human_red_blood_cells-Sebastian_Kaulitzki-2000_0cda0d0f3cb64b54bebc8de4486ae6a5-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Enat Party is returning to “coalition for Ethiopian Unity”",
    "desc": "Enat Party announced that it is returning to the “coalition for Ethiopian Unity”  after months of NEBE imposed restriction. Read more.",
    "image": "https://borkena.com/wp-content/uploads/2026/02/Enat-party.webp",
    "source": "Borkena"
  },
  {
    "title": "Ethiopia's Ruling Party Central Committee Meeting Ahead of National Election",
    "desc": "Ethiopia's ruling party announced that its central committee is holding a meeting ahead of Ethiopia's National Election. Read more.",
    "image": "https://borkena.com/wp-content/uploads/2026/02/Prosperity-Party-_-Ethiopian-News.jpg",
    "source": "Borkena"
  },
  {
    "title": "'I'm two years sober and still don't have my child full-time' - Nikki Hayes",
    "desc": "The former 2FM presenter had an alcohol addiction and was living on the streets of Dublin two years ago",
    "image": "https://i2-prod.irishmirror.ie/article33839002.ece/ALTERNATES/s1200/0_JS347742931.jpg",
    "source": "Irish Mirror"
  },
  {
    "title": "Rigathi Gachagua, Wife Celebrate Son’s Birthday with Feast",
    "desc": "Form second family celebrates Dr Keith's birthday at Carnivore Simba Salon, Nairobi. A memorable evening filled with family love, nostalgia, and delicious cuisine.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/2f0e9e4ba8dde0ed.jpeg?v=1",
    "source": "Tuko News"
  }
]