[
  {
    "title": "PPP targets improved social services",
    "desc": "DODOMA: THE government is strengthening partnerships with financial institutions to improve the delivery of key social services within Local Government Authorities (LGAs), following talks between the Office of the Prime Minister–Regional Administration and Local Government (PMO- RALG) and Azania Bank. Minister of State in the PMO- RALG, Professor Riziki Shemdoe, made the remarks after holding",
    "image": "https://dailynews.co.tz/wp-content/uploads/2023/01/23940084.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Sean Diao - I’m Much Funnier Since My Dad Is Dead at Terrarium Bar",
    "desc": "Sean Diao – I’m Much Funnier Since My Dad Is Dead at Terrarium Bar Friday, January 30, 2026  Sean Diao opened [...]",
    "image": "https://xpressmag.com.au/wp-content/uploads/2026/01/Sean-Diao-2026-1024x576.jpg",
    "source": "X-Press Magazine"
  },
  {
    "title": "UK snow bomb brought forward by 48 hours and will hit sooner than expected",
    "desc": "WX Charts weather maps and charts, projected using Met Desk data, show snow will impact many areas of the country",
    "image": "https://i2-prod.birminghammail.co.uk/article33394122.ece/ALTERNATES/s1200/0_snow.jpg",
    "source": "Birmingham Live"
  },
  {
    "title": "AI-enabled CCTV trial ongoing at 14 construction sites in Singapore",
    "desc": "Singapore recorded 36 workplace deaths in 2025, said MOM on Feb 10. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/61e9faaaddb6217041eeebd10198e57849c5154cf0ffc1ecc5c3c34714696689",
    "source": "The Straits Times"
  },
  {
    "title": "How to Setup Openclaw on MacBook Pro M5 in a Virtual Environment",
    "desc": "I recently picked up a MacBook Pro M5 with the 10-core chip and 16GB of unified memory. Like a lot of people right now, I wanted to experiment with OpenClaw",
    "image": "https://www.gadgetpilipinas.net/wp-content/uploads/2026/02/Openclaw-Running-on-VM-on-MacBook-Pro-M5-Openclaw-15.png",
    "source": "Gadget Pilipinas"
  },
  {
    "title": "Roaming livestock threaten environment, says Dodoma RC",
    "desc": "DODOMA: DODOMA Regional Commissioner Rosemary Senyamule has called for strict enforcement of by-laws banning roaming and street grazing of livestock, saying the practice significantly contributes to environmental degradation, including the destruction of newly planted trees. Ms Senyamule made the remarks over the weekend during the launch of a treeplanting campaign in Iyumbu Ward, Dodoma City,",
    "image": "https://dailynews.co.tz/wp-content/uploads/2025/12/Livestock-farming.webp",
    "source": "dailynews.co.tz"
  },
  {
    "title": "‘No progress’ in SA’s battle against graft, warns new survey",
    "desc": "Corruption Watch warned on Tuesday that South Africa has shown little to no progress in addressing graft, as it released the latest Corruption Percept",
    "image": "https://turntable.kagiso.io/images/Brown_envelope.width-400.png",
    "source": "Jacaranda FM"
  },
  {
    "title": "Matiang'i to open Jubilee party offices in Nakuru",
    "desc": "Matiang'i is seeking to bolster his party's popularity ahead of next year's general election",
    "image": "https://cdn.radioafrica.digital/image/2026/02/d482115d-aa26-4b98-865b-689a3e9c3c6c.jpg?1770721509920",
    "source": "the-star.co.ke"
  },
  {
    "title": "Matiang'i to open Jubilee party offices in Nakuru",
    "desc": "Matiang'i is seeking to bolster his party's popularity ahead of next year's general election",
    "image": "https://cdn.radioafrica.digital/image/2026/02/d482115d-aa26-4b98-865b-689a3e9c3c6c.jpg?1770711015757",
    "source": "the-star.co.ke"
  },
  {
    "title": "Blues target seventh straight home",
    "desc": "Get ready for Chelsea vs Leeds at Stamford Bridge. Chelsea aims for a seventh straight home win over their old rivals in a crucial Premier League clash.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2021/09/01212828/Chelsea-Logo-2.jpg",
    "source": "Punch Newspapers"
  }
]