[
  {
    "title": "WRKS Games Releases Open Gaming License for Katana-Ra IP",
    "desc": "Press releases and assets from across the games industry - screenshots, videos, logos, packshots, artwork, PR contacts, release dates",
    "image": "https://www.gamespress.com/Content/Themes/Games Press/img/favicon.ico",
    "source": "Games Press"
  },
  {
    "title": "Meghan Markle Embraces Old Hollywood Glamour To Go Solo at the Fifteen Percent Pledge Gala",
    "desc": "For the fifth annual gala promoting Black business and celebrating the start of Black History Month, Meghan Markle matched the glitzy vibe.",
    "image": "https://assets.vogue.com/photos/698867b0c61d5d51df917753/16:9/w_1280,c_limit/2259906717",
    "source": "Vogue"
  },
  {
    "title": "Max Cleworth: Wrexham's last National League survivor as Hollywood watches on",
    "desc": "Max Cleworth becomes the club's leading appearance-maker during Phil Parkinson's tenure in Wrexham's defeat against Millwall.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/25df/live/bff6d7f0-02a9-11f1-83b0-21555a6f44a1.jpg",
    "source": "BBC"
  },
  {
    "title": "2 UK value stocks trading at 10-year lows to consider buying in an ISA",
    "desc": "Harvey Jones looks at twp troubled FTSE 100 value stocks that are starting to stabilise and show signs of recovery. Is this a good time to consider them?",
    "image": "https://www.fool.co.uk/wp-content/uploads/2024/07/Portfolio-refresh-1200x800.jpg",
    "source": "Fool UK"
  },
  {
    "title": "Horrific crash ends Vonn’s Olympic dream nine days after rupturing ACL",
    "desc": "American skier Lindsey Vonn was airlifted off the slopes in Cortina after a horrific crash in Sunday’s downhill skiing.",
    "image": "https://static.ffx.io/images/$zoom_2.1222%2C$multiply_0.5%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/d845a802bb701e15b296e39ec62b183227477277a04c4a58191b0d596d33064e",
    "source": "smh.com.au"
  },
  {
    "title": "IDF's Unit 8200 failed son who died in prison, mother says",
    "desc": "\"There was a huge mess and oversight with the medications that nobody noticed,\" Eiges said. \"He had a million pills, and everyone kept giving him more and more.\"",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/705301",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Memorial for Swiss bar fire victims goes on fire",
    "desc": "A memorial for the victims of the deadly New Year's fire in Switzerland itself caught fire early today, police said, adding they were investigating what sparked the blaze.",
    "image": "https://www.rte.ie/images/0023dcfa-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Meghan Markle gives old Hollywood vibes in new photos at glitzy event",
    "desc": "Meghan Markle never lets her fans down with her fashion statements, as she recently slipped into an outfit that gives off an old-Hollywood vibe.It was for an event at Paramount Studios in Los...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-08/1391506_041401_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "Lindsey Vonn's Olympic medal hopes dashed after just 13 seconds",
    "desc": "Lindsey Vonn's pursuit of an against-all-odds Olympic medal ended Sunday in a devastating crash only 13.4 seconds into the downhill final.",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-02/260207-Lindsey-Vonn-ch-1317-976ca8.jpg",
    "source": "NBC News"
  },
  {
    "title": "The Ultimate Guide to Davao City Chinatown: Exploring the Largest Cultural Heritage District in the Philippines",
    "desc": "Explore the Philippines' largest Chinatown in Davao City, featuring iconic archways, vibrant night markets, and modern cultural tourism developments.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/Chinatown.jpg",
    "source": "Travel And Tour World"
  }
]