[
  {
    "title": "What Time Does ‘Bridgerton’ Season 4, Part 1 Come Out On Netflix?",
    "desc": "“Bridgerton” Season 4 is almost here, with Benedict’s love story taking center stage. Here’s what time the new season drops, how to watch and everything to know.",
    "image": "https://imageio.forbes.com/specials-images/imageserve/6978ec7e05ccd93d150db5e0/0x0.jpg?format=jpg&crop=1483,834,x630,y0,safe&height=900&width=1600&fit=bounds",
    "source": "Forbes"
  },
  {
    "title": "Global Tyre brand, Radar Tyres Secures Strategic Multi-Year Partnership with Cricket South Africa as their Global Partner",
    "desc": "/PRNewswire/ -- Radar Tyres is proud to announce that it has signed a strategic multi-year partnership with Cricket South Africa (CSA), becoming the Global...",
    "image": "https://mma.prnewswire.com/media/2871809/Pres_Con_Jersey_reveal_1.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "Investing in nature could yield 8 dollars for every dollar in climate adaptation, GCA report shows",
    "desc": "A Global Center on Adaptation report finds well-designed nature-based climate solutions can deliver up to eight dollars in benefits per dollar spent, but remain...",
    "image": "https://publish.eastleighvoice.co.ke/mugera_lock/uploads/2026/01/Climate-change.jpg",
    "source": "The Eastleigh Voice"
  },
  {
    "title": "Reed leaves LIV Golf to make PGA Tour return",
    "desc": "American Patrick Reed announces he is leaving the LIV Golf series to make a return to the PGA Tour, who will allow him to play from August.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f370/live/eed3d750-fc71-11f0-9f00-a7fda7ef067e.jpg",
    "source": "BBC"
  },
  {
    "title": "Reed leaves LIV Golf to make PGA Tour return",
    "desc": "American Patrick Reed announces he is leaving the LIV Golf series to make a return to the PGA Tour, who will allow him to play from August.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f370/live/eed3d750-fc71-11f0-9f00-a7fda7ef067e.jpg",
    "source": "BBC"
  },
  {
    "title": "Vancouver-based Jim Pattison group says it didn’t know warehouse would become ICE facility",
    "desc": "The U.S. Department of Homeland Security is in the process of buying a building owned by Jim Pattison Developments to use as an ICE processing facility.",
    "image": "https://globalnews.ca/wp-content/uploads/2026/01/CP218737911.jpg?quality=65&strip=all&crop=0px%2C18px%2C3000px%2C1585px&resize=720%2C379",
    "source": "Global News"
  },
  {
    "title": "Raheem Sterling leaves Chelsea by mutual agreement",
    "desc": "Raheem Sterling is a free agent after the forward reached an agreement with Chelsea to end his contact, the club confirmed on Wednesday.",
    "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2025%2F0923%2Fr1550028_2_1296x729_16%2D9.jpg",
    "source": "ESPN Singapore"
  },
  {
    "title": "EU seafood supply at risk as new Catch certification system falters",
    "desc": "European ports are reportedly facing a significant seafood backlog after the EU’s new digital Catch certification system malfunctioned, stranding shipments and disrupting the supply chain.",
    "image": "https://images.firstpost.com/uploads/2026/01/image-2026-01-94a5e8cc7dc4bce2d3883ae886c11bca-1200x675.jpg?im=FitAndFill=(1200,675)",
    "source": "Firstpost"
  },
  {
    "title": "Webb pushes boundaries of observable universe closer to Big Bang",
    "desc": "The NASA/ESA/CSA James Webb Space Telescope has topped itself once again, delivering on its promise to push the boundaries of the observable universe closer to cosmic dawn with the confirmation of a bright galaxy that existed 280 million years after the Big Bang.",
    "image": "https://scx2.b-cdn.net/gfx/news/2026/webb-pushes-boundaries.jpg",
    "source": "Phys.org"
  },
  {
    "title": "People in Minneapolis share real stories of living with ICE in the streets",
    "desc": "Residents of the Twin Cities region share their personal accounts of what it’s like to live in the midst of an ICE surge.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2256293375.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  }
]