[
  {
    "title": "Trump to send aid to Greenland for 'sick people not being taken care of' - Greenland says no thanks",
    "desc": "It turns out access to healthcare is free in Greenland.",
    "image": "https://img2.thejournal.ie/article/6964358/river/?height=400&version=6964361",
    "source": "The Journal"
  },
  {
    "title": "Certain brain regions found to be more active in people with obsessive-compulsive disorder",
    "desc": "A new study revealed that certain brain regions are more active in people with obsessive-compulsive disorder (OCD) during cognitively demanding tasks.",
    "image": "https://www.news-medical.net/image-handler/picture/2016/3/Artificially_Colored_MRI_Scan_Of_Human_Brain-Daisy_Daisy_a8c5d8bbbf824bc8932308e30187510f-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "NDLEA arrests real estate boss, Ivorian with drugs",
    "desc": "The NDLEA arrests a Lagos real estate boss with 89kg of Canadian Loud and an Ivorian with cocaine as part of a massive nationwide drug bust.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/22114403/The-arrested-real-estate-boss.-Credit-NDLEA-1200x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Villager hears explosion outside house as fire engulfs homes",
    "desc": "KEPALA BATAS: A fire victim, whose house was destroyed along with three other homes in Kampung Permatang Krai Besar here early this morning, did not expect that the explosion she heard while warming up food for sahur was actually a fire.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/22/3781049.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "The Broadway, Wimbledon police incident - photos from scene",
    "desc": "A section of The Broadway in Wimbledon has been completely closed in both directions following a police incident, causing disruption through the…",
    "image": "https://www.london-now.co.uk/resources/images/20571902.jpg?type=og-image",
    "source": "London Now"
  },
  {
    "title": "Ruto Names September as Date for Construction of Thika",
    "desc": "In December, Ruto had announced ambitious plans to construct an expressway along Thika Road.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/cars%20in%20traffic%20on%20a%20rainy%20morning%20along%20thika%20super%20highway%20on%20november%2013%2C%202019..jpg?itok=IfNXTjhr",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "Popular Boy Group Caught Up In Viral \"Child Out-Of-Wedlock\" Scandal",
    "desc": "A popular male idol has been linked to viral “child out-of-wedlock” rumors. His agency denies the claims and announces strong legal action.",
    "image": "https://image.koreaboo.com/2026/02/highlightBaby-FI.jpg",
    "source": "Koreaboo"
  },
  {
    "title": "Greenland does not need US hospital boat sent by Trump, says Denmark",
    "desc": "Defence minister rebuffs US president’s claim that Arctic islanders are ‘not being taken care of’",
    "image": "https://i.guim.co.uk/img/media/cea4235228b1abb23157d115390f410884d3313b/325_0_3270_2616/master/3270.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4332c2f1da9c71d26cacdbf2ec2dc4dc",
    "source": "The Guardian"
  },
  {
    "title": "2026 Toyota Fortuner Spied For First Time - Launch This Year?",
    "desc": "The first spy shots of the new-generation Toyota Fortuner have now surfaced online, spotted testing in Thailand. Given that Fortuner shares its underpinnings with Hilux, this sighting was only a matter of time",
    "image": "https://www.rushlane.com/wp-content/uploads/2026/02/2026-Toyota-Fortuner-Spied-2.jpeg",
    "source": "RushLane"
  },
  {
    "title": "Talks to hold one 'unified' EDSA rally break down, protest plans diverge",
    "desc": "The Trillion Peso March Movement’s program will be held at the People Power Monument, while Bayan will convene at the EDSA Shrine",
    "image": "https://www.rappler.com/tachyon/2026/02/edsa-shrine-people-power-monument.jpg",
    "source": "Rappler"
  }
]