[
  {
    "title": "Engro Holdings Profit Jumps to Rs. 107 Billion In 2025",
    "desc": "Engro Holdings reported a consolidated profit after tax of Rs. 107 billion for the latest financial year, with earnings per share rising to Rs. 46.20",
    "image": "https://propakistani.pk/wp-content/uploads/2021/10/engro-PP.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Zimbabwe Pushes Manufacturers to Use Local Raw Materials Under New Strategy",
    "desc": "Industry and Commerce Minister Dr Mangaliso Ndlovu has revealed that the government will soon roll out a Local Content Strategy aimed at promoting the use of locally manufactured raw materials in Zimbabwe's manufacturing sector.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Sophia Akuffo Breaks Silence on Protest Against Akufo",
    "desc": "Former Chief Justice, Sophia Akuffo, explained why she joined the 2023 protest against the Domestic Debt Exchange Programme, stating she had no regrets.",
    "image": "https://cdn.yen.com.gh/images/1200x675/ca3d5aae1f010591.jpeg?v=1",
    "source": "Yen News"
  },
  {
    "title": "Columbia Study Confirms Quantum Fluctuations Alter Properties Of Nearby Crystals",
    "desc": "Researchers have confirmed that quantum fluctuations within two-dimensional materials can alter the properties of nearby crystals, experimentally realizing a long-held theoretical possibility. The Columbia study demonstrates how these fluctuations, specifically vibrations in hexagonal Boron Nitride, can impact superconductivity in a neighboring material without external forces.",
    "image": "https://quantumzeitgeist.com/wp-content/uploads/columbia-study-confirms-quantum-fluctuations-alter.jpg",
    "source": "Quantum Zeitgeist"
  },
  {
    "title": "Zero-alcohol ads may increase teens’ intent to drink alcohol",
    "desc": "Findings indicate zero-alcohol advertising could serve as indirect marketing for alcohol, raising questions about its impact on adolescent drinking behaviors.",
    "image": "https://www.news-medical.net/images/news/ImageForNews_831491_17721788152449577.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Watch as GNFS officer alleges father's retirement benefits withheld pending bribe",
    "desc": "A senior officer of the Ghana National Fire Service (GNFS) has recounted how her retired father was forced to pay a bribe to receive his pension benefits.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/770/77034132.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Xie Shaoguang declined to participate in Star Awards 2026 despite being Best Actor front runner",
    "desc": "Emerald Hill's stars Chantalle Ng and Tasha Low also responded to their Best Actress nominations. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/135e66f42e1979081c3816d2e4a1fda0dc6a75c0d49efbfdf02d25f372b65b99",
    "source": "The Straits Times"
  },
  {
    "title": "Auckland CBD shop attack: Woman accused of $75k necklace theft, damage",
    "desc": "An Auckland woman has been arrested for allegedly attempting to steal a necklace worth almost $75,000 and smashing a cabinet worth tens of thousands of...",
    "image": "https://www.nzherald.co.nz/resizer/v2/E7AJOPOLJ5GQRI3ZFZX7BM7ODU.jpg?auth=8522e4ab5ef31967c9ca5a94797a33d31dbf1c73d742c264a57fd73dce72aae9&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "Raye Reflects on Heartbreak on Emotive Single 'Nightingale Lane'",
    "desc": "Raye released a new single, \"Nightingale Lane,' off her forthcoming album 'This Album May Contain Hope.'",
    "image": "https://www.rollingstone.com/wp-content/uploads/2026/02/GettyImages-2263774616.jpg?w=1600&h=900&crop=1",
    "source": "Rolling Stone"
  },
  {
    "title": "Chancellor Message – 27 February 2026",
    "desc": "Dear UJ community, As I settled down to put the proverbial ink to paper, I found myself reflecting on how quickly time has passed since the beginning of the year. In no time, we are over the registration period, and the annual Academic Opening has come and gone. Time is indeed precious. As the famous",
    "image": "https://news.uj.ac.za/wp-content/uploads/2023/05/apk_uj.jpg",
    "source": "UJ News"
  }
]