[
  {
    "title": "Winter Olympics 2026: Italian star Federica Brignone unsure if she will race in downhill at home Games after finishing 12th in training",
    "desc": "Speaking exclusively to Olympics.com, the Alpine skiing star admits she has not made up her mind about the race on Sunday (8 February) as she continues her return from serious injury.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/jpr2q3deyucnzi1hckx4",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "OpenClaw AI chatbots are running amok - these scientists are listening in",
    "desc": "Artificial-intelligence agents have their own social-media platform and are publishing AI-generated research papers on their own preprint server.",
    "image": "https://media.nature.com/lw1200/magazine-assets/d41586-026-00370-w/d41586-026-00370-w_52023864.jpg",
    "source": "Nature"
  },
  {
    "title": "Wellington actor Albert Latailakepa’s leap from school drama to Disney+",
    "desc": "Albert Latailakepa took “a leap of faith” when he joined his high school drama classes. A couple of mates were doing it, so what was the harm, right? “With...",
    "image": "https://www.nzherald.co.nz/resizer/v2/B5ZKZAJXYNFO5LQVMVIOLCIWFA.jpg?auth=b561d69fe33447d34294161e73cbb4498f625331b8b5fff00c7b709bebd99fef&width=1200&height=675&quality=70&focal=938%2C436&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Team26 takes centre stage at the San Siro Olympic Stadium: 900 volunteers attend the Opening Ceremony",
    "desc": "In addition to the Team26 members, over 1,200 volunteers will participate in the Ceremony, supporting the more than 150 professionals involved in the show.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/yd5zdtqixzixh2rcfszi",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "'Football is freedom' - How Bob Marley's love of the beautiful game inspired new adidas collection celebrating life & music of reggae icon",
    "desc": "adidas have dropped a new eight-piece collection inspired by the life and musical catalogue of iconic Jamaican singer-songwriter Bob Marley",
    "image": "https://assets.goal.com/images/v3/blt8f12e145d4030acb/GOAL%20-%20Multiple%20Images%20-%203%20Stacked%20-%20Facebook%20-%202026-02-06T161337.688.jpg",
    "source": "Goal.com"
  },
  {
    "title": "What the stronger Australian dollar means for your shares",
    "desc": "The higher Australian dollar can create a headwind for some companies, and it looks like it's here to stay, at least for this calendar year.",
    "image": "https://www.fool.com.au/wp-content/uploads/2020/07/australian-dollar-1200x675.jpg",
    "source": "The Motley Fool Australia"
  },
  {
    "title": "M. Night Shyamalan's 'Remain' With Jake Gyllenhaal Sets 2027 Release",
    "desc": "M. Night Shyamalan's 'Remain' With Jake Gyllenhaal and Phoebe Dynevor will premiere in February 2027.",
    "image": "https://variety.com/wp-content/uploads/2020/04/r1323_themix_m_knight.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "M. Night Shyamalan's 'Remain' Movie Release Date Set",
    "desc": "M. Night Shyamalan's adaptation of Nicholas Sparks' novel 'Remain' will open on February 5, 2027.",
    "image": "https://deadline.com/wp-content/uploads/2026/02/M.-Night-Shyamalan.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "'Football is freedom' - How Bob Marley's love of the beautiful game inspired new adidas collection celebrating life & music of reggae icon",
    "desc": "adidas have dropped a new eight-piece collection inspired by the life and musical catalogue of iconic Jamaican singer-songwriter Bob Marley",
    "image": "https://assets.goal.com/images/v3/blt8f12e145d4030acb/GOAL%20-%20Multiple%20Images%20-%203%20Stacked%20-%20Facebook%20-%202026-02-06T161337.688.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Learning neuroimaging models from health system-scale data",
    "desc": "Neuroimaging is a ubiquitous tool for evaluating patients with neurological diseases. The global demand for magnetic resonance imaging (MRI) studies has risen steadily, placing substantial strain on health systems, prolonging turnaround times and intensifying physician burnout. These challenges disproportionately impact patients in low-resource and rural settings. Here we utilize data from a large academic health system to develop Prima, an AI foundation model for neuroimaging that supports real-world, clinical MRI studies as input. Trained on over 220,000 MRI studies, Prima uses a hierarchical vision architecture that provides general and transferable MRI features. Prima was tested in a 1-year health system-wide study that included 29,431 MRI studies. Across 52 radiologic diagnoses from major neurologic disorders, Prima achieved a mean diagnostic area under the curve (AUC) of 92.0%, outperforming other state-of-the-art general and medical AI models. Prima offers explainable differential diagnoses, worklist priority for radiologists and clinical referral recommendations. Prima demonstrates algorithmic fairness across sensitive groups. These findings highlight the transformative potential of health system-scale AI training and Prima’s role in advancing AI-driven healthcare. Prima is an AI foundation model for neuroimaging based on clinical magnetic resonance imaging that offers accurate and explainable diagnostics, worklist priority for radiologists and clinical referral recommendations with equitable performance on diverse groups.",
    "image": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41551-025-01608-0/MediaObjects/41551_2025_1608_Fig1_HTML.png",
    "source": "Nature"
  }
]