[
  {
    "title": "China's Xi and Russia's Putin reinforce ties in video call",
    "desc": "Russian President Vladimir Putin has praised growing economic ties with China during a video call with Chinese leader Xi Jinping",
    "image": "https://i.abcnewsfe.com/a/1c46da73-721a-4b0f-bacb-f2143de20658/wirestory_051064d85fa6eda9ee52e489937a4b2c_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "PNB to independently assess Sunway’s takeover bid for IJM, says Fadillah",
    "desc": "Permodalan Nasional Bhd (PNB), one of the substantial shareholders of IJM Corporation Bhd (KL:IJM), will evaluate the takeover offer for the construction company before making any decision, Deputy Prime Minister Datuk Seri Fadillah Yusof said on Wednesday.",
    "image": "https://assets.theedgemarkets.com/20250925_Fadillah_SB-10_20251006144015_theedgemalaysia_2.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "Gold rebounds above $5,000 after US downs Iran drone",
    "desc": "Precious metal price voliatility continues as geopolitical tensions push investors to safe-haven assets.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/ce31/live/1273a030-fdb9-11f0-8e3f-176b350fc659.jpg",
    "source": "BBC"
  },
  {
    "title": "Ryan Tubridy has another new radio gig - here’s where you’ll hear him next",
    "desc": "The broadcaster will host a new Sunday afternoon show on Times Radio.",
    "image": "https://img2.thejournal.ie/article/6946348/river/?height=400&version=6946378",
    "source": "The Journal"
  },
  {
    "title": "Village Impact partners with Nakuru County to expand education Infrastructure.",
    "desc": "By James Munyua Over 6000 learners from Nakuru County have benefitted from conducive learning environment yearly, through the Village Impact, a prominent non-profit organization transformative education initiative. Since establishing its roots in Nakuru County, Village Impact has constructed and equipped 16 primary and secondary schools from the ground up, with an ambitious roadmap to increase […]",
    "image": "https://nakuru.go.ke/wp-content/uploads/2025/01/cropped-cropped-NCG-Logo-FULL-1-2-1-32x32.png",
    "source": "Nakuru County"
  },
  {
    "title": "Israeli‑led research unveils 'living' implant that could end insulin shots",
    "desc": "Technion and top US universities unveil implantable 'living pancreas' that senses glucose, produces insulin and evades immune response, paving the way for self-regulating, long-term diabetes treatment without daily injections",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/04/Ske4i5gPbl/Ske4i5gPbl_246_0_2160_1216_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Australian halfpipe snowboarder Valentino Guseli on Italian heritage and Winter Olympic 2026 medal ambitions: “ideally gold.”",
    "desc": "Australia’s Valentino Guseli heads into his second Olympic Games with massive amplitude and technical tricks proven with a trio of World Cup podiums. Guseli also has a personal mission to honor his Italian heritage at these Games.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/wwf3vjrmalnzffou3f4m",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "India Art Fair strengthens its role as launchpad for South Asian talent",
    "desc": "The New Delhi stalwart, which has raised the profile of many artists, also reflects the growing interest in Indigenous art",
    "image": "https://cdn.sanity.io/images/cxgd3urn/production/ad562071a640b5ec3fb24f0b3d8fdcaf890acc51-2560x1708.jpg?rect=0,86,2560,1536&w=1200&h=720&q=85&fit=crop&auto=format",
    "source": "The Art Newspaper"
  },
  {
    "title": "Benue: Bandits Attack Abande Community, Kill Police Officer, Four Others",
    "desc": "A Special Duty-bound Assistant Superintendent of Police and four Civilians have been killed after armed bandits launched another attack",
    "image": "https://www.tvcnews.tv/wp-content/uploads/2025/11/gunmen.webp",
    "source": "TVC News"
  },
  {
    "title": "Bucana Bridge in Davao City closed for Chinese New Year",
    "desc": "DAVAO CITY – The Davao City government will temporarily close the Bucana Bridge, part of the Davao City Coastal Road, on Feb. 16 for the 2026 Chinese New Year...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/04/76839.webp",
    "source": "Manila Bulletin"
  }
]