[
  {
    "title": "Zegna Releases Six Fragrances Inspired By Founder Ermenegildo",
    "desc": "Turning to trio of revered master perfumers – Dominique Ropion, Fabrice Pellegrin and Quentin Bisch – Zegna unveils Memorie, its debut fragrance collection.",
    "image": "https://10magazine.com/wp-content/uploads/2026/02/Zegna-FT.jpg",
    "source": "10 Magazine"
  },
  {
    "title": "Davison, Dy star as High Speed Hitters eclipse Solar Spikers",
    "desc": "PLDT drew strength from the duo of Savi Davison and Kianna Dy as it overcame a stellar effort from Bella Belen in a 25-20, 25-16, 22-25, 25-17 victory over Capital1 Thursday that kept it unscathed in the PVL All-Filipino Conference.",
    "image": "https://media.philstar.com/photos/2026/02/12/pldt-high-speed-hitters-pvl_2026-02-12_18-53-42.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "WHO and the European Union strengthen Ukraine’s health system through DG ENEST partnership",
    "desc": "12 February, Kyiv - As the war continues to place extraordinary pressure on Ukraine’s health system, the partnership between the European Union and the World Health Organization (WHO) is helping ensure that essential health services remain available while strengthening the system for the future. Through the Directorate-General for Enlargement and the Eastern Neighbourhood (DG ENEST)–WHO Project, emergency solutions and long-term reforms are supporting resilience, recovery, and equitable access to care for millions of Ukrainians.",
    "image": "https://ukraine.un.org/sites/default/files/2026-02/for%20web_0.JPG",
    "source": "ukraine.un.org"
  },
  {
    "title": "Sindh Assembly says ‘cheers, but no ban’ as liquor motion fizzles",
    "desc": "Light-hearted debate, laughter in House before lawmakers vote down province-wide proposal",
    "image": "https://i.tribune.com.pk/media/images/lanjar1770901583-0/lanjar1770901583-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Ramadan 2026: UAE announces reduced work hours for private sector",
    "desc": "Private sector companies in UAE have the option to implement flexible or remote work schedules within the limits of daily working hours specified during the holy month",
    "image": "https://imgengine.khaleejtimes.com/khaleejtimes-english/2026-02-12/fq50k8tk/Ramadan-UAE-Dubai.png?width=1200&height=630&format=auto&ogImage=true&mode=crop&rect=73,0,834,556",
    "source": "Khaleej Times"
  },
  {
    "title": "Cloud Solutions Architect at Ntice Sourcing Solutions (Pty) Ltd.",
    "desc": "Our client is looking for an experienced Cloud Solutions Architect to join their IT Service Management (ITSM) team. The role is aligned with ITIL best practices and focuses on the design and implementation of secure, scalable, and reliable solutions within their private Azure infrastructure The ideal candidate will have strong hands-on experience in cloud computing, […]",
    "image": "https://recruiter.careerjunction.co.za//_service/p/RecruiterSiteTypePlugin_1_0/recruiter/logpixeltrackingjobview?id=8d617876-0750-11f1-a54c-02f22c7af7eb",
    "source": "it-online.co.za"
  },
  {
    "title": "AUSSIE GOLD!! World No.20 Cooper Woods stuns moguls GOAT for Olympic glory... on a tiebreaker",
    "desc": "AUSSIE GOLD!! World No.20 stuns moguls GOAT for Olympic glory... on a tiebreaker",
    "image": "https://content.api.news/v3/images/bin/ebfb49f6ba4837abc18cc547bb81f796",
    "source": "fox sports"
  },
  {
    "title": "FDA-approved anti-seizure drug could help fight Alzheimer's disease",
    "desc": "While physicians and scientists have long known Alzheimer's disease involves the buildup of toxic protein fragments in the brain, they have struggled to understand how these harmful fragments are produced.",
    "image": "https://www.news-medical.net/image-handler/picture/2016/2/Alzheimers_amyloid_plaque_-_Juan_Gaertner_9638f1223d534b518a192c8478871d65-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Holiday tax could make holidays 'unaffordable' for many, campaigners say",
    "desc": "The chancellor is to allow regional mayors to introduce visitor levies on overnight stays, but the industry argues this would put an extra £100 or more on the cost of a fortnight's stay.",
    "image": "https://e3.365dm.com/26/02/1600x900/skynews-tower-bridge-london_7162949.jpg?20260212085856",
    "source": "Sky News"
  },
  {
    "title": "Galthie makes five changes as 2 debutants named",
    "desc": "France head coach Fabien Galthie has made two changes to his starting XV to face Wales, with centre duo Gailleton and Brau-Boirie named.",
    "image": "https://d3gbf3ykm8gp5c.cloudfront.net/content/uploads/2026/02/12104030/France-team-v-Wales-2026.jpg",
    "source": "planetrugby.com"
  }
]