[
  {
    "title": "Apple Just Bought A Sinister ‘Pre-Speech’ Tech Company Implicated In Genocide",
    "desc": "Nate Bear for Do Not Panic Substack Apple has paid nearly $2 billion for a ‘pre-speech’ tech company whose employees helped Israel commit genocide in Gaza. And Apple has paid this money, the second-biggest deal in its history, for a company that doesn’t have a product, doesn’t have any revenues and whose website is a…",
    "image": "https://i0.wp.com/scheerpost.com/wp-content/uploads/2026/02/Untitled-design-64.png?fit=1200%2C675&ssl=1",
    "source": "ScheerPost"
  },
  {
    "title": "Virtual Reality Gaming Market is Estimated to Reach USD 19.63",
    "desc": "Press release - Market R Future - Virtual Reality Gaming Market is Estimated to Reach USD 19.63 Billion by 2035| CAGR of 4.7% - published on openPR.com",
    "image": "https://cdn.open-pr.com/L/2/L216735511_g.jpg",
    "source": "openPR.com"
  },
  {
    "title": "Meet Sam Altman, OpenAI's Cofounder and CEO",
    "desc": "OpenAI CEO Sam Altman helped usher in the AI age. Now, he's doing everything he can to keep OpenAI ahead.",
    "image": "https://i.insider.com/698bc019d3c7faef0ece09a9?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "Apologise for 'flawed' Ofori-Atta INTERPOL Red Notice - Frank Davies to OSP",
    "desc": "A member of Kenneth Ofori-Atta’s legal team, Frank Davies, has called on the Office of the Special Prosecutor (OSP) to apologise to Ghanaians, insisting that the anti-corruption body erred in its handling of the INTERPOL Red Notice issued against...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/170/17015814.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "T20 World Cup: Pakistan 'mull' benching Babar, Shaheen after India defeat",
    "desc": "Two to three changes likely in team against Namibia: sources.They add management considering giving chance to bench strength.Pakistan will face Namibia in key group stage match on Wednesday.LAHORE: In the aftermath of the Pakistan team's loss...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-16/l_651119_024117_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Application forms for 2027 SANDF MSDS intake now available",
    "desc": "The South African National Defence Force (SANDF) has opened its Military Skills Development System (MSDS) applications for 2027, allowing young and deserving",
    "image": "https://defenceweb.co.za/wp-content/uploads/Unorganized/msd_infschool_parade_df_fb.jpg",
    "source": "defenceWeb"
  },
  {
    "title": "How $250 million project will redefine Zanzibar’s urban living",
    "desc": "Zanzibar’s skyline is about to change, this is after Infinity Developments launched a $250 million residential and mixed-use development aimed at redefining contemporary urban living on the islands.",
    "image": "https://www.thecitizen.co.tz/resource/image/5361146/landscape_ratio3x2/1200/800/1edccaab3029fc3d0f6ac36e8f38b722/cv/invest-pic.png",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Kenya labour dispute delays flights at international hub airport",
    "desc": "Authorities say they have put in place contingency measures as a labour dispute affects travel.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/44a3/live/73128dc0-0b24-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Red Bull launches Locked In Apex Legends tournament in Cape Town",
    "desc": "Red Bull has announced the launch of Red Bull Locked In, a new competitive gaming event coming to Cape Town from 6 to 8 March 2026.",
    "image": "https://novanews.co.za/wp-content/uploads/2026/02/372a8e1e-d693-4319-a_70733.jpg",
    "source": "novanews.co.za"
  },
  {
    "title": "RTÉ Pundits Clash Over 'Very Soft' Red Card For Derry's Conor Glass",
    "desc": "Footage has emerged of Conor Glass’s early red card as Derry had a good Division 2 win over Kildare in Newbridge, with ref David Gough showing a red card.",
    "image": "https://img.resized.co/balls_ie/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL21lZGlhLmJhbGxzLmllXFxcL3VwbG9hZHNcXFwvMjAyNlxcXC8wMlxcXC8xNTEzMTg1NFxcXC9VbnRpdGxlZC1kZXNpZ24tNjMucG5nXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3d3dy5iYWxscy5pZVxcXC9pbWFnZXNcXFwvYnJhbmQtaW1hZ2UuanBnXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6IjllMGI2MGQzNWJjNTAwMGJiODRiYmY3MmVjNDA5OTMwMDc3Yjg5YzQifQ==/rtpunditsclashoververysoftredcardforderrysconorglassballsie.png",
    "source": "Balls.ie"
  }
]