[
  {
    "title": "King's Theatre 'increasingly unable' to land large shows",
    "desc": "The Glasgow theatre needs investment or many touring productions will only go to Edinburgh in the future, a report has found.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2918/live/f9aea480-0111-11f1-bdfd-ed3f5ca8b7fe.png",
    "source": "BBC"
  },
  {
    "title": "Best portable power station deal: Save 51% on the Bluetti Elite 100 V2 portable power station",
    "desc": "The Bluetti Elite 100 V2 portable power station is on sale for $394.98, down from the list price of $799. That's a 51% discount.",
    "image": "https://helios-i.mashable.com/imagery/articles/02xXmG2dfo4zvmmT0aAaa6B/hero-image.fill.size_1200x675.v1770128287.jpg",
    "source": "Mashable"
  },
  {
    "title": "Some 2.6 Million Ethiopians Secured Jobs in Six Months: PM Abiy",
    "desc": "Addis Ababa, February 3, 2026 (ENA)—Some 2.6 million Ethiopians have benefited from job opportunities over the past six months, according to Prime Minister Abiy Ahmed.\nSpeaking on employment creation today, he told the House of People's Representatives that this achievement reflects the government’s commitment to expanding work opportunities across the country.\nHe stated that more than 670,000 citizens have secured employment in just the last 20 days alone.\nThis happened due to corridor deployments in the capital city and regional cities, industry, and agriculture, mines, and mega projects as well as the new free trade zones.\nThe PM added that overseas employment in six months grew to 350,000, out of which up to 10,000 were skilled professionals.\nCompared to the same period last year, PM Abiy said, jobs have increased significantly in the past six months.",
    "image": "https://www.ena.et/documents/42142/0/ABIY+%2819%29.jpg/2b64f134-c8b8-06bd-16f3-3fd6ca49f9c1?version=1.0&t=1770131702963&download=true",
    "source": "ENA English"
  },
  {
    "title": "Stepping up private capital to advance energy efficiency: Commission strengthens partnership with EU countries, financing bodies and industry",
    "desc": "The European Energy Efficiency Financing Coalition, comprising of the Commission, EU countries and stakeholders from the private sector and financing bodies, met today to discuss future priorities and a longer-term financial injection to advance on energy efficiency.",
    "image": "https://energy.ec.europa.eu/sites/default/files/styles/ewcms_metatag_image/public/2026-02/EEEF_Coalition_Meeting%20%28002%29.jpg?h=4efae111&itok=N6vdta5S",
    "source": "energy.ec.europa.eu"
  },
  {
    "title": "Bawumia will not be vindictive - Egyapa Mercer assures",
    "desc": "Former Sekondi MP and ex-Minister of Tourism, Andrew Egyapa Mercer, has praised Dr Mahamudu Bawumia for his fair-minded and inclusive approach following his victory in the New Patriotic Party (NPP) presidential primaries.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/191/19108227.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "US stock market crashes today: Why Nasdaq, S&P 500 and Dow Jones all turned red - Gold and silver surge as investors rotate into safety",
    "desc": "US stock market crashes today: Nasdaq, S&P 500, Dow fall as gold and silver rally on investor fear. The Nasdaq Composite plunged 1.01% to 23,353.77 as high-interest rates pressured tech valuations. The S&P 500 slipped 0.49%, while the Dow hovered near 49,400. Federal Reserve caution cooled rate-cut hopes, driving a flight to safety. Consequently, Gold surged 6.18% to $4,939.90, and Silver skyrocketed 13.25%. While Palantir jumped 5% on AI growth, PayPal tanked 17% on weak guidance. Investors are now rotating from volatile stocks into protective hard assets.",
    "image": "https://img.etimg.com/thumb/msid-127889248,width-1200,height-630,imgsize-134242,overlay-economictimes/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Immigration rescues abused Indonesian maid in Seremban",
    "desc": "SEREMBAN: The Negri Sembilan Immigration Department has rescued an Indonesian domestic helper who appeared to have been abused in Taman Kemayan, Seremban 2, here.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/03/3752600.jpeg",
    "source": "thestar.com.my"
  },
  {
    "title": "Freshman honors: Cody student awarded prestigious scholarship",
    "desc": "Crossing the street while exploring the quiet town of Saurahai, Nepal, on her first trip with the University of Wyoming’s Haub School of Environment and Natural Resources, UW freshman and Cody High …",
    "image": "https://delta.creativecirclecdn.com/powell/original/20260203-082208-03a-BB-1.jpg",
    "source": "Powell Tribune"
  },
  {
    "title": "Lindsey Vonn has ruptured ACL but will compete at Winter Olympics",
    "desc": "Lindsey Vonn has ruptured her left anterior cruciate ligament but is still \"very hopeful\" she can compete at the Winter Olympics.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2497/live/e983ca80-0117-11f1-94a6-8d378e3e512e.jpg",
    "source": "BBC"
  },
  {
    "title": "Lindsey Vonn has ruptured ACL but will compete at Winter Olympics",
    "desc": "Lindsey Vonn has ruptured her left anterior cruciate ligament but is still \"very hopeful\" she can compete at the Winter Olympics.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/2497/live/e983ca80-0117-11f1-94a6-8d378e3e512e.jpg",
    "source": "BBC"
  }
]