[
  {
    "title": "Court orders arrest of Liberia FA President",
    "desc": "The President of the Liberia Football Association (LFA), Mustapha Raji, is facing possible arrest after the Paynesville City Magisterial Court issued a writ of arrest against him over allegations of simple assault and disorderly conduct.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/01/liberia-football-association-president-mustapha-raji-l-440nw-10368198g.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "spent on medics equipment nationwide, Bunge told",
    "desc": "DODOMA: FOR the past five years, the government has disbursed 285.6bn/- for the procurement of medical equipment, significantly improving provision of health services in the country. Deputy Minister of State, Prime Minister’s Office, Regional Administration and Local Government (PMO-RALG) Mr Reuben Kwagilwa said yesterday that the medical equipment, include delivery (maternity) equipment, for primary-level healthcare",
    "image": "https://dailynews.co.tz/wp-content/uploads/2022/07/favicon.ico",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Seven favourites to sign Chelsea star",
    "desc": "Raheem Sterling is expected to leave Chelsea before the end of the January transfer window, but where will he go?",
    "image": "https://d3nfwcxd527z59.cloudfront.net/content/uploads/2026/01/28093104/Raheem-Sterling-Chelsea.jpg",
    "source": "Planet Football"
  },
  {
    "title": "Karan Wahi breaks silence on wedding rumours with Dill Mill Gayye co-star Jennifer Winget",
    "desc": "Karan Wahi and Jennifer Winget, who have shared screen space in multiple television shows and are close friends off screen, are making headlines after.",
    "image": "https://static.toiimg.com/thumb/msid-127695536,width-1280,height-720,imgsize-50014,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Beyond treatment: Why palliative professionals are the hidden specialists in cancer care",
    "desc": "Author: Hanneke Lubbe Speaking ahead of World of World Cancer Day on 4 February, Hanneke Lubbe, chair of the Free State chapter of the Association of Palliativ",
    "image": "https://ehospice.com/wp-content/uploads/2026/01/World-Cancer-Day-2026.jpg",
    "source": "eHospice"
  },
  {
    "title": "Ajit Pawar: Veteran Indian politician dies in plane crash",
    "desc": "Pawar, the deputy chief minister of India's Maharashtra state, died in the crash along with four other people.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/52e5/live/65691c00-fc17-11f0-8618-c12486cd8cf5.jpg",
    "source": "BBC"
  },
  {
    "title": "'Hey Pakistan, don't come, you'll be thrashed': India World Cup-winner warns Mohsin Naqvi",
    "desc": "Cricket News: NEW DELHI: Former India opener and 1983 World Cup winner Krishnamachari Srikkanth has launched a scathing attack on Pakistan Cricket Board (PCB) chief.",
    "image": "https://static.toiimg.com/thumb/msid-127695469,width-1280,height-720,imgsize-70422,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "MBC Announces Cancellation Of “Music Core In Macau”",
    "desc": "MBC’s “Music Core in Macau” has officially been canceled. On January 28, MBC released an official statement announcing the decision, citing local",
    "image": "https://0.soompi.io/wp-content/uploads/2026/01/26012311/music-core-macau.jpeg",
    "source": "Soompi"
  },
  {
    "title": "Israel assessing reports of secret US-Iran contacts",
    "desc": "Trump sent a message to Iran overnight stating that he would prefer Iran to sign an agreement, while also warning that an additional naval armada was moving toward the region.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/703854",
    "source": "jpost.com"
  },
  {
    "title": "Redmi’s new smartphone doubles as a power bank, packs 9,000mAh battery",
    "desc": "Redmi’s new smartphone doubles as a power bank, packs 9,000mAh battery",
    "image": "https://static-images.vnncdn.net/vps_images_publish/000001/00000Q/2026/1/28/redmis-new-smartphone-doubles-as-a-power-bank-packs-9000mah-battery-e69eadf72d1048cab3c41e4a325a2ca4-1418.png?width=0&s=XZqgKyHXkWHYbOR8l6v4ug",
    "source": "Báo VietNamNet"
  }
]