[
  {
    "title": "The Sun Broke Through the Clouds for This Couple’s Forest Wedding in the Bhutanese Himalayas",
    "desc": "Tara Susanto-Joseph and James Joseph, who founded a forest restoration company, held their wedding among pine trees in the mountains of Bhutan.",
    "image": "https://assets.vogue.com/photos/695188620cb2455668ed68f1/16:9/w_1280,c_limit/00064Tara&James.jpg",
    "source": "Vogue"
  },
  {
    "title": "Derry man (23) dies after fifth-storey balcony railing collapses in London",
    "desc": "Joshua’s parents have said that they are currently seeking answers from a local housing association on why the balcony collapsed.",
    "image": "https://img2.thejournal.ie/article/6946726/river/?height=400&version=6946752",
    "source": "The Journal"
  },
  {
    "title": "Timothée Chalamet thanks French fans at Marty Supreme Paris premiere",
    "desc": "Timothée Chalamet honors French cinephiles at Marty Supreme premiere, joking about ticket prices and fan support",
    "image": "https://i.tribune.com.pk/media/images/kkkk-631768052379-0/kkkk-631768052379-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Trump's Kennedy Center closure shocks the National Symphony Orchestra",
    "desc": "President Donald Trump’s decision to close the Kennedy Center for two years starting this summer came with no notice to the National Symphony Orchestra.",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-02/260203-National-Symphony-Orchestra-gk-a275f9.jpg",
    "source": "NBC News"
  },
  {
    "title": "Xi Jinping speaks with Vladimir Putin and Donald Trump on eve of Ukraine war anniversary",
    "desc": "The Chinese leader and his Russian counterpart hailed the success of the relationship between the two countries and pledged to further ties in a call broadcast on state television.",
    "image": "https://live-production.wcms.abc-cdn.net.au/804dec7574c87b083401402ae7b04871?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=217&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "says white farmers who left thought they were superior",
    "desc": "PRESIDENT Emmerson Mnangagwa has defended government’s Land Reform Programme, declaring that white farmers who upped and left the country, as a result, thought that they were superior to the “African people of Zimbabwe.”",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/02/04151833/world-governments-summit.jpeg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "Crocodile seen in waters near Changi Naval Base; second reported sighting after Sentosa",
    "desc": "A crocodile was sighted by the Republic of Singapore Navy near Changi Naval Base, prompting increased monitoring and public safety advisories. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/e47542e6da058e16a055e057f318fe2d4df9b515b89671608cdba72935fda49a",
    "source": "The Straits Times"
  },
  {
    "title": "Ex-JI chief to hold high-level meetings in Kabul in bid to ease Pak-Afghan tensions: sources",
    "desc": "Will discuss border trade and crossings in first stages, along with Islamabad's security concerns later on",
    "image": "https://i.tribune.com.pk/media/images/733955-SirajulHaq-1405057717/733955-SirajulHaq-1405057717-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "FG partners World Bank, AfDB on climate action",
    "desc": "The Federal Ministry of Livestock Development says it will collaborate with the World Bank Group and the AfDB to address climate change",
    "image": "https://cdn.guardian.ng/wp-content/uploads/2026/02/Afdb.webp",
    "source": "The Guardian Nigeria News"
  },
  {
    "title": "Aaron George century helps India down Afghanistan in semi-final",
    "desc": "The Indian cricket team, riding on Aaron George's century and fifties from Vaibhav Sooryavanshi and Ayush Mhatre, beat Afghanistan in the U19 World Cup 2026 semi-finals.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/hmzitkglfkducimeivyp",
    "source": "Milano Cortina 2026"
  }
]