[
  {
    "title": "Comelec to hold fair for automated election systems tech in April",
    "desc": "The Commission on Elections (Comelec) is set to hold a voters’ fair in April this year to know the latest automated election systems (AES) technologies as part of their preparations for the 2028 national elections.",
    "image": "https://images.gmanews.tv/webpics/2026/02/Kapihan_Ernesto_Maceda_Jr_2026_02_25_15_37_40.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Former ADOR CEO Min offers truce with Hybe over 25.6 billion",
    "desc": "Former ADOR chief executive Min Hee-jin on Wednesday offered to end all legal disputes with K-pop giant Hybe in return for waiving a 25.6 billion-won (US$17.89 million) put option payout she expects from the company.",
    "image": "https://cdnph.upi.com/sv/ph/og/i/3921772004491/2026/1/17720048732710/v1.5/Former-ADOR-CEO-Min-offers-truce-with-Hybe-over-256-billion-won-deal.jpg",
    "source": "upi.com"
  },
  {
    "title": "Woolworths shares have best day on record as food sales and profit beat expectations",
    "desc": "Woolworths shares rally 13 per cent on a well-received result. The supermarket's shareholders will receive an interim dividend of 45 cents per share, up from the same time a year ago.",
    "image": "https://live-production.wcms.abc-cdn.net.au/84cb7b044ca037b558e8880aa46b03fc?impolicy=wcms_watermark_news&cropH=560&cropW=995&xPos=5&yPos=42&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "TeamGroup PD20M Mag Portable 1TB SSD Review",
    "desc": "Unfortunately, the portable SSD market is also affected by the AI-induced shortage but that didn't stop TeamGroup from sending us their latest external SSD - the TeamGroup PD20M Mag Portable SSD.",
    "image": "https://www.gadgetpilipinas.net/wp-content/uploads/2026/02/TeamGroup-PD20M-Mag-Portable-SSD-1TB-Philippines.jpg",
    "source": "Gadget Pilipinas"
  },
  {
    "title": "ArenaPlus joins Sinulog, Dinagyang in reimagining festival experiences",
    "desc": "TIKTOK Live thundering drumbeats felt bigger, louder and more electric fused with the nonstop livestreams of ArenaPlus, the country’s #1 Philippine Amusement and Gaming Corp.-licensed online sportsbook, teamed up with Spectrum, the official event organizer of “Lyvefest [powered by TikTok Live],” transformed two of the Philippines’ most iconic celebrations into immersive party spaces where culture, community, and sports digital entertainment collided in real time.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/25/950282.jpeg",
    "source": "The Manila Times"
  },
  {
    "title": "BRB Capital appoints Etimbuk Bassey as new CEO",
    "desc": "BRB Capital Group names Etimbuk Bassey as its new Chief Executive Officer to lead its next phase of global expansion and investment strategy in Africa.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/25083012/laer.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Northeast US scrambles to clear piles of snow",
    "desc": "NEW YORK (AP) — Snowplows cleared the way for ambulances and fire trucks in Rhode Island. New York City workers geared up to dump massive basins of warm water...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/25/81823.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "YouTuber taken into custody for recording Imran Khan convoy",
    "desc": "RAWALPINDI: Law enforcement officials reportedly detained a social media activist for recording the movement of incarcerated Pakistan Tehreek-e-Insaf founder Imran Khan while he was being transported between a hospital and prison, The...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-25/l_652792_121551_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Receivers put one-seventh stake in Cheong family's Oxley Rise mansion on the block",
    "desc": "The prime freehold residential landed plot was put up for sale in 2022 at S$300 million",
    "image": "https://cassette.sphdigital.com.sg/image/businesstimes/e84d717b95d997695f0a114952f34f2a016723361203a2c27a6eaf106640f17b?w=1200&f=webp",
    "source": "The Business Times"
  },
  {
    "title": "Paras Dogra headbutt sparks chaos; apology rejected as KL Rahul unleashes verbal attack in Ranji Trophy final",
    "desc": "Paras Dogra lost his cool and headbutted a Karnataka fielder amid sledging; Mayank Agarwal and KL Rahul then stepped in even as the umpire issued stern warning. | Cricket",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/25/550x309/dogra_headbutt_1772004815952_1772004823277.jpg",
    "source": "Hindustan Times"
  }
]