[
  {
    "title": "Silver Price Crash: 3 Signs the Metal Could Be Headed for More Pain",
    "desc": "Silver prices crashed on Friday. One commodities expert says there are three signs to watch for to know if more pain is coming.",
    "image": "https://i.insider.com/697bbe40d3c7faef0ecd3446?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "The doorstep revenge killing of an innocent mum that shattered a quiet community",
    "desc": "Joanne Penney only went to answer the door. It cost her her life. This is the story of a gangland shooting, a violent feud, and an innocent victim",
    "image": "https://i2-prod.walesonline.co.uk/article33280674.ece/ALTERNATES/s1200/0_Joanne-Penney-Talbot-Green-murder.jpg",
    "source": "Wales Online"
  },
  {
    "title": "These Gazans May Finally Get a Lifeline to the World",
    "desc": "Thousands of Palestinians are waiting to be evacuated for medical treatment as the border between Gaza and Egypt looks set to reopen in the coming days.",
    "image": "https://static01.nyt.com/images/2026/01/30/multimedia/30Gaza-medical-evacuees-04-cbmt/30Gaza-medical-evacuees-04-cbmt-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Auckland FC fall to Perth Glory after late goal",
    "desc": "Live updates of Auckland FC’s away trip to the Perth Glory. Auckland FC 2 Central Coast Mariners 2 Michael Woud won’t be in a hurry to watch this one back....",
    "image": "https://www.nzherald.co.nz/resizer/v2/FVYHMG32SNATXNRM3YAO2752CE.jpg?auth=19818bc68eb1bfee81b5784a60f66ce5d3c0399c5f3ebd7592ec2225626ac900&width=1200&height=675&quality=70&focal=1643%2C806&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Why have rapper Ghali’s Israel comments led to Winter Olympics criticism?",
    "desc": "The Milano-Cortina Winter Olympics open on Monday, but rapper Ghali’s inclusion draws criticism in his native Italy.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/01/2019-03-17T195352Z_2065278254_RC1294778B30_RTRMADP_3_SOCCER-ITALY-MIL-INT-1769854317.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "South Africa expels Israel’s top diplomat",
    "desc": "Israel retaliates by ordering out Pretoria’s envoy amid Gaza-related tensions",
    "image": "https://i.aaj.tv/large/2026/01/31153300889859c.webp",
    "source": "Aaj English TV"
  },
  {
    "title": "Why Amazon Fresh Struggled to Break Through in Grocery: Store Workers",
    "desc": "As Amazon Fresh closes stores, workers say the chain struggled to resonate with customers and differentiate itself from Whole Foods",
    "image": "https://i.insider.com/697b6d48a645d1188188395c?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "ESB issues flood warning for Newbridge and Clane as it may empty excess water from Poulaphouca reservoir",
    "desc": "ESB has said that it may need to allow some water to “pass through” from the Poulaphouca reservoir due to its “limited” storage, placing the towns of Clane and Newbridge under direct flood threat.",
    "image": "https://focus.independent.ie/thumbor/KKsjTA3T53aQEyvb9fbg4Wh-iGM=/0x14:800x547/629x0/prod-mh-ireland/96ecc8bd-16a5-43d4-b915-15fdd3650979/e86f7009-44f0-41d2-a030-dc665a7091ae/96ecc8bd-16a5-43d4-b915-15fdd3650979.jpg",
    "source": "The Irish Independent"
  },
  {
    "title": "FACT CHECK: Is playing in natural outdoor environments good for kids’ immune systems?",
    "desc": "Playing in dirt and exposure to everyday environmental microbes helps train a child's immune system, potentially reducing the future risk of allergies and asthma. Experts confirm this 'hygiene hypothesis' but stress that balanced exposure is key, and basic hygiene practices remain essential for safety.",
    "image": "https://www.theweek.in/content/dam/week/week/news/health/images/2026/1/29/babies-play-shutterstock-new.jpg",
    "source": "theweek.in"
  },
  {
    "title": "More than 200 killed after landslide hits miners extracting key smartphone mineral",
    "desc": "Heavy rain in the Democratic Republic of Congo leads to the collapse of mines used to extract coltan - used in phones, computers and aircraft engines.",
    "image": "https://e3.365dm.com/26/01/1600x900/skynews-coltan-congo_7150966.jpg?20260131093102",
    "source": "Sky News"
  }
]