[
  {
    "title": "'As if the world is breaking': Tampines residents woken up by traffic noise in the wee hours",
    "desc": "SINGAPORE – Like many of his neighbours, Tampines resident Abdul Razak Subahan is often jolted awake in the middle of the night by loud cars and motorcycles revving their engines along the roads that his flat overlooks.He said this happens almost every day in the wee hours.“It can be very painful... When you’re sleeping, it triggers you to wake up....",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/TPE%20construction.jpg?itok=H_MMIYIN",
    "source": "AsiaOne"
  },
  {
    "title": "Two-year ban imposed on rockpool harvesting north of Auckland",
    "desc": "The temporary closure — requested by Ngāti Manuhiri and backed by a rāhui — will prohibit taking most marine life from east coast rockpools from next month.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/people-gathering-sea-life-at-army-bay-on-the-whangaparaoa-pe-LSTFEGTWXFEYNMEJ5DWGWSAJVU.jpg?auth=f8e3cbcc090b1e5b1ea3d1e4813820a2f8a715cdf625beb4aa0055433398f9d5&quality=70&width=600&height=315&focal=427%2C174",
    "source": "1News"
  },
  {
    "title": "Daughter whose dad fought detainment as she battled cancer dies",
    "desc": "Ofelia Torres' story came to public attention after the teen's father was detained at a Home Depot in Niles.",
    "image": "https://www.chicagotribune.com/wp-content/uploads/2026/01/CTC-pulitzer-09.jpg?w=1024&h=742",
    "source": "Chicago Tribune"
  },
  {
    "title": "TB outbreak: Malaysia records 503 new cases",
    "desc": "KUALA LUMPUR: A total of 503 new tuberculosis (TB) cases were reported nationwide during the fifth epidemiological week.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/15/3771336.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "Domestic fuel supply rises as imports decline",
    "desc": "Nigeria's domestic fuel supply is increasing thanks to the Dangote Refinery's 40.1M litres/day output, reducing reliance on imports and boosting energy sec",
    "image": "https://cdn.punchng.com/wp-content/uploads/2023/03/29235447/download-2.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Brooklyn Peltz Beckham and Nicola Peltz Beckham: From Coachella meet-cute to married life in Beverly Hills’ luxurious condo",
    "desc": "This Valentine’s Day weekend, the limelight is on the couples who aren’t just making love look Instagram-worthy, but also weathering storms together t.",
    "image": "https://static.toiimg.com/thumb/msid-128368421,width-1280,height-720,imgsize-33880,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Shamed Andrew has paid Royal favours with ‘national scandal’",
    "desc": "Andrew Mountbatten Windsor is branded a liability for the Royal Family.The former Prince, who is demanded answers as his name constantly appears in Esptein files, cannot not be trusted over his...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-15/1392320_034459_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "Does Fiverr (FVRR) Still Justify Its Valuation Discount Amid Rising EPS Expectations and AI Hopes?",
    "desc": "Fiverr International recently saw a sharp shift in investor attention ahead of its now-past 18 February 2026 earnings release, with analysts expecting earnings per share to rise 18.75% year-on-year and maintaining a Hold (Zacks Rank #3) rating amid a valuation discount to the industry average. This mix of cautious analyst sentiment and higher earnings expectations has intensified interest in whether Fiverr’s evolving marketplace model and AI-driven services can support the profit trajectory...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/bba80cef4667ee8433810d7fbee032a7",
    "source": "Yahoo Finance"
  },
  {
    "title": "Young Africans embark on journey to own CAF approved stadium",
    "desc": "Tanzania Premier League champions Young Africans have launched a plan to built a stadium to host their matches, in the league, and the international stage.",
    "image": "https://www.panafricafootball.com/wp-content/uploads/2026/02/Yanga-SC-President-Hersi-Ally-Said-e1771121080128.jpg",
    "source": "Pan-Africa Football"
  },
  {
    "title": "Actress Reveals Terrifying Photos of Symptoms While Recovering From Surgery",
    "desc": "Back in January, actress Cha Joo Young announced that she would step back from official schedules while recovering from a procedure to treat epistaxis.",
    "image": "https://image.koreaboo.com/2026/02/Cha-Jooyoung-nosebleed-photos-fi.jpg",
    "source": "Koreaboo"
  }
]