[
  {
    "title": "Donald Trump RATTLED: 4 ways strongman act is over",
    "desc": "Donald Trump’s second term is rapidly unravelling, with dissent spreading beyond his critics to senior Republicans and furious MAGA voters - a collapse laid bare when he was heckled by his own supporters",
    "image": "https://i2-prod.mirror.co.uk/article36603835.ece/ALTERNATES/s1200/0_TOPSHOT-US-POLITICS-TRUMP.jpg",
    "source": "The Mirror"
  },
  {
    "title": "‘Where has this come from?!’: SEVEN NBL players ejected after ‘clear the benches-type brawl’",
    "desc": "‘Where has this come from?!’: SEVEN NBL players ejected after ‘clear the benches-type brawl’",
    "image": "https://content.api.news/v3/images/bin/010c0987b62c041310e4470f21a1538b",
    "source": "fox sports"
  },
  {
    "title": "Key to Women's Health: Stroke Care in Pregnancy",
    "desc": "Statement Highlights:\tA new scientific statement from the American Heart Association and endorsed by the American College of Obstetricians",
    "image": "https://iprsoftwaremedia.com/67/files/20239/6525a4793d6332305ce09937_0111PregnantWomenSocialDeterminants_SC/0111PregnantWomenSocialDeterminants_SC_hero.jpg",
    "source": "Mirage News"
  },
  {
    "title": "Uganda: Masaka Court Halts Kalungu East Vote Recount After Ballot Boxes Tampered With",
    "desc": "The Masaka Grade One Chief Magistrate's Court has halted the recount of votes for the Kalungu East parliamentary seat after discovering that five ballot boxes had been tampered with, raising serious doubts about the integrity of the recount exercise.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Randy Abbey can't differentiate between cocoa and pawpaw - Listowel Poku fires",
    "desc": "Listowel Nana Poku, a leading member of the pressure group Arise Ghana, has called on President John Dramani Mahama to immediately dismiss the Chief Executive Officer of the Ghana Cocoa Board (COCOBOD), Dr Randy Abbey, to ensure the survival of the...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/948/94832393.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Ex-Nigeria oil minister in bribery trial spent £2 million at Harrods",
    "desc": "More than £2m was spent at Harrods on behalf of a then-Nigerian oil minister accused of accepting bribes from industry figures interested in government contracts, a court in London has heard.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/977/97709747.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Amazon to axe another 16,000 corporate jobs",
    "desc": "Latest cuts will bring total number of lay-offs to 30,000 over past three months amid higher spending on AI",
    "image": "https://images.ft.com/v3/image/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F1f18eaa7-11cc-40e1-a692-8bb6fb7e36aa.jpg?source=next-article&fit=scale-down&quality=highest&width=700&dpr=1",
    "source": "Financial Times"
  },
  {
    "title": "Crash shuts down northbound Highway 410 in Brampton",
    "desc": "Northbound Highway 410 was fully closed through Brampton early on Wednesday after a serious multi‑vehicle collision.",
    "image": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2026/01/28/Brampton-collision.png",
    "source": "toronto.citynews.ca"
  },
  {
    "title": "Federal Reserve expected to hold interest rates steady, defying Trump",
    "desc": "The Federal Reserve is widely expected to defy the wishes of President Donald Trump, who has called for significantly lower interest rates.",
    "image": "https://i.abcnewsfe.com/a/fb413b31-a675-4a73-a296-9566773300fb/federal-reserve-gty-jt-241106_1730927231883_hpMain_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "President Taye Atske Selassie Receives Rotary International President",
    "desc": "President Taye Atske Selassie today received the President of Rotary International, Francesco Arezzo, at the National Palace.\nThe visit underscored the deep-rooted partnership between Ethiopia and Rotary International’s global network.\nDiscussions focused on key areas of cooperation, including health, education, and peacebuilding.\nArezzo also praised President Taye’s strong support, describing him as highly committed and a key partner in advancing Rotary’s mission in the country.\nThe President said discussions covered the long-standing work of Rotary in Ethiopia, particularly in polio eradication, peacebuilding, and other initiatives.\nHe emphasized that ending polio remains Rotary International’s top priority.\n“Finishing polio eradication is our final goal,” Arezzo said.\n“It is also a step toward peace, because every time we send a child to school, provide access to clean water, or protect the environment, these are all small but meaningful steps toward peace.”\nHe noted that Ethiopia has been one of the strongest-performing countries in Africa in implementing polio campaigns with high effectiveness and accuracy.\nHe emphasized that Ethiopia is polio-free and has successfully prevented outbreaks that affected parts of Africa in recent years.\nHe also described the containment of the Marburg virus as a major achievement, congratulating the Ethiopian government for its efforts.\nPresident Arezzo reaffirmed Rotary International’s commitment to strengthening peacebuilding efforts through its clubs in Ethiopia.\nBoth sides noted the shared vision between Ethiopia and Rotary International in promoting health, development, and peace, highlighting polio eradication as a common and unifying goal.\nRotary International is a global service organization with more than 46,000 clubs worldwide, working to provide humanitarian services, promote peace, and improve lives. In Ethiopia, local Rotary clubs operate in cities including Addis Ababa, Mekelle, Gondar, Jimma, and Awassa, implementing community-focused projects and partnering on initiatives related to health, clean water, and peacebuilding.",
    "image": "https://www.ena.et/documents/42142/0/rotary.jpg/ab047274-ec10-45a4-0f80-45b9b6fd5f20?version=1.0&t=1769596631881&download=true",
    "source": "ENA English"
  }
]