[
  {
    "title": "Comprehensive Map Of Radio Sky Published",
    "desc": "The LOFAR radio telescope has delivered the most detailed radio map of the northern sky to date. It provides new insights into active galaxies, star",
    "image": "https://www.uni-wuerzburg.de/fileadmin/_processed_/1/8/csm_0219KarteRadiohimmel-w_3924de2320.jpg",
    "source": "The National Tribune"
  },
  {
    "title": "Comprehensive Map Of Radio Sky Published",
    "desc": "The LOFAR radio telescope has delivered the most detailed radio map of the northern sky to date. It provides new insights into active galaxies, star",
    "image": "https://www.uni-wuerzburg.de/fileadmin/_processed_/1/8/csm_0219KarteRadiohimmel-w_3924de2320.jpg",
    "source": "Mirage News"
  },
  {
    "title": "US is planning to launch a website that may make governments across Europe quite angry, as it will allow Europeans to …",
    "desc": "Tech News News: The US government is reportedly planning to launch a website that will allow people in Europe and elsewhere to see content banned by their governments.",
    "image": "https://static.toiimg.com/thumb/msid-128548832,width-1280,height-720,imgsize-38394,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Vico Sotto files election overspending, perjury raps vs Discaya",
    "desc": "Pasig City Mayor Vico Sotto filed a complaint before the Commission on Elections on Thursday, February 19, against former mayoral candidate and embattled contractor Sarah Discaya, accusing her of overspending and perjury during the 2025 electoral campaign period.",
    "image": "https://media.philstar.com/photos/2026/02/19/vico-macalintal_2026-02-19_16-46-45.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Ethiopia: PM Abiy Highlights Gibe Dedesa Union As Value-Driven Agricultural Growth",
    "desc": "Prime Minister Abiy Ahmed has underscored what he described as a transformative shift in Ethiopia's agricultural sector, emphasizing that farmers are increasingly benefiting beyond primary production.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Former South Korean President Yoon receives life sentence for imposing martial law",
    "desc": "Former South Korean President Yoon Suk Yeol has been sentenced to life in prison for his brief imposition of martial law to suppress the opposition.",
    "image": "https://dims.apnews.com/dims4/default/2d27e92/2147483647/strip/true/crop/4301x2866+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F4d%2Ffe%2F00211c8977bf32bc43c389799d2f%2F0573cf88758d461091d585fb2cb7c74f",
    "source": "Associated Press News"
  },
  {
    "title": "Is MCX stock too expensive after doubling money in just 1 year? A CME case study explains it",
    "desc": "Multi Commodity Exchange of India shares surged over 100% driven by a bullion price rally. Following sharp corrections in gold and silver, exchanges increased margin requirements to curb volatility. While futures activity contracted, options trading picked up, mirroring past trends and raising questions about the stock's valuation.",
    "image": "https://img.etimg.com/thumb/msid-128548673,width-1200,height-630,imgsize-75217,overlay-etmarkets/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Mandalika Joins Singapore, Buriram, and Hanoi as Southeast Asian Sports Tourism Powerhouses Driving a Multi‑Million Dollar Travel Boom: Get All The Latest Information Here",
    "desc": "Southeast Asian destinations Mandalika, Singapore, Buriram and Hanoi leverage motorsport and events to drive sports tourism and sustainability.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/passenger-at-an-airport-with-foorball-in_OBW5pPIZSMiuuaYjDVjbSA_TLrW7evNSXmMBu81gN2K6A.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "Infinix Smart 20 launched in the Philippines",
    "desc": "It looks like Infinix has launched the Infinix Smart 20 in the Philippines. The device is now listed on Lazada...",
    "image": "https://www.yugatech.com/wp-content/uploads/2026/02/Infinix-Smart-20.jpg",
    "source": "YugaTech"
  },
  {
    "title": "British Gas owner Centrica's profits hit by warmer weather",
    "desc": "Savvy bill payers shopping around for fixed-tariff energy deals also dented earnings at British Gas.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/63b2/live/33baf060-0d75-11f1-b1f2-a50c2c5773ab.jpg",
    "source": "BBC"
  }
]