[
  {
    "title": "Toyota bets on four new electric SUVs to win over EV buyers",
    "desc": "With the new Highlander EV arriving later this year, Toyota will have a full lineup of electric SUVs. Toyota believes...",
    "image": "https://i0.wp.com/electrek.co/wp-content/uploads/sites/3/2026/02/Toyota-four-new-EVs.jpeg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "source": "Electrek"
  },
  {
    "title": "Margot Robbie, Jacob Elordi on Emerald Fennell's 'Wuthering Heights'",
    "desc": "\"Wuthering Heights\" director Emerald Fennell and stars Margot Robbie & Jacob Elordi on putting provocative spin on Emily Brontë's classic novel.",
    "image": "https://variety.com/wp-content/uploads/2026/02/MCDWUHE_WB043.jpg?crop=0px%2C79px%2C3000px%2C1688px&resize=1000%2C563",
    "source": "Variety"
  },
  {
    "title": "Ireland Under-20s edge out Italy in eight-try thriller",
    "desc": "The Ireland Under-20s bounced back from a heavy opening day defeat to France to record a thrilling 30-27 win over Italy at Virgin Media Park in Cork.",
    "image": "https://www.rte.ie/images/0023e461-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Canada police say mass shooter was 'hunting' for victims",
    "desc": "Canadian police have said that the perpetrator of a mass shooting this week who killed eight people was \"hunting\" but had no specific targets.",
    "image": "https://www.rte.ie/images/0023e44a-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "U.N. Condemns U.S. Measures Halting Oil Deliveries to Cuba",
    "desc": "The measures were installed last month by the Trump administration after the U.S. captured Nicolás Maduro and seized control of Venezuela’s oil industry.",
    "image": "https://static01.nyt.com/images/2026/02/13/multimedia/13int-cuba-oil-bwzm/13int-cuba-oil-bwzm-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Medcare Symposium Highlights Minimally Invasive Advances Transforming Brain, Spine & Orthopaedic Surgery",
    "desc": "News Desk DUBAI: Experts have highlighted a key shift in major ortho, brain and spine surgery, driven by advances in minimally invasive and microsurgical techniques that are dramatically reducing pain, hospital stays, and long-term disability, according to specialists speaking at the latest edition of the Medcare Orthopaedics & Spine Symposium. Doctors noted that procedures once …",
    "image": "https://www.biztoday.news/wp-content/uploads/2026/02/IMG-20260213-WA0128.jpg",
    "source": "Biz Today"
  },
  {
    "title": "Federal officers may have lied about shooting of migrant in Minneapolis, officials say",
    "desc": "ICE chief Todd Lyons says the two officers were immediately placed on administrative leave.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5e24/live/11e37690-091c-11f1-a919-a96c5a4ca48c.jpg",
    "source": "BBC"
  },
  {
    "title": "New Dublin hotel receives public backlash for seeking injunction against bar next door over noise levels",
    "desc": "The news was met with outrage by many people who shared their opinions online.",
    "image": "https://img2.thejournal.ie/article/6956822/river/?height=400&version=6956904",
    "source": "The Journal"
  },
  {
    "title": "Canada confirms 35 EVs eligible for new rebate program",
    "desc": "The Canadian government has released the first official list of electric vehicles (EVs) eligible for its new Electric Vehicle Affordability Program (EVAP), which officially begins February 16, 2026. The list provides Canadians with their first […]",
    "image": "https://driveteslacanada.ca/wp-content/uploads/2026/02/evs-1024x683.png",
    "source": "driveteslacanada.ca"
  },
  {
    "title": "Valentine’s Season Shock as Viral Video Raises Privacy and Moral Concerns",
    "desc": "By KPC Reporter",
    "image": "https://kisiipressclub.co.ke/wp-content/uploads/sites/33/2026/02/IMG_20260214_003842-1.jpg",
    "source": "Kisii Press Club"
  }
]