[
  {
    "title": "Reddit Mod Deleted Breathtaking Photo Taken by NASA Astronaut From Space Because It Was \"Blurry\"",
    "desc": "A moderator at the r/aviation subreddit didn't look too kindly on a shot by astronaut Don Pettit, deeming it too \"blurry\" and taking it down.",
    "image": "https://futurism.com/wp-content/uploads/2026/02/reddit-deleted-photo-nasa-astronaut-blurry.jpg?w=1200",
    "source": "Futurism"
  },
  {
    "title": "Ricky Martin Writes Open Letter to Bad Bunny After Grammy Victory: ‘You Won by Staying True to Puerto Rico’",
    "desc": "The pop icon published his heartfelt letter in the Puerto Rican newspaper El Nuevo Día.",
    "image": "https://s.yimg.com/ny/api/res/1.2/QcU1bLk7ygfcU.X1SZNdQw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/billboard_547/cc440ea2b599bbf77f17b7882f2ee822",
    "source": "Yahoo"
  },
  {
    "title": "Toronto Argonauts release two-time All-CFL linebacker Wynton McManis",
    "desc": "The Toronto Argonauts have released pending CFL free agent linebacker Wynton McManis. The 31-year-old missed five regular-season games in 2025 but still had",
    "image": "https://cdn.3downnation.com/wp-content/uploads/2025/10/MG_7438trim-scaled.jpg",
    "source": "3DownNation"
  },
  {
    "title": "Act of Squad: Warriors predicted team and 2026 overview",
    "desc": "While the Warriors re-entered the finals last season, they were unable to produce their best form with major injuries curtailing their promising push to end their premiership drought.",
    "image": "https://www.nrl.com/contentassets/5aedffe97b8a41a581b62b1ca40cb0a5/79313318_tuivasa-sheckr-celebration-250823_cd_8444_2025823172420.jpg?center=0.514%2C0.483&preset=share",
    "source": "NRL.com"
  },
  {
    "title": "The Nugent score is an inappropriate diagnostic tool for neovaginal bacteria in transfeminine people",
    "desc": "Many transfeminine people (assigned male at birth with feminine gender identities) undergo vaginoplasty, a surgical procedure constructing a neovagina, typically using penile and scrotal tissue. In cisgender females, gynecological symptoms (pain, discharge, malodor) are often attributed to bacterial vaginosis, which can be diagnosed using Nugent scoring of gram-stained vaginal smears. The Nugent score assesses the abundance of large gram-positive rods versus small or curved gram-variable rods, traditionally for the detection of Lactobacillus, Gardnerella vaginalis, and Mobiluncus, respectively. Although unvalidated, this method is frequently applied to neovaginal samples to diagnose gynecological symptoms and dysbiosis. This study assessed the Nugent score’s utility for diagnosing neovaginal dysbiosis in transfeminine people. As a part of the TransBiota study, n = 39 transfeminine participants self-collected neovaginal smears. Smears were Gram stained and Nugent scored, and scores were correlated with data on neovaginal bacterial composition (16S rRNA gene sequencing), neovaginal cytokines (Luminex multiplex immunoassay), and self-reported symptoms. We show more than 70% of neovaginal smears fell in the 7-10 Nugent score range, indicative of Bacterial Vaginosis in cisgender women. However, scores fail to correlate with the abundance of Nugent-targeted bacteria. Bacteria with similar morphotypes, but not belonging to Lactobacillus, Gardnerella, or Mobiluncus, are highly abundant and prevalent in the neovagina. Nugent score also fails to predict local inflammation or clinical symptoms. The Nugent score is not an effective tool to identify neovaginal dysbiosis or indicators of health in transfeminine individuals. Clinicians need the development of accurate, evidence-based diagnostic tools for the neovagina. Many transfeminine people undergo vaginoplasty, which creates a vagina (neovagina) from penile tissue. In cisgender women, vaginal symptoms like pain, discharge, or malodor are caused by bacterial imbalance. This can be diagnosed using the Nugent score, which counts bacteria of specific shapes under a microscope. We examined whether this test also works in neovaginas. Data on neovaginal bacteria, inflammation, and symptoms was collected from 39 transfeminine people. The bacteria the Nugent score was designed to detect were rarely present, yet most participants received a score that would indicate bacterial imbalance in cisgender women. These scores also did not align with symptoms or inflammation, showing that the Nugent score is not reliable for neovaginas. Neovagina-specific diagnostic tools are needed to help transfeminine people and clinicians accurately understand and manage neovaginal symptoms. Parmar et al. assess the Nugent score as a diagnostic tool for neovaginal dysbiosis in transfeminine people with vaginoplasty. Nugent targeted taxa are found to be rare in the neovagina, and Nugent score does not correlate with neovaginal inflammation or symptoms, highlighting the need for neovagina-specific, evidence-based diagnostic tools.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Beijing’s hands may be tied as US scores win in Panama Canal ports ruling",
    "desc": "A recent Panama Canal court ruling, favouring the US over China in port control, threatens to disrupt fragile US-China relations, with Beijing having limited options. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/cb27ab710b4a05d11a2a9a54e94ef4b05e6ec0a84d91d8eebeac8d6948482338",
    "source": "The Straits Times"
  },
  {
    "title": "Elon Musk is merging SpaceX and xAI to build data centers in space - or so he says",
    "desc": "Elon Musk says he’s merging SpaceX with xAI to build data centers in space. But the billionaire has been known to combine profitable companies with debt-ridden, unprofitable ones.",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/chorus/uploads/chorus_asset/file/22498394/1229892421.jpg?quality=90&strip=all&crop=0%2C12.364070075844%2C100%2C75.271859848313&w=1200",
    "source": "The Verge"
  },
  {
    "title": "AMGEN REPORTS FOURTH QUARTER AND FULL YEAR 2025 FINANCIAL RESULTS",
    "desc": "/PRNewswire/ -- Amgen (NASDAQ: AMGN) today announced financial results for the fourth quarter and full year of 2025 versus the comparable periods in 2024....",
    "image": "https://mma.prnewswire.com/media/213782/AMGEN_LOGO_V1.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "Sam Altman Expects to Get What He Wants",
    "desc": "He wants you to have AI whether you want it or not.",
    "image": "https://gizmodo.com/app/uploads/2026/01/shutterstock_2672751937-1200x675.jpg",
    "source": "Gizmodo"
  },
  {
    "title": "How Japan’s First Female Leader Won Over Disillusioned Young Voters",
    "desc": "From viral handbags to selfies with world leaders, Sanae Takaichi's social savvy is paying off with the youth. That popularity will be put to the test in Japan’s upcoming lower-house election.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iVD4Ggob1V.s/v1/1200x800.jpg",
    "source": "Bloomberg.com"
  }
]