[
  {
    "title": "Liza Minnelli's Memoir Unpacks Viral 2022 Oscars Moment With Lady Gaga",
    "desc": "In her new memoir, 'Kids, Wait Til You Hear This,' Lisa Minnelli describes what really happened during her viral moment with Lady Gaga at 2022 Oscars.",
    "image": "https://www.billboard.com/wp-content/uploads/2026/02/1388094804-e1771602442511.jpg?w=1024",
    "source": "Billboard"
  },
  {
    "title": "Trump's sweeping global tariffs struck down by US Supreme Court",
    "desc": "The Supreme Court rules with a 6-3 majority that Trump exceeded his authority when he imposed tariffs via a law reserved for national emergencies.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8240/live/63755a70-0e6f-11f1-a7d2-13765adb9f56.jpg",
    "source": "BBC"
  },
  {
    "title": "Crookhaven trailer offers exciting sneak peek at brand new high-stakes drama",
    "desc": "Crookhaven is made by BBC Studios Kids & Family for the BBC with support from Northern Ireland Screen.",
    "image": "https://ichef.bbci.co.uk/images/ic/1920x1080/p0n287mz.jpg",
    "source": "BBC"
  },
  {
    "title": "Women's Curling Semifinals: USA to play for bronze after loss to Switzerland; Swiss to face Sweden in gold medal game",
    "desc": "The U.S. women's curling team fell to Switzerland in the semifinals on Friday, and will now play Canada in the bronze medal match. With wins on Friday, Switzerland and Sweden will face off for the gold medal.",
    "image": "https://images.nbcolympics.com/sites/default/files/2026-02/1920x1080%20-%20curling%20-%20WUSA9.jpg",
    "source": "NBC Olympics"
  },
  {
    "title": "Daniel Radcliffe admits to being self conscious while filming 'Harry Potter' in late teens",
    "desc": "Daniel Radcliffe has opened up about the insecurities he faced while filming the Harry Potter franchise during his late teens.While appearing on First We Feast's Hot Ones, the actor reflected on how...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-20/1393038_094152_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "\"It needs to cooperate fairly, and it's clearly not.\" Why Valve is facing a £656m day in the UK courts",
    "desc": "Digital safety campaigner Vicki Shotbolt explains why she is at the forefront of a lawsuit against the PC games market's biggest player",
    "image": "https://assetsio.gnwcdn.com/steam-regional-pricing.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "source": "GamesIndustry.biz"
  },
  {
    "title": "Chromosome 1q Duplication Linked to Pancreatic Cancer",
    "desc": "Researchers at the Johns Hopkins Kimmel Cancer Center and its Ludwig Center uncovered new evidence that extra copies of a specific chromosome segment",
    "image": "https://www.hopkinsmedicine.org/-/media/news/images/valerie-stock-teaser.jpg",
    "source": "Mirage News"
  },
  {
    "title": "US Supreme Court rejects Trump's sweeping global tariffs",
    "desc": "The US Supreme Court has ruled that President Donald Trump exceeded his authority in imposing a swath of tariffs that upended global trade, blocking a key tool the president has wielded to impose his economic agenda.",
    "image": "https://www.rte.ie/images/00223429-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Court battle erupts over NACADA recruitment, process halted",
    "desc": "Petitioner argues that the recruitment process is unconstitutional and discriminatory.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/0f5dafc5-0e7f-43aa-8673-abf8e500b798.jpeg?1771606897133",
    "source": "the-star.co.ke"
  },
  {
    "title": "Metastasis-Directed Therapy in Oligometastatic Prostate Cancer",
    "desc": "In an individual patient data meta-analysis (WOLVERINE) reported in The Lancet Oncology, Tang et al found that the addition of metastasis-directed therapy to standard of care was associated with benef...",
    "image": "https://ascopost.com/media/14014930/prostate-cancer-bayer-image-215x120.jpg",
    "source": "The ASCO Post"
  }
]