[
  {
    "title": "Inside Parties With J Balvin, Diplo & More",
    "desc": "Green Day, J Balvin, Travis Scott and many other stars attended 2026 Super Bowl parties in San Francisco. See the photos.",
    "image": "https://www.billboard.com/wp-content/uploads/2026/02/eladio-carrion-diplo-j-balvin-cr-getty-images-press-billboard-1800.jpg?w=1024",
    "source": "Billboard"
  },
  {
    "title": "It's clear Social Democrats see themselves in growth mode",
    "desc": "At their party conference it was clear the Social Democrats see themselves in growth mode.The by-elections in May will be the first test to show if the electorate agrees.",
    "image": "https://www.rte.ie/images/0023dcbb-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "England 48-7 Wales: Hosts focus on fine-tuning after big win",
    "desc": "Steve Borthwick has the pleasure of nit-picking through fine details after his England side swat aside Wales in their Six Nations opener.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e79b/live/7c69cd80-0466-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  },
  {
    "title": "Nedbank Cup Wrap: Sekhukhune United join Orlando Pirates and Mamelodi Sundowns in the Round of 16 as Kaizer Chiefs duo combine to seal Casric Stars win",
    "desc": "The weekend was highlighted by the Sea Robbers' huge win against Tshakhuma Tsha Madzivhandila at the Moses Mabhida Stadium in Durban. Teams continue chasing the CAF Confederation Cup ticket by winning the annual competition. There will be a new champion as holders Kaizer Chiefs were eliminated by Stellenbosch.",
    "image": "https://assets.goal.com/images/v3/bltc750cd0ddf7dd7a5/Manqoba%20Ozoemena,%20Kaizer%20Chiefs.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Ohio Man Is Charged With Threatening to Kill JD Vance",
    "desc": "During the investigation, the man was found to have child sex abuse materials on his phone, federal prosecutors said.",
    "image": "https://static01.nyt.com/images/2026/02/07/multimedia/07xp-vance-mfvg/07xp-vance-mfvg-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Assessing RPC (RES) Valuation After A Weaker Quarter And Earnings Miss",
    "desc": "Why RPC (RES) is back in focus after its latest earnings RPC (RES) is back on investors' radar after reporting a fourth quarter net loss that missed expectations, with weaker revenues, seasonal softness and an accounting change weighing on results despite solid liquidity. See our latest analysis for RPC. At a share price of $5.77, RPC has seen a 6.46% 1 day share price return after earnings, while the 1 year total shareholder return of 2.48% and 3 year total shareholder return of 35.48%...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/92d26d55968bddf376addae5e476c381",
    "source": "Yahoo Finance"
  },
  {
    "title": "BTC is seeing accumulation across all cohorts, according to Glassnode",
    "desc": "Glassnode data is showing buying across all cohorts of bitcoin holders.",
    "image": "https://cdn.sanity.io/images/s3y3vcno/production/7271f4449aede8677c1ba74eab1b7e7175486e48-1338x536.png?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "source": "CoinDesk"
  },
  {
    "title": "Sam Raimi Says Rachel McAdams Was 'Underutilized' In 'Doctor Strange'",
    "desc": "Sam Raimi says Rachel McAdams was 'underutilized' in 'Doctor Strange in the Multiverse of Madness,' which led him to cast her in 'Send Help.'",
    "image": "https://variety.com/wp-content/uploads/2026/01/MCDSEHE_H3009-e1769610275829.jpg?crop=0px%2C19px%2C1000px%2C562px&resize=1000%2C563",
    "source": "Variety"
  },
  {
    "title": "EU-backed network to probe genocide, war crimes in West Africa",
    "desc": "The European Union Agency for Criminal Justice Cooperation​ (Eurojust) is actively supporting the probe of serious human rights violations and summary",
    "image": "https://dailypost.ng/wp-content/uploads/2025/09/dreamstime_s_132267393.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "These Game Boy, DS, 3DS, GameCube, Wii, and Wii U games sold exactly 1 copy each in the U.S. in 2025",
    "desc": "New data has been released that reveals games that sold exactly one unit in the United States during 2025 on older Nintendo platforms. Wii U is the newest of the bunch, but this stretches all the way back to the Game Boy. The full list is as follows: Game Boy GB Boxing GBA Legend of Spyro: A New Beginning GBA...",
    "image": "https://nintendoeverything.com/wp-content/uploads/Games-that-sold-1-copy-in-2025.jpg",
    "source": "Nintendo Everything"
  }
]