[
  {
    "title": "Tournament of Champions: Lottie Woad shares lead with Lydia Ko",
    "desc": "England's Lottie Woad hits a three-under-par 69 on day two of the Tournament of Champions to share the lead with three-time major winner Lydia Ko.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2df/live/afab2350-fe2c-11f0-953d-3d953efb5806.jpg",
    "source": "BBC"
  },
  {
    "title": "The TV industry finally concedes that the future may not be in 8K",
    "desc": "With virtually no content and limited benefits, 8K TVs were doomed.",
    "image": "https://cdn.arstechnica.net/wp-content/uploads/2026/01/Desktop_01-1-1152x648-1769809194.jpg",
    "source": "Ars Technica"
  },
  {
    "title": "‘Bridgerton’ Season 4 Star Katie Leung On Araminta's Influence",
    "desc": "'Harry Potter' actress Katie Leung opened up about playing an antagonist role in Season 4 Part 1 of 'Bridgerton,' teasing what is in store for Part 2.",
    "image": "https://deadline.com/wp-content/uploads/2025/02/BRIDGERTON_401_Unit_04462R.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Anti-ICE protests take place nationwide following fatal shootings in Minneapolis",
    "desc": "Protesters across the U.S. called for \"no work, no school, no shopping\" as part of a nationwide strike to oppose the Trump administration's immigration crackdown.",
    "image": "https://i.abcnewsfe.com/a/d12ac2c8-d2db-406a-9f2d-5f053864a6f1/ice-protest-2-gty-gmh-260130_1769810312461_hpMain_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Ditch monthly cloud fees with this secure Dropbox alternative for $99.97",
    "desc": "Internxt offers a secure Dropbox alternative with 2TB of end-to-end encrypted cloud storage for life — now $99.97, no monthly fees required.",
    "image": "https://helios-i.mashable.com/imagery/articles/01oKbuRozqGO1T8QpkSed9I/hero-image.fill.size_1200x675.v1769722125.jpg",
    "source": "Mashable"
  },
  {
    "title": "Artificial Intelligence News for the Week of January 30; Updates from Fujitsu, NVIDIA, VDURA & More",
    "desc": "Solutions Review Executive Editor Tim King curated this list of notable artificial intelligence news for the week of January 30, 2026.",
    "image": "https://solutionsreview.com/wp-content/uploads/2026/01/Artificial-Intelligence-2026-01-30.jpg",
    "source": "solutionsreview.com"
  },
  {
    "title": "Rashid sees Zii Jia’s tough run over four tournaments as part of comeback journey",
    "desc": "PETALING JAYA: Lee Zii Jia set out January determined to find his footing on the international stage, lining up four tournaments in quick succession to measure his progress.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/31/3747285.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "Privileged File System Vulnerability Present in a SCADA System",
    "desc": "We detail our discovery of CVE-2025-0921. This privileged file system flaw in SCADA system Iconics Suite could lead to a denial-of-service (DoS) attack.",
    "image": "https://unit42.paloaltonetworks.com/wp-content/uploads/2026/01/06_Vulnerabilities_1920x900-2-1.jpg",
    "source": "Unit 42"
  },
  {
    "title": "'Sinners' Cinematographer Autumn Durald Arkapaw on Buddy Guy's Cameo",
    "desc": "'Sinners' Cinematographer Autumn Durald Arkapaw on filming Buddy Guy's cameo, her favorite shot and reuniting with Ryan Coogler for \"The X-Files.\"",
    "image": "https://variety.com/wp-content/uploads/2026/01/GRC-13324.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Fresh ang pow notes: Why tradition endures - and where Malaysians can get them this Chinese New Year",
    "desc": "KUALA LUMPUR, Jan 31 — Despite the growing push for digital red packets and e-wallet transfers, Malaysians continue to favour physical ang pow — especially crisp new banknotes...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/01/30/322926.jpg",
    "source": "Malay Mail"
  }
]