[
  {
    "title": "DepEd urged to push P50,000 entry-level pay for teachers",
    "desc": "The Department of Education (DepEd) faces renewed calls from the Alliance of Concerned Teachers (ACT) Philippines to champion a P50,000 entry-level salary for...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/06/77357.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Life with epilepsy: 'It looked like my daughter was having a stroke'",
    "desc": "Signs of epilepsy vary according to the condition, and it doesn’t always involve loss of consciousness or shaking of the limbs, as Aisling Allan discovered when her daughter had a seizure",
    "image": "https://www.irishexaminer.com/cms_media/module_img/9918/4959341_4_seoimageog_CMK27012026_Aisling_Bonnie_20Allan_20Epilepsy_009.jpg",
    "source": "Irish Examiner"
  },
  {
    "title": "Canada and France to open Greenland consulates after Trump demands",
    "desc": "The moves were planned before Trump said he wanted the Arctic island but they are being seen as a show of solidarity with Greenlanders.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bdcd/live/5b0754a0-02d6-11f1-818d-6b893d658ff1.jpg",
    "source": "BBC"
  },
  {
    "title": "The difference makers: Five players who could decide the Nedbank Cup last-32 weekend",
    "desc": "The Nedbank Cup has a reputation for drama, upsets, and unlikely heroes. As clubs across divisions collide this weekend, individual quality could again be the difference between survival and heartbreak. Here are five players to keep a close eye on as the country’s premier knockout competition resumes.   Relebohile Mofokeng [...]",
    "image": "https://image-prod.iol.co.za/16x9/800?source=https://iol-prod.appspot.com/image/2d64db8947c7154bed52de329616254280527b71/1593&operation=CROP&offset=0x345&resize=1593x896",
    "source": "Magic 828"
  },
  {
    "title": "Monitoring beefed up to close illegal cigarette factories",
    "desc": "PHILIPPINE National Police (PNP) chief General Jose Melencio Nartatez Jr. vowed to intensify the agency’s intelligence operations to locate and shut...",
    "image": "https://media.assettype.com/sunstar%2F2026-01-21%2Ferecaqrv%2FSmuggled-cigarettes.jpg?rect=0%2C23%2C750%2C394&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "SunStar Publishing Inc."
  },
  {
    "title": "Michael Flatley's show went ahead after a long, bitter legal saga - here's what it was like",
    "desc": "By hook and by crook, the show finally returned last night on the 3Arena stage.",
    "image": "https://img2.thejournal.ie/article/6948895/river/?height=400&version=6948989",
    "source": "The Journal"
  },
  {
    "title": "Six Nations 2026: Can England's evolving attack bring them title?",
    "desc": "BBC Sport crunches the numbers to see if greater ambition in attack can secure England a Six Nations title.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f2a6/live/cc9dfad0-feb0-11f0-9972-d3f265c101c6.png",
    "source": "BBC"
  },
  {
    "title": "Airtel Uganda Invests in Future Leaders Through Tech Fellowship",
    "desc": "The fellowship is aimed at empowering some of Uganda’s brightest young minds by providing them with opportunities to pursue their aspirations while contributing meaningfully to their communities, the country, and the African continent.",
    "image": "https://techafricanews.com/wp-content/uploads/2026/02/airtel-10.png",
    "source": "TechAfrica News"
  },
  {
    "title": "T20 World Cup: Predictions for the tournament from Test Match Special team",
    "desc": "Who will win? Who will be the top run-scorers and wicket-takers? The Test Match Special team make their T20 World Cup predictions.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d9b6/live/3392ba60-01ad-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  },
  {
    "title": "AFL Latest: Merrett reportedly in contract talks; Crows defender Keane stretchered off at training",
    "desc": "Shock report on Merrett contract talks; star’s worst injury fears confirmed — AFL Latest",
    "image": "https://content.api.news/v3/images/bin/b773a57727ee795142a047b033a04965",
    "source": "foxsports.com.au"
  }
]