[
  {
    "title": "Meet Bavariscyllium: This 25-centimetre shark that lived 150 million years ago forced scientists to re-think shark evolution",
    "desc": "A remarkably preserved 150-million-year-old shark fossil is forcing researchers to reconsider how modern sharks evolved. The species, Bavariscyllium, displays a mix of features that do not align with today’s major shark groups.",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260219094818_Shark-fossil-.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "Airbus says engine shortages are holding back plans to build more planes",
    "desc": "Aircraft maker blames supplier Pratt & Whitney for paring back output target as it tries to meet surging demand",
    "image": "https://images.ft.com/v3/image/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2Ffbddf998-7c85-413f-ac15-a32936db6907.jpg?source=next-article&fit=scale-down&quality=highest&width=700&dpr=1",
    "source": "Financial Times"
  },
  {
    "title": "PCG recommends cases vs Amejara owner, captain",
    "desc": "DAVAO CITY – The Philippine Coast Guard District Southeastern Mindanao (CGDSEM) has recommended the filing of multiple homicide charges against the owner and...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/19/80469.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Today's Top 3 News: Northern Lights in US States, SEAblings vs. Knetz Online Battle",
    "desc": "Here is the list of the top 3 news on Tempo English today.",
    "image": "https://statik.tempo.co/data/2025/04/08/id_1390225/1390225_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "El-Rufai Is In Our Custody - ICPC",
    "desc": "El-Rufai Is In Our Custody — ICPC",
    "image": "https://www.channelstv.com/wp-content/uploads/2022/07/El-Rufai.jpg",
    "source": "Channels Television"
  },
  {
    "title": "Thai cops go undercover as lion dancers to nab suspected thief",
    "desc": "BANGKOK: Thai police donned a lion dance costume during this week's Lunar New Year festivities to arrest a suspect accused of stealing about $64,000 worth of Buddhist artefacts, police said Thursday (Feb 19).",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/19/3777005.jpg",
    "source": "The Star"
  },
  {
    "title": "South Korea's ex-president Yoon receives life sentence for imposing martial law",
    "desc": "Yoon Suk Yeol fell from office after an ill-advised attempt to overcome an opposition-controlled legislature by declaring martial law and sending troops to surround the legislature on Dec. 3, 2024.",
    "image": "https://i.cbc.ca/ais/6a0e94a4-09a3-4462-a79a-55f6d6a7765f,1771488454311/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C99%2C5000%2C2812%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "South Korea’s ex-president jailed for life for masterminding an insurrection",
    "desc": "Yoon Suk Yeol was impeached and indicted for declaring martial law in 2024.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/08f8/live/02977510-0caa-11f1-be0b-7bd43c95266e.jpg",
    "source": "BBC"
  },
  {
    "title": "president jailed for life over martial law attempt",
    "desc": "Yoon Suk Yeol's December 2024 martial law bid fundamentally damaged South Korea's democracy, a judge told the court.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ab04/live/3ed0c190-0d71-11f1-b1f2-a50c2c5773ab.jpg",
    "source": "BBC"
  },
  {
    "title": "CANEX Creations Inc. Invests in Feature Film Clarissa, Acquired for Worldwide Distribution by NEON",
    "desc": "Cairo, Egypt — 19 February 2026 CANEX Creations Inc. (CCInc), the intellectual property investment subsidiary backed by Afreximbank’s Fund for Export Development in Africa (FEDA), today announced its investment in the feature film Clarissa, a Nigerian-produced drama directed by twin filmmakers Arie and Chuko Esiri. The film has been acquired for worldwide distribution by NEON,",
    "image": "https://www.afreximbank.com/wp-content/themes/afrexim/assets/favicons/favicon-32x32.png",
    "source": "African Export-Import Bank"
  }
]