[
  {
    "title": "Zyxel Issues Urgent Security Warning Over Critical Router Vulnerability",
    "desc": "Taiwanese networking manufacturer Zyxel has issued a critical security advisory after uncovering a severe vulnerability affecting a wide range of its networking devices, including routers, fiber terminals, and wireless extenders. The flaw, which could allow attackers to remotely execute commands on",
    "image": "https://media.licdn.com/dms/image/v2/D5612AQGcshImHqP5pw/article-cover_image-shrink_600_2000/B56ZyVkQMCIIAQ-/0/1772035837739?e=2147483647&v=beta&t=-tl8Ei4i7m-spgDz4txbFNpHrrsGlNkvtyg7xgtJRck",
    "source": "LinkedIn"
  },
  {
    "title": "F.B.I. Raids Home of L.A.U.S.D. Chief Alberto Carvalho and School District Offices",
    "desc": "The investigation’s target was unclear. The school district is the nation’s second largest, and as superintendent, Alberto Carvalho has one of the highest-profile jobs in K-12 education.",
    "image": "https://static01.nyt.com/images/2026/02/25/multimedia/25nat-la-schools-mlvh/25nat-la-schools-mlvh-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Just Published! Pixie Littlefield's Journey Celebrates Neurodiversity and Imagination",
    "desc": "Pixie Littlefield's enchanting journey, published by Palmetto Publishing, inspires young readers to embrace neurodiversity, creativity, and emotional resilience through whimsical storytelling.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/26/951475.png",
    "source": "The Manila Times"
  },
  {
    "title": "1 person dead in avalanche near Pemberton, B.C.",
    "desc": "RCMP say the individual was skiing near the Anniversary Glacier, about 50 kilometres northeast of Whistler, B.C. A search and rescue team have located the deceased and the recovery is ongoing.",
    "image": "https://i.cbc.ca/ais/f652d298-004d-4331-8986-0892ff68df55,1772044320151/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C535%2C5712%2C3213%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Ghana's cocoa buyers owe banks up to $750 million, raising fresh liquidity risks",
    "desc": "Ghana's licensed cocoa buyers owe banks as much as $750 million, the association that represents them said, leaving the financial sector starved of cash for bean purchases at a time when lenders are...",
    "image": "https://cdn.zonebourse.com/static/resize/0/0//images/reuters/2026-02/2026-02-25T181223Z_1_LYNXMPEM1O116_RTROPTP_4_GHANA-COCOA-BANKS.JPG",
    "source": "marketscreener.com"
  },
  {
    "title": "Bloem to welcome back Boks",
    "desc": "Free State Stadium is eligible to host Springbok Test matches again.",
    "image": "https://www.sarugbymag.co.za/wp-content/uploads/2026/02/Free-State-Stadium-e1772042556621.jpg",
    "source": "SA Rugby magazine"
  },
  {
    "title": "Deadly bird flu found in California elephant seals for the first time",
    "desc": "Researchers at UC Davis say news they've dreaded since 2023 has come to pass: California's elephant seals have been infected with H5N1 bird flu.",
    "image": "https://ca-times.brightspotcdn.com/dims4/default/f43b652/2147483647/strip/true/crop/3600x1890+0+326/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fa2%2F7c%2Fd1a5876f4494be952f796b685060%2Fla-photos-1staff-767426-me-big-sur-33-brv.jpg",
    "source": "Los Angeles Times"
  },
  {
    "title": "Who are the reserve drivers for each F1 team in 2026?",
    "desc": "Teams need to be prepared to adapt to every scenario, including the possibility that one of their main drivers could fall ill or sustain an injury that rules them out of a race weekend. With every result proving crucial, their roster of reserve drivers must be ready to step in at the last second, so who has each team trusted that responsibility to?",
    "image": "https://media.formula1.com/image/upload/c_lfill,w_2048/q_auto/v1740000000/fom-website/2026/Miscellaneous/16x9%20single%20image%20-%202026-02-25T180407.469.webp",
    "source": "F1 - The Official Home of Formula 1® Racing"
  },
  {
    "title": "Loblaw continues pivot to discount as shoppers demand value",
    "desc": "Loblaw Cos. Ltd. continues to lean into discount stores and private label products as consumers relentlessly hunt for value.",
    "image": "https://s.yimg.com/ny/api/res/1.2/__1JVrXJyL7_xqyj2ETUOg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/cp_finance_889/6e45fee01324605336b432095acf80d8",
    "source": "Yahoo! Finance Canada"
  },
  {
    "title": "Chief Rabbinate gains authority over Kotel in new bill",
    "desc": "The bill passed by a margin of 56-47 and will now be discussed in Knesset committee meetings. It will still need to undergo three more plenum readings to become a law.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/707643",
    "source": "The Jerusalem Post"
  }
]