[
  {
    "title": "COSAFA: Zambia coach heaps praise on players after Botswana win",
    "desc": "Zambia women’s national team assistant coach Charles Haalubono says the Copper Queens started the COSAFA title defense the right way with a 3-0 win over",
    "image": "https://www.panafricafootball.com/wp-content/uploads/2026/02/Zambia-vs-Botswana-e1771561825831.jpg",
    "source": "Pan-Africa Football"
  },
  {
    "title": "Everyday kitchen staple hailed 'best medicine in the world'",
    "desc": "A medical herbalist has hailed it as 'one of the best medicines around' for heart health - but experts say moderation is key.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/11/1200x630/6752313.jpg",
    "source": "Express.co.uk"
  },
  {
    "title": "Car crashes into SBS Transit bus along Upper Changi Road North after beating red light",
    "desc": "A 33-year-old car driver crashed head-on into an SBS Transit bus after running a red light along Upper Changi Road North on Feb 14. Dashcam footage of the accident posted on Facebook on Tuesday (Feb 17) by SGRV Admin shows a silver Honda civic speeding past a red light. An SBS Transit bus service 5 was making a right turn...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/honda-civic-crash-sbs-tranist-bus.jpg?itok=aam_dxa7",
    "source": "AsiaOne"
  },
  {
    "title": "Police hunt illegal fireworks seller after Segamat blast costs man his leg",
    "desc": "JOHOR BAHRU, Feb 20 — Police are tracking down a fireworks vendor believed to have sold prohibited materials that caused a 32-year-old man to lose his left leg while lighting...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/20/326286.JPG",
    "source": "Malay Mail"
  },
  {
    "title": "FiiO DM15 R2R CD player review: Long live physical media",
    "desc": "With the extremely versatile FiiO DM15 R2R CD player, op shops become a treasure trove of great and affordable music.",
    "image": "https://www.gadgetguy.com.au/wp-content/uploads/2026/02/FiiO-DM15-R2R-connected-to-headphones.jpg",
    "source": "GadgetGuy"
  },
  {
    "title": "Murray: I was disappointed Rassie left",
    "desc": "Former Munster and Ireland scrumhalf Conor Murray admits he wonders what might have been had Rassie Erasmus stayed in Limerick a little longer.",
    "image": "https://www.sarugbymag.co.za/wp-content/uploads/2024/02/853659354-e1707630215779.jpg",
    "source": "SA Rugby magazine"
  },
  {
    "title": "Darwin prisoner Clinton Daylight found, returned to custody two days after being freed from jail by mistake",
    "desc": "A 52-year-old inmate who was mistakenly released from the Darwin Correctional Centre two months before his sentence was due to end, due to an \"administration error\" by prison staff, has been found following a police search.",
    "image": "https://live-production.wcms.abc-cdn.net.au/625e2b11194ff6197f7bb67a54eb01cf?impolicy=wcms_watermark_news&cropH=424&cropW=754&xPos=0&yPos=126&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Neepawa medical clinic flagged as measles exposure site",
    "desc": "Breaking News, Sports, Manitoba, Canada",
    "image": "https://www.brandonsun.com/wp-content/uploads/sites/3/2025/05/MEASLES-CELL.jpg?w=1600",
    "source": "Brandon Sun"
  },
  {
    "title": "'Stay in own lane': French President Macron tells Italian PM Meloni to 'stop commenting on other countries'",
    "desc": "Europe News: French President Emmanuel Macron on Thursday launched a broadside against Italian Prime Minister Giorgia Meloni, asking her to stop \\\"commenting on wha.",
    "image": "https://static.toiimg.com/thumb/msid-128591080,width-1280,height-720,imgsize-980403,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Cedi gains not enough to reduce prices as manufacturers still recovering losses",
    "desc": "President of the Association of Ghana Industries (AGI), Dr Kofi Nsiah-Poku, says the recent appreciation of the cedi is not enough to trigger immediate price reductions, as manufacturers are still recovering from heavy losses incurred during the period of a weak currency.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Screenshot-2026-02-20-at-4.22.09-am.png",
    "source": "MyJoyOnline"
  }
]