[
  {
    "title": "PICTURES: Sepang MotoGP Shakedown ends with Honda on top",
    "desc": "A selection of pictures after the final day of the Sepang MotoGP Shakedown test, ranked by rider order.",
    "image": "https://cdn.crash.net/2026-01/gng_1288189_hires_1600x900.jpg?width=1600&aspect_ratio=16:9",
    "source": "crash.net"
  },
  {
    "title": "Tipperary Council plan to demolish 52 incomplete houses",
    "desc": "Tipperary County Council is pushing forward with plans to demolish 52 incomplete houses that works stopped on almost 20 years ago.",
    "image": "https://www.rte.ie/images/0023d424-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Williams boss James Vowles on the 2026 regulations, embracing new technologies and F1’s future",
    "desc": "As part of Santander’s Driving Tomorrow series, Williams Team Principal James Vowles gives his take on F1 as it is today and where the sport might be heading…",
    "image": "https://media.formula1.com/image/upload/t_16by9Centre/c_lfill,w_2048/q_auto/v1740000000/trackside-images/2025/F1_Grand_Prix_of_Qatar___Sprint__Qualifying/2249002646.webp",
    "source": "Formula 1"
  },
  {
    "title": "US authorities reportedly investigate claims that Meta can read encrypted WhatsApp messages",
    "desc": "A lawsuit filed last week alleges tech firm ‘can access virtually all’ private communications, a claim the company has denied",
    "image": "https://i.guim.co.uk/img/media/3b2d9e5704aa4cc63dbc19f3e9679f9ee8501778/886_311_2237_1789/master/2237.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=09d4a0edadd7040772a41a23cc8ee90a",
    "source": "The Guardian"
  },
  {
    "title": "Apple's New Lip-Reading Tech Is a Weird Signal of Where We're Heading",
    "desc": "Commentary: The purchase of a startup called Q.ai isn't a blip on the radar. The way we use our wearables could be changing in very weird new ways.",
    "image": "https://www.cnet.com/a/img/resize/d01d54149527a3730a52f12ef22ae78ae42f7ee4/hub/2026/01/31/7032b4ef-63c5-4f07-80c4-c52addb3525e/gettyimages-2150495171.jpg?auto=webp&fit=crop&height=675&width=1200",
    "source": "CNET"
  },
  {
    "title": "Lemme Launches Skin Glaze Gummies With Kylie Cosmetics",
    "desc": "For its first-ever brand collaboration, Lemme is teaming up with Kylie Cosmetics to launch Skin Glaze Gummies for a limted time only at Ulta Beauty.",
    "image": "https://wwd.com/wp-content/uploads/2026/01/MixCollage-27-Jan-2026-04-10-PM-6270.jpg?w=1000&h=563&crop=1",
    "source": "WWD"
  },
  {
    "title": "NDA 'strongly advises' AHPC to stop registration and",
    "desc": "NDA says the regulation of drug shops in Uganda is vested in the Authority in accordance with Section 15 of the National Drug Policy and Authority Act.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/38d7a112-1304-4204-ab60-35d13899a459.jpg",
    "source": "NewVision.co.ug"
  },
  {
    "title": "Anywar directs new NWSC board to prioritize innovation",
    "desc": "“You must support the government because we do not want moles to frustrate government services to the poor. We shall fish out those who frustrate us. Water should be accessible to all people regardless of status,” Anywar, emphasised.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/e96a58de-f102-455c-97be-f61af0d2d169.jpg",
    "source": "NewVision.co.ug"
  },
  {
    "title": "Court throws out Majegere recount petit",
    "desc": "The court further observed that the petitioner did not pay security for costs amounting to thirty currency points as required by law. Based on the two grounds, court dismissed the petition.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/dec93bc3-e28a-4cf2-9692-adc40fb3a229.jpg",
    "source": "NewVision.co.ug"
  },
  {
    "title": "Edmonton city councillor wants province to revisit rules on restrictive covenants to help prevent food deserts",
    "desc": "The fight is once again ramping up to change rules that have resulted in food deserts across Alberta, according to Edmonton city councillor Michael Janz.",
    "image": "https://i.cbc.ca/ais/2a22249c-7918-4074-b928-837d570a911e,1769817569189/full/max/0/default.jpg?im=Crop%2Crect%3D%28524%2C377%2C1496%2C841%29%3BResize%3D620",
    "source": "CBC"
  }
]