[
  {
    "title": "SBCA to celebrate 43rd anniversary",
    "desc": "The office of the vice president for Public Relations and External Corporate Affairs, Ma. Flordeliza R. de Guzman, MA.ED. announces the celebration of St....",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/09/77924.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Daily Post Nigeria",
    "desc": "Dami Marshall, a daughter of Fuji maestro, King WasiAyinde Marshall, popularly known as KWAM 1 or K1 De Ultimate, has debunked rumours of a romantic",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/KWAM1s-daughter-Dami-.webp",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "When the Host Turns Hostile: Moving UN Headquarters to Save Multilateralism?",
    "desc": "[Elodie Tranchez, PhD, is an international human rights lawyer and a senior lecturer with UNITAR and teaches public international law, including the law of treaties and the law of international org…",
    "image": "https://i1.wp.com/opiniojuris.org/wp-content/uploads/1260661-1.jpg?fit=1012%2C645",
    "source": "Opinio Juris"
  },
  {
    "title": "HIV Vaccine Candidate Triggers Neutralising Antibodies",
    "desc": "A novel HIV vaccine candidate induces neutralising antibodies after a single dose in primates, potentially accelerating HIV prevention.",
    "image": "https://www.emjreviews.com/wp-content/uploads/2026/02/9am-micro.jpg",
    "source": "European Medical Journal"
  },
  {
    "title": "soil health, youth and climate",
    "desc": "At the Africa Food Systems Forum 2025 in Dakar, leaders, scientists and youth highlighted soil health, climate resilience and food sovereignty as foundations for transforming Africa’s food systems.",
    "image": "https://www.forestsnews.org/wp-content/uploads/DSC_5830-scaled.jpg",
    "source": "CIFOR-ICRAF Forests News"
  },
  {
    "title": "Amazing support for pet vaccination drive in Pumula",
    "desc": "The LSC SPCA appeals to the public for support, to enable it to continue providing vital services to animals in need in the community. Anyone able to assist is encouraged to contact them on 039 3120962.",
    "image": "https://images.caxton.co.za/wp-content/uploads/sites/52/2026/02/spca3_80029.jpeg",
    "source": "The Citizen"
  },
  {
    "title": "William and Catherine say they are 'deeply concerned' in first statement on Epstein revelations",
    "desc": "It comes after documents released in the US revealed new allegations about Epstein's ties with Andrew Mountbatten-Windsor.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b065/live/3de096a0-0599-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  },
  {
    "title": "William and Catherine 'deeply concerned' over Jeffrey Epstein revelations",
    "desc": "It comes after documents released in the US shone new light on the scandal, including over Epstein's ties with Andrew.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1a2d/live/537ff930-6139-11ee-b101-6f93d6dfbcc2.png",
    "source": "BBC"
  },
  {
    "title": "Lobola cattle lost as FMD outbreak destroys livelihoods in Mpophomeni",
    "desc": "The FMD outbreak near Mpophomeni cost eMashingeni resident Mxolisi Zuma three cattle meant for lobola, setting his future plans back.",
    "image": "https://witness.co.za/wp-content/uploads/sites/144/2025/07/FMD-Cattle-Pasture.jpg",
    "source": "The Witness | Your compass in the community"
  },
  {
    "title": "Stranded in India for 13 years, Ugandan mother finally",
    "desc": "When Namuddu left Uganda in 2013, she travelled alone, filled with dreams of building a better life in India and returning home transformed. However, her plans did not materialise as expected. She struggled to secure stable employment, her visa eventually expired, and she had little to show for her efforts.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/60cadaf1-6aa5-4ad0-bef2-d7ccfd0c30d9.jpg",
    "source": "NewVision.co.ug"
  }
]