[
  {
    "title": "Democrats alarmed by 'chaos in the skies' after U.S. government again fires laser near Mexico border",
    "desc": "The U.S. military used a laser Thursday to shoot down a \"seemingly threatening\" drone flying near the U.S.-Mexico border — one that appears to have been flown by U.S. Customs and Border Protection.",
    "image": "https://i.cbc.ca/ais/50e1e1c5-36de-4a01-b6b9-b98ee29adc6d,1772194125976/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C237%2C4547%2C2557%29%3BResize%3D620",
    "source": "cbc.ca"
  },
  {
    "title": "NCAA: EAC bounces back at Letran’s expense in men’s volleyball",
    "desc": "Emilio Aguinaldo College bounced back at the expense of Colegio de San Juan de Letran, 25-21, 28-26, 25-16, on Friday in the NCAA Season 101 men’s volleyball tournament.",
    "image": "https://images.gmanews.tv/webpics/2026/02/IMG_7679_2026_02_27_20_45_37.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Champions League last 16 draw: Man City draw Real Madrid as Arsenal, Liverpool, Chelsea, Spurs and Newcastle learn fate",
    "desc": "Manchester City to face Real Madrid in Champions League last 16; Chelsea drawn against holders Paris Saint-Germain; Newcastle face Barcelona, while Premier League leaders Arsenal handed Bayer Leverkusen tie; Liverpool take on Galatasaray as Tottenham given Atletico Madrid",
    "image": "https://e0.365dm.com/26/02/1600x900/skysports-champions-league_7176473.jpg?20260227080811",
    "source": "Sky Sports"
  },
  {
    "title": "Expert: 'Israel must act independently, Tehran’s nuclear ambitions pose a global threat'",
    "desc": "Public diplomacy expert Ran Bar-Yoshafat calls for Israel to counter misinformation worldwide, stresses the need for independent media voices in Israel to counter biased coverage.",
    "image": "https://2.a7.org/files/pictures/000/1211274.jpg",
    "source": "Israel National News"
  },
  {
    "title": "Kenya: ODM Collapse Laid Bare By Fresh By-Election Losses",
    "desc": "Fresh by-election results and growing internal divisions have raised questions about the political future of the Orange Democratic Movement (ODM), with Thursday's contests showing the party struggling to remain competitive even in areas it once dominated.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Botswana government says it will support hemp after issuing strict regulations",
    "desc": "Cultivation is restricted to licensed operators under specific categories, including commercial growing, nurseries and seed production.",
    "image": "https://hemptoday.net/wp-content/uploads/2026/02/Minister-Finance-Botswana.png",
    "source": "HempToday"
  },
  {
    "title": "China suspends some agricultural tariffs on Canada, maintains levy on canola seed",
    "desc": "Tariffs on canola meal and pea imports, as well as lobster and crab, will be halted from March 1 through the end of 2026",
    "image": "https://www.theglobeandmail.com/resizer/v2/X2QIPD5E4NH6PILJGDJMYZZJNM.JPG?auth=1df793d773742797c633899a379b4f9b654c52c696911388240a42a5c2472a14&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "Condemnation as universities in Darfur come under attack",
    "desc": "Sudan’s Ministry of Higher Education and Scientific Research has condemned the drone strikes on Kordofan University in El-Obeid, the capital of Nort...",
    "image": "https://www.universityworldnews.com/images/articles/20260227095533406_5_1200.jpg?r=173953209?cb=25365",
    "source": "University World News"
  },
  {
    "title": "ScarCruft Uses Zoho WorkDrive and USB Malware to Breach Air-Gapped Networks",
    "desc": "North Korea-linked ScarCruft’s Ruby Jumper uses Zoho WorkDrive C2 and USB malware to breach air-gapped systems for surveillance.",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEjGnWXXVXx1WeEkTWrq3_CCY922KPE3hV_pg-UYgx86QO76S5DomWi6TxZZQSGZ1Jpf2Rp2riR41Ld7zqWhjfdniLJthYBBDJx3eyNFMPQn5ph9kmmRyrib3HpIe1o5oEp6htOMFVe-m9UQNaXhhoY6MkHeXk1oM4UfctRDC5piMbIZGdjr2bApPUzXMQXK/s1700-e365/keys.jpg",
    "source": "The Hacker News"
  },
  {
    "title": "New pathway found connecting liver congestion to fibrosis and cancer",
    "desc": "Researchers from The University of Osaka find that chronic liver congestion is linked to severe liver diseases through a specific signaling pathway in liver sinusoidal endothelial cells - key cells lining the liver's tiny blood vessels.",
    "image": "https://www.news-medical.net/image-handler/picture/2017/1/Digital_illustration_of_liver_in_colour_background-Liya_Graphics_0fff2ea2f60c4e71b4991068b748916f-620x480.jpg",
    "source": "News-Medical"
  }
]