[
  {
    "title": "10ID: 7 towns targeted to be declared insurgency-free this year",
    "desc": "The 10th Infantry Division (10ID) is aiming to clear the remaining seven municipalities within its areas of responsibility this year to officially achieve a 100% \"insurgency-free\" status. While the division reports zero active New People's Army (NPA) armed units, the formal declaration for the final seven towns currently rests on the completion of documentary requirements...",
    "image": "https://www.mindanaotimes.com.ph/wp-content/uploads/2025/07/0grace5-pic-2-1.jpg",
    "source": "mindanaotimes.com.ph"
  },
  {
    "title": "Danish Sheikh on Queer Love, Courtrooms and Creative Freedom",
    "desc": "Passion, ghosting and heartbreak— all part of Danish Sheikh's intimate yet toxic relationship with the law. The lawyer-activist and theatre-maker is now deep in his creative era after witnessing how judicial systems have both turned their back on and embraced LGBTQIA+ communities. From navigating Section 377 in India to celebrating his sexuality in the streets of Melbourne, Danish shares with Suhayla Sharif how his experiences have formed his understanding of acceptance. They also unpack how authentic stories and Taylor Swift helped shape his show 'Much to do with Law, but More to do with Love' at Midsumma Festival 2026. Listen now, only on SBS Spice.",
    "image": "https://images.sbs.com.au/dims4/default/d66b1f3/2147483647/strip/true/crop/1920x1080+0+0/resize/1280x720!/quality/90/?url=http%3A%2F%2Fsbs-au-brightspot.s3.amazonaws.com%2F05%2F99%2F96c5136347c3ba72e4f2efea2bd3%2Fsbs-spice-danish-sheikh-pod.png",
    "source": "SBS Australia"
  },
  {
    "title": "‘Near impossible’: The big stumbling block in Lomax saga as ‘outrageous’ situation laid bare",
    "desc": "‘Near impossible’: The big stumbling block in Lomax saga as ‘outrageous’ situation laid bare",
    "image": "https://content.api.news/v3/images/bin/68e97989ad0537ec007d8392fde1b022",
    "source": "fox sports"
  },
  {
    "title": "38 Oxley Road site acquired by Govt after being gazetted as a national monument",
    "desc": "38 Oxley Road has been acquired to safeguard and preserve its historic significance after being gazetted as a National Monument. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/3cfbf5e8873d6586ffaa6ebe962c3b5cefa66bd19cc666654c369c6cecde1fb1",
    "source": "The Straits Times"
  },
  {
    "title": "Nearly 100 ex-rebels surrender in Davao del Norte",
    "desc": "Nearly 100 ex-rebels surrender in Davao del Norte",
    "image": "https://images.gmanews.tv/webpics/2026/01/mass-surrender-for-site_2026_01_29_10_12_22_2026_01_29_11_02_31.jpeg",
    "source": "GMA Network"
  },
  {
    "title": "‘I find it disrespectful’: Novak Djokovic fires back at journalist — ‘Chasing Jannik and Carlos? In which sense?’",
    "desc": "Tennis News: Novak Djokovic does not lack motivation at this stage of his career, but on the eve of another Australian Open semifinal, the most successful men’s si.",
    "image": "https://static.toiimg.com/thumb/msid-127751740,width-1280,height-720,imgsize-159910,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Mother of four Marys hits back at critics of unusual baby name choice",
    "desc": "A California woman has defended her unconventional decision to give her four daughters the same name. Mary Heffernan and her husband Brian named the quartet...",
    "image": "https://www.nzherald.co.nz/resizer/v2/NGUF473FHVA4TMLSKDMNV7EABA.png?auth=cb532ce32863e77bdfd29809a620c1e16c8df86c2f99bf88008afd718333fd13&width=1200&height=675&quality=70&focal=313%2C203&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Great White Sharks Grow Deadly New Types of Teeth as They Age",
    "desc": "A great white shark is a masterwork of evolutionary engineering.",
    "image": "https://www.sciencealert.com/images/2026/01/GreatWhiteSharkTeeth.jpg",
    "source": "ScienceAlert"
  },
  {
    "title": "Union Budget: India may pour more money & simplify tax regime to offset Trump tariffs",
    "desc": "Ahead of the Feb. 1 Budget, PM Modis government is expected to boost infrastructure spending and improve ease of doing business while maintaining fiscal discipline. Finance Minister Nirmala Sitharaman may simplify import duties and ease compliance for small businesses, aiming to support growth amid muted private investment and global risks, including punitive US tariffs.",
    "image": "https://img.etimg.com/thumb/msid-127752582,width-1200,height-630,imgsize-92618,overlay-economictimes/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Zaldy Co's SC petition a 'dilatory tactic' -- Ombudsman",
    "desc": "While fugitive from justice and resigned congressman Zaldy Co has asked the Supreme Court (SC) to stop the Office of the Ombudsman from prosecuting him,...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/29/75112.webp",
    "source": "mb.com.ph"
  }
]