[
  {
    "title": "Super Bowl 60: Bad Bunny lights up Super Bowl halftime",
    "desc": "Stars have been front-and-center at Super Bowl 60, with Chris Pratt and Jon Bon Jovi introducing the teams, a series of soaring pre-game performances and a much-anticipated halftime show from Bad Bunny.",
    "image": "https://dims.apnews.com/dims4/default/5774f22/2147483647/strip/true/crop/5237x3490+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F7e%2F88%2Fc106601da4742aca8ff52991cf14%2F49025a9861ee4eea9eee24d8b511b31a",
    "source": "AP News"
  },
  {
    "title": "Schizas goes viral during Olympic team event",
    "desc": "Her snarling face made Canadian figure skater Madeline Schizas an internet meme on Friday, as she reacted to some confusing scores in the kiss and cry after her short program at Milano Ice Skating Arena.",
    "image": "https://globalnews.ca/wp-content/uploads/2026/02/1c9060ebf210c098376bf09ef95200f77a579e7d9bfba223d427b04a34a9017c.jpg?quality=65&strip=all&w=720&h=379&crop=1",
    "source": "Global News"
  },
  {
    "title": "Glasgow man sets up male-centred breast cancer group after diagnosis",
    "desc": "A former joiner has set up a support service for men diagnosed with breast cancer after his own diagnosis. Paul Steele, 44, was diagnosed with breast cancer at ...",
    "image": "https://www.ireland-live.ie/resizer/1200/700/true/pa/2026_02_09/1770596748757_0.jpg--.jpg?1770596749168",
    "source": "Ireland Live"
  },
  {
    "title": "2 Cryptocurrencies Set to Rebound in 2026",
    "desc": "Solana and Chainlink could both soar this year.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F852058%2Finvesting-screen-analysis-investor-growth-stocks.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "led event on geographic atrophy",
    "desc": "Geographic atrophy (GA) continues to present significant challenges in both diagnosis and long-term patient management, as emerging therapies and evolving understanding of the disease reshape clinical practice.",
    "image": "https://www.insightnews.com.au/wp-content/uploads/2026/02/image-2.jpg",
    "source": "insightnews.com.au"
  },
  {
    "title": "Airlines warn of higher ticket costs due to government levy",
    "desc": "The nation’s airlines say the federal government’s aviation consumer protection scheme will drive up costs, and consumer advocates question what will change for passengers.",
    "image": "https://static.ffx.io/images/$zoom_0.1906%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/f974e7b73e9f3e8a58f8648f66f23c3945ed39d0",
    "source": "theage.com.au"
  },
  {
    "title": "Globe Telecom Seals Agreement with Starlink to Launch First Southeast Asia Direct‑to‑Cell Satellite Service",
    "desc": "MANILA, Philippines, Feb. 9, 2026 /PRNewswire/ -- Globe Telecom, the Philippines' leading mobile operator, has become the first in Southeast Asia, and the second in Asia, to offer Starlink's groundbreaking Direct‑to‑Cell (DTC) satellite service. Joining a growing group of countries worldwide, Globe's partnership with Starlink marks a historic milestone in global connectivity.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/09/929690.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "Triple suicide? 3 found dead in car parked near west Delhi flyover; 'poisonous' smell detected in vehicle",
    "desc": "NEW DELHI: Three bodies, including those of an elderly man and a woman, were found in a car parked near Peeragarhi flyover in west Delhi on Sunday aft.",
    "image": "https://static.toiimg.com/thumb/msid-128093423,width-1280,height-720,imgsize-1180538,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "PMO Bars Parliament Questions on PM CARES and Defence Funds Citing Secret Rules",
    "desc": "The reasoning for questions and matters not being admissible in Lok Sabha given by the PMO, it is learnt, was that the corpus of these funds is constituted entirely with voluntary public contribution and not from any allocation out of the Consolidated Fund of India.",
    "image": "https://images.indianexpress.com/2026/02/PM-CARES_20260208210020.jpg",
    "source": "The Indian Express"
  },
  {
    "title": "Coinbase Bets On Karaoke-Themed Super Bowl Commercial",
    "desc": "Coinbase Bets Lo-Fi Karaoke Super Bowl Commercial Creates High-Flying Response",
    "image": "https://variety.com/wp-content/uploads/2026/02/Everybody_Coinbase_Hero_Image_16x9_v04.png?w=1000&h=563&crop=1",
    "source": "Variety"
  }
]