[
  {
    "title": "Death Notice of Marie Dillon (née Crawford) (Clareview, Limerick)",
    "desc": "The death has occurred of Marie Dillon (née Crawford) of Clareview, Limerick Ireland, on 27/02/2026. You can view the full death notice and add your condolences here.",
    "image": "https://img-dedicated.rip.ie/w188/Marie_Dillon_b8081dd18f76481a1df8169f16c34a0ac45b5aa2e8883837.png",
    "source": "RIP.ie"
  },
  {
    "title": "At least 20 workers killed, nine injured in firecracker unit blast in Kakinada district",
    "desc": "A deadly blast at a firecracker unit in Kakinada kills at least 15 workers, with many more feared trapped.",
    "image": "https://th-i.thgim.com/public/incoming/jir9dg/article70688321.ece/alternates/LANDSCAPE_1200/Andhra%20firecrackers.jpeg",
    "source": "The Hindu"
  },
  {
    "title": "I’m Not Competing With Anyone, Want To Tell Nigerian, African Stories - Funke Akindele",
    "desc": "I’m Not Competing With Anyone, Want To Tell Nigerian, African Stories – Funke Akindele",
    "image": "https://www.channelstv.com/wp-content/uploads/2024/01/Olufunke-Akindele.jpg",
    "source": "Channels Television"
  },
  {
    "title": "World leaders silent amid US, Israeli war with Iran",
    "desc": "The exception was Australia's prime minister, while the X accounts of British, French, Italian, and German leaders had not been updated for hours by the time of publication.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/708861",
    "source": "The Jerusalem Post"
  },
  {
    "title": "ADB MD honoured for impactful leadership at PMI Ghana engagement",
    "desc": "The Managing Director of Agricultural Development Bank (ADB) PLC, Edward Ato Sarpong, has been honoured by the Project Management Institute Ghana (PMI Ghana) for his exceptional leadership and contributions to professional development.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/image-2537.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Explosions reported across Persian Gulf as Iran retaliates US, Israeli attacks",
    "desc": "Explosions were reported across parts of the Persian Gulf on Saturday after Iran’s Revolutionary Guards launched multiple waves of regional attacks, prompting several countries to activate air defense systems.",
    "image": "https://i.iranintl.com/images/rdk9umy0/production/2b8a06953d5e04f1f3f77005bf1dfc146ee6e36b-4994x3319.jpg?rect=0,349,4994,2622&w=1200&h=630&fit=max&auto=format",
    "source": "ایران اینترنشنال"
  },
  {
    "title": "What are Iran's ballistic missile capabilities?",
    "desc": "DUBAI - The United States and Israel launched strikes on Iran on Saturday (Feb 28), plunging the Middle East into a new conflict that President Donald Trump said would end a security threat to the United States and offer Iranians a chance to topple their rulers.Iran launched missiles towards Israel, Israel's military said. Here are some details about Iran's missiles:What...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/20260228_iran_missiles.jpg?itok=fBMrWWwq",
    "source": "AsiaOne"
  },
  {
    "title": "The week the AI scare turned real and America realized maybe it isn't ready for what's coming",
    "desc": "From the \"Ghost GDP\" to mass layoffs at tech companies, this was the week AI's new collar economy took full effect.",
    "image": "https://fortune.com/img-assets/wp-content/uploads/2026/02/GettyImages-1186712099-e1772230034418.jpg?resize=1200,600",
    "source": "Fortune"
  },
  {
    "title": "Surbhi Chandna reacts to Psycho Saiyaan co-star Tejasswi Prakash refusing to give interviews with her",
    "desc": "Recently, the promotions for Psycho Saiyaan took a tense turn when Tejasswi Prakash refused to give joint media interactions with co-star Surbhi Chandna. | Web Series",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/28/550x309/Tejasswi_Prakash_1772270975956_1772270976087.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "West Ham face summer player sales after £104m loss",
    "desc": "West Ham will need to sell players this summer even if they avoid relegation from the Premier League, after revealing a £104.2m loss for the last financial year.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4924/live/ce4091a0-1485-11f1-adc7-3d4265b36882.jpg",
    "source": "BBC"
  }
]