[
  {
    "title": "‘Misleading and unfounded’ — JAMB dismisses claims of hike in UTME registration fee",
    "desc": "The Joint Admission and Matriculation Board (JAMB) has dismissed reports insinuating it has increased the registration fees for Unified Tertiary Matriculation Examinations (UTME), describing the claim as “false, misleading and entirely unfounded”.",
    "image": "https://www.thecable.ng/wp-content/uploads/2017/03/JAMBe.jpg",
    "source": "TheCable"
  },
  {
    "title": "The impact of the Fallout TV series on PC game sales from 2024",
    "desc": "Data from digital entertainment marketplace G2A.com shows the significant effect the Fallout TV show has had on the franchise's PC game sales across both seasons. This analysis covers individual SKUs and cumulative sales over two years.",
    "image": "https://mcvuk.com/wp-content/uploads/fallout-tv-series_jc8y.jpg",
    "source": "mcv/develop"
  },
  {
    "title": "High number of chikungunya cases reported among travellers returning from Seychelles: local transmission in mainland Europe currently unlikely",
    "desc": "Since November 2025, more than 70 travel-related cases among travellers returning from Seychelles have been reported by 10 European countries.",
    "image": "https://www.ecdc.europa.eu/sites/default/files/styles/metatag_image_large/public/images/chikungunya.png?itok=SHNP4gAT",
    "source": "European Centre for Disease Prevention and Control"
  },
  {
    "title": "Eight months’ jail for private-hire driver who ran red light and killed motorcyclist",
    "desc": "A private-hire driver received eight months' jail and an eight-year driving ban for a fatal traffic accident caused by running a red light. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/24b127c3ea25f9458976c6a92fd00bcebf8b9f5015ec01ffd3a37afddfa0bd74",
    "source": "The Straits Times"
  },
  {
    "title": "Queensland Reds defeat Highlanders, Western Force beat Moana Pasifika in Super Rugby",
    "desc": "The Queensland Reds and Western Force have recorded their first wins of the Super Rugby Pacific season in round three.",
    "image": "https://live-production.wcms.abc-cdn.net.au/f0ed2bec2dcf1c5c6c1525a4fc0e9e59?impolicy=wcms_watermark_news&cropH=1634&cropW=2905&xPos=0&yPos=97&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Indonesia court jails ex-CEOs of Pertamina units in graft case",
    "desc": "Pertamina said it respects the court's ruling and reiterated it has",
    "image": "https://img.dunyanews.tv/news/2026/February/02-27-26/news_big_images/937791_18921487.jpg",
    "source": "Dunya News"
  },
  {
    "title": "2 measles cases aboard SIA flight to New Zealand infected before arrival in Singapore: CDA",
    "desc": "Two individuals infected with measles developed symptoms on an SIA flight to New Zealand after transiting through Changi Airport from India. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/21949e41a654267368c8449127eca67c470b7a062be5d8c10994df0a86a4ed99",
    "source": "The Straits Times"
  },
  {
    "title": "Apply for the Megatrends Afrika Fellowship 2026: Advancing African Research and Policy Engagement",
    "desc": "The Megatrends Afrika Fellowship 2026 offers a unique opportunity for African researchers to contribute to policy-relevant, interdisciplinary research on",
    "image": "https://i0.wp.com/www.globalsouthopportunities.com/wp-content/uploads/2026/02/Megatrends-Afrika-Fellowship.webp",
    "source": "Global South Opportunities"
  },
  {
    "title": "Rice, fish, fuel costs may push February inflation above 3%-BSP",
    "desc": "Higher cost pressures from rice and fish, compounded by elevated petroleum prices, could have quickened headline inflation to as fast as 3.1 percent in...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/27/82416.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Man’s decomposed body found in Qate thicket, Marsabit",
    "desc": "The body, believed to have been dumped a week ago, was discovered by locals who alerted police",
    "image": "https://cdn.radioafrica.digital/image/2026/02/17e16b9e-20de-4b37-8e3a-adede5461077.jpg?1772182523825",
    "source": "the-star.co.ke"
  }
]