[
  {
    "title": "APC, ADC Share Votes Equally At FCT Polling Unit",
    "desc": "The chairmanship candidates of the All Progressives Congress (APC) and the African Democratic Congress (ADC) split votes accordingly at the Supreme Court",
    "image": "https://dailytrust.com/wp-content/uploads/2022/10/Daily-Trust-Logo-566x400.jpg",
    "source": "Daily Trust"
  },
  {
    "title": "Premier rodeo event returns to Waikouaiti",
    "desc": "A dusty showdown awaits as the country’s best cowboys ride into town. For the first time since 1999 the Waikouaiti Rodeo Club will host the...",
    "image": "https://www.odt.co.nz/sites/default/files/styles/odt_story_opengraph_1200w/public/story/2026/02/star19rodeo1.jpg?itok=Sr3rCalL",
    "source": "Otago Daily Times"
  },
  {
    "title": "We’ve proposed a state-assisted funeral for Yaw Sarpong - MUSIGA",
    "desc": "The President of the Musicians Union of Ghana (MUSIGA), Bessa Simons, has disclosed that his body has proposed a state or state-assisted funeral for the late gospel icon Yaw Sarpong.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/127/12720588.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "AEW Collision Preview: February 21, 2026 - Jet Set Rodeo Defend AEW World Trios Titles, Death Riders and Don Callis Family Clash, More",
    "desc": "AEW Collision will be LIVE TONIGHT at 8 p.m. ET/7 p.m. CT on TNT and streaming on HBO Max! It’s another night in California, as we move down the coast to Oceanside, which will be the host to two championship matches!",
    "image": "https://static.wixstatic.com/media/815952_3fbcb7ddd28b40a99cf504d82fc0122f~mv2.jpg/v1/fill/w_1920,h_1080,al_c/815952_3fbcb7ddd28b40a99cf504d82fc0122f~mv2.jpg",
    "source": "AEW"
  },
  {
    "title": "Interior Minister launches Automated Fire Safety Compliance System to enhance public safety",
    "desc": "The Minister for the Interior, Mohammed Muntaka-Mubarak, has launched the Automated Fire Safety Compliance System (AFCAS), a new digital platform designed to transform fire safety compliance in Ghana.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/639897683_34068403369471101_8639353751080599334_n.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Trump open to 'token' Iran nuclear deal if every path to a bomb is blocked",
    "desc": "Washington reportedly signals narrow room for diplomacy on Iran's nuclear programme even as Trump reviews strike options",
    "image": "https://www.middleeasteye.net/sites/default/files/images-story/us-president-donald-trump-press-conference-dc-washington-february-2026-afp.jpg",
    "source": "Middle East Eye"
  },
  {
    "title": "AC Milan vs Parma predictions: Crociati to pose problems",
    "desc": "Expert AC Milan vs Parma predictions, including three predictions for their Serie A Matchday 26 clash on 22 February 2026 at 10.30 pm.",
    "image": "https://assets.goal.com/images/v3/blt46b8a1765f6e5a97/AC%20Milan%20vs%20Parma%20Predictions.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Elections: Like FCT And Kano, Rivers Records Low Voter Turnout",
    "desc": "Low turnout and voter apathy marked the by-election to fill the vacant seats for Ahoada East and Khana constituencies in the Rivers State House of Assembly.",
    "image": "https://dailytrust.com/wp-content/uploads/2026/02/IMG-20260221-WA0015.jpg",
    "source": "Daily Trust"
  },
  {
    "title": "OpenAI debated calling police about suspected Canadian shooter's chats",
    "desc": "Jesse Van Rootselaar's descriptions of gun violence were flagged by tools that monitor ChatGPT for misuse.",
    "image": "https://techcrunch.com/wp-content/uploads/2025/02/GettyImages-2195918462.jpg?w=1024",
    "source": "TechCrunch"
  },
  {
    "title": "KATSEYE's Manon’s Unexpected Hiatus Is a Reminder for Young Girls to Prioritize Their Well-being",
    "desc": "Beloved girl group KATSEYE has been at the top of their game, even earning Grammy nominations for Best Pop Duo/Group Performance and Best New Artist at the 68th Annual Grammy Awards. However, in a tru...",
    "image": "https://s.yimg.com/os/en/sheknows_79/f365ab9d830443852983292328a0208c",
    "source": "Yahoo"
  }
]