[
  {
    "title": "Winter Olympics 2026: Mikaela Shiffrin 'excited' to cheer Lindsey Vonn, praises her ‘tenacity and grit’",
    "desc": "The double Olympic champion says she’s eager to watch Vonn tackle the women’s downhill despite an ACL injury: “I have a lot of belief.”",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/obbn8vffsmpvmolajo4k",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Italy head to Dublin with Scotland victory banked",
    "desc": "Pressure mounted on Gregor Townsend as Scotland suffered a disastrous Guinness Six Nations start by losing 18-15 to Italy in rain-lashed Rome as the hosts picked up steam before their trip to Dublin.",
    "image": "https://www.rte.ie/images/0023dc98-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "West Ham ratings vs Burnley: Nuno proved right as 9/10 trio pile pressure on Nottingham Forest",
    "desc": "Nuno Espirito Santo proved right on three big West Ham calls as star trio help pile pressure on Nottingham Forest with a 2-0 win at Burnley.",
    "image": "https://cdn1.hammers.news/uploads/25/2026/02/GettyImages-2260390196-scaled.jpg",
    "source": "Hammers News"
  },
  {
    "title": "Waterford defeat the Dubs to maintain winning start",
    "desc": "Waterford continued their perfect start to the Lidl National Football League Division 1 with a deserved 1-10 to 0-08 victory against All-Ireland champions Dublin in Dungarvan.",
    "image": "https://www.rte.ie/images/0023dc84-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Thom Browne Sent a Surprise Asics Collab Down the GQ Bowl Runway",
    "desc": "In San Francisco, the designer quietly debuted his first-ever sneaker collaboration.",
    "image": "https://media.gq.com/photos/69877734b7871ca31241f237/16:9/w_1280,c_limit/020626_GQ_BOWL_2026_324.jpg",
    "source": "GQ"
  },
  {
    "title": "How Brampton landed on a 0% city tax increase",
    "desc": "After weeks of budget debate, Brampton Mayor Patrick Brown says resident pushback over affordability forced city hall to “sharpen pencils” and find savings in the 2026 budget.",
    "image": "https://www.cp24.com/resizer/v2/5MCIZG3CGNDGZNXININRGFSA64.jpg?smart=true&auth=9b94fe189b85a86eeb0ba8d13d7c01ddfea79014aef29acd0d45a058ba78b632&width=1200&height=630",
    "source": "CP24"
  },
  {
    "title": "Al Jazeera Forum hosts Hamas leader, UN's Albanese",
    "desc": "United Nations Special Rapporteur Francesca Albanese claimed that \"international law has been stabbed in the heart\" and accused Israel of being the \"common enemy\" of humanity.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/705285",
    "source": "The Jerusalem Post"
  },
  {
    "title": "1 Aston Villa (Feb 7, 2026) Game Analysis",
    "desc": "Expert recap and game analysis of the AFC Bournemouth vs. Aston Villa English Premier League game from February 7, 2026 on ESPN.",
    "image": "https://a.espncdn.com/combiner/i?img=/i/espn/misc_logos/500/soccer.png",
    "source": "ESPN"
  },
  {
    "title": "Famous surfer dog Bosco makes a splash at Waitangi",
    "desc": "Now five years old, the French bulldog was joined by younger companion Treasure, who is also learning to ride the waves.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--fHTuy_QP--/t_tohu-badge-facebook/v1770440239/4PGHBYI_20150421_152230350_iOS_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Will Smith couldn't make this dog part of his family: Here's why",
    "desc": "In I Am Legend, Will Smith has a canine named Samantha, nicknamed Sam. She tagged along with the actor against the backdrop of the movie's post-apocalyptic setting. During their work, the...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-07/1391442_103219_updates.jpg",
    "source": "The News International"
  }
]