[
  {
    "title": "Kurtis Patterson career-best knock for NSW Blues, highlights, video, scorecard",
    "desc": "‘Tormented’ former Test star sends reminder with career-best statement after ‘low period’",
    "image": "https://content.api.news/v3/images/bin/35809650d5ac70991a1de03c3f1969ff",
    "source": "foxsports.com.au"
  },
  {
    "title": "Manchester United to buy RCB? Glazer brothers bid for IPL team: Report",
    "desc": "Premier League giants Manchester United could be headed for a major IPL crossover, with co-owner Avram Glazer reportedly placing a massive bid for Royal Challengers Bengaluru. If it goes through, the deal could be one of the biggest in sporting history.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/virat-kohli--avram-glazer-074050186-16x9_0.jpg?VersionId=ZH2fjesX9FrTjnmQExTqa2dQKjBsOlPT",
    "source": "India Today"
  },
  {
    "title": "Why Airline 'Stopover' Deals Are One of the Best Air Travel Hacks",
    "desc": "Some two dozen airlines offer \"stopover\" programs that let flyers turn a layover into a mini‑vacation, often with a free hotel included.",
    "image": "https://i.insider.com/698389afe1ba468a96ab6435?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "Fruit-led export narrowed PH’s farm trade gap -DA",
    "desc": "The Department of Agriculture (DA) on Saturday said the country ended 2025 with a narrower agricultural trade deficit amid a surge in farm exports, led by tropical fruits coupled with softer imports.",
    "image": "https://images.gmanews.tv/webpics/2022/12/roundfruits_2022_12_27_11_16_53.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Blackpool business owners issue heartbroken statements after huge building fire 'causes carnage'",
    "desc": "Smart Mart has also addressed specualation as to the cause of the blaze",
    "image": "https://i2-prod.lancs.live/article33381439.ece/ALTERNATES/s1200/0_fire-4.jpg",
    "source": "Lancs Live"
  },
  {
    "title": "Opens 58% Lower Than TV Serial Franchise Film Khichdi's Opening!",
    "desc": "Bhabiji Ghar Par Hain! Fun On The Run opened much lower than the other TV serial franchise film Khichdi - day 1 box office report.",
    "image": "https://www.koimoi.com/wp-content/new-galleries/2026/02/bhabiji-ghar-par-hain-box-office-01.jpg",
    "source": "Koimoi"
  },
  {
    "title": "CCC urges vice governors to step up role in climate risk governance",
    "desc": "The Climate Change Commission (CCC) called on vice governors to take a more active role in climate risk governance, citing their strategic position in driving...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/07/77608.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Destruction in Gaza escalates as Israel continues violating ceasefire",
    "desc": "The Israeli army has continued violating the ceasefire agreement in the Gaza Strip, coinciding with ongoing escalation of fighting in the north and south amidst a backdrop of political turmoil in Israel.",
    "image": "https://amayei.nyc3.digitaloceanspaces.com/2026/01/ap26006617469257_jpg.jpg",
    "source": "Egypt Independent"
  },
  {
    "title": "stake World Bank procurement training",
    "desc": "DAR ES SALAAM: MZUMBE University’s Dar es Salaam Campus College is currently hosting a high-level workshop on the Sustainable Procurement Capacity Building Training Programme for World Bank–financed projects in Tanzania, a programme designed to strengthen procurement practices, improve accountability, and align national implementation with international standards. The training, which brings together procurement and contract management",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/MU.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "PM Anwar condemns Islamabad mosque bombing, extends condolences to Pakistan",
    "desc": "PETALING JAYA: Prime Minister Datuk Seri Anwar Ibrahim has condemned the bombing at a mosque in Islamabad during Friday (Feb 6) prayers, describing it as an affront to basic humanity and extending Malaysia's condolences to the victims and their families.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/07/3759212.JPG",
    "source": "The Star"
  }
]