[
  {
    "title": "Report: Netanyahu turned down 11 chances to kill Hamas leader Sinwar in 2023",
    "desc": "Quoting senior official, Israeli TV says in February and March of that year, Shin Bet repeatedly suggested taking Sinwar out, but PM refused to even discuss it; PMO denies report",
    "image": "https://static-cdn.toi-media.com/www/uploads/2024/10/AP22120591449726-e1728455143162.jpg",
    "source": "timesofisrael.com"
  },
  {
    "title": "Arsenal player ratings vs Kairat Almaty: Kai Havertz is back! Returning German stars as Gunners complete perfect Champions League league phase",
    "desc": "Kai Havertz marked his first start in almost a year with a goal and an assist as Arsenal made it eight wins from eight in the Champions League with a 3-2 success over Kairat Almaty to seal their spot as league phase winners",
    "image": "https://assets.goal.com/images/v3/blt55b2400001237875/Havertz%20Gyokeres%20Martinelli%20Arsenal%20GFX.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Surprising green ice on Lake Lipno: Cyanobacteria bloom in mid-winter",
    "desc": "An unusual natural phenomenon appeared on Lake Lipno in South Bohemia, the Czech Republic, at the end of 2025. Large amounts of accumulated cyanobacteria in the water caused the ice to turn green. The phenomenon was thoroughly documented by hydrobiologists from the Biology Center of the Czech Academy of Sciences, who also collected and analyzed water samples.",
    "image": "https://scx2.b-cdn.net/gfx/news/hires/2026/surprising-green-ice-o-1.jpg",
    "source": "Phys.org"
  },
  {
    "title": "Potential turning point for Gaza as peace plan enters second phase: UN envoy",
    "desc": "The start of a second phase of a stabilisation plan for Gaza offers a potential turning point for the war-ravaged enclave, a senior UN official told the Security Council on Wednesday.",
    "image": "https://global.unitednations.entermediadb.net/assets/mediadb/services/module/asset/downloads/preset/Collections/Production%20Library/28-01-2026-UN-Photo-Ramiz-Alakbarov.jpg/image770x420cropped.jpg",
    "source": "UN News"
  },
  {
    "title": "AI for beginners - what you really need to know to keep up",
    "desc": "Liz Kendall just announced free AI training courses. Can’t face it? Chris Stokel-Walker has a brief guide",
    "image": "https://www.thetimes.com/imageserver/image/%2F53f42e0c-18f8-45bd-9f4a-7abed0021852.jpg?crop=1600%2C900%2C0%2C0&resize=1200",
    "source": "The Times"
  },
  {
    "title": "NASA and SpaceX move up launch of Crew-12 astronauts to Feb. 11 as relief crew after ISS medical evacuation",
    "desc": "NASA and SpaceX are proceeding ahead of schedule with their next astronaut launch to the International Space Station, which is currently operating with a skeleton crew.",
    "image": "https://cdn.mos.cms.futurecdn.net/PPWuVdsXBHhENj5YBbSkyM-2560-80.jpg",
    "source": "Space"
  },
  {
    "title": "'Many happy returns', or more of a refuge?",
    "desc": "Investors like Singapore for its location, English common-law, large private capital markets and access to emerging economies, experts say.",
    "image": "https://image.cnbcfm.com/api/v1/image/108257091-1769446837211-gettyimages-680185402-dji_0372-pano-0-srgb.jpeg?v=1769446930&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Jeremie Frimpong injury blow as distraught Liverpool star forced off in Champions League",
    "desc": "Liverpool star Jeremie Frimpong has appeared to suffer another major injury blow after being taken off in the Champions League clash against Qarabag",
    "image": "https://i2-prod.liverpoolecho.co.uk/article33321518.ece/ALTERNATES/s1200/0_Jeremie-Frimpong.jpg",
    "source": "liverpoolecho.co.uk"
  },
  {
    "title": "Recapitalisation of BoG imminent; government shows commitment",
    "desc": "The Bank of Ghana (BoG) has confirmed that government's support in its recapitalisation after the significant balance sheet strain it recorded during the",
    "image": "https://citinewsroom.com/wp-content/uploads/2026/01/MPC.jpeg",
    "source": "CitiNewsroom.com"
  },
  {
    "title": "In a battle over how to carry out Trump's immigration agenda, one faction has triumphed - for now",
    "desc": "WASHINGTON — President Donald Trump’s decision to shake up the leadership of his immigration enforcement operations in Minnesota is the latest twist in a monthslong power struggle inside his administration over one of his top policy priorities, according to two law enforcement officials, one administration official and a person familiar with the situation.",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-01/260121-ice-officer-vl-502p-2332ad.jpg",
    "source": "NBC News"
  }
]