[
  {
    "title": "Electoral Malpractice: Presiding officer arrested, colleague on the run",
    "desc": "Namisindwa, Uganda | THE INDEPENDENT | Namisindwa Police are holding a presiding officer and hunting another for alleged electoral malpractice. The suspects include Saulo Nanongo, a parish chief who served as presiding officer at Lushu Centre polling station in Tsekululu Sub-county, and David Bwayo, the Tsekululu Sub-county supervisor. During Thursday’s local government elections, Nanongo allegedly inflated votes …",
    "image": "https://www.independent.co.ug/wp-content/uploads/2025/05/arrest-jail.jpg",
    "source": "independent.co.ug"
  },
  {
    "title": "Bondi’s injection of voter roll demands into Minneapolis ICE tensions draws claims of ‘ransom’",
    "desc": "Attorney General Pam Bondi’s demand that Minnesota hand over sensitive voter registration records to the federal government amid tensions over ICE and immigration enforcement underscores the importance of the administration’s nationwide data grab that is facing resistance in multiple states and has stumbled in the courts.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2239795863-20260126232427752.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "PM: Full compensation for Malay reserve land needed for road projects",
    "desc": "SEMENYIH, Jan 27 — Prime Minister Datuk Seri Anwar Ibrahim today gave an assurance that any Malay reserve land acquired for road development projects will be fully compensated, a...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/01/27/322322.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "Supreme Court refuses to entertain plea against ‘VIP darshan’ at Ujjain Mahakal temple",
    "desc": "Supreme Court declines to hear plea against VIP access at Mahakal temple, emphasizing no role in temple entry decisions.",
    "image": "https://th-i.thgim.com/public/incoming/vnxgl4/article70555919.ece/alternates/LANDSCAPE_1200/Mahakaleshwar_Temple_Ujjain.jpg",
    "source": "The Hindu"
  },
  {
    "title": "Luanda City at 450: Catholic Archbishop in Angola Challenges Authorities to Lead with Justice",
    "desc": "Archbishop Filomeno do Nascimento Vieira Dias of Angola’s Catholic Archdiocese of Luanda has called on government officials and those responsible for public decision-making to lead Angola’s capital with seriousness, justice, and a spirit of service.",
    "image": "https://www.aciafrica.org/images/aci-africa-photo-edit-2026-01-27t065912_1769502619.jpg?w=1200&format=jpeg",
    "source": "aciafrica.org"
  },
  {
    "title": "Banijay Finland Adds 'Queen Heist,' 'The Good Widow'",
    "desc": "‘Queen Heist’ grew creatively at the Banijay Bootcamp, led by Steve Matthews, Banijay head of scripted, creative.",
    "image": "https://variety.com/wp-content/uploads/2026/01/3-Split5.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Joko Anwar's Berlin-Bound 'Ghost in the Cell' Sold to Plaion Pictures",
    "desc": "Joko Anwar's Berlin-bound horror-comedy 'Ghost in the Cell' has secured German-speaking European distribution through Plaion Pictures.",
    "image": "https://variety.com/wp-content/uploads/2026/01/Ghost-in-the-Cell2.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Laboratory Analysis Confirms O Strain In Smuggled FMD Vaccines",
    "desc": "Although the O field strain of foot-and-mouth disease (FMD) has never officially been recorded in South Africa, laboratory analysis has confirmed the presence of inactivated O strain in the shipment of smuggled vaccines intercepted by authorities at Polokwane Airport in late November.",
    "image": "https://www.africanfarming.com/wp-content/uploads/2026/01/blood-draw-cattle_Alamy_News-Pics-1.jpg",
    "source": "African Farming"
  },
  {
    "title": "Trump wants to cap credit card interest at 10%. Is that a good idea?",
    "desc": "U.S. President Donald Trump has called for credit card interest rates to be capped at 10 per cent — a move that could bring short-term relief to some consumers but is likely to cause a broader credit crisis in the long run, according to experts.",
    "image": "https://i.cbc.ca/ais/a4335105-f9a5-430e-b391-144d8a371635,1769455082377/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C304%2C2902%2C1632%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "No. 1 Arizona holds off BYU comeback to stay unbeaten",
    "desc": "Brayden Burries poured in 29 points, five rebounds, four assists and three steals, and Jaden Bradley scored 26 with three assists and two steals as No. 1 Arizona remained unbeaten.",
    "image": "https://img.ksl.com/slc/3142/314217/31421751.jpeg?filter=kslv2/responsive_story_lg",
    "source": "KSL.com"
  }
]