[
  {
    "title": "Number of jobs advertised decreased by 4% to 2,614 in 2025",
    "desc": "In total, 2,615 job adverts were recorded as compared with 2,725 for the same period in 2024, indicating a decline of 4.0% year-on-year, the January 2026 Monetary Policy Report has disclosed.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2020/03/cropped-cropped-myjoyonline-logo-2-1-32x32.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Barcelona player ratings vs Levante: Joao Cancelo rolls back the years while Frenkie de Jong grabs rare goal as Blaugrana bounce back to return to La Liga summit",
    "desc": "Barcelona returned to winning ways with a 3-0 victory over Levante on Sunday that moved them back to the summit of La Liga as they took advantage of Real Madrid's defeat to Osasuna 24 hours earlier",
    "image": "https://assets.goal.com/images/v3/blt6eba6108b6fe2d73/Cancelo%20De%20Jong%20Fermin%20Barcelona%20GFX.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Barcelona 3-0 Levante: Goals and highlights - LaLiga 25/26",
    "desc": "Match ends, Barcelona 3, Levante 0. Second Half ends, Barcelona 3, Levante 0. Offside, Levante. Mathew Ryan is caught offside. Roony Bardghji (Barcelo",
    "image": "https://objetos.estaticos-marca.com/assets/multimedia/imagenes/2026/02/22/17717628117138.jpg",
    "source": "MARCA"
  },
  {
    "title": "Barcelona player ratings vs Levante: Joao Cancelo rolls back the years while Frenkie de Jong grabs rare goal as Blaugrana bounce back to return to La Liga summit",
    "desc": "Barcelona returned to winning ways with a 3-0 victory over Levante on Sunday that moved them back to the summit of La Liga as they took advantage of Real Madrid's defeat to Osasuna 24 hours earlier",
    "image": "https://assets.goal.com/images/v3/blt6eba6108b6fe2d73/Cancelo%20De%20Jong%20Fermin%20Barcelona%20GFX.jpg",
    "source": "Goal.com"
  },
  {
    "title": "US to hold Geneva nuclear talks if Iran submits deal soon",
    "desc": "US negotiators will meet Iran in Geneva on Friday for a new round of nuclear talks, with significant gaps remaining over enrichment limits and Trump's \"zero enrichment\" stance.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/707671",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Live updates: Historic blizzard shuts down major I-95 corridor cities as paralyzing 'bomb' begins",
    "desc": "A powerful \"bomb cyclone\" is now blasting the Northeast, bringing life-threatening blizzard conditions, 60 mph wind gusts, and the potential for over two feet of snow to the I-95 corridor. New York City, Boston, and Philadelphia are under Blizzard Warnings as heavy snow rates of 1 to 3 inches per hour create total whiteouts and power outages.",
    "image": "https://static.foxnews.com/static/orion/styles/img/fox-weather/og/og-fox-weather.png",
    "source": "FOX Weather"
  },
  {
    "title": "Kate Middleton Rewears Rose Gown for BAFTAs Date Night With Prince William",
    "desc": "Kate Middleton and Prince William stepped out for a glamorous date night at the BAFTAs 2026 on February 22. The Princess of Wales rewore an elegant cascading rose pink Gucci gown, while William matched her in a deep red velvet suit.",
    "image": "https://www.instyle.com/thmb/BsXXGh-BKF8RepOWUt6iSMMX7to=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/catherine-e2b39de8b0f34667bdc217a1e966ad5c.jpg",
    "source": "instyle.com"
  },
  {
    "title": "Armed Man Is Fatally Shot at Mar-a-Lago, Secret Service Says",
    "desc": "The man was killed early Sunday after an “unauthorized entry” into the secure perimeter at President Trump’s resort in Florida, the agency said. The president was not at the club.",
    "image": "https://static01.nyt.com/images/2026/02/22/multimedia/22trump-news-mar-a-lago-wgvh/22trump-news-mar-a-lago-wgvh-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Aldi Ireland set to launch range of Mother's Day gifts ideas including bathrobes and beauty bag",
    "desc": "ALDI Ireland has Mother’s Day range from €1.99 — with beauty bags, bathrobes and sweet treats.\nMother’s Day is creeping up - and the...",
    "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2026/02/newspress-collage-hww5s72lg-1771775994768.jpg?quality=90&strip=all&1771776006&w=1920&h=1080&crop=1",
    "source": "The Irish Sun"
  },
  {
    "title": "Nottingham Forest vs Liverpool - Premier League RECAP: Latest score, team news and updates as Reds look to chase down top four spot plus updates from two others games",
    "desc": "Follow Daily Mail Sport's live blog from Sunday's 2pm Premier League games featuring Nottingham Forest vs Liverpool, Crystal Palace vs Wolves and Sunderland vs Fulham.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/22/14/106580669-0-image-a-16_1771772368053.jpg",
    "source": "Daily Mail"
  }
]