[
  {
    "title": "What Happened With Savannah Guthrie Mom's Suspect's Glove?",
    "desc": "See what happened with the gloves found near the home of Savannah Guthrie's mom, Nancy and whether sheriff Chris Nanos is witholding evidence.",
    "image": "https://stylecaster.com/wp-content/uploads/2026/02/chris-nanos-savannah-nancy-guthrie_21c620.jpg?w=650",
    "source": "StyleCaster"
  },
  {
    "title": "Batista Lab Study Reveals How Local Antibody Feedback Regulates B Cell Competition and Promotes Immune Diversity",
    "desc": "A collaborative study published in Immunity from the Batista Lab and Liu Lab at the Ragon Institute, together with the Schief Lab at Scripps Research Institute, has uncovered a previously unrecognized mechanism that shapes how immune cells are selected during an immune response. When the immune system encounters a pathogen or vaccine, B cells that […]",
    "image": "https://ragoninstitute.org/wp-content/uploads/2026/02/batistapaperauthors-1440x1058.png",
    "source": "Ragon Institute"
  },
  {
    "title": "Actress Kemity Denies Trading Sex for Movie Roles",
    "desc": "Nollywood actress Kemisola 'Kemity' Apesin addresses rumors, stating she never traded sexual favors for movie roles and built her career on hard work.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/13193029/Kemity-960x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "FACT FOCUS: False claims the Trump Administration made about climate change and energy",
    "desc": "While announcing that he was rolling back the Environmental Protection Agency’s 2009 endangerment finding, President Donald Trump and EPA Administrator Lee Zeldin made false claims regarding the government declaration, climate change and energy.",
    "image": "https://dims.apnews.com/dims4/default/2ec17e1/2147483647/strip/true/crop/5871x3912+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb8%2Fa8%2F9f839b6171dc42b278ad9e8dfe91%2F6d8e78ae9c2a4cc59c4787d128fddafb",
    "source": "AP News"
  },
  {
    "title": "Settlers smash cars in West Bank after Palestinian attack",
    "desc": "According to reports, Palestinians approached an illegal farm established by Jewish settlers on private land in Area B of the West Bank. Police told KAN that dozens of Palestinians attacked the farm.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/706329",
    "source": "The Jerusalem Post"
  },
  {
    "title": "The 2026 Women’s AFCON confirmed in Morocco",
    "desc": "Despite the rumors of postponement or relocation, the president of the CAF, Patrice Motsepe, took advantage of his press conference in Dar Es Salam t...",
    "image": "https://sportnewsafrica.com/storage/short-post-images/01KHBNZ0XFZJQJJNE1B3BC0N7G.jpg",
    "source": "Sport News Africa"
  },
  {
    "title": "Stock Market Today: Stocks Rise Following Tame Inflation Report; Tech Sell-Off Eases",
    "desc": "Stocks rose on Friday after a crucial inflation report showed prices rose less than expected last month.",
    "image": "https://www.investopedia.com/thmb/1lMdC1Ccn3mf7KojHxQ5wdZQKAw=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/GettyImages-2260936030-146b7a42c88049199a4f5b5f5e049fc4.jpg",
    "source": "Investopedia"
  },
  {
    "title": "World's rules-based order 'no longer exists', Germany's Merz warns",
    "desc": "\"Our freedom is not guaranteed\" in an era of big powers, the German chancellor tells Munich's security summit.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2a0f/live/0cff21e0-08f6-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  },
  {
    "title": "Raptors waive G Chris Paul, open up roster spot",
    "desc": "Paul was acquired by Toronto ahead of last week's NBA trade deadline in a three-team swap that sent Ochai Agbaji to the Brooklyn Nets and got the Raptors under the luxury tax line.",
    "image": "https://www.sportsnet.ca/wp-content/uploads/2025/11/cp3.jpg",
    "source": "Sportsnet"
  },
  {
    "title": "based ports giant DP World quits after Epstein links revealed",
    "desc": "Sultan Ahmed bin Sulayem’s exit comes after files showed he appears to have exchanged hundreds of emails with Epstein.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1f08/live/7c4f3ae0-08eb-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  }
]