[
  {
    "title": "Emotionally ‘very shaken’: Father of girl killed in Chinatown crash mourns as Indonesian community rallies",
    "desc": "Mr Ashar Ardianto is physically well but emotionally overwhelmed, an Indonesian embassy spokesperson says, as his wife remains in SGH’s High Dependency Unit and fundraising efforts grow to cover her medical costs.",
    "image": "https://dam.mediacorp.sg/image/upload/s--sKk4cjWL--/c_crop,h_899,w_1599,x_1,y_1/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/16/20260213_chinatownaccident_008.jpg?itok=p5nVTBrz",
    "source": "CNA"
  },
  {
    "title": "Poem of the week - from plastic: A Poem by Matthew Rice",
    "desc": "Two time-stamped poems are taken from a book-length sequence tracking the human moments of a factory night shift",
    "image": "https://i.guim.co.uk/img/media/2dec9789ef0460e312d7b017e498be9552b4a7e4/0_0_2880_2304/master/2880.png?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d9be20b937e909416f1fd16f3ac954b6",
    "source": "The Guardian"
  },
  {
    "title": "Dr Bawumia can bounce back to win Ghana’s 2028 presidency",
    "desc": "Former Majority Leader of Parliament Osei Kyei-Mensah Bonsu, has expressed confidence that Former Vice President Dr Mahamudu Bawumia could win Ghana’s 2028 presidential election.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Screenshot-2026-02-16-092404.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Somali Region Invests in $1.58M Solar Power Initiative for Sustainable Energy",
    "desc": "Ethiopia's Somali Region has inaugurated a 200 million birr ($1.58 million) solar power project in Dig district, marking a significant advance in expanding renewable energy access to remote areas. The new facility, with a generation capacity of 350 kilowatts, is designed to provide uninterrupted, 24-hour electricity to the district, which previously lacked a reliable power",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs"
  },
  {
    "title": "Alcaraz says he still has 'weaknesses'",
    "desc": "The Australian Open winner will return to action in Doha",
    "image": "https://i.tribune.com.pk/media/images/11769949913-0/11769949913-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Africa Must Benefit From Its Mineral Resources",
    "desc": "UN Chief António Guterres calls for an end to the exploitation of Africa's mineral resources, urging fair value chains so the continent benefits first.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2021/11/01152632/Antonio-Guterres.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Ions Pave Smoother Path to Blue Energy",
    "desc": "Osmotic energy, often called blue energy, is a promising way to generate sustainable electricity from the natural mixing of salt and fresh water. It",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1574170608990-8b45e8d75449%3Fixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1351%26amp%3Bq%3D80",
    "source": "Mirage News"
  },
  {
    "title": "Awkward scenes in Colombo: Shaheen Afridi and Usman Tariq stand still as Team India snubs handshake - WATCH",
    "desc": "Cricket News: In a high-voltage clash at the ICC Men’s T20 World Cup 2026 in Colombo, India crushed Pakistan by 61 runs, delivering a commanding performance that on.",
    "image": "https://static.toiimg.com/thumb/msid-128418209,width-1280,height-720,imgsize-71616,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Donegal man not so blue after appearing on The 1% Club!",
    "desc": "FacebookTweetLinkedInPrint Image: ITV NOTE: Article contains spoilers A Donegal man charmed viewers with his good humour after appearing on ITV’s…",
    "image": "https://www.donegaldaily.com/wp-content/uploads/2026/02/Stephen-1-Club.jpg",
    "source": "Donegal Daily"
  },
  {
    "title": "Casio forms strategic partnership with Toyota Racing",
    "desc": "Casio has announced a new two-year partnership with TOYOTA RACING, the motorsports division of Toyota Motor Corporation, beginning in January 2026. The collaboration aims to strengthen the global presence of Casio’s EDIFICE sports watch brand, which reflects the precision, speed, and advanced technology associated with competitive motorsports. Built on shared values, the partnership highlights both…",
    "image": "https://i0.wp.com/cinemabravo.com/wp-content/uploads/2026/02/casio-forms-strategic-partnership-with-toyota-racing.png?fit=1200%2C675&ssl=1",
    "source": "CinemaBravo"
  }
]