[
  {
    "title": "Good Luck Getting Canon's 30th Anniversary Edition PowerShot G7 X Mark III",
    "desc": "Canon has announced a special, limited edition 30th Anniversary version of its super popular PowerShot G7 X Mark III compact camera.",
    "image": "https://petapixel.com/assets/uploads/2026/02/canon-powershot-g7x-iii-30th-featured.jpg",
    "source": "PetaPixel"
  },
  {
    "title": "Stephen Harper says Canada must urgently reduce its dependence on the U.S.",
    "desc": "Speaking at an Ottawa gala late Wednesday, former prime minister Stephen Harper said that Canada must urgently pivot in the face of an erratic U.S. president and reduce its dependence on the American market to protect its sovereignty and the continued functioning of the economy.",
    "image": "https://i.cbc.ca/ais/de3fb3eb-7e9d-4181-b80d-267790937c80,1770262569639/full/max/0/default.jpg?im=Crop%2Crect%3D%28130%2C0%2C3055%2C1718%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "2026 UG Corporate Football League launched as champions face tough draw",
    "desc": "The 2026 University of Ghana Corporate Football League was officially launched on Tuesday, February 3, with organisers promising a sharper, more...",
    "image": "http://www.businessghana.com/site/img/../../cms/img/news/2026-02-04-175231002.jpg",
    "source": "BusinessGhana"
  },
  {
    "title": "Second Australian dies in ski accident in Japan",
    "desc": "Melbourne man Michael Hurst was found unconscious by a group of skiers in Hokkaido on Monday.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/michael-hurst-source-linkedin-PTX7KXFUUBAE7INGL672AFOJQQ.jpg?auth=f7ae35e5a2dc3da8862c59f8780f1952bbb1c7734db9e5c7f0b5ae16c3d6ccb0&quality=70&width=600&height=315&focal=355%2C195",
    "source": "1News"
  },
  {
    "title": "Isuzu UTE A-League Round 16 Match Preview",
    "desc": "Wellington Phoenix head coach Giancarlo Italiano is taking the glass-half-full approach ahead of the Waitangi Day clash with Melbourne Victory.",
    "image": "https://wellingtonphoenix.com/wp-content/uploads/sites/11/2026/02/26-01-30-Ifeanyi-Eze-4.jpg?w=1200",
    "source": "Wellington Phoenix"
  },
  {
    "title": "Steve Nicol names Arsenal star Arteta must drop from XI",
    "desc": "Mikel Arteta has been advised to place Viktor Gyokeres at the “bottom of the pile” following his “embarrassing” contribution to Arsenal’s Carabao Cup semi-final victory over Chelsea.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/470/47007748.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "What Iwobi said about Kobbie Mainoo's physicality",
    "desc": "Super Eagles player Alex Iwobi has said that Manchester United’s Kobbie Mainoo caused him an injury during Fulham’s 3-2 loss at Old Trafford last weekend.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/906/90635135.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Nathania Ong, Singaporean West End star, returns home for Legally Blonde The Musical",
    "desc": "Known for her West End roles in London, Nathania Ong will be stepping into pink heels as Elle Woods in Singapore’s upcoming production of Legally Blonde The Musical.",
    "image": "https://dam.mediacorp.sg/image/upload/s--n0gPuu1r--/c_crop,h_599,w_1064,x_2,y_147/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/04/nathania_ong_2.jpg?itok=29oyabYQ",
    "source": "CNA Lifestyle"
  },
  {
    "title": "Aer Lingus announce major change to travel rules between Ireland and UK",
    "desc": "The Irish airline has been known to allow alternative forms of identification for travel but rules are changing",
    "image": "https://i2-prod.dublinlive.ie/article31501696.ece/ALTERNATES/s1200/0_GettyImages-1233207771.jpg",
    "source": "Dublin Live"
  },
  {
    "title": "Canon launches its widest hybrid prime lens yet",
    "desc": "Canon RF 14mm f/1.4L VCM is a seriously wide lens optimized for videography - and the most expensive RF hybrid yet",
    "image": "https://cdn.mos.cms.futurecdn.net/PmDEAteYPi6mGnHN8sfPAg-2560-80.jpg",
    "source": "Digital Camera World"
  }
]