[
  {
    "title": "Vancouver Mayor Ken Sim apologizes to councillor for unsubstantiated comments about distributing drugs",
    "desc": "Mayor Ken Sim says he has apologized to his council colleague Sean Orr for claiming without evidence in a media briefing earlier this month that Orr distributed illegal drugs. Orr has denied the allegation \"unequivocally\" and said the comments were ridiculous and defamatory.",
    "image": "https://i.cbc.ca/ais/b9780d76-0c4b-4d93-b4a1-266511b9601e,1772227507512/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C1920%2C1080%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "India closely monitoring Af-Pak escalation; backs Taliban but wary of full-blown conflict",
    "desc": "India News: India was closely monitoring the situation as Afghanistan and Pakistan seemed poised for a dangerous escalation, with Islamabad declaring that the two.",
    "image": "https://static.toiimg.com/thumb/msid-128869471,width-1280,height-720,imgsize-1012435,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "21 Orthodox Church Followers Reportedly Killed in the Latest attack in Arsi",
    "desc": "21 followers of Ethiopian Orthodox Church reportedly killed in Sherka district of Arsi, Oromia regional state.  Read more.",
    "image": "https://borkena.com/wp-content/uploads/2026/02/Arsi-_-Ethiopia-News-_-Amharic.jpg",
    "source": "Borkena"
  },
  {
    "title": "Three Killed In Worejarso Attack In Oromia Region",
    "desc": "Oromo Liberation Army reportedly killed three civilians in Worejarso district, Oromia region of Ethiopia. Read more.",
    "image": "https://borkena.com/wp-content/uploads/2026/02/Wore-Jarso-_-Gohatsion.jpg",
    "source": "Borkena"
  },
  {
    "title": "Machine learning estimation of FVIII pharmacokinetic parameters in Chinese children with severe Hemophilia A",
    "desc": "Hemophilia A is a rare inherited bleeding disorder typically managed with coagulation factor VIII (FVIII) replacement therapy. Designing personalized prophylactic regimens requires accurate pharmacokinetic (PK) characterization; current population PK (popPK) and Bayesian approaches provide a principled framework for individualized dosing, but their routine clinical implementation may still be constrained by model specification requirements and practical considerations in data collection and analysis. Here we present a machine learning (ML) framework, incorporating state-of-the-art language models, to predict individual FVIII PK parameters in pediatric patients. Using minimal sampling and routinely collected clinical data, our approach achieves superior performance over the widely adopted WAPPS-Hemo platform in predicting in vivo recovery (IVR) and FVIII half-life. These findings highlight the potential of AI-driven methods to reduce patient burden while improving accuracy in individualized treatment planning for children with severe hemophilia A.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "HK star in Penang to learn how to cook famous dishes",
    "desc": "HONG Kong star Elena Kong recently flew to Penang to learn how to cook two of its soul foods – asam laksa and hokkien mee (prawn noodles) – while celebrating Chinese New Year here.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/28/3791345.jpg",
    "source": "The Star"
  },
  {
    "title": "First Nations Chiefs pass vote of non-confidence in UCP government",
    "desc": "First Nations chiefs from across Alberta have unanimously passed a vote of non-confidence in Premier Danielle Smith’s UCP government",
    "image": "https://smartcdn.gprod.postmedia.digital/calgaryherald/wp-content/uploads/2026/02/first-nations-tsuut-ina-112625-12_300062958-1.jpg",
    "source": "Calgary Herald"
  },
  {
    "title": "Can Red Light Therapy Help With Muscle Recovery and Pain?",
    "desc": "Experts explain how red light therapy can help with recovery and pain management, and where it falls short.",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-02/260225-red-light-for-recovery-ac-main-e73682.jpg",
    "source": "NBC News"
  },
  {
    "title": "'We again made same mistakes': India captain pulls no punches after ODI series loss to Australia",
    "desc": "Cricket News: India captain Harmanpreet Kaur admitted on Friday that batting let the team down in the first two ODIs against Australia, leading to back-to-back defe.",
    "image": "https://static.toiimg.com/thumb/msid-128850463,width-1280,height-720,imgsize-33234,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "What to Expect From Apple's Big Week: iPhone 17e, Low-Cost MacBook, New iPads, and More",
    "desc": "Starting on Monday, we're going to get our first major product announcements of 2026. Apple CEO Tim Cook teased a \"big week ahead\" with...",
    "image": "https://images.macrumors.com/t/i45pIv3J9hVw5S1yOfw1UeoER88=/1888x/article-new/2026/02/Apple-Announces-Special-Event-in-New-York-Feature-1.jpg",
    "source": "MacRumors"
  }
]