[
  {
    "title": "Avoiding seed oils is an online trend, but are they as bad as some would have you believe?",
    "desc": "Claims that seed oils are \"toxic\" and \"inflammatory\" are being circulated on social media, but they don't tell the whole story, experts say.",
    "image": "https://live-production.wcms.abc-cdn.net.au/59adc4f95b5dd315a6bc4f030117b521?impolicy=wcms_watermark_news&cropH=1152&cropW=2048&xPos=0&yPos=285&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Trump Called for ‘De-Escalation’ in Minneapolis. It Didn’t Last Long.",
    "desc": "President Trump has offered dueling messages on the crisis in Minneapolis, part of a pattern of dialing back his rhetoric only to change again if the political winds are shifting.",
    "image": "https://static01.nyt.com/images/2026/01/30/multimedia/30DC-TRUMP-MINNEAPOLIS-top-fhmj/30DC-TRUMP-MINNEAPOLIS-top-fhmj-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Rents in Kampong Glam, Little India and Chinatown rose 'moderately' over past two years: URA",
    "desc": "The statement follows the announcement earlier this month that Warong Nasi Pariaman, said to be Singapore's oldest nasi padang stall, will close after nearly eight decades in Kampong Glam.",
    "image": "https://dam.mediacorp.sg/image/upload/s--OhJ85CAu--/c_crop,h_900,w_1600,x_0,y_300/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/01/23/warong_nasi_pariaman_3.jpg?itok=JApZZ4j3",
    "source": "CNA"
  },
  {
    "title": "Soldiers overrun bandit enclaves, rescue victims in Kwara",
    "desc": "Nigerian Army's Operation Igbo Danu overruns Kwara bandit enclaves, neutralising terrorists and rescuing multiple kidnap victims in a sustained offensive.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/01/31033534/ig-1080x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Two Malaysian business leaders honoured at Asean conference in UK",
    "desc": "KUALA LUMPUR: Two Malaysian business personalities have been honoured for their distinguished work.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/31/3747469.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "First-of-its-kind clinical guidance on psychedelic medicine released",
    "desc": "Unbound Medicine and Johns Hopkins Medicine today announced a significant expansion of the Johns Hopkins Psychiatry POC-IT Guide, a leading digital resource for clinicians and trainees worldwide.",
    "image": "https://www.news-medical.net/images/tags/TagImage-1831-45296002389942131275-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "'I spoke to ChatGPT 8 times a day' - Gen Z's loneliness 'crisis'",
    "desc": "AI chatbots are being used as 'surrogate friends' by young people who have lost the ability to socialise.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0d72/live/38ec35b0-fd0a-11f0-833e-6bf0186607ca.jpg",
    "source": "BBC"
  },
  {
    "title": "'I spoke to ChatGPT 8 times a day' - Gen Z's loneliness 'crisis'",
    "desc": "AI chatbots are being used as 'surrogate friends' by young people who have lost the ability to socialise.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/0d72/live/38ec35b0-fd0a-11f0-833e-6bf0186607ca.jpg",
    "source": "BBC"
  },
  {
    "title": "WWE SmackDown Results & Highlights 30-jan-2026: Bron Breakker stands tall, US title open challenge, AJ Styles appears before Royal Rumble match and more",
    "desc": "WWE News: WWE broadcast its January 30 episode of Friday Night SmackDown from the KAPD Financial District in Riyadh, Saudi Arabia. It was the go-home edition of.",
    "image": "https://static.toiimg.com/thumb/msid-127813098,width-1280,height-720,imgsize-989344,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Sporadic Nipah virus cases highlight importance of global surveillance",
    "desc": "The Global Virus Network (GVN), representing eminent human and animal virologists from more than 90 Centers of Excellence and Affiliates in over 40 countries dedicated to advancing research, collaboration, and pandemic preparedness, is monitoring reports of a Nipah virus outbreak in India and emphasizes that such cases, while very concerning and serious, are not unexpected or unprecedented. Sporadic Nipah virus infections have occurred almost annually in parts of South Asia, particularly in India and Bangladesh, and do not indicate a new or escalating global threat.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/Nipah_Virus-620x480.jpg",
    "source": "News-Medical"
  }
]