[
  {
    "title": "IDF more worried about ICJ than ICC",
    "desc": "Military officials say the ICJ genocide case worries them more than the ICC, as Israel prepares a major response ahead of a March deadline.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/555003",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Pharmac makes move towards funding weight loss drug Wegovy",
    "desc": "By Krystal Gibbens of RNZ Pharmac has taken the first steps towards funding weight loss drug Wegovy after an advisory panel provisionally recommended funding...",
    "image": "https://www.nzherald.co.nz/resizer/v2/QA5EWJGRCVACZKOUSP4SJZADAE.jpg?auth=52b9608857231afe4928f4bd12f96f3fc199a44f39149cdcff075556621d2284&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "Ohio Church Swells With Support for Haitians as Deportation Threat Looms",
    "desc": "In Springfield, which was thrust into the spotlight by President Trump during the 2024 campaign, hundreds of people turned out to back Haitians living in the city.",
    "image": "https://static01.nyt.com/images/2026/02/02/multimedia/02-nat-springfield-t-zmwq/02-nat-springfield-t-zmwq-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Crystal Palace transfer news: Jorgen Strand Larsen joins in club-record deal worth up to £48m",
    "desc": "Crystal Palace sign striker Jorgen Strand Larsen from Wolves in a club-record deal worth up to £48m.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c51d/live/bdcef140-006c-11f1-b49c-93e7b72bd9b3.jpg",
    "source": "BBC"
  },
  {
    "title": "Jerseys up for grabs as Farrell weighs up options",
    "desc": "It's just under two years since Andy Farrell picked a team for a Six Nations match, and when he does reveal his matchday squad for Ireland's opener against France in Paris tomorrow morning, it will be a much different side to his last in March 2024.",
    "image": "https://www.rte.ie/images/0023d698-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Moneyball theory reveals AFL teams to rise, fall this year… with 2025 finalists on watch",
    "desc": "Champ’s shock result as Moneyball theory reveals AFL teams to rise, fall this year",
    "image": "https://content.api.news/v3/images/bin/7791f663a2b7f1bea2b30eb4e62160fb",
    "source": "fox sports"
  },
  {
    "title": "The Prettiest Pink & Red Galentine’s Day Jewelry",
    "desc": "From red heart-shaped charms to rose gold metals, treat yourself (and your bestie) to these pretty jewelry picks.",
    "image": "https://akns-images.eonline.com/eol_images/Entire_Site/20260202/c8eb2008-c3bc-46e1-83dc-844f76a444fa_1770049951.jpg?fit=around%7C1080:1080&output-quality=90&crop=1080:1080;center,top",
    "source": "E! News"
  },
  {
    "title": "SpaceX counters Russia’s ‘unauthorized’ use of Starlink to guide drones in Ukraine",
    "desc": "Efforts to halt Russia’s use of the Starlink internet system to guide its drones for attacks on Ukraine have produced “real results,” Ukraine’s defense minister Mykhailo Fedorov said on Sunday.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/2025-06-05t212043z-1932073602-rc2kwea51ijx-rtrmadp-3-usa-trump-musk-spacex.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Samsung’s “Open Always Wins” Campaign Comes to Life in Milan",
    "desc": "Samsung invites fans to experience the Olympic spirit through bold out-of-home visuals across iconic Milan landmarks",
    "image": "https://img.global.news.samsung.com/ca/wp-content/uploads/2026/02/Duomo-Low-e1770058852329.jpg",
    "source": "samsung.com"
  },
  {
    "title": "Paedo bouncer rubbed himself against 14-year-old girl while drunk and high on cocaine",
    "desc": "A paedophile bouncer who sexually assaulted a teenage girl after a Christmas night out then harassed her mother has been labelled a “disgusting monster” and a “danger to children”.",
    "image": "https://prod-img.crimeworld.com/public/incoming/rjhokd-bouncer.jpg/alternates/SIXTEEN_NINE_1200/bouncer.JPG",
    "source": "Sunday World"
  }
]