[
  {
    "title": "Awuye sets ambitious targets as STAHIZA’s new co-cur",
    "desc": "School proprietor Justus Mugisha described Awuye as a seasoned educationist and respected sports administrator with vast experience at both continental and international levels.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/d91f3b61-a317-4a72-abbf-55db342a1ad8.jpg",
    "source": "NewVision.co.ug"
  },
  {
    "title": "India's AI boom pushes firms to trade near-term revenue for users",
    "desc": "ChatGPT and rivals are testing whether India's massive AI user boom can translate into paying customers as free offers wind down.",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/chatgpt-india-jagmeet-singh-techcrunch.jpg?resize=1200,800",
    "source": "TechCrunch"
  },
  {
    "title": "A Qualitative Descriptive Study of Peer Supporters’ Experiences Using the Women’s Health Action Co-Creation Approach",
    "desc": "Background: Breast and cervical cancer screening rates in Japan remain below international standards. Workplace peer support interventions may help promote women’s health behaviors, but few studies have explored the experiences of peer supporters in rural settings. Objective: To explore the roles, experiences, and challenges of female peer supporters who provided workplace peer support and were engaged in the Women’s Health Action Co-Creation Approach in the Kita-Iwate region of Japan. Methods: A qualitative descriptive study was conducted. Semi-structured interviews were conducted with seven female peer supporters who promoted breast and cervical cancer screening among their colleagues, and data were analyzed using qualitative content analysis. Results: Four core categories, representing the participants’ experiences of peer support, emerged from content analysis: workplace and regional contexts that enabled female employees to provide peer support to their female colleagues, ripple effects on individuals and their surroundings, sharing cancer screening information with colleagues and choosing communication methods, and psychological and social barriers and coping strategies. Peer supporters engaged in health promotion activities, using leaflets, to meet the needs of different age groups and workplace settings. They encouraged colleagues to undergo cancer screening while reinforcing their own health awareness. Psychological and social barriers, including embarrassment and time constraints, were addressed through culturally sensitive and flexible strategies. Collaboration with midwives, who provided professional guidance, supported peer supporters in implementing these activities, reflecting a unique feature of Japanese midwifery practice. Conclusions: Peer support contributes to fostering a local health culture, reducing psychological barriers, and promoting cancer screening. Internationally, these findings suggest that integrating peer networks with professional guidance and tailoring interventions to cultural, psychosocial, and generational contexts can enhance community- and workplace-based women’s health promotion. Future initiatives should expand peer support, utilize digital technologies, and maintain peer supporter motivation to embed sustainable health promotion practices.",
    "image": "https://file.scirp.org/image/ojn2024080115250044.png",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Surface Water Quality Assessment in the Southeastern Part of the Noun Catchment Area in Cameroon (Central Africa)",
    "desc": "This study aims to assess water quality and its suitability in terms of consumption and irrigation in the Noun Catchment Area (NCA) in the Western Highlands of Cameroon. To achieve this objective, 19 water samples were collected along the NCA. The measurement of physicochemical parameters, such as pH, electrical conductivity, alkalinity, salinity, suspended solids, along with eleven major elements (Na+, K+, Ca2+, Mg2+,\nNH\n4\n+\n, Cl−,\nNO\n3\n−\n,\nHCO\n3\n−\n,\nSO\n4\n2−\n,\nPO\n4\n3−\n, and F−) was also analyzed using conventional hydrochemical methods, Multivariate Statistical Analysis, and a geostatistical approach for spatialization of WQI,\nHCO\n3\n−\n, EC, Salinity,\nPO\n4\n−\n. The water quality index (WQI) illustrates three types of water: water of excellent quality, poor water quality, and water unsuitable for drinking purposes. Most of the samples from the NCA fall within the permissible limit of WHO (6.50 - 8.50) and ANOR (6.5 - 9) except for 3 samples from Koup in Baigom, Bameka, and Noun in Dioma, which are slightly above the standard limit for safe drinking water. The spatial distribution of WQI,\nHCO\n3\n−\n, EC, Salinity, and\nPO\n4\n2+\nwas performed. The northern and central parts of the study area exhibit high EC values. Fresh water availability was indicated by higher EC values in the north and central part of the study area and lower values in the south and their surroundings. Salt is present everywhere in that zone since the conductivity of water depends on the amount of salt in the area. The\nPO\n4\n−\nis present in the northern part of the study area, whereas the\nHCO\n3\n−\nis mainly found in the center of the study area. The southwestern and a small portion of the southeast section of the research area are heavily polluted by anthropogenic waste. The spatial distribution map of WQI shows the highest concentration in the central part of the study area. This suggests that the water in this part needs to be seriously treated before any use in conformity with the standards prescribed by the WHO and ANOR.",
    "image": "https://file.scirp.org/image/gep2025010716304140.png",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Finestra at Solaire North refreshes Italian dining in Quezon City",
    "desc": "Living in the northern reaches of the metro, Quezon City, QC, Kyusi for millennials, I am not sure what Gen Z or Gen Alpha call the country’s most populous...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/25/81659.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Infosys, TCS, other IT stocks rebound after ₹1.1 lakh crore rout; Here are some positive triggers",
    "desc": "All 10 stocks on the Nifty IT index are trading with gains in early trading on Wednesday. Mphasis and Persistent Systems are trading with gains between 3% to 4%, while Coforge, LTIMindtree, Tech Mahindra, HCLTech, TCS, Infosys and Wipro are also trading with gains between 2% to 3%.",
    "image": "https://images.cnbctv18.com/uploads/2026/02/what-is-next-in-ai-6-2026-02-6e507f5e4937564191f7c398ce165b16.jpg?im=FitAndFill,width=500,height=300",
    "source": "CNBC TV18"
  },
  {
    "title": "Climate Change Could Wipe Out Up to 65% of Africa’s Grazing Land by 2100, Study Says",
    "desc": "Africa’s grasslands could shrink up to 65% by 2100\nOver 110 million livestock farmers risk losing incomes\nGlobally, up to half of grazing land may",
    "image": "https://www.ecofinagency.com/media/k2/items/cache/7e328364878f6a1f63666d5f99a86e15_S.jpg",
    "source": "Ecofin Agency"
  },
  {
    "title": "Young picklers seek Asian spotlight in PCL Rising stars",
    "desc": "DAVAO City – The Pickleball Champions League Asia Rising Stars U19 Sectional Tournament in Davao City officially got underway at Pickletown here Tuesday, Feb....",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/25/81660.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Microalgae Biochar Speeds Low-Cost Hydrogen Peroxide Test",
    "desc": "Researchers have developed a new biochar material derived from marine microalgae that can detect hydrogen peroxide rapidly, sensitively, and without",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1460925895917-afdab827c52f%3Fixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bixlib%3Drb-1.2.1%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D702%26amp%3Bq%3D80",
    "source": "Mirage News"
  },
  {
    "title": "Scott Robertson lands new gig after All Blacks axing",
    "desc": "It will be Scott Robertson's first assignment since he was sacked as All Blacks coach in January.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/scott-robertson-the-new-zealand-head-coach-looks-on-during-t-H4XIOZJMDBA3NPNHCVI25SZ7U4.jpg?auth=9edcc95d2fa918d39b46e97adfc9412ec5e074056277824edbf92fb98bf53d41&quality=70&width=600&height=315&focal=479%2C227",
    "source": "1News"
  }
]