[
  {
    "title": "Farmer drags government to Supreme Court over cannabis licence fees",
    "desc": "A farmer from Techiman, Mariam Alhassan, has triggered a legal showdown at the Supreme Court after filing a landmark suit challenging the government’s regulatory regime for industrial cannabis cultivation.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/965/96569854.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Daily Post Nigeria",
    "desc": "Former Netherlands striker, Jimmy-Floyd Hasselbaink, believes that Chelsea will take points off Arsenal in the Premier League this weekend. The Gunners",
    "image": "https://dailypost.ng/wp-content/uploads/2022/11/jimmy-floyd-Hasselbaink.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Before You Call Your Partner Stingy, Have a Money Talk",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% Not all men are stingy.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/35.jpg",
    "source": "The Namibian -"
  },
  {
    "title": "Cronin relishing new challenge with the Girls in Green",
    "desc": "Gary Cronin, the new assistant manager of the Republic of Ireland women's team, is straight in at the deep end this week with games against France and the Netherlands looming. He discussed his ambitions for the role and plans to chat to Colin Healy after the camp ends.",
    "image": "https://www.rte.ie/images/0023f813-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Live updates: US, Israel attack Iran in ‘preemptive strike,’ Trump posts video on Truth Social",
    "desc": "President Donald Trump described the military campaign in Iran as “massive and ongoing.” Follow for live updates",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/150325082132-social-gfx-breaking-news.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Premier League buildup, Champions League draw reaction, and more - matchday live",
    "desc": "News, buildup and discussion before a busy day of football action",
    "image": "https://i.guim.co.uk/img/media/7395ef1e25fee3eec256109c8e7f9428aa193599/0_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=e30d2979506d07a1ca91a6b94b8bd640",
    "source": "The Guardian"
  },
  {
    "title": "Where Winds Meet Hexi Expansion brings Jade Gate Pass, new bosses, martial arts, desert exploration, and more on 6 March",
    "desc": "Where Winds Meet Hexi expansion begins March 6 with Chapter One Jade Gate Pass, introducing new regions, bosses, martial arts, and more.",
    "image": "https://i0.wp.com/gamingonphone.com/wp-content/uploads/2026/02/where-winds-meet-hexi-expansion-cover.jpg",
    "source": "GamingonPhone"
  },
  {
    "title": "The Stars That Lit Up the Early Milky Way",
    "desc": "Astronomers have used a special class of ancient, pulsating stars as celestial lighthouses to map the earliest chapter of our Galaxy's life and what they've found is rewriting what we thought we knew about how the Milky Way was born. By building the largest ever catalogue of these stellar beacons and tracing their movements back billions of years, the team has uncovered surprising similarities between our Galaxy's earliest structures, and even found evidence of the same story playing out in our nearest galactic neighbour.",
    "image": "https://www.universetoday.com/article_images/960px-Variable_stars_close_to_the_Galactic_Centre_20260228_080407.jpg",
    "source": "Universe Today"
  },
  {
    "title": "ICC Men’s Player of the Month for January 2026 announced",
    "desc": "New Zealand all-rounder named ICC Men’s Player of the Month for January 2026 after a stunning display with the bat against India.",
    "image": "https://images.icc-cricket.com/image/upload/t_ratio16_9-size20-webp/prd/zsdcfsxx8hejx1cv70jc",
    "source": "ICC"
  },
  {
    "title": "US and Israel launch attack on Iran, as Trump says 'major combat operations' under way",
    "desc": "Explosions have been reported in Tehran and in five other cities, according to Iranian media.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8af3/live/8f91e800-1471-11f1-801d-ed3cff6bf876.jpg",
    "source": "BBC"
  }
]