[
  {
    "title": "1 dead, 1 seriously injured after shooting at Chilliwack home",
    "desc": "The RCMP says it is investigating after a shooting Sunday morning that resulted in one person dead and another seriously injured in Chilliwack Sunday morning.",
    "image": "https://vancouver.citynews.ca/wp-content/blogs.dir/sites/9/2024/09/23/IHIT-Intergrated-Homicide-Investigation-Team.jpg",
    "source": "CityNews Vancouver"
  },
  {
    "title": "Hills Real Estate: With forced liquidation looming, flipping king Rickhil Prakash and staff joined new real estate firm",
    "desc": "A South Auckland real estate company linked to a $22 million tax investigation appears to have tried setting up under a new name one week out from a court...",
    "image": "https://www.nzherald.co.nz/resizer/v2/EXC6GPOMRVFQPLATZ2RQGPMFZM.jpg?auth=d5ddf4852626885fbfa79cfcf2f50421b38e3dff00a80ae4c5f443a04de78e97&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "How to reduce loneliness while working remotely",
    "desc": "Working from home can be a lonely experience. Here's what you can do about it.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--JWll86rs--/t_tohu-badge-facebook/f_auto/q_auto/4LV3GJE_image_crop_139785?_a=BAMABkiu0",
    "source": "RNZ"
  },
  {
    "title": "Australia news live: police announce new search for evidence at Gus Lamont’s home; court battle begins over Coles’ ‘discounts’",
    "desc": "Follow live",
    "image": "https://i.guim.co.uk/img/media/965cfc3839db4d0c445fa08e704bfde7d3a58503/0_0_2813_2250/master/2813.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=481050148e17c61808c800654a21d195",
    "source": "The Guardian"
  },
  {
    "title": "One in Three International Students Abandon Applications Over Poor Communication, New Research Finds",
    "desc": "Universities are losing prospective international students before they even apply, with one in three students abandoning an application altogether due to",
    "image": "https://thekoalanews.com/wp-content/uploads/2026/02/Omnichannel-Sinorbis.jpg",
    "source": "The Koala News"
  },
  {
    "title": "Winter Olympics 2026: Matt Weston and Tabby Stoecker win mixed team skeleton gold for Team GB",
    "desc": "Team GB enjoy historic day at Milan-Cortina as Matt Weston lands gold alongside Tabby Stoecker to become double Olympic champion; Britain claim two golds in one day and reach a record three golds at a single Winter Games after mixed snowboard success earlier on Sunday",
    "image": "https://e0.365dm.com/26/02/1600x900/skysports-stoecker-weston-olympics_7165979.jpg?20260215184708",
    "source": "Sky Sports"
  },
  {
    "title": "McGuinness 'took apart' Mayo plan",
    "desc": "Mayo manager Andy Moran conceded a \"very poor\" first-half display put paid to any chance of victory over Donegal in Letterkenny.",
    "image": "https://www.rte.ie/images/0023e61b-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Ocean pressure changes how carbon travels to the seafloor",
    "desc": "Deep sea pressure causes sinking ocean particles to leak carbon and nitrogen, feeding deep water microbes.",
    "image": "https://cff2.earth.com/uploads/2026/02/15131746/Ocean-pressure-carbon.jpg",
    "source": "Earth.com"
  },
  {
    "title": "Ledzokuku South Circuit triumphs in maiden Ga language competition as officials push cultural revival",
    "desc": "Students from the Ledzokuku South Circuit have emerged overall winners of the maiden inter-circuit Ga Language Reading Festival organised by the Ledzokuku Municipal Directorate of the Ghana Education Service (GES), in a closely contested competition aimed at promoting indigenous language learning and cultural preservation.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-15-at-15.17.56-2-e1771186713178.jpeg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Michael English hospitalised after heart attack at 46",
    "desc": "Country singer Michael English has revealed he suffered a shock heart attack aged 46 after blacking out on his way to a gig in Waterford.",
    "image": "https://i2-prod.irishmirror.ie/article30773138.ece/ALTERNATES/s1200/1_JS307770695.jpg",
    "source": "Irish Mirror"
  }
]