[
  {
    "title": "World Cancer Day 2026: Healthy Workplace And Corporate Habits To Reduce Cancer Risk",
    "desc": "World Cancer Day reminds us that many cancer risks can be lowered through informed choices and supportive environments.",
    "image": "https://images.news18.com/ibnlive/uploads/2025/11/Blood-Cancer-Pill-2025-11-00ad3f0245fb620acf8dc2db1700e857-16x9.jpg",
    "source": "News18"
  },
  {
    "title": "NPP Primaries: Here are the seven prophets who predicted win for Bawumia",
    "desc": "Some Ghanaian prophets made bold proclamations predicting victory for former Vice President Dr Mahamudu Bawumia ahead of the 2026 New Patriotic Party (NPP) primaries.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/685/68586001.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Watch as Prophet Worlasi celebrates with cake as his prophecy about Bawumia ‘comes to pass’",
    "desc": "The Head Pastor of the Kumasi Branch of Conquerors Chapel International, Prophet Emmanuel Worlasi, has been captured celebrating with his family after what he described as the fulfillment of his prophecy, following the close of polls in the New...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/611/61190064.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "DLSU Englicom transforms campus into festive CNY grounds",
    "desc": "EVERY triumph begins with a trail, a path shaped by resilience and the courage to move forward.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/01/920355.png",
    "source": "The Manila Times"
  },
  {
    "title": "Autopsy reveals cause of mass deaths among Nairobi street families",
    "desc": "There were concerns about the deaths of the about 15 street families in the city in the past month alone.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/ce4f0a39-ac44-428c-90f6-1fdf3957eaee.jpg?1769932801111",
    "source": "the-star.co.ke"
  },
  {
    "title": "Budget 2026: Check what gets cheaper and costlier in Union Budget this year",
    "desc": "Union Budget 2026 Cheaper Costlier List: Several items will become cheaper due to duty cuts. These include overseas tourism packages and energy transition equipment. However, penalties for income tax misreporting have increased. Securities Transaction Tax on stock options also saw a rise. This budget aims to boost growth and household sentiment.",
    "image": "https://img.etimg.com/thumb/msid-127832136,width-1200,height-630,imgsize-26150,overlay-economictimes/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Auction set for 8 Discaya cars on February 11",
    "desc": "Eight cars owned by contractor couple Curlee and Sarah Discaya will be up for auction this week.",
    "image": "https://media.philstar.com/photos/2025/11/20/discaya-luxury-car_2025-11-20_12-24-17.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "CEO of mala chain A Hot Hideout, 26, diagnosed with Stage 3 cancer",
    "desc": "When Mr Lee was 12, his nine-year-old brother died from a rare immune disorder. Mr Lee carries the same genetic risk. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/1de1a23745ac1ac9ecb24217322b586668a823068dc8bf49d0267e15a2707c14",
    "source": "The Straits Times"
  },
  {
    "title": "'Brutally honest' Wiltshire art show explores mental health",
    "desc": "'Art Heals' is on display in Corsham until the end of February.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b9bb/live/a73bd970-fc61-11f0-a7b3-13a56b7a31f4.png",
    "source": "BBC"
  },
  {
    "title": "Why do the Northern Lights keep appearing so far south?",
    "desc": "Why the Northern Lights keep appearing so far south and when you can see them again.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/645e/live/aa00b800-f5cd-11f0-a32c-ff5834b4c89e.jpg",
    "source": "BBC"
  }
]