[
  {
    "title": "Louvre Museum director resigns in wake of brazen October crown jewel heist in Paris",
    "desc": "Louvre Museum director Laurence des Cars resigns after months of pressure following the brazen theft of crown jewels, water damage, staff strikes, overcrowding complaints and a suspected ticket fraud scheme.",
    "image": "https://live-production.wcms.abc-cdn.net.au/da7655eac1a5bc335feecf1597641c21?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=113&width=862&height=485&imformat=generic",
    "source": "abc.net.au"
  },
  {
    "title": "The Foundational Elements for an Optimal Ethiopian Nile Basin Treaty Covering Water Allocation and Basin Management",
    "desc": "The Nile Basin Initiative (NBI, 1999) has gone a long way toward advancing this goal but remains unfinished. Read more.",
    "image": "https://borkena.com/wp-content/uploads/2026/02/Nile-Basin-_-Ethiopian-Dam.jpg",
    "source": "Borkena"
  },
  {
    "title": "New study finds Papua New Guinea children among world's most affected by ear disease",
    "desc": "Children in Papua New Guinea have some of the world's highest rates of childhood middle ear infections, a new study has found.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--c-lBV_E0--/t_tohu-badge-facebook/v1643534472/4ORIGUW_copyright_image_78613?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "MPs openly criticising Andrew reflects shift in tradition",
    "desc": "In the Commons, MPs shared their personal experiences of meeting the former prince – all of them were resoundingly negative.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cbe5/live/307c0fc0-11ac-11f1-a8f6-f18f581059b8.jpg",
    "source": "BBC"
  },
  {
    "title": "Hmm: Spirit Airlines Expects To Emerge From Chapter 11 Bankruptcy Soon",
    "desc": "Spirit Airlines claims that it will emerge from Chapter 11 bankruptcy in the coming months, stronger than ever. Is that really realistic?",
    "image": "https://cdn.onemileatatime.com/wp-content/uploads/2022/12/Spirit-Airlines-A321-Big-Front-Seat-11.jpeg",
    "source": "One Mile at a Time"
  },
  {
    "title": "Microgravity Mission to Unlock New Insights into Cancer Biology",
    "desc": "Space Mission to Provide Insights into Cancer Biology Supported by State Government Grant",
    "image": "https://img.einnews.com/facebook/1058466/rocket-launch-partners-cancer-r.jpeg",
    "source": "EIN Presswire"
  },
  {
    "title": "The Night Agent Underwhelms, The Hunting Party Lands",
    "desc": "The Gabriel Basso-led drama series took the number two spot in Netflix’s weekly ratings report with 8.4M views.",
    "image": "https://deadline.com/wp-content/uploads/2026/01/The_Night_Agent_n_S3_E3_00_02_55_13Rx.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Father of Georgia school shooting suspect described son's aggressive behavior in interview after attack",
    "desc": "A state investigator testified Tuesday that Colt Gray's father revealed his 14-year-old son had become aggressive and was in need of mental health counseling in the months leading up to the 2024 deadly rampage at a Georgia high school",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-02/260217-colin-gray-vl-357p-9da0ba.jpg",
    "source": "NBC News"
  },
  {
    "title": "Ted Lasso Season 4 Release Month Confirmed For Apple TV",
    "desc": "The wait for one of television's biggest shows just got a little narrower, as Ted Lasso season 4 finally has a release month at Apple TV.",
    "image": "https://static0.srcdn.com/wordpress/wp-content/uploads/2026/02/jason-sudeikis-smiling-as-ted-lasso-sitting-at-a-desk-in-season-3.jpg?w=1600&h=900&fit=crop",
    "source": "Screen Rant"
  },
  {
    "title": "Ethiopian Banks Hike Fees for National Disaster Fund",
    "desc": "Several Ethiopian banks are reportedly preparing to increase fees for digital banking and other financial services provided to their customers, as part of a",
    "image": "https://ethionegari.com/wp-content/uploads/2023/07/Mobile-money-jpg.webp",
    "source": "Ethio Negari"
  }
]