[
  {
    "title": "Nvidia's CEO Says the \"ChatGPT Moment\" for Physical AI Is Here: 1 Move to Make",
    "desc": "Key PointsEarlier this month, Nvidia's CEO Jensen Huang said his company had reached a \"ChatGPT moment\" regarding physical AI.",
    "image": "https://www.nasdaq.com/sites/acquia.prod/files/2019-05/0902-Q19%20Total%20Markets%20photos%20and%20gif_CC8.jpg",
    "source": "Nasdaq"
  },
  {
    "title": "WATCH: Ferran Torres fires Barcelona back in front against Elche",
    "desc": "Barcelona can go four points lead at the top of La Liga with a win over Elche, and they have gone 2-1 in front against Elche.Lamine Yamal has been one of the league’s best players this season, and i...",
    "image": "https://s.yimg.com/os/en/football_espana_articles_993/39d7a70af11089cb7de0da8e3396f343",
    "source": "Yahoo Sports"
  },
  {
    "title": "Petrol and diesel prices to drop in February",
    "desc": "PETROL prices will fall by N$1 per litre in February 2026, while the prices of both diesel variants (50ppm and 10ppm) will be reduced...",
    "image": "https://informante.web.na/wp-content/uploads/2024/07/Petrol-and-diesel-prices-decrease-Informante-Image-workspace_Facebook-1024x677.jpg",
    "source": "Informanté"
  },
  {
    "title": "Galway v Cork: Two Brian Hayes goals help Rebels to second league win",
    "desc": "Ben O'Connor's side respond strongly after trailing by seven points in first half",
    "image": "https://www.echolive.ie/cms_media/module_img/9905/4952957_3_seoimageog_2880183-2W_1W0A5013.jpg",
    "source": "echo live"
  },
  {
    "title": "Tinubu returns to Abuja after state visit to Turkey",
    "desc": "President Bola Tinubu returns to Abuja following a successful state visit to Türkiye, where he signed nine agreements on defence, energy, and security.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2025/09/16201109/IMG_8001.jpeg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Search suspended for missing fishermen after boat sinks off Massachusetts",
    "desc": "Seven people were reported aboard the Lily Jean, a fishing boat featured on the History Channel miniseries Nor'easter Men.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2acc/live/262eb510-fee0-11f0-bde6-39dbeae3fac9.jpg",
    "source": "BBC"
  },
  {
    "title": "WWE News, AEW News, Pro Wrestling Backstage News",
    "desc": "The field of surprises in the 2026 WWE women's Royal Rumble match. Among the surprises was the return of Tiffany Stratton.",
    "image": "https://d1fcaprh3kb5t7.cloudfront.net/wp-content/uploads/2026/01/31153321/HABHj6WW0AErpZr.jpg?v=20260131203345",
    "source": "Fightful"
  },
  {
    "title": "Kerry community celebrates St Brigid with annual Biddy",
    "desc": "The origins of the annual Biddy - its members dressed in white and sporting flamboyant hats made out of oaten straw - is unknown, but is believed to be linked to centuries old customs celebrating the goddess/St Brigid, and the arrival of spring (Imbolc).",
    "image": "https://www.rte.ie/images/0023d482-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "AC Milan goalkeeper Mike Maignan signs new deal to 2031",
    "desc": "AC Milan secured the long-term future of Mike Maignan after the goalkeeper signed a new deal to 2031 on Saturday. Maignan had an immediate impact after joining Milan from Lille in 2021 to replace Gianluigi Donnarumma, who left to Paris Saint-Germain. The France international helped Milan win Serie A in his first season and was named Serie A goalkeeper of the season.",
    "image": "https://s.yimg.com/ny/api/res/1.2/a6ID9UD8P7AAXJYaXGbDyw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/ap.org/7028135e67d99e19b9357069e98750fc",
    "source": "Yahoo Sports"
  },
  {
    "title": "Algal bloom brings 'sense of grief' to parts of Yorke Peninsula",
    "desc": "While Adelaide is largely having a reprieve from the algal bloom, it is a different story on the south-west tip of the Yorke Peninsula with locals reporting fish kills and discoloured water.",
    "image": "https://live-production.wcms.abc-cdn.net.au/a4f542db5570d92c3b859976f297dc9d?impolicy=wcms_watermark_news&cropH=1646&cropW=2927&xPos=0&yPos=7&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  }
]