[
  {
    "title": "“‘How long do we want to support this thing?’ And Jensen said, ‘For as long as we shall live.’”",
    "desc": "Nvidia CEO Jensen Huang, that is, re: the Nvidia Shield TV, likely the most supported Android gadget ever at over a decade. Nvidia’s Andrew Bell tells Ars Technica a new model isn’t in active development, but hints at what he’d add (like AV1 and YouTube HDR). He says Nvidia doesn’t profit off its Netflix button, BTW.\n[Link: Inside Nvidia's 10-year effort to make the Shield TV the most updated Android device ever | https://arstechnica.com/gadgets/2026/01/inside-nvidias-10-year-effort-to-make-the-shield-tv-the-most-updated-android-device-ever/ | Ars Technica]",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/nvidia-gdc-shield-hold.0.webp?quality=90&strip=all&crop=0,3.2535527299925,100,93.492894540015",
    "source": "The Verge"
  },
  {
    "title": "“Land is Angola’s social security”: Catholic Church, Government Urged to Lead Agricultural Regeneration Efforts",
    "desc": "The founder of the Songhai Center in Porto-Novo, Benin, has urged the Catholic Church and the Government of Angola to prioritize the restoration of degraded farmland and the training of young people in sustainable agriculture.",
    "image": "https://www.aciafrica.org/images/aci-africa-photo-edit-2026-02-02t181915_1770055552.jpg?w=1200&format=jpeg",
    "source": "aciafrica.org"
  },
  {
    "title": "NASA's Perseverance Rover completes its first AI",
    "desc": "During the demonstration, NASA engineers used vision-language models, or VLMs, to create waypoints on Mars for Perseverance.",
    "image": "https://www.therobotreport.com/wp-content/uploads/2026/02/pia26344-perseverance-selfie-at-cheyava-featured.jpg",
    "source": "The Robot Report"
  },
  {
    "title": "Artificial Intelligence, Job Loss, and the Psychiatric Significance of Work",
    "desc": "AI-driven job loss threatens mental health, highlighting the need for societal responses that recognize work's vital role.",
    "image": "https://cdn.sanity.io/images/0vv8moc6/psychtimes/7145d34aba12a1dec3d64e59d7b62d21ed79ff1a-4000x2250.jpg",
    "source": "Psychiatric Times"
  },
  {
    "title": "'ICE out' at the Grammys: Bad Bunny, Billie Eilish and others use speeches to protest Trump's immigration crackdown",
    "desc": "While music's biggest night took place in Los Angeles, many stars used the occasion to demonstrate against the administration's Immigration and Customs Enforcement operations in Minneapolis.",
    "image": "https://s.yimg.com/ny/api/res/1.2/O3ixDOrGAxYhzjlCMpldkA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://d29szjachogqwa.cloudfront.net/images/user-uploaded/thumb-grammys-ice-speeches.jpg",
    "source": "yahoo.com"
  },
  {
    "title": "Collins Sichenje: Charlton Explain Why They Signed Harambee Stars Defender",
    "desc": "Charlton Athletic signs Harambee Stars defender Collins Sichenje on a three-and-a-half-year deal, bolstering their squad as they aim for Championship success.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/2f07ef8e47beedf9.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "Detroit-based bank takes over assets of failed Chicago institution",
    "desc": "The move follows the closure of Metropolitan Capital Bank & Trust.",
    "image": "https://www.detroitnews.com/gcdn/presto/2023/03/29/PDTN/98ed2a6c-3e43-45a2-a675-c2cfbbd93edc-fdic-bg-adfc0356-ce66-11ed-8e62-fad4072a41cf.jpg?crop=5844,3287,x0,y279&width=3200&height=1800&format=pjpg&auto=webp",
    "source": "The Detroit News"
  },
  {
    "title": "Sony's flagship WF-1000XM6 earbuds appear in leaked listing",
    "desc": "Sony broke ground with the WF-1000XM4 earbuds when they launched just under six years ago. Two generations later, and Sony...",
    "image": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2026/02/Sony-WF-1000xm6-leak-header.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "source": "9to5Google"
  },
  {
    "title": "Several Britons dead after stomach illnesses in Cape Verde - what we know so far",
    "desc": "Four British people have died within a period of four months after being struck down with stomach bugs while holidaying in Cape Verde. | ITV National News",
    "image": "https://images.ctfassets.net/pjshm78m9jt4/1Z5IeYLpr5zFs4bNfi3iB0/22d48614b4844c705ab40f197853ea4a/verdet.jpg?fm=jpg&fit=fill&w=1600&h=900&q=80",
    "source": "ITVX"
  },
  {
    "title": "US will lower India tariffs to 18% after Modi agrees to stop buying Russian oil, says Trump",
    "desc": "The US has reduced tariffs on Indian goods from 50% to 18% following an agreement for India to stop buying Russian oil. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/2ae75e228fcbda5b9c07e6d0b1c2c1a5cc58845fc0ffd9c9e0bb4ffc53136e8c",
    "source": "The Straits Times"
  }
]