[
  {
    "title": "Corsair Closes Drop Store; Products Will Live On in \"New Homes\"",
    "desc": "Corsair acquired Drop in December 2023 in an effort to expand its peripheral business beyond the basic gaming keyboards and audio gear it offered at the time, and it has since adopted some of Drop's keyboard expertise into its new Corsair MAKR 75 DIY keyboard kits. Now, Drop has announced that Corsa...",
    "image": "https://www.techpowerup.com/img/az7nrUkqt08AVvuv.jpg",
    "source": "TechPowerUp"
  },
  {
    "title": "Ireland fall to narrow loss to Azerbaijan",
    "desc": "Ireland's Eurobasket 2029 qualifying campaign lay in tatters after a narrow 76-75 home defeat to an emotion-filled performance by Azerbaijan, the bottom-ranked country in the group.",
    "image": "https://www.rte.ie/images/0023f8c2-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Unified boxing champ Oleksandr Usyk to face Rico Verhoeven at Pyramids of Giza",
    "desc": "Sometimes these things happen in boxing.",
    "image": "https://www1-cdn.sherdog.com/_images/headers/20260227103157_giza.JPG",
    "source": "Sherdog"
  },
  {
    "title": "Marco Rubio: Iran designated state sponsor of wrongful detention",
    "desc": "\"The Iranian regime must stop taking hostages and release all Americans unjustly detained in Iran,\" Rubio said, as Trump states he is \"not happy\" with the negotiations.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/708806",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Attorney General Pam Bondi announces 30 more indicted in Minnesota church protest",
    "desc": "Attorney General Pam Bondi says federal prosecutors have indicted 30 more people tied to a protest at a Minnesota church over an immigration enforcement crackdown.",
    "image": "https://dims.apnews.com/dims4/default/29bbbae/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F70%2Fdf%2F0ef7703d6d664f352751538e975e%2Fb8cac2b6e060424dbc19c81d983bddb4",
    "source": "AP News"
  },
  {
    "title": "Trump says additional talks with Iran expected on Friday",
    "desc": "Tensions between the U.S. and Iran are escalating, with Washington ordering a significant military build-up in the region and multiple countries evacuating diplomatic staff amid fears of further instability.",
    "image": "https://anewz.tv/data/images/2026-02-27/25281_2026-02-27t181010z-1176219787-rc2huja2pw29-rtrmadp-3-usa-trump_f.JPG?t=1772237054",
    "source": "AnewZ"
  },
  {
    "title": "Before Retiring, Warren Buffett Sold These 3 Stocks and Piled Into This High-Yield Investment",
    "desc": "Buffett passed the reins to Greg Able as Berkshire's new CEO at the end of 2025 -- but not before making some big moves.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F856053%2Fbuffett17-tmf.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Labour MPs demand Starmer change course after humiliating byelection loss",
    "desc": "Scale of defeat to Greens has plunged party into fresh despair and again raised prospect of leadership challenge",
    "image": "https://i.guim.co.uk/img/media/07642e4fe1776a3668a9715a66c704bcac0e3305/573_0_4801_3843/master/4801.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=365f99d4d956e28cade3de0620ba61fa",
    "source": "The Guardian"
  },
  {
    "title": "Drogs to cover 'full cost' of Oriel Park pitch damage",
    "desc": "Drogheda United will cover the full cost of the damage caused to Dundalk's Oriel Park pitch after fans threw flares on to the field of play before last week's SSE Airtricity Men's Premier Division derby.",
    "image": "https://www.rte.ie/images/0023f859-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Tram derails in central Milan leaving two dead",
    "desc": "A tram derails in the heart of Milan close to the city's Central Station, killing two people and injuring around 40 others.",
    "image": "https://live-production.wcms.abc-cdn.net.au/e8874aa27d038107a5d05b38e6025cd9?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  }
]