[
  {
    "title": "China-Canada trade breakthrough: Beijing eases agriculture tariffs after Mark Carney visit",
    "desc": "China has announced to suspend some tariffs on Canadian agricultural products after Prime Minister Mark Carney struck an initial deal with Beijing during high-level talks in January.\nThe...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-27/1393978_034552_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "QuickCheck: Was 7% the highest EPF dividend payout in Malaysia?",
    "desc": "WITH the Employees Provident Fund set to announce its dividend rates for 2025 on Saturday (Feb 28), Malaysian workers are eagerly anticipating what returns they'll receive on their retirement savings.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/27/3790749.jpg",
    "source": "The Star"
  },
  {
    "title": "Rwanda: RDF Army Chief On Official Visit to Mozambique",
    "desc": "The Army Chief of Staff of Rwanda Defence Force (RDF), Maj Gen Vincent Nyakarundi, on Thursday, February 26 began an official visit to Cabo Delgado Province in Mozambique, reaffirming ongoing security cooperation between the two countries in the fight against terrorism.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Kerala High Court lifts stay on release of Kerala Story 2 movie",
    "desc": "A Division Bench of Justices SA Dharmadhikari and PV Balakrishnan lifted the stay imposed by single-judge Justice Bechu Kurian Thomas on Thursday.",
    "image": "https://media.assettype.com/barandbench%2F2026-02-19%2Fcx9xobrw%2Fkerala-High-Court-kerala-story-2?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Bar and Bench"
  },
  {
    "title": "Newcastle news: Eddie Howe urges Anthony Gordon to stay 'fully focused' amid Arsenal talk",
    "desc": "Head coach Eddie Howe has urged Anthony Gordon to stay \"fully focused\" after the Newcastle United forward was linked with a move to Arsenal.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ecda/live/0cc941f0-13c4-11f1-8c68-835571867502.jpg",
    "source": "BBC"
  },
  {
    "title": "Newcastle news: Eddie Howe urges Anthony Gordon to stay 'fully focused' amid Arsenal talk",
    "desc": "Head coach Eddie Howe has urged Anthony Gordon to stay \"fully focused\" after the Newcastle United forward was linked with a move to Arsenal.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ecda/live/0cc941f0-13c4-11f1-8c68-835571867502.jpg",
    "source": "BBC"
  },
  {
    "title": "Stanbic Bank Ghana leads US$205m financing for Engineers & Planners:",
    "desc": "The five-year facilities, structured in two tranches (US$110 million and US$95 million), will support E&P’s ongoing contract mining operations, particularly its long-term engagement with Gold Fields Ghana Limited (Gold Fields Ghana). Ecobank Ghana PLC and Absa Bank Ghana LTD participated as key lending partners, underscoring strong collaboration within Ghana’s banking sector to mobilise capital at scale.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-27-at-11.19.53.jpeg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Anthropic CEO Dario Amodei tells Nikhil Kamath why he could not work in OpenAI: ‘I just …’",
    "desc": "Tech News News: Anthropic CEO Dario Amodei has said that differences over the vision and approach to artificial intelligence were the primary reasons he left OpenAI, .",
    "image": "https://static.toiimg.com/thumb/msid-128845200,width-1280,height-720,imgsize-33340,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Arne Slot delivers ominous Florian Wirtz injury update with Liverpool star set to miss West Ham clash",
    "desc": "Liverpool boss Arne Slot has delivered an ominous injury update on Florian Wirtz, with the Dutchman admitting that he is unsure when the German playmaker will be available again. Wirtz, who picked up a problem when warming up ahead of the Reds’ Premier League trip to Nottingham Forest, will definitely sit out a home date with relegation-threatened West Ham on Saturday.",
    "image": "https://assets.goal.com/images/v3/blt47958a9bdd10d989/GOAL%20-%20Blank%20WEB%20-%20Facebook%20-%202026-02-27T095600.406.png",
    "source": "Goal.com"
  },
  {
    "title": "Strengthening Traditional Medicine: WHO Launches New Collaborating Centre",
    "desc": "The Charité Competence Center for Traditional and Integrative Medicine (CCCTIM) at Charité Universitätsmedizin in Berlin has been designated as the WHO Collaborating Centre for Traditional, Integrative, and Preventive Medicine for the next four years. This is the first collaborating centre to support the Global Traditional Medicine Centre (GTMC) in this thematic area, establishing Berlin as",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  }
]