[
  {
    "title": "Jail for driver who was speeding when he hit 76-year-old woman, killing her",
    "desc": "The elderly woman was crossing the road, looking to her left when Ang Kim Chuan's vehicle collided with her from her right.",
    "image": "https://dam.mediacorp.sg/image/upload/s--1NRxynB---/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/13/bukit_batok.png?itok=fnQoufHT",
    "source": "CNA"
  },
  {
    "title": "Kindiki pushes for faster implementation of IBEC resolutions",
    "desc": "“We have seen some progress in implementing IBEC decisions, but it is not enough; we must do better. This is a high-level meeting bringing together all levels of government, and there is no reason for institutions to delay implementation,” the DP stated. - Kenya breaking news | Kenya news today | Capitalfm.co.ke",
    "image": "https://www.capitalfm.co.ke/news/files/2026/01/KITHURE-KINDIKI-.jpg",
    "source": "Capitalfm.co.ke"
  },
  {
    "title": "Hull City vs. Chelsea, FA Cup: Preview, team news, how to watch",
    "desc": "The Liam Rosenior Derby",
    "image": "https://platform.weaintgotnohistory.sbnation.com/wp-content/uploads/sites/178/2026/02/gettyimages-1245223070.jpg?quality=90&strip=all&crop=0%2C15.514154323855%2C100%2C34.908318847393&w=1200",
    "source": "We Ain't Got No History"
  },
  {
    "title": "Why youth must champion peace, unity and development",
    "desc": "DAR ES SALAAM: IT is crucial for young people to champion peace, unity and development because they are both the present strength and the future architects of the nation. The stability Tanzania enjoys today was built through sacrifice, wisdom and collective responsibility. If that peace is weakened, it is the youth who stand to lose",
    "image": "https://dailynews.co.tz/wp-content/uploads/2025/11/Peace-1.png",
    "source": "dailynews.co.tz"
  },
  {
    "title": "IPOPHL urges ASEAN IP offices to push for commercialization thru strengthened TISC network",
    "desc": "The Intellectual Property Office of the Philippines (IPOPHL) urged ASEAN intellectual property (IP) offices to place commercialization at the heart of...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/13/79112.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Hotels Association raises alarm over high utility tariffs",
    "desc": "The Ghana Progressive Hotels Association (GHAPROHA) has expressed serious concerns over the high cost of utility services, saying the situation is negatively affecting the operations and sustainability of hotels across the country.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/315/31568375.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Kohat escapes major disaster as explosive-filled vehicle defused",
    "desc": "Security forces disable suspicious vehicle before it reaches target",
    "image": "https://i.aaj.tv/large/2026/02/131250469163d82.webp",
    "source": "Aaj English TV"
  },
  {
    "title": "Afghan soil must not be used for terrorism, Pakistan tells UN",
    "desc": "UN Security Council unanimously renews Taliban sanctions Monitoring Team mandate for another 12 months",
    "image": "https://i.tribune.com.pk/media/images/untitled-design-2026-02-13t115455-4171770965695-0/untitled-design-2026-02-13t115455-4171770965695-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "‘Drama pero walang gawa’: Palace calls VP Sara an ‘emotional vulture’",
    "desc": "Palace Press Officer Claire Castro did not mince her words against Vice President Sara Duterte, calling her an “emotional vulture” who was pretending to be concerned about the country’s problems, but is not doing anything to actually help solve anything.",
    "image": "https://media.philstar.com/photos/2025/09/16/sara-duterte-2026-budget-hearing-philippine-star_2025-09-16_15-39-34.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Key Lessons from the Fair Competition Tribunal’s decision in Tanga Fres : Clyde & Co",
    "desc": "Tanga Fresh Limited (the Appellant), a dairy company operating in Tanzania, was found by the Fair Competition Commission (FCC) to have contravened merger notification requirements under the Fair Competition Act, No. 8 of 2003 (the FCA).",
    "image": "https://www.clydeco.com/getattachment/7c09bba7-125a-445a-92fa-bc7dae436e8d/facebook-image?variant=introbannerdesktopvarient",
    "source": "Clyde & Co"
  }
]