[
  {
    "title": "Political tensions steal spotlight at Berlin Film Festival closing ceremony",
    "desc": "The 76th Berlin Film festival has come to an end, but the headlines were not just about the movies. While the festival showcased powerful stories ranging from family dramas to 17th-century...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-21/1393118_034703_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "DHQ & W'Africa Forces Develop New Combat Strategies",
    "desc": "Discover how West African armed forces are developing new combat strategies to tackle regional threats in a four-day workshop hosted by Nigeria's DHQ.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2022/03/18045939/ezgif.com-gif-maker.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Forum supports women living with epilepsy across all life stages",
    "desc": "Epilepsy Action Australia and Australian Women with Epilepsy are inviting women across the country to take part in a powerful one-day forum designed to uplift, inform and support women living with epilepsy. Taking place on Saturday 7 March 2026, this unique event will be livestreamed nationally bringing together leading medical specialists and women with lived [...]",
    "image": "https://pakenhamnews.starcommunity.com.au/files/2026/02/epilepsy_533919_01.jpg",
    "source": "Pakenham Officer Star News"
  },
  {
    "title": "China's Xuelong wraps up ocean mission in 42nd Antarctic expedition",
    "desc": "China's research icebreaker Xuelong left Antarctica's Terra Nova Bay in the Ross Sea on Saturday after picking up 69 members of the summer team from Qinling Station, as the station enters its overwintering phase.The crew recovered the final acoustic",
    "image": "https://news.cgtn.com/news/2026-02-21/China-s-Xuelong-wraps-up-ocean-mission-in-42nd-Antarctic-expedition-1KWGhWcCk4E/img/ec84eec0fc41426b9fe4867f78a0ce40/ec84eec0fc41426b9fe4867f78a0ce40-1280.png",
    "source": "news.cgtn.com"
  },
  {
    "title": "“I am not a Zionist”: Hugh Laurie responds after Dana Eden tribute sparks backlash",
    "desc": "UK News: Hugh Laurie faced backlash after paying tribute to late producer Dana Eden. He responded firmly to accusations of being a Zionist, emphasizing the importance of mourning over political disputes.",
    "image": "https://static.toiimg.com/thumb/msid-128641697,width-1280,height-720,imgsize-548640,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Of hopes and hearts: Juba orphanage inspires futures once unimaginable",
    "desc": "JUBA – It’s a quiet Saturday at the Confident Children out of Conflict center in Juba. While violence is rising across the country, the space is a rare sanctuary amidst the chaos.A sanctuary that",
    "image": "https://unmiss.unmissions.org/sites/default/files/styles/3_2_lg/public/2026-02/new.jpg?h=aade5fe1&itok=M6Lvldxi",
    "source": "UNMISS"
  },
  {
    "title": "IOB Officers’ Association threatens nationwide strike on Mar 2 over alleged coercive practices",
    "desc": "IOB Officers’ Association plans nationwide strike on March 2 over concerns of coercive practices and workplace culture issues.",
    "image": "https://bl-i.thgim.com/public/incoming/thhmvb/article70659666.ece/alternates/LANDSCAPE_1200/2501_19_2_2025_12_39_37_3_DSC_8872.JPEG",
    "source": "BusinessLine"
  },
  {
    "title": "Pakistan, US Pledge to Deepen Economic Cooperation in Key Sectors",
    "desc": "A Pakistani delegation, led by Finance Minister Senator Muhammad Aurangzeb, met with US Commerce Secretary Howard A. Lutnick at the",
    "image": "https://thediplomaticinsight.com/wp-content/uploads/pu-8.jpg",
    "source": "The Diplomatic Insight"
  },
  {
    "title": "Experts call for transforming mindsets and curriculum at seminar on disability and social inclusion at JMI",
    "desc": "The Centre for the Study of Social Inclusion (CSSI) Jamia Millia Islamia (JMI), in collaboration with the Office of the Dean, Academic Affairs, on 18 .",
    "image": "https://static.toiimg.com/thumb/msid-128640646,width-1280,height-720,imgsize-193718,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Smriti Mandhana, Jemimah Rodrigues power India to 176 in Adelaide T20I",
    "desc": "Smriti Mandhana and Jemimah Rodrigues helped India post 176/6 in the third and final match of the ongoing India vs Australia Women's T20I series at the Adelaide Oval on Saturday.",
    "image": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTA1ZTFjOWEwLTBmMTEtMTFmMS1hN2NkLWExNzYyOTNmNDNjZS5qcGc=",
    "source": "Tribune India"
  }
]