[
  {
    "title": "Slow Shear Waves Defy Physics In New Holographic Simulations",
    "desc": "Researchers have discovered a novel, unusually slow shear mode in simulated materials exhibiting strong interactions, revealing a departure from typical fluid behaviour and offering a new avenue for understanding anomalous transport phenomena.",
    "image": "https://quantumzeitgeist.com/wp-content/uploads/Image_fx-18-36.jpg",
    "source": "Quantum Zeitgeist"
  },
  {
    "title": "Simplifying library prep: All in a day’s work for Louise Fraser",
    "desc": "As Fraser and her team prepare for the launch of Illumina’s constellation mapped read technology, she looks back on a nearly 20-year career",
    "image": "https://assets.illumina.com/content/dam/illumina-marketing/images/company/featured-articles-v2/Louise_Fraser_Functional_Team.png",
    "source": "Illumina"
  },
  {
    "title": "Jill Zarin Stunned Over Sudden Firing From E! Over Halftime Show Opinion",
    "desc": "Jill Zarin is struggling to process her sudden firing from E!'s upcoming reunion series \"The Golden Life\" and TMZ has learned she feels blindsided by the fallout.",
    "image": "https://imagez.tmz.com/image/e7/16by9/2026/02/10/e7bf517ae7c54a48bef583f559462e2a_xl.png",
    "source": "TMZ"
  },
  {
    "title": "Turbulence warning was not relayed to plane before flight attendants were seriously injured",
    "desc": "Pilots aboard a United Airlines flight where three flight attendants were seriously injured were not warned about turbulence reported by a plane in front of them, the National Transportation Safety Board concluded Tuesday.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/screenshot-2026-02-10-at-5-17-04-pm.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "trick on starting debut in English Championship for Norwich",
    "desc": "Mohamed Toure moved to England recently on a $5 million deal and it is already looking like a great decision for the 21-year-old forward.",
    "image": "https://live-production.wcms.abc-cdn.net.au/bcf4af5c993a36e6c7392b9b4db6ea30?impolicy=wcms_watermark_news&cropH=487&cropW=866&xPos=116&yPos=56&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "QC human milk bank serves recipients from neighboring cities",
    "desc": "QUEZON City Mayor Joy Belmonte on Tuesday said that the majority of the beneficiaries of the Quezon City Human Milk Bank (QCHMB) in 2025 came from neighboring localities, including Bulacan.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/11/933043.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "Mike Burgess says alleged Bondi terrorists ‘went dark’ before attack",
    "desc": "Australia’s spy chief has revealed the accused Bondi terrorists “went dark” to prevent detection ahead of the alleged mass murder event during a Chanukah celebration in December.",
    "image": "https://content.api.news/v3/images/bin/abe279d327a95e557ecbed30897b7312",
    "source": "News.com.au"
  },
  {
    "title": "Britney Spears sells rights to music catalog for undisclosed sum, say reports",
    "desc": "Music publisher Primary Wave said to have bought rights to pop star’s music, including Toxic and Baby One More Time",
    "image": "https://i.guim.co.uk/img/media/7e599eaa0e00a135bd1b5aafe97af8589cc314b0/43_0_3001_2401/master/3001.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e7f3a18bfc0f2594d303e6f657169fbb",
    "source": "The Guardian"
  },
  {
    "title": "Australia Day Honours recognise leaders tackling diabetes across Australia",
    "desc": "Australians working across diabetes care, endocrinology, vascular medicine and First Nations health have been recognised in the 2026 Australia Day Honours.",
    "image": "https://www.diabetesaustralia.com.au/wp-content/uploads/Aus_Flag.jpg",
    "source": "Diabetes Australia"
  },
  {
    "title": "New video shows Mike Perry and Eddie Alvarez getting into wild brawl at BKFC event; Alvarez adds ‘It was deserved’",
    "desc": "Mike Perry got involved in a wild brawl at BKFC KnuckleMania VI with past opponent Eddie Alvarez",
    "image": "https://platform.mmafighting.com/wp-content/uploads/sites/109/2026/02/IMG_1797.jpg?quality=90&strip=all&crop=0%2C16.386212235419%2C100%2C67.227575529163&w=1200",
    "source": "MMA Fighting"
  }
]