[
  {
    "title": "'When cocoa farmers cried over delayed payments, you gave them a ‘haircut' - Minority",
    "desc": "The Minority Chief Whip in Parliament, Frank Annoh-Dompreh, has criticised the government for failing to brief Parliament on the reduction of the producer price of cocoa to GH¢2,587 per bag for the remainder of the 2025/2026 crop season.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/869/86941430.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Judgment Day: Malaysian football faces its toughest test",
    "desc": "Seven players, one hearing, and a system under scrutiny. As CAS proceedings begin, Malaysia faces questions that reach beyond eligibility.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/11/f0e225f6-7-fam-footballer-file-051125-brighter.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Horoscope Today: February 26, 2026",
    "desc": "See what the stars have in store for your sign",
    "image": "https://assets.vogue.in/photos/6936a34b536bb7db1633ae3b/16:9/w_1280,c_limit/16;9_For%20Desktop%20View_Thumbnail%20Creative_Daily%20Horoscope.png",
    "source": "Vogue India"
  },
  {
    "title": "Hyderabad scientists develop switchable nano-brushes to target tumor cells",
    "desc": "Researchers have engineered a redox-responsive polymer coating for nanoparticles that exhibits potent anti-cancer activity by triggering controlled oxidative stress in tumor cells. | University of Hyderabad,Cancer Therapy,Nanoengineering,Medical innovation,Nanotechnology,ferrocene | Latest science and technology news, research breakthroughs, and innovations from India’s top institutions. Recent stories and articles on advancements in science, engineering, technology, ecology, humanities, social sciences, and policy. Discover cutting-edge developments and expert insights on Research Matters, your trusted source for comprehensive science and research news.",
    "image": "https://researchmatters.in/sites/researchmatters/files/February_Aishwarya%20%283%29.jpg",
    "source": "Research Matters"
  },
  {
    "title": "SNOW DEADLINE ALERT: Faruqi & Faruqi, LLP Reminds Snowflake (SNOW) Investors of Securities Class Action Deadline on April 27, 2026",
    "desc": "Faruqi & Faruqi, LLP, a leading national securities law firm, is investigating potential claims against Snowflake Inc. (“Snowflake” or the “Company”) (NYSE: ...",
    "image": "https://mms.businesswire.com/media/20260225306145/en/2669297/22/FF_BW_Image_2.jpg",
    "source": "Business Wire"
  },
  {
    "title": "'If Any Team Can Do It, It's Us': Raphinha Predicts Comeback For Barcelona In Copa del Rey",
    "desc": "Barcelona winger Raphinha has sounded a defiant battle cry as the Catalan giants face the monumental task of overturning a four-goal deficit in the Copa del Rey.",
    "image": "https://a57.foxsports.com/statics.foxsports.com/www.foxsports.com/content/uploads/2026/02/1408/814/9db84659-raphinha1.jpg?ve=1&tl=1",
    "source": "FOX Sports"
  },
  {
    "title": "Webb telescope reveals Uranus' upper atmosphere in unprecedented detail",
    "desc": "NASA's James Webb Space Telescope has captured the first vertical view of Uranus's upper atmosphere.",
    "image": "https://cdnph.upi.com/ph/st/th/1561772065325/2026/i/17720654742694/v1.5/Webb-telescope-reveals-Uranus-atmosphere-in-unprecedented-detail.jpg?lg=5",
    "source": "upi.com"
  },
  {
    "title": "National bushfire outlook puts NSW, Victoria and southern WA at heightened risk",
    "desc": "The latest seasonal bushfire outlook has identified large parts of Victoria, NSW and southern WA as still at risk, even though summer is almost over.",
    "image": "https://live-production.wcms.abc-cdn.net.au/da22bfcd1ba63f491242ad4ae4368f54?impolicy=wcms_watermark_news&cropH=540&cropW=960&xPos=0&yPos=164&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Trump’s Push for Election Power Raises Fears He Will ‘Subvert’ Midterms",
    "desc": "The president appears to be undermining Americans’ faith in the outcome, at a moment when Republicans face an uphill climb to keep control of Congress.",
    "image": "https://static01.nyt.com/images/2026/02/25/multimedia/pol-trump-elections-phwk/pol-trump-elections-phwk-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "'Potential tragedy': Seven people rescued from Waikato River",
    "desc": "Using a jetboat and a jetski, police, Coastguard and the harbourmaster were able to rescue the seven people from the water, who were hanging onto a tree.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/police-arrived-and-were-able-to-communicate-with-the-now-sev-5IUNZEV23NAWHAZM2VNWVCO5R4.jpg?auth=b0071e1f03eb08b2ff46351b9e1707d9b892c8a463eec8765bb345e7dc2b79c7&quality=70&width=600&height=315&focal=1710%2C1200",
    "source": "1News"
  }
]