[
  {
    "title": "Kuria warns politicians against ‘Mt Kenya bashing’ ahead of 2027",
    "desc": "Kuria said attacking the Mt Kenya region to win political mileage is an outdated strategy.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/ee17fbae-2f72-443f-b62f-39a7ea57e966.png?1771742000857",
    "source": "Star newspaper"
  },
  {
    "title": "Immunomediator expression in human periodontal ligament MSCs varies depending on surface CD146 expression",
    "desc": "Isolating mesenchymal stromal cell (MSC) subpopulations with improved quality based on specific surface markers, such as CD146, is one approach to enhance their therapeutic potential. However, there is limited information on the cytokine-boosted immunomodulatory mechanisms between CD146-expressing and non-expressing MSCs across various inflammatory conditions. This study seeks to address this gap. MSCs from the human periodontal ligament (hPDL-MSCs) were treated with interleukin-(IL)-1β, interferon-(IFN)-γ, or tumor necrosis factor-(TNF)-α, investigating the expression of IDO-1, PD-L1, PTGS-2, and TSG-6 between CD146+ and CD146− hPDL-MSCs. Additionally, the expression of the immunomediators was compared between CD146-depleted and -enriched populations, generated by magnetic-bead-sorting. CD146+ hPDL-MSCs exhibited a significantly higher proportion of IDO-1+ cells, enhanced expression levels in the presence of IL-1β or TNF-α, and higher IL-1β, IFN-γ, or TNF-α-induced PD-L1 protein expression. Conversely, the proportion of TSG-6+ hPDL-MSCs was significantly lower in CD146+ cells under basal conditions. In CD146-enriched hPDL-MSCs, the immunomediator expression was minimally elevated, with significant differences under specific conditions: a higher PD-L1 protein expression under basal conditions and in the presence of IFN-γ or TNF-α, as well as higher or lower PGE2 levels with TNF-α or IL-1β, respectively. These results suggest that the immunomediator expression in hPDL-MSCs alters with different CD146 surface expression. CD146+ hPDL-MSCs do not always show higher levels of immunomediator expression. Further research is necessary to isolate hPDL-MSC subpopulations with optimal potential for therapeutic applications.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "TV tonight: a true-crime drama about Sarah Ferguson’s former dresser",
    "desc": "Natalie Dormer and Mia McKenna-Bruce star in The Lady, which tells the story of Jane Andrews. Plus: your golden ticket to the Baftas! Here’s what to watch this evening",
    "image": "https://i.guim.co.uk/img/media/4844c5358969821b8ba143e2891e7628b186714e/196_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=482146068adc7339388f3f47eebb47e4",
    "source": "The Guardian"
  },
  {
    "title": "Israel still hopes for return of free trade with US despite Trump's global tariff spi",
    "desc": "After the Supreme Court voided the original policy, Trump imposed a temporary 15% tariff for up to five months, leaving exporters facing fresh uncertainty and the loss of their previous competitive edge",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/20/r1cR2m800Zg/r1cR2m800Zg_0_0_3000_1689_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "J-K: Encounter breaks out in Kishtwar",
    "desc": "The gunfight started when army troops launched a search operation in Chatroo forests following information about the presence of two suspected terrorists, the officials said",
    "image": "https://greaterkashmir.imagibyte.sortdcdn.net/wp-content/uploads/2025/04/K-encounter-scaled-e1744354044115.jpg",
    "source": "Greater Kashmir"
  },
  {
    "title": "Who are the key players in the Irish farming lobby?",
    "desc": "Irish farmers, with the support of the Government, have had some big wins in recent times.",
    "image": "https://www.rte.ie/images/0017171e-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Serious injuries after crash involving a car and cyclist in Canterbury",
    "desc": "Emergency services received reports of the crash near the intersection of Sumnervale Drive and Evans Pass Road about 5:30pm.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--CM_oiXeB--/t_tohu-badge-facebook/v1644508112/4M2WHSW_copyright_image_277087?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "China To Decide Fate Of Silver Prices | The Reason Why",
    "desc": "Over the past fifteen years, China has moved to the centre of the global silver market. It became the world's second-largest silver fabricator as early as 2011 and drove much of the growth in industrial demand again in 2024.",
    "image": "https://c.ndtvimg.com/2026-01/kdpi8lkc_silver-prices-record-high-today-_625x300_24_January_26.jpg?im=FeatureCrop,algorithm=dnn,width=1080,height=607",
    "source": "NDTV Profit"
  },
  {
    "title": "The Most Remote Hotels on Earth",
    "desc": "From the Gobi Desert and the Arctic Tundra to Chilean Patagonia – discover the world’s most remote hotels.",
    "image": "https://elitetraveler.com/wp-content/uploads/sites/8/2026/02/tierrapatagoniabyrobertmichaelpoole13711-800x418.jpg?1771755020",
    "source": "Elite Traveler"
  },
  {
    "title": "Two terrorists killed in operation in J&K's Kishtwar, war-like stores & 2 AK-47 rifles recovered",
    "desc": "India News: Two terrorists, affiliated with Pakistan-based Jaish-e-Mohammad (JeM), have been killed so far in an ongoing encounter that erupted on Sunday between .",
    "image": "https://static.toiimg.com/thumb/msid-128667654,width-1280,height-720,imgsize-1027258,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  }
]