[
  {
    "title": "'Masters of the Universe' Director Talks Skeletor's \"Toxic Masculinity\"",
    "desc": "As the 'Masters of the Universe' makes its way to the big screen, one of Saturday morning cartoons' most iconic villains is getting the cinematic treatment.",
    "image": "https://deadline.com/wp-content/uploads/2026/02/Screenshot-2026-02-06-at-5.00.26 PM.png?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Pakistan meets 3 out of 5 IMF goals",
    "desc": "Next $1b loan tranche depends on achieving all conditions; tax targets missed",
    "image": "https://i.tribune.com.pk/media/images/banks1769818308-0/banks1769818308-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Canadian Tire ordered to pay almost $1.3 million over ads",
    "desc": "Canadian Tire has been ordered to pay just under $1.3 million after pleading guilty to 74 counts of violating sections of Quebec’s Consumer Protection Act related to false advertising.",
    "image": "https://www.bnnbloomberg.ca/resizer/v2/AGYO2MYI6QDCSLYDUDDRJOXJI4.jpg?smart=true&auth=5d9290c627ef7df0d9be7553ef3af5ac50193e2dab1d810ee845983ebcb48c04&width=1200&height=630",
    "source": "BNN Bloomberg"
  },
  {
    "title": "150 runs in boundaries! Sachin among India greats STUNNED by 14yo’s ‘absurd’ WC final knock",
    "desc": "‘Timeless blockbuster’: Sachin left gobsmacked by 14yo’s ‘absurd’ WC final feat",
    "image": "https://content.api.news/v3/images/bin/30b52df0fcd82753cfa2392d23f38f9c",
    "source": "foxsports.com.au"
  },
  {
    "title": "From movie night to state visit: Anwar hails ‘Taj Mahal’ film, to welcome India’s Modi today",
    "desc": "PUTRAJAYA, Feb 7 — Prime Minister Datuk Seri Anwar Ibrahim praised the historical epic film Taj Mahal: An Eternal Love Story following a special preview last night.Anwar...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/07/324241.JPG",
    "source": "Malay Mail"
  },
  {
    "title": "WHO says one person dead from Nipah virus in Bangladesh",
    "desc": "DHAKA: The World Health Organization said on Friday that a woman ​had died in northern Bangladesh in January after contracting the deadly Nipah virus infection. The case in Bangladesh, where Nipah cases are reported almost every year, follows two Nipah virus cases identified in neighboring India, which has already prompted stepped-up airport screenings across Asia. The patient",
    "image": "https://www.arabnews.pk/sites/default/files/styles/660x371_watermarkpakistan/public/main-image/2026/02/07/4682539-1451924468.jpg?itok=1tOsOEyp",
    "source": "Arab News PK"
  },
  {
    "title": "The Bull Case For JD.com (JD) Could Change Following Offshore Yuan Bonds And Global Logistics Push",
    "desc": "Recently, JD.com has reportedly explored issuing up to CN¥10 billion in offshore yuan \"dim sum\" bonds with maturities of up to 10 years, while simultaneously expanding its global logistics footprint through initiatives such as a new hub in Riyadh and the growth of its JD MALL concept in China. This combination of diversified funding plans and deeper logistics investment underlines how JD.com is attempting to reinforce its integrated ecosystem beyond its core domestic e-commerce base. We’ll...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/55db137e8fb9da1d02f3184a40c85dcc",
    "source": "Yahoo Finance"
  },
  {
    "title": "Make all teachers face police background checks, say NGOs",
    "desc": "This comes after a teacher at a school in Desa Pandan was convicted for sodomising a 13-year-old student.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/e32ab1ae-noor-azimah-abdul-rahim-hartini-zainudin-tile-pic-6226.webp",
    "source": "freemalaysiatoday.com"
  },
  {
    "title": "Lakers Injury Report: Luka Doncic Ruled Out, Luke Kennard Questionable Vs. Warriors",
    "desc": "Los Angeles Lakers star Luka Doncic is out and Luke Kennard is questionable for Saturday night's game against the Golden State Warriors.",
    "image": "https://lakersnation.com/wp-content/uploads/2026/02/Luka-Doncic-4.jpg",
    "source": "Lakers Nation"
  },
  {
    "title": "Woman dead after car ploughs into house at Rivervale, Perth",
    "desc": "A woman has died after a car ploughed into a Perth home overnight, with the driver now in police custody.",
    "image": "https://content.api.news/v3/images/bin/0c2e4f07151e6b522d3bfbb0a35c725e",
    "source": "News.com.au"
  }
]