[
  {
    "title": "Madagascar's Mpox Outbreak Reaches Réunion Island",
    "desc": "The Regional Health Agency (ARS) of Réunion has recently confirmed a second imported case of smallpox (mpox) from the Republic of Madagascar to the French Department of Réunion. As of February 10, 2026, the ARS reported that there is no established epidemiological link between this new case and the first case confirmed on January 22, 2026.",
    "image": "https://www.vax-before-travel.com/sites/default/files/styles/article_metadata/public/Screenshot%202026-02-14%201.07.12%20PM.png",
    "source": "Vax-Before-Travel"
  },
  {
    "title": "Man City player ratings vs Salford: That's why Phil Foden's no longer first-choice! England international's struggles continue in laboured FA Cup win over League Two opposition",
    "desc": "GOAL dishes out ratings to all of the Manchester City players involved in Saturday's FA Cup clash with Salford City, as Pep Guardiola's men laboured to a 2-0 win over their League Two opponents",
    "image": "https://assets.goal.com/images/v3/blt664547c3faef4ec0/GOAL%20-%20Multiple%20Images%20-%203%20Stacked%20-%20Facebook%20(3).png",
    "source": "Goal.com"
  },
  {
    "title": "Prince William’s private battle to protect his family in Kate's darkest days",
    "desc": "The Mirror's royal editor Russell Myers has written the first joint biography of the Prince and Princess of Wales in over a decade. William & Catherine: The Intimate Inside Story draws on exclusive access to numerous palace insiders and features never-before-told context about the biggest stories to have followed the Prince and Princess of Wales in recent years",
    "image": "https://i2-prod.mirror.co.uk/article36700721.ece/ALTERNATES/s1200/0_From-KP-Press-Office-kensingtonpalaceroyalukDate-Mon-9-Sept-2024-at-1531Subject-STRICTLY.jpg",
    "source": "The Mirror"
  },
  {
    "title": "PM said pushing to soften wording of bill mandating death penalty for terrorists",
    "desc": "Report says Netanyahu looking to allow judicial discretion on sentencing, remove clause specifying it only applies to those who kill Israelis, fearing international legal pressure",
    "image": "https://static-cdn.toi-media.com/www/uploads/2025/03/F250319YS430.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Padres address needs by adding Griffin Canning and Nick Castellanos",
    "desc": "Team needed veteran starting pitcher and a hitter.",
    "image": "https://www.sandiegouniontribune.com/wp-content/uploads/2026/02/LDN-L-DODGERS-1010-KB35.jpg?w=1024&h=702",
    "source": "San Diego Union-Tribune"
  },
  {
    "title": "Africa’s youth see top regional body as a bloc of old leaders",
    "desc": "The African Union is holding its annual summit in Ethiopia as the organization faces widespread discontent.",
    "image": "https://dims.apnews.com/dims4/default/3cca058/2147483647/strip/true/crop/4512x3006+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fd0%2F6c%2F72af7a808fbc62b84cbaf1b31157%2F0e2d7d1f13894e968a11177896226f70",
    "source": "AP News"
  },
  {
    "title": "Kampala traders accuse landlords of mistreating them",
    "desc": "Traders operating in the Central Business District of Kampala have expressed frustration over what they describe as continued harassment and mistreatment by prominent city landlords, accusing them of intimidation and unfair financial demands disguised as rent. The traders claim that several wealthy building owners have been labeling them as fraudsters, despite being fully aware that",
    "image": "https://ntv.co.ug/wp-content/uploads/2026/02/Screenshot-2026-02-14-at-7.30.18-PM.png",
    "source": "NTV Uganda"
  },
  {
    "title": "start time, how to watch, Indigenous All Stars vs Maori All Stars preview",
    "desc": "‘More important than playing NRL’: The forgotten winners from All-Star game",
    "image": "https://content.api.news/v3/images/bin/eeef07a11d87dfed4fc41f4a8284bc64",
    "source": "fox sports"
  },
  {
    "title": "The Real Reason Investors Should Be Excited for Ford's China Negotiations",
    "desc": "Turning around its business in Europe will be a big win, but what it could learn from a Chinese rival might be even more valuable.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F855591%2F2023-mustang-mach-e-premium-nite-pony-package_01.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "AUSW vs IND-W Today Match Prediction and Betting Tips, Odds and Live Score",
    "desc": "Cricket prediction for Australia Women (AUSW) vs India Women (IND-W), India Women tour of Australia, 2026, t20, 13:45 IST 15 Feb 2026.",
    "image": "https://api.thetopbk.com/storage/cricket/teams/ausw/MTyXszayQ7xMpYLlfaNN0Hel5ZE1arkKv4oi5ckJ.png",
    "source": "TheTopBookies"
  }
]