[
  {
    "title": "Holly Valance slammed for 'disgusting' slur as GB News host forced to interject",
    "desc": "Holly Valance has once again come under fire after the former singer appeared on GB News, during which she used a derogatory slur, which left even the host stunned",
    "image": "https://i2-prod.mirror.co.uk/article36666628.ece/ALTERNATES/s1200/0_Holly.jpg",
    "source": "The Mirror"
  },
  {
    "title": "IndiGo to pause Copenhagen operations, trim flights on Manchester, London route",
    "desc": "IndiGo is changing its long-haul flights. Services to Copenhagen will stop from February 17, 2026. Flights to Manchester and London Heathrow will also be reduced. These changes aim to improve punctuality and avoid passenger issues. IndiGo is contacting affected customers to offer alternatives. The airline is working to maintain reliable service amid operational challenges.",
    "image": "https://img.etimg.com/thumb/width-1200,height-900,imgsize-55472,resizemode-75,msid-127905396/nri/visit/indigo-to-pause-copenhagen-operations-trim-flights-on-manchester-london-route.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Sharks snap up Lions pivot",
    "desc": "The Sharks have confirmed the signing of an experienced Lions playmaker to bolster their ranks next season.",
    "image": "https://www.sarugbymag.co.za/wp-content/uploads/2025/02/Gianni-Lombard-e1739527317748.jpg",
    "source": "SA Rugby magazine"
  },
  {
    "title": "Brendon McCullum on Harry Brook, Ashes and Noosa trip",
    "desc": "In a wide-ranging interview, Brendon McCullum talks about Harry Brook's altercation with a nightclub bouncer and the criticism of England's off-field behaviour.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/831f/live/7d6b10f0-0131-11f1-a569-59dc5b36a4f8.jpg",
    "source": "BBC"
  },
  {
    "title": "Ethiopia, China Strengthen Development Cooperation with New Grant Agreement",
    "desc": "Addis Ababa, February 4, 2026 (ENA)—Ethiopia and China have further deepened their longstanding development partnership following a high-level bilateral meeting held on Tuesday between Ethiopia’s Finance Minister, Ahmed Shide and Chanese Ambassador to Ethiopia, Chen Hai.\nDuring the meeting, the two sides signed a development cooperation grant agreement and held discussions on ongoing and future areas of Ethiopia–China collaboration.\nMinister Ahmed Shide expressed Ethiopia’s strong appreciation to the Government of China for its continued support through public project financing and foreign direct investment.\nHe reaffirmed Ethiopia’s commitment to strengthening the historic partnership between the two countries and called for enhanced cooperation in financing priority development initiatives, including Ethiopia’s new international airport project.\nAmbassador Chen Hai reaffirmed China’s commitment to supporting Ethiopia’s development agenda.\nHe highlighted continued cooperation in key areas, including the AI Sovereign Model and Application Project, supplementary works on the Ethio–Djibouti Railway, and sustained engagement under the Comprehensive Agreement on Development and Economic Partnership for Africa (CADEPA).\nAt the conclusion of the meeting, the two parties signed a 200 million RMB grant agreement, which will finance “small but beautiful” development projects designed to deliver quick, tangible results and direct benefits to the Ethiopian people.",
    "image": "https://www.ena.et/documents/42142/0/628324825_1331968565638724_1132559923086608956_n.jpg/afaedcb4-551c-8102-a21e-61a1f6521e5c?version=1.0&t=1770196480180&download=true",
    "source": "ENA English"
  },
  {
    "title": "Ghana, Latvia align on security and trade in high-level foreign ministers’ talks",
    "desc": "Ghana, Latvia align on security and trade in high-level foreign ministers’ talks",
    "image": "https://www.graphic.com.gh/images/2026/Feb/03/Baiba%20Braze%20un%20Samuel%20Okudzeto%20Ablakwa.jpg",
    "source": "Graphic Online"
  },
  {
    "title": "Govt mulls adding frozen food to SARA aid list",
    "desc": "KUALA LUMPUR, Feb 4 — The government will review improvements to the implementation of the Sumbangan Asas Rahmah (SARA) aid, including a proposal to expand the scope of permitted...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/04/323856.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "Prince Harry urged 'go back home' by A-list star in devastating blow to Meghan",
    "desc": "The American rapper issued a heartfelt plea to the Duke of Sussex.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/20/1200x630/6719511.jpg",
    "source": "Daily Express"
  },
  {
    "title": "Nuclear Tech Offers Hope to Global Cancer Patients",
    "desc": "Cancer is a major global public health challenge, particularly in low- and middle-income countries where nearly 70% of cancer-related deaths occur and",
    "image": "https://www.iaea.org/sites/default/files/2026-02/img_2389.jpeg",
    "source": "Mirage News"
  },
  {
    "title": "Drug dealers, underage drivers caught using deregistered vehicles as cases surge",
    "desc": "Cases of deregistered vehicles jumped by over six times in four years from 40 in 2022 to 245 in 2025. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/795cd5200629445891686d250525b536119f1898dce435b4ce553451559aa613",
    "source": "The Straits Times"
  }
]