[
  {
    "title": "Karnataka BJP MLA caught red-handed taking Rs 5 lakh bribe, arrested",
    "desc": "The complainant, Vijay Pujar, a Class-1 contractor from Gadag, approached the anti-corruption authorities after he was allegedly asked to pay Rs 11 lakh to secure necessary clearances for the project.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/bjp-karnataka-mla-214015219-16x9_0.jpeg?VersionId=EEdywn8CduEwEjlxWtcs6cQtjqmKYIX1",
    "source": "India Today"
  },
  {
    "title": "Fasting together: Ramadan and Lent in Sierra Leone’s spirit of harmony",
    "desc": "Although politics may be troubled in Sierra Leone, religions co-exist harmoniously. As Christian Lent and Muslim Ramadan fall into the same time period this year, the faithful celebrate their holidays together, peacefully.",
    "image": "https://images.euronews.com/articles/stories/09/66/03/97/1024x538_cmsv2_4e8fa2b6-50ec-536a-8956-05ad7b2a4e55-9660397.jpg",
    "source": "africanews.com"
  },
  {
    "title": "Vishwak Sen’s Cult teaser: Violence at full throttle in a deadly game of survival",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/02/cult-4.webp",
    "source": "123telugu.com"
  },
  {
    "title": "President Donald Trump's Nomination of Kevin Warsh to Become Fed Chair May Come With Unintended Consequences for Wall Street",
    "desc": "The end of Jerome Powell's term as Federal Reserve chair brings about more questions than answers.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F856780%2Fjerome-powell-fomc-official-photo-federal-reserve.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Sindh to expand bus fleet, speed up Red Line BRT work in Karachi",
    "desc": "The Sindh government has announced plans to add more buses to Karachi’s transport network in a fresh push to ease commuting challenges and modernize public transit",
    "image": "https://www.nation.com.pk/digital_images/large/2026-02-21/sindh-expand-bus-fleet-speed-red-line-brt-work-karachi-1771673725-4522.jpg",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "MCP Cuts Force Family to Seek Donations",
    "desc": "A father is crying foul after he was told MCP will no longer be providing 100 per cent coverage for medical pr...",
    "image": "https://media-cdn.socastsrm.com/wordpress/wp-content/blogs.dir/900/files/2026/02/charlie-gill-cleft-lip-mcp.jpg",
    "source": "VOCM"
  },
  {
    "title": "Fonseca: 'I deserved more time' at AC Milan in 2024",
    "desc": "Paulo Fonseca says he 'enjoyed' his short spell at Milan, but feels he 'deserved more time' to 'change the game' at San Siro.",
    "image": "https://icdn.football-italia.net/wp-content/uploads/2024/12/Paulo-Fonseca-Milan-glance.jpg",
    "source": "Football Italia"
  },
  {
    "title": "Umeta lending ops halted by SEC",
    "desc": "Umeta Credit Lending Corp. is no longer allowed to operate its lending apps after the Securities and Exchange Commission (SEC) ordered it to immediately stop al",
    "image": "https://media.assettype.com/tribune%2F2024-09-19%2Fphvwrrpk%2FUntitled_1_copy_4.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Daily Tribune"
  },
  {
    "title": "How projects tell powerful story about leadership",
    "desc": "MWANZA: AT the heart of every ward and council, development projects tell a simple but powerful story about leadership. A completed classroom, a functioning health facility, a reliable water point: these are not just structures. They are the most visible proof that leadership is working and that those entrusted with power are accountable to the",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/MTANDA.jpeg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "VIDEO: Chelsea loanee Nicolas Jackson goes viral after sharing bizarre clip of himself walking topless in the snow in Munich",
    "desc": "Nicolas Jackson has gone viral on social media after the Bayern Munich loanee shared a video of himself walking through snow in the German city. The 24-year-old, who joined Chelsea in 2023, has scored five goals in 22 appearances for the Bundesliga giants this season, largely being reduced to a back-up role behind star striker Harry Kane.",
    "image": "https://assets.goal.com/images/v3/bltfa84363e440f133e/GOAL%20-%20Multiple%20Images%20-%202%20Split%20-%20Facebook%20-%202026-02-21T102734.004.png",
    "source": "Goal.com"
  }
]