[
  {
    "title": "NParks looking into allegations that man cut community cat's fur and whiskers in Everton Park",
    "desc": "Footage of the incident posted on social media showed a man wearing gloves approaching the cat while holding a pair of scissors.",
    "image": "https://dam.mediacorp.sg/image/upload/s--GWBeUV6y--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/10/timmy_the_cat_cut_hair_whiskers.png?itok=VRS0JY5X",
    "source": "CNA"
  },
  {
    "title": "Nipah Virus Infection in Focus: Expert Perspectives from a WHO SEARO Webinar",
    "desc": "Against the backdrop of two confirmed cases of Nipah virus (NiV) infection in West Bengal in India, reported to WHO on 26 January 2026, renewed interest in the epidemiology, clinical management, and public health response to the disease has emerged within the WHO South-East Asia Region and beyond.In response to this interest, the Community of Practice on Public Health Intelligence in the WHO South-East Asia Region, in collaboration with the Health Emergencies Programme at WHO South-East Asia Regional Office (SEARO), hosted a webinar on Nipah virus infection on 4th February 2026.On behalf of WHO SEARO, the webinar was opened by Dr Masaya Kato, Programme Area Manager for Health Information Management, and Dr Pushpa Ranjan Wijesinghe, Programme Area Manager for Pandemic and Epidemic Management.Dr Kato introduced the Community of Practice as a platform for continuous learning and collaboration on public health intelligence, including epidemic intelligence from open sources (EIOS).The webinar brought together scientific experts from India to provide a comprehensive overview of the Nipah virus event and the national response in the West Bengal. Dr Dipankar Maji, Director of Hospital Administration, Government of West Bengal, outlined the epidemiological situation and public health response following the detection of two RT-PCR-confirmed NiV infection cases among nurses. Building on this, Dr Yogiraj Ray, Associate Professor and Head of the Department of Infectious Diseases at IPGME&R, Kolkata, described the clinical course of the cases, including symptom progression, laboratory and imaging findings, and clinical management.Drawing on experience from previous outbreaks, Prof. Anish TS from the Kerala One Health Centre for Nipah Research and Resilience shared key lessons from Kerala, with a focus on One Health approaches, spillover risks linked to bat habitat disruption and observed seasonal patterns of the disease. Dr Pragya D. Yadav, Scientist at the Indian Council of Medical Research, provided scientific insights into transmission dynamics, animal surveillance, diagnostics, and viral sequencing.Highlighting WHO’s strategic approach to the prevention and control of Nipah virus infection in the South-East Asia Region, Dr Pushpa Ranjan Wijesinghe explained why Nipah virus is considered a priority pathogen for WHO, how the 2019 expert consultation informed the development of the WHO’s Regional Strategy for the prevention and control of Nipah virus infection, and outlined its key components as well as the regional challenges for Nipah virus prevention and control.Following the presentation by Dr Masaya Kato on WHO’s rapid risk assessment and public health advice, the webinar concluded with a short question-and-answer session with the presenters.",
    "image": "https://cdn.who.int/media/images/default-source/cover-images/who-documents/nvi-flyer26.tmb-1200v.jpg?sfvrsn=77a10a9b_1",
    "source": "World Health Organization (WHO)"
  },
  {
    "title": "New Savannah Guthrie video plea as ransom deadline hours away",
    "desc": "An initial deadline passed last week, but a second one was set for Tuesday afternoon New Zealand time.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/she-was-taken-and-we-dont-know-where-and-we-need-your-help-g-V3SYSQ72ZJEMHPKUIPNXYPJZUQ.jpg?auth=c79d4153e4541c3956724fdc772884121bde0c9e3f29db95aa3e976d63e3ceac&quality=70&width=600&height=315&focal=960%2C540",
    "source": "1News"
  },
  {
    "title": "Blacklist International, Boom Esports exit in Honor of Kings Invitational semis",
    "desc": "An Honor of Kings Grand Finals appearance remains elusive for Filipino teams as both Blacklist International and Boom Esports fell in the semifinals of the Honor of Kings Invitational (KIS) Season 4 at the GBK Basketball Hall in Jakarta, Indonesia.",
    "image": "https://media.philstar.com/photos/2026/02/10/honor-kings-esports_2026-02-10_12-45-12.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Berbatov urges patience over Carrick's Man United future",
    "desc": "Former Manchester United striker Dimitar Berbatov has hailed the turnaround at Old Trafford under Michael Carrick but urged the club not to rush a decision on a permanent managerial role.",
    "image": "https://a2.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0210%2Fr1613049_1296x729_16%2D9.jpg",
    "source": "ESPN Singapore"
  },
  {
    "title": "King Charles expresses ‘profound concern’ over new allegations against Andrew",
    "desc": "King Charles has publicly addressed fresh allegations involving his younger brother and former Prince Andrew Mountbatten",
    "image": "https://static.arynews.tv/zip-archives/wp-content/uploads/2026/02/king.jpg?imageMogr2/format/jpg",
    "source": "arynews.tv"
  },
  {
    "title": "10 of the Best Bodyguards in the Animal Kingdom",
    "desc": "This list highlights animals with remarkable defensive strategies, strength, vigilance, or protective behavior.",
    "image": "https://cf-img-a-in.tosshub.com/sites/visualstory/wp/2026/02/rude-boss-at-workITG-1770698371898.jpg",
    "source": "India Today NE"
  },
  {
    "title": "Mackay MP Nigel Dalton crosses the floor to oppose LNP ban on abortion debate",
    "desc": "First-term Liberal National Party MP Nigel Dalton votes to overturn a ban on debating abortion — in defiance of his party.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ba791aa26bb30567f478c02556e03db2?impolicy=wcms_watermark_news&cropH=2268&cropW=4032&xPos=0&yPos=668&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Endocrinologist shares a simple morning routine to keep blood sugar stable before breakfast",
    "desc": "Health News: Eating food is not the only thing that can raise blood sugar levels. Chemicals, including cortisol, adrenaline, and glucagon, also have an effect. The.",
    "image": "https://static.toiimg.com/thumb/msid-128141306,width-1280,height-720,imgsize-599696,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "DOF mulls higher tariffs on artificial sweeteners to protect sugar farmers",
    "desc": "Agriculture Secretary Francisco Tiu Laurel Jr. says the government is considering higher tariffs on artificial sweeteners to protect domestic sugar producers.",
    "image": "https://cdn.manilastandard.net/wp-content/uploads/2025/09/dof-building-2.png",
    "source": "Manila Standard"
  }
]