[
  {
    "title": "Parking rage turns bloody at Cheras flats after man slashed",
    "desc": "KUALA LUMPUR, Feb 22 — A parking dispute at the Seri Melaka Flats in Cheras escalated into a knife attack this week, leaving a man with a three-centimetre wound on his left...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/22/326659.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "Gordon Ramsay's ex-mistress accuses him of whitewashing his past in his 'completely misleading and fake' new Netflix series",
    "desc": "The six-part Netflix documentary series Being Gordon Ramsay highlights a softer, more vulnerable, side of the multi-millionaire restaurateur - as a devoted husband and father of six.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/20/17/106552137-0-image-a-50_1771608209259.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Missiles pound Kyiv and other regions ahead of Russia invasion anniversary",
    "desc": "The city has faced waves of overnight strikes recently as Moscow intensified its assaults on infrastructure.",
    "image": "https://img2.thejournal.ie/article/6964296/river/?height=400&version=6964300",
    "source": "The Journal"
  },
  {
    "title": "PM Modi flags off Namo Bharat RRTS, Meerut Metro | Video",
    "desc": "The project, consisting of both the Namo Bharat RRTS and the Meerut Metro, was developed at an estimated cost of ₹30,274 crore.| India News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/22/550x309/PTI02-22-2026-000071B-0_1771751144593_1771751156539.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "El Al Flight Delayed at LAX After 140 Suitcases Flagged in Explosive Security Sweep",
    "desc": "El Al LY-6 delayed at LAX over 'Free Palestine' stickers on 140 bags, triggering explosive searches; Shin Bet security and global disputes.",
    "image": "https://aviationa2z.com/wp-content/uploads/2025/04/El_Al_B787-9_4X-EDH_@_SFO_Nov_2019.webp",
    "source": "Aviation A2Z"
  },
  {
    "title": "Los Angeles Football Club",
    "desc": "Los Angeles Football Club (LAFC) began its 2026 MLS regular season with a 3-0 win over Inter Miami CF in the second-highest attended game in MLS history, and the highest attended opening weekend game in league annals.\nWith 75,673 watching firsthand inside the Los Angeles Memorial Coliseum, Black & Gold",
    "image": "https://images.mlssoccer.com/image/private/t_editorial_landscape_3_4_desktop/mls-lafc/qu2allplofjcfygalraw.jpg",
    "source": "LAFC"
  },
  {
    "title": "Super Rugby giants collide as ACT Brumbies face Crusaders",
    "desc": "Pundits had written the ACT Brumbies off as they arrived chasing their first win over the Crusaders in Christchurch since 2000.",
    "image": "https://www.canberratimes.com.au/images/transform/v1/crop/frm/36vwtM5n3dmMVgNPycRBEHz/87803bf0-f411-4f43-8853-3bb5faf4d38a.jpg/r0_496_6225_3764_w1200_h630_fmax.jpg",
    "source": "The Canberra Times"
  },
  {
    "title": "Ministry sec-gen among several witnesses to be called in probe over RM1.1bil agreement",
    "desc": "KUALA LUMPUR: The Malaysian Anti-Corruption Commission (MACC) is expected to call several witnesses, including the secretary-general of a ministry, to assist in investigations into the implementation of a RM1.1bil agreement between the Malaysian Government and a foreign company.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/22/3780812.jpeg",
    "source": "thestar.com.my"
  },
  {
    "title": "MACC to summon economy ministry sec-gen in RM1bil deal probe",
    "desc": "The deal was alleged to have been pushed through hastily despite not having the agreement of the finance ministry and Miti.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/46184928-kementerian-ekonomi-ss-220226.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "'He is so complete' - Pep Guardiola in awe of Man City star Nico O'Reilly after Newcastle brace",
    "desc": "Pep Guardiola has showered Manchester City starlet Nico O’Reilly with praise, claiming that the versatile 20-year-old is so complete. The youngster, who had just nine senior career goals to his name prior to facing Newcastle at the Etihad Stadium, bagged a brace in his latest Premier League experience to fire City to within two points of table-topping Arsenal.",
    "image": "https://assets.goal.com/images/v3/blt133b0cd8b436b674/GOAL%20-%20Blank%20WEB%20-%20Facebook%20-%202026-02-22T065451.608.png",
    "source": "Goal.com"
  }
]