[
  {
    "title": "Barcelona SC rally as Lionel Messi’s goal and assist aren’t enough for Inter Miami in a 2026 international friendly",
    "desc": "Inter Miami and Barcelona SC played to a 2-2 draw in the 2026 international friendly. Messi’s goal and assist weren’t enough as Tomás Martínez scored the late equalizer. Check out the highlights and goals.",
    "image": "https://media.bolavip.com/wp-content/uploads/sites/10/2026/02/07211428/lionel-messi-barcelona-1200x740.webp",
    "source": "bolavip.com"
  },
  {
    "title": "Multi-titled para chess star Sander Severino passes away",
    "desc": "Sander Severino's heart, which was as big as the chesser's willpower and courage, failed him as he quietly faded into the night. He was 40.",
    "image": "https://media.philstar.com/photos/2020/06/18/sanderseverino_2020-06-18_14-45-29.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "'Such people have no right to make films': FWICE president says 'no cooperation' with Ghooskhor Pandat makers",
    "desc": "The President of Federation of Western India Cine Employees, BN Tiwari, condemned the film Ghooskhor Pandat's title, amid row. | Bollywood",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/08/550x309/Ghooshkor_Pandat_Netflix_1770351296442_1770351296587_1770517147611.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Live Updates: NBA News & Highlights from 10-Game Saturday Slate",
    "desc": "Follow along with Saturday's NBA highlights, analysis and final scores in real time as a 10-game slate unfolds.",
    "image": "https://cdn.nba.com/manage/2026/01/GettyImages-22492481612-1.jpg",
    "source": "NBA"
  },
  {
    "title": "Ashie Moore admits defeat in war against vote buying",
    "desc": "The Greater Accra Regional Chairman of the National Democratic Congress (NDC), Emmanuel Nii Ashie Moore, has made a startling admission regarding the party’s inability to police financial influence during internal polls.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Ashie-Moore-new-1-1024x512-1-848x424-1.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "US Boosts Burundi Health Resilience with New Strategy",
    "desc": "On February 6, the United States and the Government of the Burundi signed a five-year bilateral health cooperation Memorandum of Understanding (MOU",
    "image": "https://upload.wikimedia.org/wikipedia/commons/5/59/United_States_Department_of_State_headquarters.jpg",
    "source": "Mirage News"
  },
  {
    "title": "Tarriela invites Marcoleta to join West Philippine Sea mission flight",
    "desc": "The Coast Guard invited Sen. Rodante Marcoleta to join a flight over the Kalayaan Island Group amid controversy over his remarks.",
    "image": "https://media.philstar.com/photos/2026/02/08/marcoleta-pcg-dare-mission-west-philippine-sea_2026-02-08_10-15-50.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "China’s aluminium smelters embark on green long march",
    "desc": "One of country’s most polluting industries is relocating from northern rust belt to renewables-rich south-west",
    "image": "https://images.ft.com/v3/image/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F67e67559-2cd0-4683-a39a-d8c3919831f8.jpg?source=next-article&fit=scale-down&quality=highest&width=700&dpr=1",
    "source": "Financial Times"
  },
  {
    "title": "Israeli bobsled team's apartment robbed ahead of Milan Winter Games, says athlete",
    "desc": "Bobsled pilot AJ Edelman says burglars pinched passports, thousands of dollars worth of items in weekend break-in, adds that team pushed ahead, kept training despite setback",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/02/AP26035555474797.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Pascual passes test of character in first MPBL preseason game",
    "desc": "Migs Pascual and the Sarangani 10 Act squad got an early test of character, and there’s no better way to do it than facing no less than reigning MPBL champions Abra Weavers.",
    "image": "https://media.philstar.com/photos/2026/02/08/migs-pascual-mpbl_2026-02-08_10-13-40.jpg",
    "source": "Philstar.com"
  }
]