[
  {
    "title": "Nestle Malaysia to explore potential sale of ice cream business to Froneri",
    "desc": "KUALA LUMPUR: Nestle (Malaysia) Bhd will explore the potential sale of its ice cream business to Haagen-Dazs owner Froneri following the announcement by Nestle Malaysia's ultimate holding company, Nestle SA, that it will dispose of the remainder of its global ice cream business to Froneri.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/19/3776939.jpeg",
    "source": "The Star"
  },
  {
    "title": "'Amazing community' effort to reinstate vital Wairarapa bridges",
    "desc": "A bridge at Lake Ferry reopened late on Wednesday afternoon after being damaged by the raging Tūranganui River in the storm earlier this week.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/the-bridge-over-the-turanganui-river-just-before-lake-ferry-NBJTTZZJPJACLI2IJYXRBHYS6A.jpg?auth=95c4d39d7409c98f076c446f4ed5dcff4647e89834517cdb0c0686d45b3fbfa2&quality=70&width=600&height=315&focal=2245%2C1226",
    "source": "1News"
  },
  {
    "title": "Former chief justice Abdul Hamid Mohamad dies at 83",
    "desc": "KUALA LUMPUR, Feb 19 — Former Chief Justice Tun Abdul Hamid Mohamad, 83, passed away at Hospital Universiti Kebangsaan Malaysia (HUKM) at noon today.The news was confirmed by...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/19/326175.JPG",
    "source": "Malay Mail"
  },
  {
    "title": "Simple Ways to Protect Your Child from Cold and Flu This Season",
    "desc": "Is your child shivering? With the unseasonal grey weather, learn easy habits to prevent flu, boost immunity, and keep your family warm this February.",
    "image": "https://parentsafrica.com/wp-content/uploads/2024/11/kid-wearing-warm-clothes-medium-shot_23-2148905759.avif",
    "source": "Parents Africa"
  },
  {
    "title": "Gachagua slams state over ‘excessive’ Githurai demolitions",
    "desc": "The DCP leader says it was unnecessary to deploy a large contingent of police officers at night.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/ed818924-26ac-45dd-8820-da5294c54254.jpeg?1771497746175",
    "source": "the-star.co.ke"
  },
  {
    "title": "Apple Plans to Put AI Cameras on AirPods - What Do You Have, Samsung?",
    "desc": "Apple is developing AirPods with built-in AI cameras, while Samsung focuses on smarter Galaxy Buds features.",
    "image": "https://sammyguru.com/wp-content/uploads/2026/02/AirPods-Pro-3.jpg",
    "source": "SammyGuru"
  },
  {
    "title": "Globe says 96% of Philippines connected",
    "desc": "Globe Telecom says it has connected 96 percent of the Philippines and plans further expansion through infrastructure upgrades and a Starlink satellite partnership to reach remote areas",
    "image": "https://media.assettype.com/tribune%2F2026-02-19%2Fayce8hrc%2Fviberimage2026-02-1917-02-17-811.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Daily Tribune"
  },
  {
    "title": "Canada sharpens skilled immigration system, unveils new Express Entry categories for 2026",
    "desc": "Rest of World News: Canada’s immigration minister - Lena Metlege Diab, last night announced new Express Entry immigration categories for 2026. The writing on the wall is .",
    "image": "https://static.toiimg.com/thumb/msid-128549647,width-1280,height-720,imgsize-60372,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Understanding the drivers of household and geographical poverty and their influence on health, and the demand for and supply of healthcare in Tanzania",
    "desc": "Understanding the interaction between household poverty, regional economic conditions, and healthcare access is critical for designing effective and equitable health policies. This study seeks to systematically explore how both household and geographical poverty shape the demand for healthcare services and the health system’s capacity to respond. By examining health status, healthcare-seeking behaviour, financing burdens, and … Continued",
    "image": "https://povertyevidence.org/wp-content/uploads/2026/02/iStock-108313157-1.webp",
    "source": "Data & evidence to end extreme poverty"
  },
  {
    "title": "CRDB Bank Foundation, HESLB launch digital skills initiative for varsity students",
    "desc": "Founder and CEO of Basil Link, Emmanuel Basil, explained that the initiative will have representatives in universities to guide students and answer questions.",
    "image": "https://www.thecitizen.co.tz/resource/image/5364788/landscape_ratio3x2/1200/800/63b63b35435b3fc5daaf9392908e3019/tV/crdb-pic.jpg",
    "source": "thecitizen.co.tz"
  }
]