[
  {
    "title": "AHA/ASA Release New Comprehensive Acute Ischemic Stroke Guideline",
    "desc": "This “long overdue” update expands the pools of patients eligible for thrombolysis and thrombectomy, and tackles pediatric stroke.",
    "image": "https://d14d5nk8lue86f.cloudfront.net/s3fs-public/2026-01/AHAASA%20Release%20New%20Comprehensive%20Acute%20Ischemic%20Stroke%20Guideline.jpg",
    "source": "TCTMD.com"
  },
  {
    "title": "nominated movies and TV shows discuss the Australian screen industry",
    "desc": "Ahead of next week's AACTA Awards, the makers of frontrunners Bring Her Back, Kangaroo and Apple Cider Vinegar share their thoughts on the state of the local screen industry.",
    "image": "https://live-production.wcms.abc-cdn.net.au/9a9c0298e36665bf082a8932c9acb5fc?impolicy=wcms_watermark_news&cropH=1687&cropW=3000&xPos=0&yPos=157&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Photocatalysis enables direct coupling of native sugars and N-heteroarenes",
    "desc": "Researchers from the National University of Singapore (NUS) have developed a \"capping-and-coupling\" strategy to transform naturally occurring (native) sugars directly into compounds known as C-heteroaryl glycosides. This makes it easier to produce such molecules that are valuable for drug and vaccine development.",
    "image": "https://scx2.b-cdn.net/gfx/news/2026/photocatalysis-enables.jpg",
    "source": "Phys.org"
  },
  {
    "title": "New blood test predicts risk of early death more accurately than age",
    "desc": "Population Health Research Institute researchers have developed a blood test that predicts risk of early death more accurately than age",
    "image": "https://www.hamiltonhealthsciences.ca/wp-content/uploads/2026/01/Hertzel-Gerstein-web-size-3496-003-scaled.jpg",
    "source": "Hamilton Health Sciences"
  },
  {
    "title": "Essendon North beauty salon firebombed for second time in two days",
    "desc": "About 100 residents have been forced to evacuate their Essendon North apartments in the early hours for a second night in a row.",
    "image": "https://live-production.wcms.abc-cdn.net.au/2696250af2552ebd5d172919a701aa47?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Pakistan's 5G spectrum auction scheduled for March 10",
    "desc": "ISLAMABAD: The Pakistan Telecommunication Authority has announced that the “Spectrum Auction for Next Generation Mobile Services /5G in Pakistan” will be conducted on March 10, 2026.According to a press release, the...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-01-30/l_647973_123917_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Carney cautions US on Canada sovereignty after reports of Alberta separatist talks",
    "desc": "The remarks come after reports that the Trump administration hosted Albertan separatists seeking independence from Canada, an idea Ottawa has repeatedly rejected amid Trump’s comments about Canada becoming the 51st US state.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202601/mark-carney-292822343-16x9_0.jpg?VersionId=T3spJYdCE.0xVwSimWmD3gpEUTtpw.hP",
    "source": "India Today"
  },
  {
    "title": "Democrats poised to trigger government shutdown over ICE restrictions",
    "desc": "Democrats voted to block legislation to fund the Department of Homeland Security and several other agencies Thursday as they continued to negotiate with Republicans and the White House on new restrictions for President Donald Trump’s surge of immigration enforcement.",
    "image": "https://dims.apnews.com/dims4/default/40322c7/2147483647/strip/true/crop/5111x3406+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F2c%2F75%2Ff6d2edc52aae57a418d02e73ef88%2F6d60cb770af044bb801d27d32b0f5eea",
    "source": "AP News"
  },
  {
    "title": "Gut microbiome may be a central player in the body's response to cancer",
    "desc": "A new study reveals how bacteria in the gut can help determine whether the amino acid asparagine from the diet will feed tumor growth or activate immune cells against the cancer​, according to researchers at Weill Cornell Medicine.",
    "image": "https://www.news-medical.net/image-handler/picture/2016/3/bacteria_-_Sebastian_Kaulitzki_46826fb7971649bfaca04a9b4cef3309-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Celtic vs Utrecht LIVE as Nygren and Engels strikes sandwich own goal before cheap goal for visitors",
    "desc": "It's the final matchday of the league phase and Celtic know three points will guarantee them a place in the play-offs",
    "image": "https://i2-prod.dailyrecord.co.uk/sport/football/article36638712.ece/ALTERNATES/s1200/0_Screenshot-2026-01-29-at-161511.png",
    "source": "Daily Record"
  }
]