[
  {
    "title": "Israel team, JD Vance booed at Olympics opening ceremony",
    "desc": "Cheers for the large U.S. team quickly turned to boos when U.S. Vice President JD Vance was shown on the stadium's big screen.",
    "image": "https://globalnews.ca/wp-content/uploads/2026/02/CP175742379.jpg?quality=65&strip=all&crop=1815px%2C297px%2C3619px%2C1911px&resize=720%2C379",
    "source": "Global News"
  },
  {
    "title": "Canadian Researchers Map the Milky Way's Magnetic Field",
    "desc": "An international team of researchers have published two papers that reveal a new model for how the magnetic field of the Milky Way evolved.",
    "image": "https://www.universetoday.com/article_images/eso0932a_20260206_221006.jpg",
    "source": "Universe Today"
  },
  {
    "title": "Amazon spending looks painful but it's not a reason to sell",
    "desc": "Amazon shares fell 7% on Friday after management issued a 2026 capital expenditures guide of $200 billion.",
    "image": "https://image.cnbcfm.com/api/v1/image/108259472-1769776783103-gettyimages-2258454612-20090101260130-99-336595.jpeg?v=1770397509&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Winter Olympics 2026: Why is Charlize Theron speaking out for peace at Milano Cortina 2026?",
    "desc": "The South African-born movie star will deliver a message of peace at the Opening Ceremony. Find out more about who she is and her connection to the event.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/v1770416303/primary/goabftczmgdct7xcfu5e",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Chelsea FC star spotted in training ahead of Wolves clash after injury update from Liam Rosenior",
    "desc": "Positive signs for Chelsea supporters before the Premier League meeting against Wolves",
    "image": "https://static.standard.co.uk/2026/02/06/20/42/LiamRoseniorChelsea06022026.jpeg?width=1200&auto=webp&quality=75",
    "source": "London Evening Standard"
  },
  {
    "title": "It just got easier for Claude to check in on your WordPress site",
    "desc": "WordPress users can now leverage Claude to analyze web traffic or find information about other internal site metrics.",
    "image": "https://techcrunch.com/wp-content/uploads/2024/10/unnamed-7.png?w=1200",
    "source": "TechCrunch"
  },
  {
    "title": "Nancy Guthrie may have been abducted in a 41-minute window, authorities say",
    "desc": "Nancy Guthrie was last seen alive when a relative dropped her outside her Tuscan home after a family games night. The 84-year-old grandmother has now been missing for a week.",
    "image": "https://live-production.wcms.abc-cdn.net.au/d2d92b95a59625010b6b5d445ced9c23?impolicy=wcms_watermark_news&cropH=1688&cropW=3000&xPos=0&yPos=165&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "'Invisible scaffolding of the universe' revealed in ambitious new James Webb telescope images",
    "desc": "A team of researchers using the James Webb Space Telescope has produced the most detailed map of dark matter to date.",
    "image": "https://cdn.mos.cms.futurecdn.net/teESBNqZ6Q4EGydNMYhAqe-2560-80.jpg",
    "source": "Live Science"
  },
  {
    "title": "Thousands Of Travellers Grounded In Asia As Thailand, Singapore, Japan, China, India, Indonesia, And Türkiye Delay 4,099 And Cancel 76 Flights, Disrupting AirAsia, Singapore, Pegasus, Cathay Pacific,",
    "desc": "Thousands of passengers stranded in Asia today as 4,175 flight cancellations and delays hit Mumbai, Bangkok, Osaka, Jakarta, Singapore, Istanbul, Phuket, more.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/AI-Generated-Image-495.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "Why are Italy’s volleyball teams being honoured at the Opening Ceremony?",
    "desc": "Italy's national volleyball teams crowned a phenomenal 2025 season winning both the men's and women's world titles. The teams are honoured at the opening ceremony on Friday (6 February), in a celebration of Italy’s sporting excellence and unity.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/r4a314mty5jqwhzfuoza",
    "source": "Milano Cortina 2026"
  }
]