[
  {
    "title": "John Blaq loses rights to early music catalog",
    "desc": "Singer John Blaq reveals he no longer owns the rights to his early hits, as his former management controlled all finances and rights.",
    "image": "https://mbu.ug/wp-content/uploads/2026/02/IMG_7917-edited-scaled.jpeg",
    "source": "mbu.ug"
  },
  {
    "title": "Scramble for a bank that came back from the brink",
    "desc": "IDBI Bank, once a development finance institution, is nearing privatization after years of financial stress and government intervention. Indian-Canadian investor Fairfax Financial and Kotak Mahindra Bank are set to submit bids for a majority stake. This marks a significant shift for the troubled public sector lender towards private ownership.",
    "image": "https://img.etimg.com/thumb/msid-127981064,width-1200,height-630,imgsize-98408,overlay-economictimes/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Led Cutlass Express 2026 to Boost Maritime Security in the Indian Ocean",
    "desc": "The U.S. recently strengthened Kenya’s security capabilities through an Ksh8.9 billion runway expansion at Manda Bay, a project that is aimed at enhancing domain awareness and the war against insurgents.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/KDF%20training.jpg?itok=vBQLoEqN",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "Iyabo Ojo's Cryptic Post Amid Nollywood Drama",
    "desc": "Actress Iyabo Ojo shares a cryptic message on Instagram amid ongoing Nollywood drama, telling critics '2026 ain’t for talkers.' Find out more.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/01/09222130/Iyabo-Ojo-1200x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Leeds vs Nottingham Forest Sky Bet preview: A season-shaping test as both sides fight to stay clear of relegation trouble",
    "desc": "Leeds and Nottingham Forest may start the weekend six points above the relegation zone, however, should they fail to finish the season strong - they are at real risk of going down.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/05/14/102605583-0-image-m-74_1770301590760.jpg",
    "source": "dailymail.co.uk"
  },
  {
    "title": "TCRA calls for submission of ICT projects for global recognition",
    "desc": "DAR ES SALAAM: THE Tanzania Communications Regulatory Authority (TCRA) has called on government institutions, private sector players, academia, civil society, and other stakeholders to submit information and communication technology (ICT) projects for international recognition under the 2026 World Summit on the Information Society (WSIS) initiatives. The call follows an invitation by the International Telecommunication Union",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/Mkurugenzi-Mkuu-wa-Mamlaka-ya-Mawasiliano-Tanzania-TCRA-Dkt.-Jabiri-Bakari-ameshiriki-kwenye-h.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "The environmental cost of Israel’s booming data center industry",
    "desc": "Data centers power Israel’s tech growth and AI ambitions, but they also strain land, water and electricity supplies. Without smarter planning, cleaner energy and regulation, their hidden environmental costs will keep rising",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2021/06/10/ryVdTQysd/ryVdTQysd_0_79_1280_720_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Jelutong MP wants authorities to expedite probe into teen's death in traffic accident",
    "desc": "GEORGE TOWN: Jelutong MP RSN Rayer urges the authorities to expedite investigations into the death of 17-year-old Jason Lee Jia Chen, who was killed in a road accident in November last year, saying the prolonged delay had caused further distress to the victim's family.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/06/3757965.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Vattenfall appoints Sjur Jensen as new Head of Business Area Markets",
    "desc": "Vattenfall has appointed Sjur Jensen as Senior Vice President and Head of Business Area Markets, and as a member of the Executive Group Management. He has already filled this position in an acting role since August 2025.",
    "image": "https://group.vattenfall.com/globalassets/com/newsroom/2026/sjur-jensen-5x3.jpg",
    "source": "group.vattenfall.com"
  },
  {
    "title": "Lawyer Raja Segaran, apex court chief registrar among 11 new JCs",
    "desc": "K Raja Segaran appeared for Prime Minister Anwar Ibrahim in a civil suit last year.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/29a1ec8a-lawyer-k-raja-segaran-and-federal-court-chief-registrar-zamri-bakar-tile-pic-6226.webp",
    "source": "freemalaysiatoday.com"
  }
]