[
  {
    "title": "Ghana to host ICC Men’s T20 World Cup Africa qualifier in March",
    "desc": "Ghana will host the ICC Men’s T20 World Cup Africa Sub-Regional Qualifier B tournament from March 24 to March 29, 2026, marking a major milestone in the",
    "image": "https://citinewsroom.com/wp-content/uploads/2026/02/Sport-GCA-Tournament-.jpg",
    "source": "CitiNewsroom.com"
  },
  {
    "title": "Elections In 3 Months, But Ignores In Budget?",
    "desc": "Generally, when a state is heading for Assembly elections, it is expected to get significant grants and allocations in the union budget from the central",
    "image": "https://cdn.gulte.com/wp-content/uploads/2026/02/tamilnadu-union-budget.jpg",
    "source": "Gulte"
  },
  {
    "title": "Five-year-old boy and father detained by ICE return to Minnesota",
    "desc": "The boy was released on the order of a judge who said his detention was \"cruel\" and \"bereft of human decency”.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5369/live/62e82be0-ff98-11f0-b5b6-6b2a047b2cea.jpg",
    "source": "BBC"
  },
  {
    "title": "San Miguel Beermen triumphs over TNT Tropang 5G to win PBA Season 50 Philippine Cup",
    "desc": "San Miguel has seen off TNT to win the PBA Season 50 Philippine Cup -- its second consecutive all-Filipino crown.",
    "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0201%2Fr1608858_1296x729_16%2D9.jpg",
    "source": "ESPN Philippines"
  },
  {
    "title": "India invited for observing Bangladesh polls: Interim govt",
    "desc": "In a statement, the Chief Adviser said, '330 International Observers confirmed for upcoming elections. Invited countries yet to confirm their delegates include India, Nepal, Australia, Brazil, Canada, Egypt, France, Kuwait, Morocco, Nigeria, and Romania.'",
    "image": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTk1MWJlNzIwLWZmOTEtMTFmMC05ZTU3LWE1YjYwZTQ0ZTg4ZS5qcGc=",
    "source": "Tribune India"
  },
  {
    "title": "Jude Bellingham in tears after Real Madrid injury, 'an important loss'",
    "desc": "Jude Bellingham was substituted early in Real Madrid's LaLiga game with Rayo Vallecano on Sunday, forced off with what appeared to be a hamstring injury.",
    "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0201%2Fr1608777_1296x729_16%2D9.jpg",
    "source": "ESPN Singapore"
  },
  {
    "title": "Carlos Alcaraz beats Novak Djokovic in Australian Open final to complete career grand slam",
    "desc": "Spaniard wins his seventh major tournament in Melbourne at just 22",
    "image": "https://www.irishtimes.com/resizer/v2/5BE7447WODYWGLS2YL7WZU3PH4.jpg?smart=true&auth=52d27068c4cd5341cc2d8d8e14d2ba9952623159377d1d9572fb0ba1e1f3ee8f&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "The new addiction on the rise in Britain... and how it has the same dopamine effect as cocaine: These are the signs you have a problem - and the steps you should take to tackle it",
    "desc": "For Hannah Blass, it all began aged 23 and at university... today Hannah, now 30, can put a name to her problem",
    "image": "https://i.dailymail.co.uk/1s/2026/02/01/11/106008593-0-image-a-55_1769944769553.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Architect bets on emerging designs crashing house prices soon",
    "desc": "Architect Olugbenga Lana, has said that based on new housing designs now coming into the building industry, chances are that house prices...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2025/03/Untitled-design-2025-03-11T115840.860-1.png",
    "source": "Businessday NG"
  },
  {
    "title": "World Bank Supports a Stronger and More Resilient Health System in Botswana",
    "desc": "The project will help strengthen critical medicine supplies, accelerate detection of disease outbreaks, and make life-saving health data available in real time.",
    "image": "https://i0.wp.com/tanzaniatimes.net/wp-content/uploads/2026/02/gaborone-world-bank-health.jpg?fit=474%2C232&ssl=1",
    "source": "The Tanzania Times"
  }
]