[
  {
    "title": "Tanzania, Kenya reaffirm partnership to expand staple grain trade",
    "desc": "NAIROBI: TANZANIA and Kenya have reaffirmed their commitment to boosting trade in the staple grain value chain, particularly white maize and rice. The agreement was reached in a discussion between Tanzania’s Permanent Secretary in the Ministry of Agriculture, Gerald Mweli, and Kenya’s Principal Secretary, State Department for Agriculture, Dr Kipronoh Ronoh in Nairobi, Kenya. ALSO",
    "image": "https://dailynews.co.tz/wp-content/uploads/2022/07/favicon.ico",
    "source": "dailynews.co.tz"
  },
  {
    "title": "The model who moved to Ghana and wrapped her prosthetic leg in its famous fabric",
    "desc": "It was hard to miss 33-year-old model and writer Abena Christine Jon'el's appearance at a recent major fashion show in Ghana.",
    "image": "https://i0.wp.com/www.gbcghanaonline.com/wp-content/uploads/2026/01/Abena.png",
    "source": "GBC Ghana Online"
  },
  {
    "title": "Record-breaking Australia heatwave fuels bushfires, cuts power to thousands",
    "desc": "A record-breaking heatwave baked Australia's southeast for a fifth straight day on Wednesday.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--Nq8XJpCx--/t_tohu-badge-facebook/v1769591448/4JU2RU2_Screenshot_2026_01_28_221015_png?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Royal Family LIVE: Meghan Markle faces Hollywood humiliation as photogate details emerge",
    "desc": "Meghan Markle is back in the spotlight after Kim Kardashian spoke about the infamous photogate with Prince Harry.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/106/1200x630/6706023.jpg",
    "source": "Daily Express"
  },
  {
    "title": "Kwesi Botchway Jnr makes a solid case for Dr Bawumia",
    "desc": "Kwesi Botchway Jnr, a private legal practitioner, has presented a compelling case for why Dr Bawumia remains the most qualified, capable, and winnable candidate to lead the New Patriotic Party (NPP) into the 2028 general elections.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/346/34637768.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Man Utd make final decision on Cole Palmer transfer as summer priority becomes clearer",
    "desc": "Manchester United will not be signing Cole Palmer from Chelsea this summer, with the England star out of their price range",
    "image": "https://i2-prod.football.london/article33323541.ece/ALTERNATES/s1200/0_GettyImages-2258117368.jpg",
    "source": "Football London"
  },
  {
    "title": "School fees, uniforms biggest challenge during Grade 10 transition - survey",
    "desc": "Infotrak survey shows mixed perceptions continue to shape public confidence in CBE.",
    "image": "https://cdn.radioafrica.digital/image/2026/01/9df08d23-0b5e-456b-9770-bb0b7689573c.png?1769699822966",
    "source": "the-star.co.ke"
  },
  {
    "title": "Aussies to blood three debutants in Pakistan series opener",
    "desc": "Mahli Beardman, Jack Edwards and Matthew Renshaw will play their first T20I for Australia",
    "image": "https://resources.cricket-australia.pulselive.com/cricket-australia/photo/2026/01/29/84ef7491-62a9-4b05-89b8-e83c262a85db/beardman-renshaw-edwards-debut.jpg",
    "source": "cricket.com.au"
  },
  {
    "title": "Number of term-time school holiday fines hits another record high",
    "desc": "New government data shows that fines for term-time holidays have risen again in the last academic year.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6ab7/live/f6084b80-fbb0-11f0-b852-153f64f31c74.jpg",
    "source": "BBC"
  },
  {
    "title": "'She was a beacon of light in a dark chapter in history': Ann Lee, the 1700s Christian leader who shocked America",
    "desc": "How did a charismatic but impoverished British woman become the leader of the progressive religious sect known as \"the Shakers\" in 18th-Century America?",
    "image": "https://ychef.files.bbci.co.uk/624x351/p0mxp9vm.jpg",
    "source": "BBC"
  }
]