[
  {
    "title": "2026 Toy of the Year® Winners Shine at Toy Industry’s Biggest Night",
    "desc": "The toy industry rolled out the purple carpet tonight at the 2026 Toy of the Year® (TOTY®) Awards, also known as the “Oscars” of the toy industry, which honored the most creative and innovative toys and games of the year. The TOTY Awards program and",
    "image": "https://www.toyassociation.org/images/websites/news/toty26-1280.webp",
    "source": "The Toy Association"
  },
  {
    "title": "A Practical Study on Integrating Red Culture in the School History Museum of Baoding University into College English Curriculum Ideological and Political Education",
    "desc": "To address the predicament of the absence of Chinese culture in college English teaching and achieve ideal ideological and political education outcomes through curriculum, this paper adopts a combined approach of literature review, investigation, and curriculum practice to conduct an in-depth exploration of the integration of red culture in the School History Museum of Baoding University into college English curriculum ideological and political education. The practice shows that by thoroughly excavating and interpreting the two major thematic red culture resources—“The Power of Ideals” and “The Call of the Red Flag”—in the School History Museum, organically integrating them into curriculum content via modular embedding and the development of school-based teaching units, and designing task-driven activities such as project-based learning, situational simulation, and bilingual interpretation practice in teaching processes, students’ comprehensive English application abilities can be enhanced. Meanwhile, their sense of identity and pride in the school’s red culture, as well as their willingness and capacity to disseminate excellent Chinese culture in English, are significantly strengthened. This indicates that the integration of red culture in the School History Museum of Baoding University into college English curriculum ideological and political education is feasible and operable. By integrating value shaping, knowledge imparting, and competence cultivation, this practice provides an effective reference for similar institutions to carry out college English curriculum ideological and political education relying on their distinctive resources.",
    "image": "https://file.scirp.org/image/ce2016062413390872.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Students Sporting Preferences and Practices",
    "desc": "In this article, we aim to better understand the experiences of students who struggle in volleyball but succeed in other physical activities. We want to know how they experience this situation and what types of obstacles they encounter. 353 middle school students, through their experiences in physical education and sports, are included in this study. A questionnaire combined with semi-structured interviews was used. Data analysis was performed. The content was categorized. Standard statistical indicators (frequencies, percentages) and the chi-square test were used to analyze the observed student attitudes. The results showed that volleyball is among the students’ favorite sports, even though only 7.31% of them play it outside of school hours. The forearm pass is preferred by 34.05% of students, but its learning is characterized by difficulties in five technical sub-elements. It is necessary to promote new, relevant, and effective teaching methods.",
    "image": "https://file.scirp.org/image/ce2016062413390872.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Enduring love story: Elderly couple spent final days together at hospice after decades of marriage",
    "desc": "For many, love lasts a lifetime. And for this couple, their love truly did.In a Facebook post on Thursday (Feb 12), Assisi Hospice recounted the enduring love story of a couple who stood by each other through life's ups and downs to the very end, as the world celebrates Valentine's Day on Saturday (Feb 14).Lai Fa Chong, 84, and his...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/couple_facebook_cancer_dementia_last_days.jpg?itok=UNcEGnnM",
    "source": "AsiaOne"
  },
  {
    "title": "Honeysuckle compounds target key inflammatory signaling pathways",
    "desc": "Announcing a new publication for Acta Materia Medica journal. Inflammation is a complex biological response essential for tissue repair in acute settings, yet chronic dysregulation contributes to progressive tissue damage and the pathogenesis of numerous diseases.",
    "image": "https://www.news-medical.net/themes/Standard/images/full_site_logo.png",
    "source": "News-Medical"
  },
  {
    "title": "Mahama meets UN Chief, discusses African security, democracy",
    "desc": "President John Dramani Mahama on Friday held talks with United Nations (UN) Secretary-General António Guterres on the sidelines of the 39th Assembly of Heads of State and Government of the African Union in the Ethiopian capital, Addis Ababa.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/574/57450429.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Man, 85, kidnapped in reported case of mistaken identity in Sydney",
    "desc": "Police have made a rare appeal in what they say is the mistaken identity kidnapping of an 85-year-old man in Sydney.",
    "image": "https://live-production.wcms.abc-cdn.net.au/29dd18e36364de9f4a385c55b271d71c?impolicy=wcms_watermark_news&cropH=128&cropW=227&xPos=0&yPos=11&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "10,000 Condom Packs Exhausted, Unexpected Crisis Emerges At Winter Olympics",
    "desc": "Organisers of the 2026 Milan-Cortina Winter Olympics have exhausted their initial supply of 10,000 free condoms at the athletes village just days into the Games.",
    "image": "https://c.ndtvimg.com/2026-02/26t5ckp4_olympics-condoms-getty_625x300_14_February_26.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
    "source": "NDTV Sports"
  },
  {
    "title": "Marshall launches new limited-edition Emberton III Lunar New Year 2026 speaker at Against Lab",
    "desc": "Celebrating the Year of the Horse, Marshall has introduced the latest Emberton III Lunar New Year Edition 206, designed alongside Chinese artist FCCK.",
    "image": "https://i0.wp.com/nasilemaktech.com/wp-content/uploads/2026/02/Marshall-Emberton-III-Lunar-New-Year-2026-launched-featured.webp",
    "source": "Nasi Lemak Tech"
  },
  {
    "title": "Anthony Albanese taunts new Liberal leaders in first comments since Sussan Ley’s ousting",
    "desc": "‘Angus Taylor presents us with a new question: can a soufflé rise once?’, the prime minister said in a speech to a Labor conference",
    "image": "https://i.guim.co.uk/img/media/fdab5e609ed8212c7bfec14c73e60793bf80f4be/736_131_2219_1776/master/2219.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=55e3d6207b2c025372e7794634b7ac9d",
    "source": "The Guardian"
  }
]