[
  {
    "title": "Vertiv Reports Strong Fourth Quarter with Organic Orders Growth of 252% and Diluted EPS Growth of 200% (Adjusted Diluted EPS +37%)",
    "desc": "Fourth Quarter 2025 Net sales of $2,880 million, 23% higher than fourth quarter 2024 Operating profit up 27% and adjusted operating profit(1) up 33% from...",
    "image": "https://mma.prnewswire.com/media/2660251/Vertiv_Corporation_Logo.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "BIODEV2030 Backs Ethiopia’s Nature",
    "desc": "On 7 February 2026, Bishoftu, Ethiopia, hosted the fourth national stakeholder workshop under the BIODEV2030 project. The event brought together senior officials from key government bodies, including the Ethiopia Biodiversity Institute, Ethiopian Wildlife Authority, Ministry of Agriculture, Ministry of Finance, Ministry of Planning, and Environment Protection Authority, alongside the national CBD Focal Point and a",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Thomas Frank sacked by Tottenham after eight months in charge",
    "desc": "Spurs are winless in their last eight league games and have won just two of their last 17.",
    "image": "https://static01.nyt.com/athletic/uploads/wp/2025/11/23125836/thomas-frank-claps-scaled-e1763920748283.jpg?width=1200&height=630&fit=cover",
    "source": "The New York Times"
  },
  {
    "title": "Players surge back to Overwatch with the new expansion, as it leapfrogs Marvel Rivals on Steam and dominates Twitch",
    "desc": "The comeback is on, but for how long?",
    "image": "https://assetsio.gnwcdn.com/overwatch-comeback-venedetta.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "source": "Eurogamer"
  },
  {
    "title": "The Commission sets up the European Ocean Board and calls for experts to advise on ocean policy",
    "desc": "The European Commission is calling for applications for the High-Level European Ocean Board, a new expert group established under the European Ocean Pact.",
    "image": "https://oceans-and-fisheries.ec.europa.eu/sites/default/files/styles/ewcms_metatag_image/public/2026-02/European-Ocean-Board-Feb-2026-Europa-3X2-03.png?h=06ac0d8c&itok=prP_uZ2o",
    "source": "European Commission"
  },
  {
    "title": "With eyes on trade deals and reform in global governance, Lula heads to India with 260 firms",
    "desc": "Lula leads Brazil's largest-ever business delegation to India, aiming for trade deals and global governance reforms amidst geopolitical challenges.",
    "image": "https://th-i.thgim.com/public/incoming/hcpd8z/article70619328.ece/alternates/LANDSCAPE_1200/2026-01-28T221552Z_574182851_RC2FAJAVUK3U_RTRMADP_3_PANAMA-ECONOMIC-FORUM.JPG",
    "source": "The Hindu"
  },
  {
    "title": "GoNigeria Expands Advocacy, Calls For Deeper Democratic Reforms in Nigeria",
    "desc": "GoNigeria Expands Advocacy, Calls For Deeper Democratic Reforms in Nigeria",
    "image": "https://www.channelstv.com/wp-content/uploads/2026/02/collage.jpg",
    "source": "Channels Television"
  },
  {
    "title": "Tanzania, Somalia deepen ties, establish a body to boost trade, investment.",
    "desc": "DAR ES SALAAM: TANZANIA, and Somalia have agreed to strengthen diplomatic ties by establishing a Joint Cooperation Commission to boost trade and investments. The agreement was reached in a discussion between Tanzania’s Permanent Secretary in the Ministry for Foreign Affair and East African Cooperation, Dr Samwel Shelukindo, and the Permanent Secretary of the Ministry of",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/Tanzania-na-Somalia-zaendelea-kusimika-mizizi-ya-ushirikiano-wa-kidiplomasiaKatibu-Mkuu-wa-Wizar.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Russian drone strike kills three Ukrainian toddlers and their father",
    "desc": "Three toddlers and their father were killed in a Russian drone strike in eastern Ukraine that also injured their pregnant mother and their grandmother, local emergency services said.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2260477626.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Violin finalists announced for the 2026 International Mozart Competition",
    "desc": "Three violinists compete for the €10,000 first prize in Salzburg, Austria",
    "image": "https://dnan0fzjxntrj.cloudfront.net/Pictures/1024x536/1/9/7/42197_wideimages6_753470.jpg",
    "source": "The Strad"
  }
]