[
  {
    "title": "Ted Cruz Bashes Billie Eilish Grammy Speech During Netflix Hearing",
    "desc": "Ted Cruz pressed Netflix chief Ted Sarandos about Billie Eilish's Grammy speech during a hearing about the company's merger with Warner Bros.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2026/02/GettyImages-2258175143.jpg?w=1440&h=810&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "Six Nations kicks off with heavyweights Ireland and France, yet Paris looks uninterested",
    "desc": "If Ireland are to win, then most likely it will be a bare-knuckle ride",
    "image": "https://www.irishtimes.com/resizer/v2/VUL2U7CUJOCIKKV4XB4VHWWGAI.jpg?smart=true&auth=2647d29de011e8449f4306e7e73ce08542b835bcb976043b169132431c81c6cc&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Highgrove House welcomes charities on World Cancer Day",
    "desc": "The event marks the first of a series at Highgrove House aimed at bringing people together.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/79f8/live/4fadf630-01e7-11f1-9199-abe6787bfb38.jpg",
    "source": "BBC"
  },
  {
    "title": "Winter Olympics kicked off in Cortina with curling, but took a brief pause due to a power outage",
    "desc": "The Winter Olympics got underway Wednesday with the first curling matches in Cortina, but came to a halt only moments later because of a power outage.",
    "image": "https://www.tsn.ca/resizer/v2/6BSFRKLVEHQYF2PN3RFL3VE5WE.jpg?smart=true&auth=3e81e130a1050607df1e5d7c252f47f5aa601cba014e11ab258cf8f9ca4bcc91&width=1200&height=630",
    "source": "TSN"
  },
  {
    "title": "Human Rights Watch researchers resign over ‘pulled’ report",
    "desc": "HRW said they concluded “aspects of the research and the factual basis for our legal conclusions needed to be strengthened to meet Human Rights Watch’s high standards.”",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/658064",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Wilder vs Chisora: Derek Chisora describes Deontay Wilder as he \"brother\" as",
    "desc": "Deontay Wilder and Derek Chisora strike a friendly tone at the launch news conference for their heavyweight fight in April.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8987/live/36113d60-01f9-11f1-956b-671d50219d57.png",
    "source": "BBC"
  },
  {
    "title": "Supreme Court lets California use new Democrat-friendly congressional map",
    "desc": "The Supreme Court on Wednesday allowed California to use a new congressional map that will undermine President Donald Trump’s effort to keep control of the House of Representatives, marking a defeat for Republicans who claimed one of the new districts was redesigned based on race rather than politics.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2255405203-20260114145556294.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Report calls for Australia to grow security, trade and diplomatic ties with Taiwan because of China's influence",
    "desc": "Experts say Australia needs to do more to grow its relationship with Taiwan as China works to diplomatically isolate Taipei in the region.",
    "image": "https://live-production.wcms.abc-cdn.net.au/3fa9fe5450ea6309e61fe6c8d7c778a8?impolicy=wcms_watermark_news&cropH=450&cropW=800&xPos=0&yPos=40&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Jigsaw puzzle racing winners crowned at Masters Games",
    "desc": "Jigsaw puzzle racing was a new addition at the last Masters Games in Dunedin and it sold out within a day when it returned this year.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--ZiFzOR3c--/t_tohu-badge-facebook/v1770222900/4JTQRUC_Puzzle_masters_24644_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "In Zak Hilditch's horror movie We Bury the Dead, the zombie apocalypse devastates Tasmania",
    "desc": "These Final Hours writer and director Zak Hilditch drew on personal tragedy to produce We Bury the Dead, his biggest cinematic epic yet.",
    "image": "https://live-production.wcms.abc-cdn.net.au/1c81195acffab31706916c6f5d5288d8?impolicy=wcms_watermark_news&cropH=1687&cropW=3000&xPos=0&yPos=157&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  }
]