[
  {
    "title": "Blind refugee dies in New York after released by immigration",
    "desc": "Immigration authorities say the Myanmar refugee was dropped at a \"warm, safe\" location, but New York officials say he was left outside a closed coffee shop.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8bf2/live/53511050-137c-11f1-bff0-79e5e20f8a65.jpg",
    "source": "BBC"
  },
  {
    "title": "Notre Dame RB Jeremiyah Love will work out at combine",
    "desc": "Fewer prospects than ever are working out at the Scouting Combine this year.",
    "image": "https://nbcsports.brightspotcdn.com/dims4/default/b07d38f/2147483647/strip/true/crop/6929x3898+0+0/resize/1440x810!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2F5a%2F3e%2F127eccf54fd4be1f683fcd784f78%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F2263335992",
    "source": "NBC Sports"
  },
  {
    "title": "Abhishek Sharma, Tilak Varma's run back into form down to video analysis: 'Slide was made for the entire team'",
    "desc": "After the loss against South Africa, the video analysts made the entire team see a slide, revealing what went for the side in the past.  | Cricket",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/28/550x309/PTI02-26-2026-001036A-0_1772247894735_1772247910782.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Xie Shaoguang opts out of Star Awards 2026",
    "desc": "Xie Shaoguang declined to be nominated for Star Awards 2026 despite buzz over his role in The Gift Of Time and will not attend the ceremony.",
    "image": "https://dam.mediacorp.sg/image/upload/s--bsIRvxOn--/c_crop,h_900,w_1600,x_0,y_0/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2024/09/05/xieshaoguang_240904-01_new.jpg?itok=EDFn9w1x",
    "source": "CNA Lifestyle"
  },
  {
    "title": "Study maps how NF-κB regulates gene expression in cells",
    "desc": "To further the quantitative understanding of cellular decision making, Dr. Gregory Reeves and his team in the chemical engineering department have worked to interpret how a transcription factor dictates the alteration of gene expression in cells.",
    "image": "https://www.news-medical.net/images/tags/TagImage-456-45847033825775462152-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Sam Altman's OpenAI Signs Deal With Pentagon Amid Trump vs Anthropic",
    "desc": "OpenAI said Friday it struck a deal for the Pentagon to use its models in the US defense agency's classified network, with \"safeguards,\" after President Donald Trump blacklisted AI rival Anthropic.",
    "image": "https://c.ndtvimg.com/2025-06/17f2pqk4_sam-altman_625x300_30_June_25.jpeg",
    "source": "NDTV"
  },
  {
    "title": "Philippines, US, Japan conduct joint drills near Taiwan",
    "desc": "The Philippine, US and Japanese militaries conducted joint exercises this week over the Bashi Channel that separates the Philippines from Taiwan, officials said Friday.",
    "image": "https://media.philstar.com/photos/2026/02/28/bashi-channel_2026-02-28_10-16-16.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Don Don Donki to shutter Downtown East store on March 15 after 5 years",
    "desc": "Those who frequent Downtown East will no longer hear Don Don Donki's familiar jingle very soon.The Japanese supermarket chain will be closing its outlet at the mall on March 15, it announced in a Facebook post on Friday (Feb 27).\"We are truly grateful for all the love, support and late-night snack runs you've shared with us over the years. Thank...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/280226_donkiDTEclose_Gmaps.jpg?itok=BIGD9P86",
    "source": "AsiaOne"
  },
  {
    "title": "Biden seizes on Trump's sinking favorability in a combative speech in South Carolina",
    "desc": "Former President Joe Biden stood before a South Carolina crowd on Friday and took aim at President Donald Trump's State of the Union address.\"Is he still talking?\" Biden asked, to laughter",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-02/022726-joe-biden-south-carolina-vsb-2057-db1f45.jpg",
    "source": "NBC News"
  },
  {
    "title": "Pistons-Cavaliers game delayed over horn malfunction",
    "desc": "Friday's game between the Pistons and Cavaliers was delayed for roughly 12 minutes -- all because the horn at Little Caesars Arena would not turn off.",
    "image": "https://nypost.com/wp-content/uploads/sites/2/2026/02/newspress-collage-nphz6y6ta-1772245888304.jpg?quality=75&strip=all&1772227900&w=1200",
    "source": "New York Post"
  }
]