[
  {
    "title": "Don't Ask Harry Potter New Cast About Original Movies",
    "desc": "Daniel Radcliffe urges the press not to ask the new cast of HBO's \"Harry Potter\" series reboot about the original actors like himself and Emma Watson.",
    "image": "https://variety.com/wp-content/uploads/2026/02/radcliffe-mclaughlin-split.webp?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Efficient Quantum Code Compilation Simplifies Circuits And Reduces Error Rates",
    "desc": "Researchers have developed a new compilation strategy, utilising simulated circuit blocks, that significantly reduces error rates and improves the efficiency of quantum code implementations, offering a flexible pathway towards advanced quantum computing compilers.",
    "image": "https://quantumzeitgeist.com/wp-content/uploads/Image_fx-87-11.jpg",
    "source": "Quantum Zeitgeist"
  },
  {
    "title": "Bird flu suspected as dead geese are found at multiple parks across New Jersey, officials say",
    "desc": "The cause of the geese deaths is suspected to be bird flu, officials said.",
    "image": "https://www.nj.com/resizer/v2/ND47EH5BIJBLJO2GJRVVKWHP2E.JPG?auth=e2fe849d0074470146eb2fe055f4ef484a10f45ee4f6e5246d2d2765b8de72e5&width=1280&smart=true&quality=90",
    "source": "NJ.com"
  },
  {
    "title": "Pakistan reports current account surplus in Jan",
    "desc": "Pakistan recorded a current account surplus of more than $120 million in January\nPakis",
    "image": "https://img.dunyanews.tv/news/2026/February/02-18-26/news_big_images/936014_95359994.jpg",
    "source": "Dunya News"
  },
  {
    "title": "In Defense of Processed Foods",
    "desc": "Yes, America has a diet problem. No, it’s not because your bread comes in a bag, write Jan Dutkiewicz and Gabriel N. Rosenberg.",
    "image": "https://substackcdn.com/image/fetch/$s_!kFrS!,w_1200,h_675,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F58ba6521-39d3-4c5f-97f8-57f0cddd3596_720x405.jpeg",
    "source": "The Free Press"
  },
  {
    "title": "ISIS bride saga deepens; Jesse Jackson dies; Angus Taylor frontbench revealed; Randa Abdel-Fattah to headline Sydney Writer’s Festival",
    "desc": "Follow along as we bring you the latest live news updates from Australia and beyond.",
    "image": "https://static.ffx.io/images/$zoom_0.3153%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_283%2C$y_78/t_crop_custom/q_86%2Cf_auto/95093f4a9093f3b0879b6880f9355a55d87af64a",
    "source": "The Age"
  },
  {
    "title": "Benfica boss Jose Mourinho points the finger at Vinicius Jr as alleged racism against Real Madrid star completely overshadows Champions League play-off",
    "desc": "Jose Mourinho has sensationally claimed that Benfica 'cannot be a racist club' after Real Madrid star Vinicius Junior accused one of his players of abuse during Los Blancos' 1-0 win over the Portuguese side in the Champions League knockout play-offs. Instead, the former head coach of the Spanish club has claimed that the Brazilian international incited Tuesday night's chaos in Lisbon.",
    "image": "https://assets.goal.com/images/v3/getty-2262179315/crop/MM5DENBUHA5DCMZXG45G433XMU5DMORSGU======/GettyImages-2262179315.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Wafer-Scale Package Hosts Over 500 Qubits, Edging Closer To Practical Quantum Computers",
    "desc": "Researchers have developed a wafer-scale package accommodating over 500 superconducting qubits on a single chip, maintaining high qubit coherence and fidelity, with median values of 100 microseconds and 97.",
    "image": "https://quantumzeitgeist.com/wp-content/uploads/Image_fx-86-12.jpg",
    "source": "Quantum Zeitgeist"
  },
  {
    "title": "US sends F-22s, F-35s, F-16s in major 50-jet deployment to Middle East",
    "desc": "The United States deployed over 50 fighter jets and advanced a carrier strike group toward the Middle East as indirect nuclear talks with Iran resumed, signaling parallel tracks of military reinforcement and diplomacy.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/uss-gerald-r-ford-181312831-16x9_0.jpg?VersionId=m333cUMep7QKysTOsIAkz1KBKCEjvrLN",
    "source": "India Today"
  },
  {
    "title": "Winter Olympics 2026: Isabeau Levito shimmies with Sophia Loren glam in Olympic debut",
    "desc": "The 18-year-old USA skater made her Olympic debut on foreign ice, but still ended up feeling right at home thanks to her Italian roots and a program honouring the most iconic of Italian divas.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/yqczljum5eubtwvincye",
    "source": "Milano Cortina 2026"
  }
]