[
  {
    "title": "day oatmeal diet may help reduce LDL levels by 10%",
    "desc": "Participants who primarily ate oatmeal for two days experienced a long-lasting reduction in LDL (“bad”) and total cholesterol levels, the results of a clinical trial show.",
    "image": "https://media.post.rvohealth.io/wp-content/uploads/sites/3/2026/02/eating-oatmeal-732x549-thumbnail.jpg",
    "source": "Medical News Today"
  },
  {
    "title": "Highway 99 in Tulare County reopens after 59-vehicle pileup, CHP says",
    "desc": "Highway 99 in Tulare County has reopened after a 59-vehicle pile-up forced a total closure Saturday morning near Earlimart.",
    "image": "https://cdn.abcotvs.com/dip/images/18516555_013126-kfsn-tulareco-hwy99-pileup.jpg?w=1600",
    "source": "ABC30 Fresno"
  },
  {
    "title": "Mistakes Tinubu's detractors madeover Turkey misstep —Fani",
    "desc": "The Nation Newspaper Mistakes Tinubu's detractors madeover Turkey misstep —Fani-Kayode",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2025/01/15084003/Fani-KAyode.jpeg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "NASA’s Perseverance Rover completes 1st AI-planned drive on Mars",
    "desc": "NASA’s Perseverance rover has successfully completed its first AI-planned drives on Mars, using generative AI to autonomously chart routes and navigate challenging terrain, marking a major milestone in space exploration.",
    "image": "https://media.assettype.com/thenewsminute%2F2026-02-01%2Fdw17zgnw%2FMars.jpeg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "The News Minute"
  },
  {
    "title": "Sheapark Resource Hub is a development pathway for Upper West and Ghana - Speaker Bagbin",
    "desc": "The Speaker of Parliament, Alban Kingsford Sumana Bagbin, has described the Sheapark Resource Hub as a clear development pathway that will transform the Upper",
    "image": "https://i0.wp.com/www.gbcghanaonline.com/wp-content/uploads/2026/02/623806799_905828878629607_1994610442924666383_n.jpg",
    "source": "GBC Ghana Online"
  },
  {
    "title": "Union Budget 2026: CM Stalin flags 'unfulfilled promises', seeks fair share for Tamil Nadu",
    "desc": "In a post on X, Stalin listed a series of demands, asking whether the Budget would include a Rs 3,548 crore education fund to support the studies of students who have been detained and not promoted, funding for Coimbatore and Madurai Metro Rail projects, Rs 3,112 crore for the Jal Jeevan Mission, which Tamil Nadu is implementing effectively, new railway projects, and a 50% share of the Centre's tax revenue for states, as recommended by the Finance Commission.",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20260201053457.jpg",
    "source": "ANI News"
  },
  {
    "title": "Video of passenger vaping next to bus captain goes viral",
    "desc": "A video of a passenger vaping next to a bus captain has gained attention on social media.Posted by the Instagram account Sgfollowsall on Friday (Jan 30), a young man films himself vaping in bus 974. He discreetly approaches the bus captain, who was unaware of the man blowing out smoke in his direction.The 10-second clip has reached 198,000 views and...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/IMG_7498.jpeg?itok=ptXCrQHC",
    "source": "AsiaOne"
  },
  {
    "title": "New economic model to lift Nigeria’s GDP in 2026 - IMPI",
    "desc": "“This is the highest GDP growth projection by the IMF over the last 17 years and a real expression of confidence in the Nigerian economy...",
    "image": "https://cdn.businessday.ng/2023/02/Monetary-Policy-Rate-GDP.jpg",
    "source": "Businessday NG"
  },
  {
    "title": "Queensland rebate scheme used to purchase hundreds of potentially illegal e",
    "desc": "Hundreds of illegal, or potentially illegal e-bikes and e-scooters, were purchased under a state government rebate scheme, according to an internal audit that dates back to before the 2024 Queensland election.",
    "image": "https://live-production.wcms.abc-cdn.net.au/1e3ea8a0d33ff8b1d983406f857b380c?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Standard Chartered Arranges €641.1 Million In Financing For Uganda Power Grid, Roads, And Water Projects",
    "desc": "Standard Chartered has arranged €641.1 million in financing for the Government of Uganda to support three major infrastructure projects across power transmission, road upgrades, and water supply and sanitation, according to an announcement in Kampala. The signing took place at the Ministry of Finance, Planning and Economic Development (Uganda).",
    "image": "https://cdn.pulse2.com/cdn/2026/02/Standard-Chartered-Logo.jpeg",
    "source": "Pulse 2.0"
  }
]