[
  {
    "title": "Tackling the rise in early onset cancer: From research to health equity",
    "desc": "Join us as LeeAnn Bailey from the NCI discusses the Early Onset Cancer Initiative's three key focus areas.",
    "image": "https://www.oncology-central.com/wp-content/uploads/2026/01/Oncology-central-feature-image-17.png",
    "source": "Oncology Central"
  },
  {
    "title": "UN pushes for decolonisation of Western Sahara & 16 others",
    "desc": "UN Secretary-General António Guterres calls for completing the decolonisation of Western Sahara and 16 other territories still under colonial rule.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2025/08/21071855/Screenshot-2025-08-21-071820.png",
    "source": "Punch Newspapers"
  },
  {
    "title": "Mardaani 3 Box Office Collection Day 18: Drops Below 1 Crore But Recovers 77% Budget, Can Rani Mukerji Still Gain Success?",
    "desc": "Rani Mukerji starrer Mardaani 3 is heading towards the 50 crore mark at the Indian box office. Check out day 18 collection!",
    "image": "https://www.koimoi.com/wp-content/new-galleries/2026/02/mardaani-3-box-office-collection-day-18-01.jpg",
    "source": "Koimoi"
  },
  {
    "title": "‘Imran Khan deserves to be treated with dignity' say former cricket captains on ex-Pakistan PM's jail treatment",
    "desc": "Cricket legends unite, urging humane treatment and medical care for Imran Khan amidst concerns over his prison conditions.",
    "image": "https://th-i.thgim.com/public/incoming/on3ak3/article70642042.ece/alternates/LANDSCAPE_1200/Pakistan_Imran_Khan_25231.jpg",
    "source": "The Hindu"
  },
  {
    "title": "'They Want a Deal': Trump Says He Will Be Indirectly Involved in Iran Talks",
    "desc": "Palestinian Reports: Settlers Set Fire to Barn South of Hebron, Dozens of Sheep Burned to Death. Eight Countries Central to Trump Cease-fire Deal Condemn Israeli Gov't Decision to Register West Bank Land as State-owned. Court Accepts Police's Appeal to Remove Netanyahu's Chief of Staff From Prime Minister's Office for a Week",
    "image": "https://img.haarets.co.il/bs/0000019c-696d-de36-a19f-efef1b510000/90/a0/0309578e4ec9ac722fb4783a3011/final-desktop.png?precrop=1000,581,x0,y0&width=1200&height=630&cmsprod",
    "source": "Haaretz"
  },
  {
    "title": "Igor Tudor takes Tottenham training and immediately sets sights on Arsenal",
    "desc": "Spurs players left in no doubt that Tudor is coach who demands ‘intensity’",
    "image": "https://static.standard.co.uk/2026/02/17/7/15/igot-tudor.jpeg?width=1200&auto=webp&quality=75",
    "source": "London Evening Standard"
  },
  {
    "title": "🥐 LaLiga shaken up, Champions League night... 5️⃣ stories to start your day",
    "desc": "Spanish football wakes up to a complete shake-up in the standings after a night of high tension at Montilivi.FC Barcelona has surrendered the top spot to Real Madrid in a match marked by their own mis...",
    "image": "https://s.yimg.com/ny/api/res/1.2/lsujbLrMsXjND.STHnet6w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/onefootball_articles_802/890b0ba7a9f9b6d51cb0bac28fc5f488",
    "source": "Yahoo Sports"
  },
  {
    "title": "'The cheater has finally been exposed': Sannia Ashfaq fires back at Imad Wasim",
    "desc": "Cricketer announces marriage to Nyla Raja, says he remains committed to his children",
    "image": "https://i.tribune.com.pk/media/images/combined-image-of-sannia-ashfaq-and-ex-husband-ima1771310685-0/combined-image-of-sannia-ashfaq-and-ex-husband-ima1771310685-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "'It’s good to get to know your HIV status' - GHANET advocates",
    "desc": "The Ghana HIV/AIDS Network (GHANET) has urged Ghanaians to prioritise knowing their HIV status, stressing that regular testing and correct condom use remain critical tools in preventing new infections, especially among young people.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/110/11054028.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "GCAA win opening game of University of Ghana Corporate Football League",
    "desc": "Ghana Civil Aviation Authority (GCAA), winners of the 2026 University of Ghana Corporate Football League, opened their campaign in commanding fashion with a confident 2-0 victory over Lancaster Accra on February 13, 2026, at the University of Ghana...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/541/54126860.jpg",
    "source": "GhanaWeb"
  }
]