[
  {
    "title": "Kenya Hosts First African Edition of UN Global Tourism Resilience Conference in Nairobi: What New Updates You Need to Know",
    "desc": "Kenya will host the first African edition of the UN Global Tourism Resilience Conference in Nairobi, focusing on crisis-proof tourism systems.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/Tourism-conference-2.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "Sex offenders should tell police about pregnancies, review finds",
    "desc": "The finding comes after a review into the death by negligence of Constance Marten and Mark Gordon's baby daughter.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/49ec/live/457b7d70-07fc-11f1-b7e1-afb6d0884c18.png",
    "source": "BBC"
  },
  {
    "title": "Liam Voice reveals reasons for choosing to remain single",
    "desc": "Singer Liam Voice reveals why he's still single, focusing on self-growth and sobriety. Despite fears, he's open to love when the time is right.",
    "image": "https://mbu.ug/wp-content/uploads/2026/02/IMG_6290-edited.jpeg",
    "source": "mbu.ug"
  },
  {
    "title": "Arrest warrant out for ex-KOJC witness who accused Hontiveros of bribery",
    "desc": "A Pasay court has issued an arrest warrant against Michael Maurillo, the former member of the Kingdom of Jesus Christ (KOJC) who recanted his statements against the church and accused Sen. Risa Hontiveros of bribing him.",
    "image": "https://media.philstar.com/photos/2026/02/12/risa-hontiveros_2026-02-12_17-50-04.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Boy, 13, stabbed pupil in neck, court hears",
    "desc": "The two victims are said to be in a stable condition in hospital following the attack on Tuesday.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c25a/live/f67a3ee0-072f-11f1-811d-d70cdc846ab3.jpg",
    "source": "BBC"
  },
  {
    "title": "'We Have to Stay Out of Politics'",
    "desc": "The Berlin Film Festival got off to a political start on Thursday as the competition jury, led by Wim Wenders, fielded several questions about Gaza.",
    "image": "https://variety.com/wp-content/uploads/2026/02/wim-wenders.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Finally Knocks Down Hrithik Roshan's War, Now Shah Rukh Khan's Dunki Under Target!",
    "desc": "Sunny Deol starrer Border 2 has slowed down at the overseas box office. Check out total worldwide collection after 20 days!",
    "image": "https://www.koimoi.com/wp-content/new-galleries/2026/02/border-2-worldwide-box-office-day-20-finally-knocks-down-hrithik-roshans-war-now-shah-rukh-khans-dunki-under-target.jpg",
    "source": "Koimoi"
  },
  {
    "title": "Official: Alex Jimenez completes full AC Milan exit as Bournemouth confirm permanent deal",
    "desc": "Alex Jimenez's move to AFC Bournemouth from AC Milan has been turned from a loan into a permanent deal, both clubs have confirmed.",
    "image": "https://icdn.sempremilan.com/wp-content/uploads/2026/02/18750890-07ee-11f1-9e1d-837df67d-1.jpg",
    "source": "SempreMilan"
  },
  {
    "title": "Schroders agrees £9.9bn takeover by US investor, ending 200 years of family ownership",
    "desc": "British asset management group’s deal with Nuveen will create one of world’s biggest fund managers",
    "image": "https://i.guim.co.uk/img/media/a0808967c32270734e745e0b2d62743feb299116/129_59_2383_1907/master/2383.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6ac4d98768fe7c5d723fcc3373e5f010",
    "source": "The Guardian"
  },
  {
    "title": "UK economy grew by 0.1% in last three months of 2025 after 'subdued' year overall",
    "desc": "The UK economy grew by 1.3% overall last year, up from 1.1% in 2024, figures from the Office for National Statistics show.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4ba7/live/d894a040-07da-11f1-867a-6bd519fd83f8.jpg",
    "source": "BBC"
  }
]