[
  {
    "title": "Full Transcript: Omani Foreign Minister Badr Albusaidi tells \"Face the Nation\" a U.S.-Iran deal is \"within our reach\"",
    "desc": "He also said, \"I don't think any alternative to diplomacy is going to solve this problem.\"",
    "image": "https://assets3.cbsnewsstatic.com/hub/i/r/2026/02/27/a964a4d8-d354-4ad9-a2c8-ffc97a9d89f8/thumbnail/1200x630/cabf7c1d547fec1f70310eb526bd37be/screenshot-2026-02-27-at-4-23-53-pm.png",
    "source": "CBS News"
  },
  {
    "title": "Lionel Messi tackled to the ground by pitch invader during Inter Miami match",
    "desc": "Argentina captain Lionel Messi is hauled to the ground by a pitch invader during Inter Miami's friendly in Puerto Rico.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/04bc/live/ff08bb20-141f-11f1-963a-55716ece1b4d.jpg",
    "source": "BBC"
  },
  {
    "title": "Decades later, Faryal and Jamal reveal 1992 divorce truth",
    "desc": "Senior Pakistani actors Faryal Gohar and Jamal Shah have revealed the real reason behind their divorce after more than 30 years. They said personal freedom and unresolved differences led to their separation in 1992. The disclosure answers a long-standing question that affected fans who once viewed them as an ideal couple. The former couple shared these details during a private television Ramadan transmission.",
    "image": "https://dailytimes.com.pk/assets/uploads/2026/02/27/937768_38746918.jpg",
    "source": "Daily Times"
  },
  {
    "title": "Barcelona make Marcus Rashford decision! LaLiga club finally make call on signing Man Utd loanee",
    "desc": "Barcelona have finally made a decision on whether to sign Marcus Rashford once his loan spell comes to an end.",
    "image": "https://assets.goal.com/images/v3/getty-2259782055/crop/MM5DINRYGY5DENRTGY5G433XMU5DAORSGQ2A====/GettyImages-2259782055.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Henshaw returns but Byrne concern after Leinster loss",
    "desc": "Ireland players Harry Byrne and Gus McCarthy both suffered head injuries as Leinster's 11-match winning run came to an end with an 8-7 URC defeat at the Cardiff Arms Park.",
    "image": "https://www.rte.ie/images/0023f8a3-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Economic Community of West African States (ECOWAS) Establishes a Regional Monitoring and Evaluation Framework for Tax Transition",
    "desc": "The Regional Steering Committee for the Economic Community of West African States (ECOWAS) Tax Transition Programme was officially inaugurated from February",
    "image": "https://i2.wp.com/www.africa-newsroom.com/files/large/c3cd4154ac2aa18?ssl=1",
    "source": "Africa.com"
  },
  {
    "title": "'Six month phase out period': Trump orders halt to Anthropic tech across US govt",
    "desc": "US News: US President Donald Trump has ordered every federal agency to “immediately” stop using technology developed by AI firm Anthropic. In a scathing post o.",
    "image": "https://static.toiimg.com/thumb/msid-128865368,width-1280,height-720,imgsize-959175,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "MARIE-ALIX DE PUTTER JOINS PRAXIS, GLOBAL NETWORK FOR HIGH-IMPACT LEADERSHIP",
    "desc": "LOME, Togo, 27 February 2026 -/African Media Agency(AMA)/ – The Bluemind Foundation announces that its Founder and President, Marie Alix De Putter, has been",
    "image": "https://i3.wp.com/africanmediaagency.com/wp-content/uploads/2026/02/unnamed-2-2-1.png?ssl=1",
    "source": "Africa.com"
  },
  {
    "title": "Tony Hudgell wins his campaign for new UK child cruelty register",
    "desc": "Tony Hudgell, who lost both legs after his birth parents assaulted him, has fought to protect children.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7031/live/5532e710-1429-11f1-9055-ad3dbc5bd2b5.jpg",
    "source": "BBC"
  },
  {
    "title": "Sonia Gray returns to uncover the truth about ADHD stimulant treatment",
    "desc": "The use of ADHD stimulant medication has surged in New Zealand. With it comes a new wave of questions about the safety, side effects and benefits of this...",
    "image": "https://www.nzherald.co.nz/resizer/v2/4JLX7FPFMVEMBK6NLIPXXDVOWE.jpg?auth=3732593f088c16b87e59005e120d253f41480a48726be1e974bea1f58477eabc&width=1200&height=675&quality=70&focal=801%2C887&smart=false",
    "source": "NZ Herald"
  }
]