[
  {
    "title": "'She has been a warrior through the pregnancy,' says Vicky Kaushal as he showers love on Katrina Kaif, talks about son Vihaan",
    "desc": "Vicky Kaushal and Katrina Kaif became parents to a baby boy in November 2025. Two months after his birth, in a joint post, Katrina and Vicky wrote, \\\"O.",
    "image": "https://static.toiimg.com/thumb/msid-128725836,width-1280,height-720,imgsize-36140,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Trump-Appointed Judge Bars Release of Jack Smith’s Report in Documents Case",
    "desc": "Judge Aileen Cannon, a Trump-appointed federal judge in Florida, slammed the former special counsel, Jack Smith, for drafting the report even after she had dismissed the case.",
    "image": "https://static01.nyt.com/images/2026/02/23/multimedia/23dc-cannon-czjh/23dc-cannon-czjh-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "State Department orders nonessential US diplomats to leave Lebanon",
    "desc": "The United States has ordered nonessential diplomats to leave Lebanon as tensions over Iran rise with the threat of a potentially imminent military strike.",
    "image": "https://dims.apnews.com/dims4/default/c577d4f/2147483647/strip/true/crop/8256x5501+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fdb%2F36%2F6ea1d606225c7c120eb9d9d6d51e%2F690294637dec4513ac778451ac374e89",
    "source": "AP News"
  },
  {
    "title": "Moving Beyond Dopamine to Treat Schizophrenia",
    "desc": "Researchers review the future of schizophrenia treatment, highlighting TAAR1 agonists, NMDA enhancers, and the gut-brain axis as key new frontiers.",
    "image": "https://neurosciencenews.com/files/2026/02/antipsychotics-schizophrenia-neuroscience.jpg",
    "source": "Neuroscience News"
  },
  {
    "title": "Political showdown marks United Opposition rallies in Gusii",
    "desc": "A political showdown marked the return of Jubilee Deputy Party Leader Fred Matiang'i to his Gusii home on Monday as rival camps emerged, leading to chaotic incidents.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/D5UvA9hk6EoDlNn0TUNDN4YxAKXk5OGIBTLW61JH.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "Charley Crockett Cancels Canadian Tour After Being Denied Entry",
    "desc": "Charley Crockett has canceled his Canadian tour after being denied entry into the country due to a 10-year-old conviction.",
    "image": "https://www.billboard.com/wp-content/uploads/2026/02/P115TZLS-e1771867202590.jpg?w=1024",
    "source": "Billboard"
  },
  {
    "title": "OpenAI calls in the consultants for its enterprise push",
    "desc": "OpenAI is partnering with four consulting giants in an effort to see more adoption of its OpenAI Frontier AI agent platform.",
    "image": "https://techcrunch.com/wp-content/uploads/2025/04/GettyImages-2206295463.jpg?resize=1200,800",
    "source": "TechCrunch"
  },
  {
    "title": "Govt bigwigs to swallow public health pill first",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% Senior government officials will transition to public healthcare facilities on 1 April, following a presidential directive aimed at reforming Namibia’s healthcare system.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/Hospital-Front.jpg",
    "source": "The Namibian -"
  },
  {
    "title": "FDA proposes new system for approving customized drugs and therapies for rare diseases",
    "desc": "Federal health officials on Monday laid out a proposal to spur development of customized treatments for patients with hard-to-treat diseases, including for rare genetic conditions that the pharmaceutical industry has long considered unprofitable.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2237911139.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Uganda: Holy Mass for Dr Besigye Hits a Snag",
    "desc": "A planned Holy Mass for veteran opposition politician Dr Kizza Besigye and other political prisoners was abruptly postponed on Monday, moments after family members, friends, and political leaders had gathered for the prayers.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  }
]