[
  {
    "title": "Stock Market Today: Nifty, Sensex Log Third Session Of Gains Tracking Asian Cues; L&T Leads",
    "desc": "ITC, IEX, Paytm, Cochin Shipyard, Swiggy among important shares to watch today.",
    "image": "https://c.ndtvimg.com/2026-01/pjcldvg4_stock-market-hero_625x300_29_January_26.jpg?im=FeatureCrop,algorithm=dnn,width=1080,height=607",
    "source": "NDTV Profit"
  },
  {
    "title": "Strengthening India’s Influenza Response: Insights from Influenza Chintan Shivir 2025",
    "desc": "India convened the Influenza Chintan Shivir from 22–23 December 2025, a two-day hybrid meeting that brought together key national ministries, scientific institutions, and partners to strengthen interministerial and intersectoral coordination for influenza preparedness, surveillance, and response. The workshop emphasized influenza as a persistent public health threat and a crucial entry point for reinforcing national and",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Study raises red flags over long-term effectiveness of popular weight loss drugs like Ozempic",
    "desc": "Ozempic, Mounjaro, and Zepbound can drive impressive weight loss, but stopping them is often followed by rapid weight regain. Researchers found that people regain weight faster after quitting these drugs than after diet and exercise alone. Improvements in heart health and diabetes risk also tend to reverse within a few years. The results suggest long-term success may require more than medication alone.",
    "image": "https://www.sciencedaily.com/images/1920/ozempic-semaglutide-injection-pen-and-box.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Digital Science and Silverchair partner to bring researcher screening into workflows",
    "desc": "Supporting the integrity of the scholarly record is vital for upholding trust and transparency in research, say partners",
    "image": "https://www.researchinformation.info/wp-content/uploads/2025/05/Clarivate.jpeg",
    "source": "Research Information"
  },
  {
    "title": "New Tool Aids Dementia Risk Prediction Post-Stroke",
    "desc": "Research Highlights:A new risk prediction tool was able to accurately identify stroke survivors with the highest risk for developing dementia within a",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1584515933487-779824d29309%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1170%26amp%3Bq%3D80",
    "source": "Mirage News"
  },
  {
    "title": "old arrested by ICE 'depressed and sad' in detention facility",
    "desc": "US News: A US Democratic Congressman, Joaquin Castro, shared about his meeting with Liam Conejo Ramos, the five-year-old detained by federal immigration author.",
    "image": "https://static.toiimg.com/thumb/msid-127771175,width-1280,height-720,imgsize-1086355,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Hollywood hit by fresh whitewashing scandal: Marty Supreme star Odessa A'zion reveals she's dropped out of Deep Cuts adaptation after facing backlash for being cast as a character with Mexican heritag",
    "desc": "The actress, 25, was set to star in an adaptation of Holly Brickley's novel Deep Cuts, but on Thursday she revealed on Instagram she would no longer be moving forward with the film.",
    "image": "https://i.dailymail.co.uk/1s/2026/01/29/09/105924071-0-image-m-32_1769677534349.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Keeping tonnes of gold while inflation hits 54% is illogical - Financial analyst",
    "desc": "Finance and Energy Policy Analyst, Richmond Eduku, has defended the Bank of Ghana’s (BoG) decision to reduce the proportion of gold in the country’s international reserves, describing it as a strategic move aimed at stabilising the economy and...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/940/94043685.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Older adults’ driving habits offer window into brain health, cognitive decline",
    "desc": "American Stroke Association International Stroke Conference 2026, Abstract A111 - A study of over 200 adults followed for five years found that greater white matter damage in the brain was linked to decreased driving, fewer trips, repetitive routes and having more driving errors, especially in those who later developed dementia.",
    "image": "https://iprsoftwaremedia.com/67/files/20145/53ac371ec80467744e0037cf_Traffic/Traffic_hero.jpg",
    "source": "www.heart.org"
  },
  {
    "title": "Women with stroke history twice as likely to have another during or soon after pregnancy",
    "desc": "American Stroke Association International Stroke Conference 2026, Abstract DP006 - Female stroke survivors were more than twice as likely as their stroke-free counterparts to have another stroke while pregnant and in the six weeks after childbirth, according to an analysis of a large national database of electronic health records.",
    "image": "https://iprsoftwaremedia.com/67/files/20258/68dae6543d6332e7cf0426cc_Mom%20with%20baby%20bump/Mom%20with%20baby%20bump_hero.jpg",
    "source": "www.heart.org"
  }
]