[
  {
    "title": "New Nothing Phone 4a color leak raises more questions than answers",
    "desc": "The Nothing Phone 4a series is expected to launch in the coming weeks, and a new leak has revealed storage and color options.",
    "image": "https://www.androidauthority.com/wp-content/uploads/2025/04/Nothing-Phone-3a-cameras-close-up-in-front-of-3a-Pro.jpg",
    "source": "Android Authority"
  },
  {
    "title": "TCS shares crash 44% from peak to hit over 5-year low. More pain left for IT bellwether?",
    "desc": "Tata Consultancy Services (TCS) shares plummeted to a five-and-a-half-year low amid fears of AI-led disruption, with its market capitalization also hitting a multi-year trough. The IT rout intensified following a plunge in Infosys and Wipro ADRs, as a new AI tool for legal tasks sparked concerns about industry-wide vulnerability.",
    "image": "https://img.etimg.com/thumb/msid-128293569,width-1200,height-630,imgsize-27068,overlay-etmarkets/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "My Weekend: 'Friday nights are for hurling coaching and training'",
    "desc": "Former Cork senior hurling manager John Meyler tells us how he spends his weekend.",
    "image": "https://www.echolive.ie/cms_media/module_img/9933/4966871_2_seoimageog_LC_20cork_2005.jpg",
    "source": "echo live"
  },
  {
    "title": "Vishal Bhardwaj's 'O Romeo': A Powerful Exploration of Love and Violence",
    "desc": "Vishal Bhardwaj reflects on his film 'O Romeo', exploring the themes of love and violence through his protagonist's journey. The star-studded cast includes Shahid Kapoor, Triptii Dimri, and Nana Patekar. Inspired by Hussain Zaidi's work, the film showcases the filmmaker's unique storytelling. Read more about this compelling cinematic experience.",
    "image": "https://static.toiimg.com/thumb/msid-128293598,width-1280,height-720,imgsize-1843105,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Teenager hit by a car at Narre Warren in Melbourne's south",
    "desc": "A 16-year-old has life-threatening injuries after he was hit on Pound Road about 4:30pm.",
    "image": "https://live-production.wcms.abc-cdn.net.au/d8ef07095d0cd96d85324f65cf61cc2b?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "NCAA: San Sebastian sweeps EAC for second win in women's volleyball; Generals outlast Stags in five-setter",
    "desc": "The San Sebastian College-Recoletos Lady Stags secured their second victory in the NCAA Season 101 women’s volleyball tournament after sweeping Emilio Aguinaldo College, 25-23, 28-26, 25-16, on Friday at the San Andres Sports Complex.",
    "image": "https://images.gmanews.tv/webpics/2026/02/IMG_9499_2026_02_13_15_07_41.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Illawarra cafes among new measles exposure sites in NSW",
    "desc": "NSW Health warns of measles exposure in Illawarra cafes and other locations. Monitor for symptoms. Vaccination details inside.",
    "image": "https://www.illawarramercury.com.au/images/transform/v1/crop/frm/230482368/44119ad3-5c7b-4e7b-b6f7-814b5d48ce15.jpg/r0_430_6064_3614_w1200_h630_fmax.jpg",
    "source": "Illawarra Mercury"
  },
  {
    "title": "Stanbic Announces Leadership Changes",
    "desc": "Stanbic Holdings Plc has announced a major leadership transition that will see its current chief executive step down at the end of February.",
    "image": "https://nairobileo.co.ke/storage/uploads/2026/02/IMG_20260213_100521-1770966427.jpg",
    "source": "Nairobi Leo"
  },
  {
    "title": "Karnivool Hits No. 1 on ARIA Chart With ‘Versus’",
    "desc": "Karnivool debuts at No. 1 the ARIA Chart with \"Versus,\" their fourth album and first in 13 years.",
    "image": "https://www.billboard.com/wp-content/uploads/2026/02/karnivool-2026-1800-cr-courtney-mcallister.jpg?w=1024",
    "source": "Billboard"
  },
  {
    "title": "A Case Study of Sekyere Kumawu Senior High Schools, Ghana",
    "desc": "The purpose of the study was to examine the instructional resources usage in general knowledge in art and how it affects students’ academic performance. This study employed a descriptive survey design complemented by a case study approach. The descriptive survey design was chosen because it allows for the collection of data from a relatively large sample, thereby providing a broad picture of the availability, adequacy, and utilization of instructional resources and their effect on students’ academic performance. Both qualitative and quantitative approaches were used to gain a comprehensive understanding of the issue. A total of 150 respondents were selected using purposive, convenient, and simple random sampling techniques to ensure representation from different school settings. The study revealed that the instructional resources were largely inadequate and that teachers were compelled to improvise, borrow, or even purchase materials themselves to support teaching and learning. The lack of adequate resources discouraged students, leading to some losing interest in Visual Arts and shifting to other courses. The study further revealed that sufficient instructional resources enhanced teaching effectiveness and improved students’ understanding of the GKA syllabus. It was therefore recommended that, as a matter of urgency, the government should ensure adequate provision of instructional resources in schools in Sekyere Kumawu District to enhance teaching and learning. Since students are shifting from Visual Arts to other courses due to insufficient resources, urgent measures should be taken to provide adequate instructional materials to rekindle students’ interest in the subject.",
    "image": "https://file.scirp.org/image/adr2015012714352592.jpg",
    "source": "SCIRP Open Access"
  }
]