[
  {
    "title": "Will Princess Beatrice, Eugenie stay in contact with Andrew? Source speaks out",
    "desc": "Princess Beatrice and Princess Eugenie may be sisters but their approaches to their father are vastly different, and this insight comes a day after he was held in police custody for over 11 hours.A...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-21/1393084_115550_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "10 arrested during blocked rally to sue govt, police",
    "desc": "Lawyer says a letter of demand will be served on the government and police soon with a 14-day deadline to reply.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/74ab7210-perhimpunan-sogo-fmt-070226.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "French soldiers are tackling explosive devises in North Kivu. Won’t leave DR Congo until the end of March 2026",
    "desc": "Four units of about 800 soldiers each, totaling to 32,000 personnel have so far been trained in combat tactics, to counter Improvised Explosive Devices (Counter-IED) measures",
    "image": "https://i0.wp.com/tanzaniatimes.net/wp-content/uploads/2026/02/french-troops-in-DR-Congo-tanzaniatimes.jpg?fit=1170%2C601&ssl=1",
    "source": "The Tanzania Times"
  },
  {
    "title": "Harry Brook hopes Pakistan players will not be overlooked for The Hundred",
    "desc": "England’s white-ball captain is set to play for the newly-renamed Sunrisers Leeds this summer.",
    "image": "https://s.yimg.com/ny/api/res/1.2/aNZUlzq44w9bwQQy0QNpUw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU7Y2Y9d2VicA--/https://media.zenfs.com/en/pa-sport.com/2e4648578b25193ea91134ea3bab88ae",
    "source": "Yahoo Sports UK"
  },
  {
    "title": "Tragedy as vehicle plunges into disused water",
    "desc": "TWO people lost their lives while one was trapped underwater after the vehicle, they were travelling in plunged into a disused water-logged mine shaft in Shurugwi, Midlands province. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the tragedy. “The ZRP confirms a fatal road traffic accident which occurred along Coronation Mine road, Shurugwi […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "Director of ‘The Voice of Hind Rajab’ rejects Berlin award over Gaza",
    "desc": "Oscar-nominated Tunisian director Kaouther Ben Hania declined a Berlin film award after an Israeli general was honoured at the same event.",
    "image": "https://cdn.siasat.com/wp-content/uploads/2026/02/kaouther-ben-hania.jpg",
    "source": "Siasat.com"
  },
  {
    "title": "Accused trailer: Konkona Sen Sharma sees marriage to Pratibha Ranta fall apart as she is labelled a sexual predator",
    "desc": "Accused trailer: Konkona Sen Sharma stars as a London-based gynecologist who faces serious allegations of sexual miscounduct at the workplace. | Bollywood",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/21/550x309/accused_konkona_sen_sharma_pratibha_ranta_1771653822066_1771653822381.png",
    "source": "Hindustan Times"
  },
  {
    "title": "Winter Olympics 2026: How to watch Day 16 live",
    "desc": "There is men’s ice hockey and women’s curling gold to be won on the final day of Milano Cortina 2026 before the Closing Ceremony takes place at Verona Olympic Arena.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/ruayi0rvv66jyy905uyr",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Seven Hills home of Lachie and Jules Neale sells for $3.2m at auction in Brisbane",
    "desc": "The extravagant home of Jules Neale and her estranged husband, two-time Brisbane Lions premiership player Lachie Neale, has sold for an eye-watering price at auction.",
    "image": "https://images.perthnow.com.au/publication/C-21710265/cc0d64c7980d52292e3865321f1a2ce179848727-16x9-x1y0w2446h1376.jpg?imwidth=1200",
    "source": "PerthNow"
  },
  {
    "title": "The Hundred: Harry Brook says Pakistan players' exclusion would be \"a shame\"",
    "desc": "England skipper Harry Brook says it would be \"a shame\" if Pakistan players were excluded from playing in The Hundred, and confirms he will not captain Sunrisers Leeds this year.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e70d/live/90e8d7a0-0eee-11f1-8f52-d7c04f26b55e.jpg",
    "source": "BBC"
  }
]