[
  {
    "title": "Iran and US views on sanctions relief differ, says Iranian official",
    "desc": "Iran and the United States have differing views over sanctions relief in talks to curb Tehran’s nuclear ambitions, a senior Iranian official told Reuters on Sunday, adding that new talks were planned in early March as fears of a military confrontation grow. Iran and the US renewed negotiations earlier this month to tackle their decades-long […]",
    "image": "https://dailytimes.com.pk/assets/uploads/2025/07/app-icon-192x192-1-192x180-1.png",
    "source": "Daily Times"
  },
  {
    "title": "Alleged car thieves charged as police bust high",
    "desc": "Four men have been charged and more than 20 vehicles recovered by police as part of an investigation into a series of high-end car thefts across Melbourne.",
    "image": "https://live-production.wcms.abc-cdn.net.au/0f6d4cd1fbda37ae4f6bec17cd12eb06?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Thailand is losing ground to Vietnam",
    "desc": "Vietnam's GDP is likely to catch up with Thailand's within two years unless the latter undertakes meaningful economic reforms, warn two academics.",
    "image": "https://static.bangkokpost.com/media/content/dcx/2026/02/23/5978950_700.jpg",
    "source": "Bangkok Post"
  },
  {
    "title": "Tame Impala’s Kevin Parker Slept Through His 2026 Grammy Win",
    "desc": "“I forgot they were even on,” he told Mac Demarco in a recent interview",
    "image": "https://media.pitchfork.com/photos/699b5c7266bebf358e2725d3/16:9/w_1280,c_limit/GettyImages-2187326801.jpg",
    "source": "Pitchfork"
  },
  {
    "title": "Somalia election talks teeter on collapse as rival camps harden positions",
    "desc": "MOGADISHU (Somaliguardian) - Talks between Somalia’s federal government and the Somali Future Council - a bloc that includes the presidents of Puntland and",
    "image": "https://www.somaliguardian.com/wp-content/uploads/2026/02/6.jpg",
    "source": "Somali Guardian"
  },
  {
    "title": "Organic molecules surprisingly found in a 500-million-year-old fossil",
    "desc": "Biological polymer chitin survives 500 million years in fossils, revealing carbon conservation and ancient chemistry.",
    "image": "https://cff2.earth.com/uploads/2026/02/20211135/500-million-year-fossil-chitin-polymer.jpg",
    "source": "Earth.com"
  },
  {
    "title": "Jessie Buckley wins Leading Actress BAFTA for Hamnet",
    "desc": "Jessie Buckley has won Leading Actress at the BAFTA Film Awards in London for her performance in Hamnet.",
    "image": "https://www.rte.ie/images/0023f04a-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Instant Tottenham vs Arsenal verdict after Randal Kolo Muani's foul on Gabriel",
    "desc": "Referee Peter Bankes decided to disallow Randal Kolo Muani's equalising goal for Tottenham Hotspur against Arsenal in the North London Derby because of a foul on Gabriel Magalhaes",
    "image": "https://i2-prod.mirror.co.uk/article36764334.ece/ALTERNATES/s1200/0_Randal-Kolo-Muani.jpg",
    "source": "The Mirror"
  },
  {
    "title": "Historic blizzard slams US northeast as NYC bans all travel",
    "desc": "The nor'easter storm already has left tens of thousands without power and led to thousands of cancelled flights.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/98aa/live/9e343710-1056-11f1-b156-e56668b8644e.jpg",
    "source": "BBC"
  },
  {
    "title": "Genesis Energy plans $400m equity raise after record first-half profit",
    "desc": "Genesis Energy said it planned to raise $400 million after reporting a record first-half profit. The power generator and retailer – 51% owned by the...",
    "image": "https://www.nzherald.co.nz/resizer/v2/IRAMOZYVOBCGNAYPW2EUTG7T4Y.JPG?auth=2fe49e4ea45dfcc726662718bfb7f7a8b3ca926894082897d69322e4f8655ca2&width=1200&height=675&quality=70&focal=2633%2C1414&smart=false",
    "source": "NZ Herald"
  }
]