[
  {
    "title": "Samsung Bets on Sound Quality With Latest Noise-Canceling Earbuds",
    "desc": "Samsung refreshed its Galaxy Buds series with two new models at its annual Unpacked event. Here's our hands-on first impression of the Buds 4 Pro.",
    "image": "https://www.rollingstone.com/wp-content/uploads/2026/02/samsung-earbuds.png?w=900&h=600&crop=1",
    "source": "Rolling Stone"
  },
  {
    "title": "Bolivian plane carrying banknotes crashes, leaving 15 people dead",
    "desc": "A Bolivian Air Force Hercules aircraft carrying new banknotes crashes into a busy avenue, leaving 15 people dead and at least 30 more injured.",
    "image": "https://live-production.wcms.abc-cdn.net.au/64921c64a847a945d1690dfad2c2bdd6?impolicy=wcms_watermark_news&cropH=2667&cropW=4742&xPos=0&yPos=417&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Colonizers Attempt to Steal Sheep, Escalate Attacks Near Hebron",
    "desc": "Illegal paramilitary Israeli colonizers continued their assaults on Friday evening against Palestinian residents east of the town of Ethna, west of Hebron i ...",
    "image": "https://imemc.org/wp-content/uploads/2026/02/colonizers_Soldiers-e1771612287965.jpg",
    "source": "- IMEMC News"
  },
  {
    "title": "Major update for Australian dollar coin revealed",
    "desc": "Australia will see a major change to its dollar coin this year, but only those with a keen eye will catch it.",
    "image": "https://content.api.news/v3/images/bin/7b9e7bef7946563ce784a2aa1873f023",
    "source": "News.com.au"
  },
  {
    "title": "'Shirtless' protest row: Youth Congress chief Uday Bhanu Chib granted bail",
    "desc": "India News: NEW DELHI: Indian Youth Congress president Uday Bhanu Chib was granted bail on Saturday after he was arrested in connection to shirtless protest at Bh.",
    "image": "https://static.toiimg.com/thumb/msid-128871328,width-1280,height-720,imgsize-1139506,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "YSES bets on the next generation to build sustainable communities",
    "desc": "The Young Software Engineers’ Society (YSES) of the University of the Philippines Los Baños is bringing together the next generation of Filipino coders,...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/28/82522.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "'They have no money, nothing': Trump raises possibility of 'friendly takeover' of Cuba",
    "desc": "US News: US President Donald Trump on Friday suggested the possibility of a “friendly takeover of Cuba,” though he did not explain what he meant by the term. H.",
    "image": "https://static.toiimg.com/thumb/msid-128871327,width-1280,height-720,imgsize-141280,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Tick-derived protein discovery can advance treatment for inflammatory diseases",
    "desc": "When the immune system detects a harmful or foreign agent it triggers an inflammatory response small proteins called chemokines direct immune cells to the site of the injury or infection, resulting in the invader being inactivated.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/174318220-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Sui Southern gets new chief executive",
    "desc": "KARACHI: The board of directors of Sui Sout­hern Gas Company has appointed Muhammad Amin Rajput as the utility’s...",
    "image": "https://www.dawn.com/_img/social-default.jpg",
    "source": "Dawn"
  },
  {
    "title": "Geopolitical risks cloud growth outlook",
    "desc": "Finance ministry cites uncertainty, commodity price volatility; projects inflation at 6-7pc in February.",
    "image": "https://i.dawn.com/large/2026/02/28092345d718eeb.webp",
    "source": "Dawn"
  }
]