[
  {
    "title": "Two-year-old opens car door, causes six-vehicle crash on Jalan Tun Razak",
    "desc": "KUALA LUMPUR, Feb 8 — A two-year-old child opened a car door, causing a road accident involving six vehicles on Jalan Tun Razak on Friday, according to preliminary police...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/08/324540.jpeg",
    "source": "Malay Mail"
  },
  {
    "title": "Roman Jews petitioned pope 250 years ago to 'stop humiliating kneeling ritual'",
    "desc": "A rare 18th-century letter from Rome’s Jewish community asks the pope to intervene against demand that rabbis kneel during an annual tax ceremony, a practice the writers say had no legal or historical basis",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/08/HJgVxB5SDZg/HJgVxB5SDZg_0_344_904_509_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Park Na Rae's \"Injection Auntie\" Targets An Individual After Police Questioning",
    "desc": "Park Na Rae’s “Injection Auntie,” A, has caught attention by targeting a specific individual following a police investigation. On the 7th, A posted on her Instagram, “I was questioned for…",
    "image": "https://image.koreaboo.com/2025/12/Park-Na-Rae-1.jpg",
    "source": "Koreaboo"
  },
  {
    "title": "Puzzle solutions for Sunday, Feb. 8, 2026",
    "desc": "Find answers to the latest online sudoku and crossword puzzles that were published in USA TODAY Network's local newspapers.",
    "image": "https://s.yimg.com/ny/api/res/1.2/TTPLNKdSwoFW4TUm8bQ0iw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/usa_today_news_641/332db63d06bfb18cbc483f6b7e9849c6",
    "source": "Yahoo Lifestyle Canada"
  },
  {
    "title": "996 Culture in Silicon Valley Is Burning Workers Out: AI Researchers",
    "desc": "Two AI researchers said the 996 work culture, which is gaining traction in Silicon Valley, can lead to burnout for tech workers.",
    "image": "https://i.insider.com/698621b7a645d1188188da3c?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "Gov’t launches nationwide training programme for coconut farmers",
    "desc": "The government has launched a nationwide training and capacity-building program for coconut farmers under the presidential initiative for coconut development. The first phase of the training session kicked off at the Prempeh Assembly Hall in Kumasi, with about 500 coconut farmers and agricultural officers from the Ashanti and Western North regions in attendance.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-07-at-17.45.26.jpeg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Addis Ababa Poised to Welcome AU Summit Delegates with Enhanced Hospitality",
    "desc": "Addis Ababa, February 8, 2026 (ENA)—Addis Ababa has finalized extensive preparations to host delegates attending the upcoming African Union (AU) Summit, as the city continues a sweeping urban transformation aimed at strengthening its role as Africa’s diplomatic capital.\nThe Ordinary Session of the Executive Council of the African Union will take place from 11 to 12 February 2026, followed by the Italy–Africa Summit on 13 February, and the AU Summit on 14 and 15 February 2026.\nThe city’s readiness comes amid wide-ranging development initiatives, including major corridor projects, riverside rehabilitation, upgraded road networks, and expanded hospitality and conference infrastructure.\nOver the past four years, key transport corridors across the capital have been developed or upgraded, easing traffic congestion and significantly improving urban mobility.\nIn parallel, riverside rehabilitation projects have transformed sections of riverbanks into vibrant green public spaces, incorporating pedestrian walkways and recreational areas.\nThese initiatives have enhanced environmental conditions while significantly improving Addis Ababa’s urban aesthetics.\nThe city’s hospitality sector has also experienced rapid growth in recent years, with the addition of new hotels and serviced apartments, increasing overall accommodation capacity.\nMeanwhile, the modernization and expansion of convention centers have further strengthened Addis Ababa’s ability to host large-scale continental and international events.\nThese developments form part of Ethiopia’s broader strategy to reposition Addis Ababa as a modern hub for diplomacy, business, and tourism, while preserving its historic role as the political capital of Africa.\nIn this regard, the Addis Ababa Hotel Owners Association has emphasized that hotels across the capital are fully prepared to ensure a comfortable and high-quality experience for summit participants.\nApproached by the Ethiopian News Agency, Aster Solomon, President of the Addis Ababa Hotel Owners Association, said hotels are ready to deliver services rooted in Ethiopia’s long-standing tradition of hospitality.\n“Several hotels in Addis Ababa are prepared to offer genuine hospitality services to participants of the upcoming AU sessions,” she said, noting that both established and newly opened hotels have completed their preparations.\nShe added that the expansion and modernization of convention centers have significantly enhanced the city’s capacity to host major international gatherings, a development reflected in the steady growth of Meetings, Incentives, Conferences, and Exhibitions (MICE) tourism.\n“The increasing number of international and continental events hosted in Addis Ababa demonstrates the city’s remarkable progress in MICE tourism,” Aster said.\nAs the headquarters of numerous international and continental institutions, Addis Ababa regularly hosts high-level conferences, diplomatic meetings, and multilateral summits, making it a preferred destination for business and diplomatic tourism.\nAccording to Aster, more than 50 international and continental events were held in the city within a six-month period last year alone.\nShe noted that hotels have not only finalized their preparations but are also eager to deliver services that meet international standards.\n“Addis Ababa has a long history of hosting AU summits. Building on this experience, hotels are offering tailored service packages for this year’s guests,” she said.\nAster also highlighted the city’s visible transformation through corridor development projects, riverside revitalization, and the creation of new recreational and tourist destinations.\n“Addis Ababa has been beautified more than ever before,” she said, adding that the improvements will allow delegates to enjoy their stay and encourage them to extend their visits beyond official meetings.\nTo this end, hotels are working closely with tour operators to offer curated tour packages showcasing the city’s cultural, historical, and contemporary attractions.\n“Visitors who were familiar with Addis Ababa in the past are genuinely surprised by the city’s dramatic transformation,” Aster said.\nShe further noted that this year’s AU Summit participants will be excited by Addis Ababa’s new face.\nAddis Ababa has consistently demonstrated its capacity to host high-profile regional and global gatherings, citing the Second Africa–Caribbean Community Summit held in September 2025 as a recent example, according to Aster.\nLooking ahead, Addis Ababa is also set to host the 32nd Conference of the Parties (COP32) of the United Nations Framework Convention on Climate Change in 2027, underscoring the city’s growing stature as a leading international conference destination.",
    "image": "https://www.ena.et/documents/42142/0/Website12.jpg/9f859132-52ed-3353-fd93-97b5605b47e5?version=1.0&t=1770544906988&download=true",
    "source": "ENA English"
  },
  {
    "title": "ASUS IoT launches PE1000U for industrial edge AI",
    "desc": "ASUS IoT has rolled out a compact, fanless industrial PC aimed squarely at edge AI workloads in robotics, machine vision, and autonomous mobile robots...",
    "image": "https://ee.cdnartwhere.eu/wp-content/uploads/2026/02/PE1000U_PR_Image_1800x1012-scaled.jpg",
    "source": "eeNews Europe"
  },
  {
    "title": "Novel NILDAs Are Effective Liver Biopsy Alternatives",
    "desc": "Novel non-invasive liver disease assessments (NILDAs) are effective alternatives to liver biopsy for the treatment of liver disease. Learn more.",
    "image": "https://www.emjreviews.com/wp-content/uploads/2026/02/10am-hep.jpg",
    "source": "European Medical Journal"
  },
  {
    "title": "Apple Tweaks Ecosystem Strategy Across Payments Car AI And Health",
    "desc": "Apple (NasdaqGS:AAPL) is shifting the Apple Card issuing partnership from Goldman Sachs to JPMorgan Chase, affecting more than 12 million existing cardholders. The company is opening CarPlay to third party AI chatbots, allowing outside developers to integrate conversational tools into the in car experience. Apple is scaling back its standalone AI powered health coach project, instead choosing to roll selected features into current health and fitness apps. For you as an investor, these moves...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/69084628647944e382f8e555f97913e8",
    "source": "Yahoo Finance"
  }
]