[
  {
    "title": "Age of Asset: The State of Jewelry in 2026",
    "desc": "Why gold prices, heritage, and experience are reshaping luxury’s most resilient category.",
    "image": "https://assets.vogue.com/photos/698cb3b679fdf8a77f2edb96/16:9/w_1280,c_limit/state-of-jewellery-vogue-business-social-newsletter.jpg",
    "source": "Vogue"
  },
  {
    "title": "Chua hits BOC for attending tobacco smuggling hearing unprepared",
    "desc": "Bureau of Customs (BOC) officials learned the hard way that it's the pet peeve of congressmen to appear unprepared in their panel investigations.Visibly irate...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/12/78732.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Ex-Chelsea midfielder Chukwuemeka set to dump Nigeria for Austria",
    "desc": "Former Chelsea midfielder, Carney Chukwuemeka is set to dump Nigeria for Austria. Chukwuemeka is eligible to play for the Super Eagles of Nigeria due to",
    "image": "https://dailypost.ng/wp-content/uploads/2025/01/cfc-carney-chukwuemeka.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Maxis reports 18% growth in 4Q net profit, sees slower earnings growth ahead",
    "desc": "Maxis Bhd (KL:MAXIS) posted an 18% growth in net profit in the final quarter of 2025 from a year earlier thanks to higher service revenue and cost control but flagged slower earnings growth in 2026.\nNet profit at the country’s second-largest mobile network operator for the three months ended Dec 31, 2025 (4QFY2025) was RM380 million, or 4.8 sen per share.",
    "image": "https://assets.theedgemarkets.com/Maxis_Maxis_1.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "Gibson Pickup Shop releases limited Aged Greenybucker set",
    "desc": "The Gibson Aged Greenybucker set recreates the iconic tone of Peter Green's famous \"Greeny\" Les Paul, with only 100 sets available.",
    "image": "https://mixdownmag.com.au/wp-content/uploads/2026/02/Screen-Shot-2026-02-12-at-4.23.19-pm-1-1024x703.png",
    "source": "Mixdown Magazine"
  },
  {
    "title": "Round Up: The Previews Are In For Pokémon Pokopia",
    "desc": "\"Pokopia was a huge surprise\" - This March, Pokémon is expanding beyond its usual battle roots with a brand-new game called Pokémon Pokopia that seems to i...",
    "image": "https://images.nintendolife.com/5880f3ba02a93/large.jpg",
    "source": "Nintendo Life"
  },
  {
    "title": "Rising phone thefts, scam rock Ikeja Computer Village",
    "desc": "Ikeja Computer Village, Nigeria’s largest technology and phone trading hub in Lagos State, has long been known as the heartbeat of the country’s gadget",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/Computer-Village.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Dawson's Creek stars lead tributes to James Van Der Beek",
    "desc": "Van Der Beek's co-star Busy Philipps urged people to support the actor's family through an online fundraiser.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/2e02/live/cf81cd00-07c8-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Dawson's Creek stars lead tributes to James Van Der Beek",
    "desc": "Van Der Beek's co-star Busy Philipps urged people to support the actor's family through an online fundraiser.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/2e02/live/cf81cd00-07c8-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "SailGP Auckland: Stewart Dodson on Swiss growth, engagement to Zoe Hobbs and 2026 outlook",
    "desc": "When Stewart Dodson returned to Auckland as part of the SailGP fleet in Auckland last year, he did so at the start of a new journey. After winning the SailGP...",
    "image": "https://www.nzherald.co.nz/resizer/v2/QCQQ7G4EWZHMRNVI4Y2TQXT2FI.jpg?auth=b0f6e5b3ad75275e94fffd980e35883c32d7d694904d9b08ab9f8df43b84d26d&width=1200&height=675&quality=70&focal=1287%2C499&smart=false",
    "source": "NZ Herald"
  }
]