[
  {
    "title": "Percutaneous endoscopic gastrostomy in atypical parkinsonian syndromes: survival and aspiration outcomes from a retrospective international cohort",
    "desc": "The New Zealand Medical Journal (NZMJ) is the principal scientific journal for the medical profession in New Zealand. The Journal has become a fundamental resource for providing research and written pieces from the health and medical industry.",
    "image": "https://nzmj.org.nz/assets/favicon/favicon-32x32.png",
    "source": "The New Zealand Medical Journal"
  },
  {
    "title": "Riluzole use and reasons for non-use in people with amyotrophic lateral sclerosis in Aotearoa New Zealand",
    "desc": "The New Zealand Medical Journal (NZMJ) is the principal scientific journal for the medical profession in New Zealand. The Journal has become a fundamental resource for providing research and written pieces from the health and medical industry.",
    "image": "https://nzmj.org.nz/assets/favicon/favicon-32x32.png",
    "source": "The New Zealand Medical Journal"
  },
  {
    "title": "Childhood blindness prevention in Aotearoa New Zealand",
    "desc": "The New Zealand Medical Journal (NZMJ) is the principal scientific journal for the medical profession in New Zealand. The Journal has become a fundamental resource for providing research and written pieces from the health and medical industry.",
    "image": "https://nzmj.org.nz/assets/favicon/favicon-32x32.png",
    "source": "The New Zealand Medical Journal"
  },
  {
    "title": "Sir Laurence Olivier among nine honoured with new London blue plaques",
    "desc": "The scheme is honouring figures including the late actor Sir Laurence Olivier.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9ad2/live/78db7b10-fc6d-11f0-9f00-a7fda7ef067e.jpg",
    "source": "BBC"
  },
  {
    "title": "KL water music festival professionally planned, says tourism group",
    "desc": "Malaysia Inbound Tourism Association says concerns of disruptions are misplaced as the organisers have experience in managing large-scale events.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/01/d13a347f-bukit-bintang-bernama-280126.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "First Time In 25 Years: Morning prayers at Joseph's Tomb",
    "desc": "Hundreds of Israelis recited the morning prayers in daylight at Joseph's Tomb in Shechem for the first time in a quarter of a century.",
    "image": "https://2.a7.org/files/pictures/000/1209100.jpg",
    "source": "Israel National News"
  },
  {
    "title": "The womb and the field: How colonialism turned African women into permanent infrastructure",
    "desc": "Colonialism did not merely exploit African women; it transformed them into permanent infrastructure for empire. African women’s bodies became sites upon which economic, social, and political systems were built, maintained, and stabilized. Their labor in fields, homes, and communities functioned as the invisible architecture supporting colonial expansion and capitalist accumulation. This article argues that African women were not only workers within colonial systems but structural components of those systems, forcibly positioned to absorb economic shock, reproduce labor, and sustain social order. “Women were forced to work in mostly of the farms in Europe, supporting men, being abused sexually, brutally killed and mistreated while being exhibited as sex tools in Europe”.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/01/Princess-Yanney_top.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "IN PHOTOS: ASEAN Tourism Forum launches in Lapu-Lapu City",
    "desc": "The ASEAN Tourism Forum is the bloc’s largest gathering of tourism officials and stakeholders, spanning a range of events — from the trade event ASEAN Travel Exchange to the ASEAN Tourism Conference",
    "image": "https://www.rappler.com/tachyon/2026/01/asean-tourism-forum-opening-group-photo-january-28-2026-002-scaled.jpg",
    "source": "Rappler"
  },
  {
    "title": "Seasonal dynamics and core stability of the bacterial microbiome of a Drosophila suzukii wild population",
    "desc": "Drosophila suzukii (spotted-wing drosophila, SWD) is an invasive pest with pronounced sexual dimorphism and seasonal polyphenism. While seasonal morphotypes are well documented, how these phenotypic traits shape the SWD microbiome remains poorly understood. Here, we investigate how sex and seasonal phenotypes shape microbiome composition in SWD. We hypothesize that these factors drive microbial shifts, with some taxa varying between phenotypes and others forming a stable core. Understanding these patterns may reveal microbiome-associated adaptations relevant to SWD ecology and management. To investigate this, we monitored SWD microbiome dynamics over one year by collecting individuals during spring, summer, and autumn of 2022 and winter of 2023 from an organic farm in northern Portugal. Bacterial communities were compared using 16 S rRNA amplicon sequencing. This SWD population retained a core bacterial community, highly represented by Gluconobacter, Pseudomonas, Commensalibacter and Pantoea, consistent with other SWD Portuguese populations. Moreover, microbiome composition varied significantly across seasons but not between sexes, although females exhibited higher microbial alpha diversity. Linear discriminant analysis of relative abundance (LEfSe) revealed enrichment of Morganella, Methanosaeta, Serratia, Duganella, Frateuria, Suttonella, and Janthinobacterium in winter groups. However, functional prediction analyses revealed no significant differences in microbiome functional potential across seasons, suggesting functional redundancy despite taxonomic variation. This study offers baseline insights into the seasonal stability and plasticity of the D. suzukii microbiome, contributing to a deeper ecological understanding of this invasive pest.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Elon Musk says Tesla ending Models S and X production as Tesla reports its first annual revenue decline on record",
    "desc": "Elon Musk announced the end of production for Tesla's Model S and Model X. He added that the company's Fremont factory will shift focus to manufacturing humanoid robots, with plans for mass production of Optimus.",
    "image": "https://www.livemint.com/lm-img/img/2026/01/29/1600x900/logo/Elon_Musk_Tesla_revenue_fall_Model_S_and_X_end_1769666032422_1769666032542.jpg",
    "source": "Mint"
  }
]