[
  {
    "title": "Report: Man City and Liverpool midfielders being targeted by La Liga giants",
    "desc": "Report: Man City and Liverpool midfielders being targeted by La Liga giants by Amelia Hartman on Feb 8, 2026 for EPLindex.com",
    "image": "https://eplindex.com/wp-content/uploads/imago1019063343-scaled.jpg",
    "source": "EPL Index"
  },
  {
    "title": "McFadden says PM made 'mistake' but acted in good faith on Mandelson appointment",
    "desc": "Also on the show are Plaid Cymru leader Rhun ap Iorwerth and shadow minister Alex Burghart.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f784/live/f1dd43e0-04ce-11f1-9514-95fd47e955e5.png",
    "source": "BBC"
  },
  {
    "title": "Red durian could become Malaysia’s next big agro",
    "desc": "A Malaysian lawmaker says Borneo’s rare Durian Merah, also known as red durian, could become a major agro-tourism attraction and commercial crop if it is properly developed. - VnExpress International",
    "image": "https://vcdn1-english.vnecdn.net/2026/02/08/steptodowncom621053-1770537718-3059-2193-1770538148.jpg?w=680&h=0&q=100&dpr=1&fit=crop&s=4UElg0yOKCNYeg9urpdhAw",
    "source": "VnExpress International"
  },
  {
    "title": "Ruben Amorim labelled 'very embarrassing' as ex-Man Utd boss continues to catch strays amid Kobbie Mainoo's resurgence under Michael Carrick",
    "desc": "Former Manchester United head coach Ruben Amorim has been told that Kobbie Mainoo's form is 'very embarrassing' for him after failing to get the best out of the England midfielder when he was in charge at Old Trafford. Mainoo made only a handful of appearances this season with Amorim in the dugout, but has started all four of United's wins under new boss Michael Carrick.",
    "image": "https://assets.goal.com/images/v3/bltf3b36c6b48aac06a/GOAL%20-%20Multiple%20Images%20-%202%20Split%20-%20Facebook%20-%202026-01-06T101656.735.png",
    "source": "Goal.com"
  },
  {
    "title": "Lammy reportedly warned Starmer over Mandelson; Union boss calls for PM to go - UK politics live",
    "desc": "Deputy PM reportedly warned Starmer not to appoint Mandelson as US ambassador because of his links to Jeffrey Epstein",
    "image": "https://i.guim.co.uk/img/media/7cd9376708b7f93c1a07e40f5899f06a263b3da4/412_0_4120_3296/master/4120.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=19968ded03b89fbe989806cc4d71ac41",
    "source": "The Guardian"
  },
  {
    "title": "Don’t risk your health on unapproved aphrodisiacs - FDA warns youth",
    "desc": "The Food and Drugs Authority (FDA) has issued a warning to consumers against the use of unapproved aphrodisiacs, citing serious health risks associated with many of these products.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/942/94259589.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Base MHIT plan covers controlled pre-existing conditions subject to terms, says Dr Dzul",
    "desc": "HULU LANGAT: Persons with pre-existing health conditions will be eligible for the affordable base medical and health insurance/takaful (MHIT) plan, but are subject to certain terms, says Health Minister Datuk Seri Dr Dzulkefly Ahmad.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/08/3760383.JPG",
    "source": "The Star"
  },
  {
    "title": "SpaceX resumes Starlink launches days after Falcon 9 anomaly",
    "desc": "SpaceX successfully resumed its Falcon 9 flights, launching another batch of Starlink satellites from California's Vandenberg Space Force Base on Saturday, February 7, 2026.",
    "image": "https://i.cdn.newsbytesapp.com/images/l65420260208141153.jpeg",
    "source": "NewsBytes"
  },
  {
    "title": "Zainab Raza's Bold Pictures Draw Criticism",
    "desc": "Zainab Raza is an actress, model and influencer. She has a knack for camera and she started her career with modelling. She has since become a part of",
    "image": "https://reviewit.pk/wp-content/uploads/2026/02/zainab-raza.jpg",
    "source": "Reviewit.pk"
  },
  {
    "title": "Phl, Australia enhance border security",
    "desc": "The Bureau of Customs (BOC) met with the Australian Border Force to bolster institutional cooperation in border management and customs enforcement. The engageme",
    "image": "https://media.assettype.com/tribune%2F2026-02-08%2F64uu69dw%2FBOC-AUSTRALIA.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Daily Tribune"
  }
]