[
  {
    "title": "'It's everyone's magic': Gregorio credits collective effort in PSC success",
    "desc": "In a room filled with sports officials, athletes, coaches, and partners, Philippine Sports Commission chairman Patrick “Pato” Gregorio stood not as a man...",
    "image": "https://mb.com.ph/manilabulletin/uploads/global_files/default_meta_image.png",
    "source": "Manila Bulletin"
  },
  {
    "title": "man kidnapped, tortured with heated iron rod in northern Is",
    "desc": "A 25-year-old suspect from Daburiyya was indicted after police said he tortured the victim for hours in a cabin near Afula before the latter managed to alert his wife, who called the police",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/17/SkxGtOWuWg/SkxGtOWuWg_0_159_496_280_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Concern for sports fans as SuperSport loses 'power'",
    "desc": "Cost-cutting measures are reportedly set to have a massive impact on SuperSport's product offering and broadcast rights.",
    "image": "https://www.thesouthafrican.com/wp-content/uploads/2026/02/SuperSport.jpeg.webp",
    "source": "The South African"
  },
  {
    "title": "Media regulator urges Saeima to terminate operations of Russian-language radio stations in Latvia",
    "desc": "The National Electronic Mass Media Council (NEPLP) is calling on members of parliament to adopt a decision to shut down all private radio stations broadcasting in Russian. — Ukrinform.",
    "image": "https://static.ukrinform.com/photos/2026_02/thumb_files/630_360_1771291762-968.jpg",
    "source": "Ukrinform"
  },
  {
    "title": "Police hunt man over alleged poisoning of son, 8, in Nakuru",
    "desc": "A second child aged two-and-a-half years was admitted to the hospital",
    "image": "https://cdn.radioafrica.digital/image/2026/02/f401521d-9b81-4345-992b-bef601c5e593.jpg?1771307906405",
    "source": "the-star.co.ke"
  },
  {
    "title": "Formula E announces TDK as Title Partner of the 2026 Tokyo E-Prix night race and Official Partner of the 2025/26 season",
    "desc": "Formula E and TDK today announced a major strategic partnership designating the company as the Title Partner of the 2026 TDK Tokyo E-Prix, set to take place as a night race event in the heart of Japan’s capital, and home of TDK, on 25 and 26 July 2026.",
    "image": "https://resources.formula-e.pulselive.com/photo-resources/2026/02/16/4778634e-d370-467b-9b24-7529f0b0065d/formula-e-tokyo-tdk-partnership.jpeg?width=1200&height=630",
    "source": "Formula E"
  },
  {
    "title": "'No Disability Pension For Brain Stroke Caused By Smoking' : Supreme Court Rejects Ex-Army Officer's Claim",
    "desc": "The Supreme Court has dismissed the disability compensation claim of a former Army personnel, holding that a disability attributed to his habit of smoking around ten beedis a day could not be linked...",
    "image": "https://www.livelaw.in/h-upload/2026/01/19/647820-justice-aravind-kumar-and-justice-prasanna-b-varale-sc.jpg",
    "source": "Live Law"
  },
  {
    "title": "CITIES WE DON'T RUN BECOME UNLIVEABLE",
    "desc": "Khaleej Towers has been censured for violating planning and building laws and infringing their neighbours’ rights to privacy,",
    "image": "https://www.amnestykenya.org/wp-content/uploads/2026/02/pexels-mwauraken-29069344-1024x683.jpg",
    "source": "Amnesty Kenya"
  },
  {
    "title": "Malaysia and Japan plan major cross-border carbon capture project, despite climate benefit doubts",
    "desc": "Japan wants to ship carbon emissions to Malaysia in a first-of-its-kind project in Southeast Asia for carbon capture and storage",
    "image": "https://static.independent.co.uk/2026/02/17/05/Malaysia_Japan_Carbon_Capture_46832.jpg?width=1200&height=800&crop=1200:800",
    "source": "The Independent"
  },
  {
    "title": "Daily Post Nigeria",
    "desc": "Real Madrid winger, Vinicius has admitted that he really misses the club's legend, Luka Modric. The Brazilian insisted that the veteran midfielder doesn't",
    "image": "https://dailypost.ng/wp-content/uploads/2025/08/Vinicius-Jr.jpg",
    "source": "Daily Post Nigeria"
  }
]