[
  {
    "title": "Epidemiological Alert: Misuse of GLP-1 receptor agonist medications and considerations for the Americas Region - 27 February 2026",
    "desc": "In recent months, there has been an increase in the number of countries reporting adverse effects of varying severity associated with the misuse of glucagon-like peptide-1 (GLP-1) receptor agonists indicated for the treatment of obesity in adults.",
    "image": "https://www.paho.org/themes/paho/favicon.ico",
    "source": "Pan American Health Organization (PAHO)"
  },
  {
    "title": "Bolivian Military Plane Carrying Banknotes Crashes, 15 Dead",
    "desc": "A cargo plane carrying money crashed Friday near Bolivia's capital, damaging about a dozen vehicles on a highway, scattering bills on the ground and leaving at least 15 people dead and others injured, an official said.",
    "image": "https://c.ndtvimg.com/2026-02/gd9tnq9c_bolivia-plane-crash_625x300_28_February_26.jpeg",
    "source": "NDTV"
  },
  {
    "title": "Cargo plane carrying money crashes near Bolivia's capital, killing at least 15, official says",
    "desc": "A cargo plane carrying money crashed Friday near Bolivia’s capital, damaging about a dozen vehicles on a highway, scattering bills on the ground and leaving at least 15 people dead, an official said.",
    "image": "https://www.castanet.net/content/2026/2/33rkarhhirbizjemeom7pbiujq._p4266279.jpg",
    "source": "Castanet"
  },
  {
    "title": "NASA announces overhaul of Artemis lunar program amid technical delays",
    "desc": "NASA on Friday abruptly said it was shaking up its Artemis lunar program that has suffered multiple delays in recent years, a bid to ensure Americans can return to the moon's surface by 2028.",
    "image": "https://www.japantimes.co.jp/japantimes/uploads/images/2026/02/28/526181.JPG?v=3.1",
    "source": "The Japan Times"
  },
  {
    "title": "Horoscope Today: Daily astrological predictions for February 28, 2026",
    "desc": "Horoscope Today News: Horoscope Today: Read daily horoscope predictions for February 28, 2026. Know all about the astrological events and influences that will be affecting .",
    "image": "https://static.toiimg.com/thumb/msid-128774558,width-1280,height-720,imgsize-159050,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Red alert issued for Vanuatu province as Cyclone Urmil passes nearby",
    "desc": "Tropical Cyclone Urmil formed southwest of Port Vila on Friday and was currently a Category 2 according to the Fiji Meteorological Service.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/tropical-cyclone-urmil-formed-southwest-of-port-vila-on-frid-LNUR5FPOGNBEJOOT77J2NW33II.jpg?auth=d242d312f326b86001b85bffb6a58d862dc067a0836bcde49ebcc104d176deb3&quality=70&width=600&height=315&focal=395%2C243",
    "source": "1News"
  },
  {
    "title": "Islamic interbank activity hits Rs151b in Feb",
    "desc": "Rupee inches up to 279.47 against dollar as gold holds at Rs540,562/tola",
    "image": "https://i.tribune.com.pk/media/images/829887-islamicbank-1422567291/829887-islamicbank-1422567291-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Australian documentary Floodland uncovers human toll of 2022 Lismore floods",
    "desc": "Four years after floodwaters peaked at 14.4 metres in Lismore, a new documentary looks at how the town moved forward — and what more needs to be done.",
    "image": "https://live-production.wcms.abc-cdn.net.au/973514093b395e5848c7947c0d96864d?impolicy=wcms_watermark_news&cropH=2160&cropW=3840&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Transforming farmers with practical goat farming",
    "desc": "Muhumuza challenged farmers to rethink what defines a good goat.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/b72c1a70-1a28-48c0-99c3-3dd710854d69.jpg",
    "source": "NewVision.co.ug"
  },
  {
    "title": "Esther McCarthy: What I learned at a midlife breakfast",
    "desc": "The event is called The Midlife Breakfast, organised by The Pink Ladies, to support breast cancer services at CUH so she’s preaching to the choir",
    "image": "https://www.irishexaminer.com/cms_media/module_img/9968/4984457_4_seoimageog_iStock-1387342690.jpg",
    "source": "Irish Examiner"
  }
]