[
  {
    "title": "95-year-old woman tied up during 'vile' attempted robbery by man who offered to clean windows",
    "desc": "Greater Manchester Police have appealed for any CCTV, dashcam or doorbell footage from the area at the time.",
    "image": "https://e3.365dm.com/26/01/1600x900/skynews-greater-manchester_7147940.jpg?20260127231824",
    "source": "Sky News"
  },
  {
    "title": "Jetour Nigeria partners with seven major automobile dealers",
    "desc": "Jetour Nigeria expands its national presence by partnering with seven top auto dealers, aiming to reshape the country's competitive automotive market.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2025/01/08010216/Jetour-Automobile-1200x630.png",
    "source": "Punch Newspapers"
  },
  {
    "title": "Judge Temporarily Blocks Deportation of 5-Year-Old Detained by ICE in Minnesota",
    "desc": "An image of the boy, wearing a Spider-Man backpack as he was detained by federal agents, became a symbol of the immigration crackdown in Minnesota.",
    "image": "https://static01.nyt.com/images/2026/01/27/multimedia/27minneapolis-ice-liam1/27minneapolis-ice-Liam-jvht-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Heated Rivalry Cast Connor Storrie, François Arnaud",
    "desc": "Connor Storrie and François Arnaud attend Saint Laurent Paris show during Fashion Week. See the “Heated Rivalry” stars in the front row.",
    "image": "https://wwd.com/wp-content/uploads/2026/01/saint-laurent-fall-men-26-fr-sf-009.jpg?crop=0px%2C42px%2C1365px%2C763px&resize=1000%2C563",
    "source": "WWD"
  },
  {
    "title": "Rubbish mountain cleared at KL transfer station",
    "desc": "THE mounting waste problem at Kuala Lumpur's main transfer station has been brought under control, says Datuk Fadlun Mak Ujud.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/28/3741967.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "China’s Xigou Site Yields Evidence of Advanced Stone Tool Technology",
    "desc": "Archaeologists have uncovered evidence of technological innovations at the site of Xigou in China’s Henan province, dating to between 160,000 and 72,000 years ago.",
    "image": "https://cdn.sci.news/images/2026/01/image_14514-Xigou-Tool-Hafting.jpg",
    "source": "Sci.News"
  },
  {
    "title": "Brooks Koepka reveals Tiger Woods' role in PGA Tour return",
    "desc": "Brooks Koepka was freed from the final year of his contract with Saudi-funded LIV Golf and the first person he called was Tiger Woods. Three weeks later, the PGA Tour created a path back for him that starts at Torrey Pines.",
    "image": "https://nypost.com/wp-content/uploads/sites/2/2026/01/newspress-collage-icpb1q80l-1769551222645.jpg?quality=75&strip=all&1769533273&w=1200",
    "source": "nypost.com"
  },
  {
    "title": "Egypt eliminates Nigeria from Africa Handball Championship",
    "desc": "Egypt crushed Nigeria 48-22 in the Africa Handball Championship, eliminating them from semi-final contention and hopes of direct World Championship qualifi",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/01/28000611/handball-players-1200x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "UK-based Nigerian jailed six years for sexual assault",
    "desc": "A UK-based Nigerian, Daniel Odubanjo, has been jailed for six years for false imprisonment and sexually assaulting a woman on a train. Read the full detail",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/01/27214153/Odubanjo-1200x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Southwest Begins Assigned Seating, Scrapping a Signature Quirk",
    "desc": "The airline said its new policy, rolled out on Tuesday, responded to passengers’ preferences, but some customers said the scramble was part of the charm.",
    "image": "https://static01.nyt.com/images/2026/01/27/multimedia/27trav-southwest-03-lqfp/27trav-southwest-03-lqfp-facebookJumbo.jpg",
    "source": "The New York Times"
  }
]