[
  {
    "title": "Vogue Williams named St Patrick's Day Grand Marshal",
    "desc": "Vogue Williams has been announced as the Grand Marshal for this year's National Saint Patrick's Day Parade.",
    "image": "https://www.rte.ie/images/0023e6d2-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Namibia: A Great Day for Namibian Sport",
    "desc": "In a great day for Namibian sport, Nathan Chase and Maja Brinkmann made history as both won gold medals at the Africa Junior Triathlon Championships in Cairo, Egypt, on Friday.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": ".hack//Z.E.R.O. announced",
    "desc": "CyberConnect2 has announced .hack//Z.E.R.O., a new action RPG in the .hack series “for home consoles” 10 years in the making—self-planned, developed…",
    "image": "https://www.gematsu.com/wp-content/uploads/2026/02/dot-hack-ZERO-Ann_02-16-26_Top.jpg",
    "source": "Gematsu"
  },
  {
    "title": "Why Maya Moore's net worth doesn't reflect her Hall of Fame legacy",
    "desc": "How much is Maya Moore’s net worth? Explore why it doesn't reflect her Hall of Fame legacy and impact on and off the court, including her career choices.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/3273abf013cf2e72.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "Antonio Marras, Intimissimi Owner Reports 4.8% Growth in 2025 Revenue",
    "desc": "Italian group Oniverse, the owner of Antonio Marras, Intimissimi and Calzedonia, reached revenues of 3.7 billion euros in 2025.",
    "image": "https://wwd.com/wp-content/uploads/2025/09/antonio-marras-ss-26-rtw-lfw-r-ctsy-058.jpg?crop=0px%2C134px%2C1365px%2C763px&resize=1000%2C563",
    "source": "WWD"
  },
  {
    "title": "KEVIN MYERS: RTE's miraculous inversion of the news",
    "desc": "The station has always been roughly a half-generation off the zeitgeist",
    "image": "https://gript.ie/wp-content/uploads/2024/09/RTE-MIC-MEDIA_2-e1771240349276.jpg",
    "source": "Gript"
  },
  {
    "title": "Mainstreaming antimicrobial resistance into primary health care: international workshop report",
    "desc": "The Asia-Europe Foundation (ASEF) and the World Health Organization (WHO) organized an international workshop from 18 to 20 March 2025 in Bangkok, Thailand, in close collaboration with the Government of Thailand on mainstreaming antimicrobial resistance (AMR) into primary health care (PHC), to discuss the growing challenge of AMR and targeting core AMR interventions to strengthen PHC-oriented health systems. Funding for the workshop was kindly provided by the Government of Japan through ASEF.",
    "image": "https://cdn.who.int/media/images/default-source/cover-images/publications/amrphc_meetingreport.tmb-1200v.jpg?sfvrsn=3f354b67_1",
    "source": "World Health Organization (WHO)"
  },
  {
    "title": "Search under way in Wicklow in cases of two missing women",
    "desc": "A search is under way in Co Wicklow as part of the investigation into the disappearance and murders of Deirdre Jacob and Jo Jo Dullard in the 1990s.",
    "image": "https://www.rte.ie/images/0023e6d7-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "India's trade deficit widens to $34.7 billion in January",
    "desc": "Goods imports rose due to gold and silver shipments",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260216111355_goods.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "Murena Teams Up With German Manufacturer to Offer a €698 de-Googled Android Tablet",
    "desc": "Featuring 12GB of RAM and a 10,000 mAh battery, this collaboration with Volla brings some decent specs to the privacy-first mobile market.",
    "image": "https://itsfoss.com/content/images/2026/02/murena-volla-tablet-banner.png",
    "source": "It's FOSS"
  }
]