[
  {
    "title": "Teenager contracts rare ‘welder’s anthrax,’ marking the ninth known case ever reported",
    "desc": "Live Science A teenager training to be a welder contracted a rare and dangerous lung infection, prompting a combined state and federal investigation. The patient: An 18-year-old in Louisiana T…",
    "image": "https://s0.wp.com/i/blank.jpg",
    "source": "University of Nebraska Medical Center"
  },
  {
    "title": "Winter Olympics 2026: Andrea Voetter and Marion Oberhofer win first-ever women’s luge doubles crown",
    "desc": "Andrea Voetter and Marion Oberhofer triumphed on home ice to claim the historic first-ever women’s doubles luge gold medal at the Winter Olympic Games in Milano Cortina 2026 on Wednesday, 11 February.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/j46gu6ultojepsf2j0qg",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Top US medical body to review vaccine effectiveness as government ‘abdicates’ responsibility",
    "desc": "AMA to review safety of respiratory vaccines as health agencies end recommendations based on no new data",
    "image": "https://i.guim.co.uk/img/media/f06057158122f9dc52adce83851138dfdd14c90f/377_0_2501_2000/master/2501.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c4bf84c0ac70bb0808e508075b8d0293",
    "source": "The Guardian"
  },
  {
    "title": "Lindsey Vonn: American skier has third surgery after Winter Olympics crash",
    "desc": "Lindsey Vonn says she is \"making progress\" after having a successful third surgery on the broken leg she sustained in a crash at the Winter Olympics on Sunday.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b05c/live/9cc234d0-0774-11f1-b5e2-dd58fc65f0f6.png",
    "source": "BBC"
  },
  {
    "title": "F1 - Defending champion Norris tops opening day of testing in Bahrain ahead of Verstappen and Leclerc",
    "desc": "Defending F1 world champion Lando Norris went quickest on the opening day of official pre-season testing in Bahrain with the McLaren driver beating 2025 runner-up Max Verstappen by just over a tenth of a second. Verstappen went quickest in a morning session dominated by aero testing, with a number of cars running rakes, but after the Dutchman’s pre-lunch break 1:35.433, Norris",
    "image": "https://www.fia.com/sites/default/files/news/main_image/dppi_00126002_807.jpg",
    "source": "Federation Internationale de l'Automobile"
  },
  {
    "title": "Two women dead of unknown cause in Ashdod lab",
    "desc": "The Israel Police announced that they have opened an investigation into the circumstances of the accident, emphasizing that \"at this moment there is no risk of hazardous materials leaking outside.\"",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/705961",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Dispute over laser tests led to El Paso airspace closure, AP sources say",
    "desc": "The agency says it will ground all flights to and from the airport for \"special security reasons.\"",
    "image": "https://dims.apnews.com/dims4/default/9dfaafa/2147483647/strip/true/crop/3377x2250+312+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fa0%2F02%2F8c97446e1343b4975a7c7a2f06ad%2F4e912a1ab8ca4fd695dba1d5373e36db",
    "source": "AP News"
  },
  {
    "title": "Female celebrities who showed up for Fugu Wednesday",
    "desc": "Following the government of Ghana’s declaration of every Wednesday as ‘Fugu Day’ to promote and celebrate the country’s unique traditional attire, many Ghanaians, including celebrities and influencers, have taken to social media to showcase...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/805/80574417.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Tailored Genetic Risk Score Offers Better Breast Risk Prediction for Women of African Ancestry",
    "desc": "An ancestry-specific polygenic risk score improves breast cancer risk prediction over current European-based models in women of African ancestry.",
    "image": "https://www.insideprecisionmedicine.com/wp-content/uploads/2026/02/ChatGPT-Image_woman-going-for-mammogram.png",
    "source": "Inside Precision Medicine"
  },
  {
    "title": "Johannes Klæbo Ran Everybody Off The Course",
    "desc": "Televisually speaking, my one complaint about the Winter Olympics is that even with expert commentary, the skills on display in many events are not so obviously different from one another that I can tell them apart. I cannot tell any trick that anyone on skis or a snowboard does from any other trick that anyone…",
    "image": "https://lede-admin.defector.com/wp-content/uploads/sites/28/2026/02/GettyImages-2260316598.jpg",
    "source": "Defector"
  }
]