[
  {
    "title": "What happened to police probe into UTM cadet’s death, asks family",
    "desc": "Lawyer says there has been 'little or no update' since the AGC ordered murder investigation in December.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/0c07655f-utm-cadet-syamsul-haris-shamsudin-facebook-pic-24226.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Rodgers Wins Top NSW Cardiovascular Research Award",
    "desc": "Professor Anthony Rodgers has won the 2025 Ministerial Award for Cardiovascular Research Excellence.The award recognises researchers who have made",
    "image": "https://www.georgeinstitute.org/sites/default/files/2026-02/Award-cardiovascular-research-Anthony-Rodgers.jpg",
    "source": "Mirage News"
  },
  {
    "title": "‘Palaces’ fit for the Jade Emperor",
    "desc": "GEORGE TOWN: Ornate paper palaces with intricate rooftops, vibrant columns and celestial figu­rines are among the most sought-after offerings for the Jade Emperor's birthday celebration today.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/24/3783607.JPG",
    "source": "The Star"
  },
  {
    "title": "CNY spring cleaning at the beach",
    "desc": "A MOTHER and daughter in Terengganu spent the first day of Chinese New Year cleaning up a beach near their home in Kemaman.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/24/3783627.jpg",
    "source": "The Star"
  },
  {
    "title": "Jeanine Pirro's office shelves pursuit of Democrats over social video, sources say",
    "desc": "Jeanine Pirro has decided to stop pursuing the case against six Democratic lawmakers over a social media video, three people familiar with the matter told NBC News.",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-06/250627-Jeanine-Pirro-trump-ew-1254p-ff5d48.jpg",
    "source": "NBC News"
  },
  {
    "title": "LaGrange addresses communication concern over Parkland County standing measles warning",
    "desc": "Minister for Primary Health Care, Adriana LaGrange, said a standing measles warning was issued for Parkland County after 17 people west of Edmonton tested positive for the virus.",
    "image": "https://globalnews.ca/wp-content/uploads/2017/10/parkland-county.jpg?quality=65&strip=all&w=720&h=379&crop=1",
    "source": "Global News"
  },
  {
    "title": "Suspect in Nancy Guthrie abduction appeared to visit her house before: Sources",
    "desc": "The masked man who is suspected of the abduction of Nancy Guthrie appeared at her front door earlier than Feb. 1, sources told ABC News.",
    "image": "https://cdn.abcotvs.com/dip/images/18640963_022326-cc-ap-guthrie-doorbell-surveillance-suspect-split-img.jpg?w=1600",
    "source": "ABC7 San Francisco"
  },
  {
    "title": "Mars Telecommunications Orbiter",
    "desc": "The Mars Sample Return mission represents one of the most ambitious and scientifically valuable endeavors in NASA’s history. For the mission to be successful, NASA requires innovative and reliable industry partners. Our MSR mission is designed to put Mars samples in the hands of scientists faster and more affordably.",
    "image": "https://rocketlabcorp.com/themes/base/production/images/og_logo.jpg",
    "source": "Rocket Lab"
  },
  {
    "title": "Transfer pricing consideration in BIR’s new audit selection process",
    "desc": "The Bureau of Internal Revenue (BIR) entered 2026 with an important shift in identifying taxpayers that will undergo tax audit.",
    "image": "https://www.grantthornton.com.ph/contentassets/4ed8a5274fce4a2fac18170c37451e08/professionals-having-a-discussion-about-their-report-1440x627.jpg",
    "source": "Grant Thornton Philippines"
  },
  {
    "title": "Eye on boosting ties, Canada PM to embark on India visit from Feb 26",
    "desc": "India News: NEW DELHI: Canadian Prime Minister Mark Carney will pay a three-day visit to India beginning this week, Ottawa said in an official announcement. Carne.",
    "image": "https://static.toiimg.com/thumb/msid-128734057,width-1280,height-720,imgsize-36596,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  }
]