[
  {
    "title": "Canadians support arrival of Chinese electric vehicles: poll",
    "desc": "Most Canadians support allowing more Chinese electric vehicles to be sold in Canada despite some nagging concerns, a new poll suggests.",
    "image": "https://www.bnnbloomberg.ca/resizer/v2/I7TXPAIXJIPSXECXWYCM3RVCVI.jpg?smart=true&auth=adcca22d2b4cd5638823c25e48d25289bf05d35c7d8096e593df29fc9ea9564c&width=1200&height=630",
    "source": "BNN Bloomberg"
  },
  {
    "title": "BRELA boosts youth business, formal economy",
    "desc": "DAR ES SALAAM: THE Business Registrations and Licensing Agency (BRELA) is accelerating business formalisation in Tanzania, creating opportunities for youth and strengthening the country’s formal economy. In just over three months under the Sixth Phase Government, BRELA has registered 4,233 companies, including 2,915 owned by young entrepreneurs. Additionally, 7,498 business names have been recorded, 4,742",
    "image": "https://dailynews.co.tz/wp-content/uploads/2024/06/BRELA-TZ.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Death of Nigerian singer after snakebite highlights crisis of ‘preventable’ fatalities",
    "desc": "Ifunanya Nwangene died in hospital after being bitten in her Abuja home, raising questions about the availability of effective antivenoms",
    "image": "https://i.guim.co.uk/img/media/e9c9345a5b8f2ade690c1a5f8e2f2165ead75cc7/217_0_1665_1333/master/1665.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ee2320f62abe1d1bb127e91d75232bcb",
    "source": "The Guardian"
  },
  {
    "title": "Graft Agency Arrests Tax and Customs Officials in Bribery Probe",
    "desc": "The Corruption Eradication Commission arrested several suspects in tax and customs cases, marking its second crackdown on tax officials.",
    "image": "https://img2.beritasatu.com/cache/jakartaglobe/960x620-w/2025/12/1766077879-5000x3333.webp",
    "source": "Jakarta Globe"
  },
  {
    "title": "Everton sack manager Brian Sorensen days after first home win of WSL season",
    "desc": "Brian Sorensen, who took charge in 2022, is sacked with Everton fourth from bottom of the Women's Super League.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3fcd/live/f0d63560-01b3-11f1-a8b8-bdd2c5f9bcad.jpg",
    "source": "BBC"
  },
  {
    "title": "Everton sack manager Brian Sorensen days after first home win of WSL season",
    "desc": "Brian Sorensen, who took charge in 2022, is sacked with Everton fourth from bottom of the Women's Super League.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/3fcd/live/f0d63560-01b3-11f1-a8b8-bdd2c5f9bcad.jpg",
    "source": "BBC"
  },
  {
    "title": "PS calls for regulation of projects near campuses",
    "desc": "DODOMA: THE government has directed stakeholders to ensure that investments taking place near 16 newly established university campuses under the National HEET Project countrywide comply with urban planning regulations, safety requirements, and national standards. The directive intends to prevent unplanned development and ensure that services provided meet the needs of students, staff, and surrounding communities.",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/Daniel-Mushi.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Maina slumped on his office staircase… now hospitalised, says aide",
    "desc": "Emmanuel Nweke, media assistant to Abdulrasheed Maina, the former chairman of the defunct Pension Reform Task Team (PRTT), says his principal slumped on Tuesday at his office.",
    "image": "https://www.thecable.ng/wp-content/uploads/2026/02/Abdulrasheed-Maina-e1770210098945.jpeg",
    "source": "TheCable"
  },
  {
    "title": "Chelsea's Tyrique George opens door to representing Ghana",
    "desc": "Chelsea youngster, Tyrique George has opened the door for a potential nationality switch from England to play for the Black Stars of Ghana.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/842/84267903.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "'I answer to no one' - Rev Obofour breaks silence on alleged side chick saga",
    "desc": "Controversies surrounding polygamy have dominated the Ghanaian public space over the past few months, following heated debates surrounding the late Daddy Lumba’s two partners.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/846/84690128.jpg",
    "source": "GhanaWeb"
  }
]