[
  {
    "title": "Alexander Zverev secures place in Australian Open semi-finals with win over Learner Tien",
    "desc": "Tennis News: Last year’s finalist Alexander Zverev made it to the semi-finals of the Australian Open on Tuesday by beating young American Learner Tien. The German .",
    "image": "https://static.toiimg.com/thumb/msid-127605434,width-1280,height-720,imgsize-91506,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Storm Chandra: severe flood warning in Devon as more rain and wind hits UK",
    "desc": "Almost 100 flood warnings issued in England, with red warning, meaning danger to life, in Ottery St Mary",
    "image": "https://i.guim.co.uk/img/media/eede83f4909a8c0878858168dbbb09f4ff31d35f/367_0_3475_2780/master/3475.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=cd9d1d2f8cec629e2a5bd019d13edea5",
    "source": "The Guardian"
  },
  {
    "title": "Office romance ends in murder: Lover beheads HR manager, carries head in backpack, dumps body in gunny bag",
    "desc": "AGRA: A 32-year-old HR manager was brutally murdered, beheaded, her legs severed and the body stuffed into a gunny bag before being dumped near a brid.",
    "image": "https://static.toiimg.com/thumb/msid-127607988,width-1280,height-720,imgsize-32510,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Australian Open 2026: Alexander Zverev thanks serve for victory over Learner Tien to reach semi-finals",
    "desc": "Third seed Alexander Zverev thanks his serve for pulling him past an \"unbelievable\" Learner Tien to reach the Australian Open semi-finals.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e3dc/live/45d4b6e0-fb4c-11f0-8a3f-efae3b17f55b.jpg",
    "source": "BBC"
  },
  {
    "title": "West PH Sea sees return of Chinese ‘monster ship’",
    "desc": "The West Philippine Sea saw the presence of the world’s largest coast guard cutter belonging to China for the first time in nearly a year.",
    "image": "https://www.inquirer.net/wp-content/uploads/2024/07/753375.jpg",
    "source": "Inquirer.net"
  },
  {
    "title": "Russia’s desperate recruitment drive as Putin frees prisoners and lures foreigners to war",
    "desc": "Moscow has largely relied on what it describes as voluntary enlistment",
    "image": "https://static.independent.co.uk/2026/01/27/05/Russia_Ukraine_War_Recruitment_52179.jpg?width=1200&height=800&crop=1200:800",
    "source": "The Independent"
  },
  {
    "title": "Stricter SkillsFuture course funding guidelines for 9,500 courses across 500 training providers",
    "desc": "The agency announced on Jan 27 moves to tighten course funding guidelines to maintain course quality. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/b7b63c88eb2abfdf3d25e40d8d462fc374aacbf87d05fe0ed2ae7e852e134c06",
    "source": "The Straits Times"
  },
  {
    "title": "Only the offended husband can file an adultery complaint against his wife -- SC",
    "desc": "The Supreme Court (SC) has dismissed an adultery case filed by a husband, through his representative, against his wife and her lover as it pointed out that only...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/27/74659.webp",
    "source": "mb.com.ph"
  },
  {
    "title": "Breast Cancer isn’t just a disease of older women: Oncologist reveals why it is rising in women under 40",
    "desc": "Health News: For a long time, breast cancer has been talked about like it’s something that shows up only after a woman crosses a certain age. Forty. Fifty. Post-me.",
    "image": "https://static.toiimg.com/thumb/msid-127605186,width-1280,height-720,imgsize-721030,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Bank of Ireland downgrades economic forecast for 2026",
    "desc": "Bank of Ireland has downgraded slightly its forecast for economic growth for 2026.",
    "image": "https://www.rte.ie/images/001f4bb7-1600.jpg",
    "source": "RTE.ie"
  }
]