[
  {
    "title": "Gravitational Wave Signal Challenges Einstein's Theory",
    "desc": "For those who watch gravitational waves roll in from the universe, GW250114 is a big one. It's the clearest gravitational wave signal from a binary",
    "image": "https://cdn1.miragenews.com/wp-content/uploads/2019/04/news-and-developments.jpg",
    "source": "Mirage News"
  },
  {
    "title": "Rafiki unbanned on appeal: why it’s an important moment for African film",
    "desc": "Sexuality – especially queer sexuality – has always been one of the most heavily policed themes in African film.",
    "image": "https://images.theconversation.com/files/714885/original/file-20260128-74-mqn24c.png?ixlib=rb-4.1.0&rect=58%2C0%2C2292%2C1146&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "Software stocks enter bear market on AI disruption fear with ServiceNow plunging 11% Thursday",
    "desc": "The iShares Expanded Tech-Software Sector ETF is on pace for its biggest one-day decline since April 4 during the tariff-triggered downturn.",
    "image": "https://image.cnbcfm.com/api/v1/image/108119578-1742559184408-gettyimages-2205510858-NVIDIA_AI.jpeg?v=1769699023&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Gravitational wave signal tests Einstein’s theory of general relativity",
    "desc": "For those who watch gravitational waves roll in from the universe, GW250114 is a big one. It’s the clearest gravitational wave signal from a binary",
    "image": "https://c.nationaltribune.com.au/wp-content/themes/news/images/news-image-default.jpg",
    "source": "The National Tribune"
  },
  {
    "title": "African migration: focusing on Europe misses the point - most people move within the continent",
    "desc": "An analysis of the data shows fears of large-scale migration from Africa to Europe are exaggerated.",
    "image": "https://images.theconversation.com/files/713147/original/file-20260119-56-m7nzxs.jpg?ixlib=rb-4.1.0&rect=0%2C144%2C1024%2C512&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "Africa, rating agencies and the cost of debt",
    "desc": "Tensions over the role that credit rating agencies play in assessing African countries have broken into the open.",
    "image": "https://images.theconversation.com/files/715227/original/file-20260129-56-4cfghs.jpg?ixlib=rb-4.1.0&rect=0%2C85%2C1024%2C512&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "How tree rings help scientists understand disruptive extreme solar storms",
    "desc": "Scientists have long relied on tree rings to learn about ancient solar storms—rare bursts of high-energy particles from the sun that can disrupt satellites, power grids, and communication systems across the planet. When these particles hit Earth's atmosphere, they create a radioactive form of carbon that trees absorb and store in their wood.",
    "image": "https://scx2.b-cdn.net/gfx/news/hires/2026/how-tree-rings-help-sc.jpg",
    "source": "Phys.org"
  },
  {
    "title": "Immunotherapy before surgery helps shrink tumors in patients with desmoplastic melanoma",
    "desc": "UCLA investigators found that treating desmoplastic melanoma with immunotherapy before surgery can dramatically shrink or even eliminate tumors, sparing patients from more aggressive surgeries and preserving their quality of life.",
    "image": "https://www.uclahealth.org/sites/default/files/styles/landscape_16x9_030000_1200x675/public/images/ff/2025-08-18-uclah-jccc-ribas-campbell-045.jpg?f=6efc8fda&itok=lmSUATJm",
    "source": "UCLA Health"
  },
  {
    "title": "Betrayal at Chikurubi as Prison Officer Faces Court Over Alleged Dagga Sales",
    "desc": "​The State alleges that on January 3, 2026, the Zimbabwe Prisons and Correctional Service (ZPCS) Special Investigation Branch received a tip-off that Javen was selling dagga to inmates at Chikurubi Maximum Prison.",
    "image": "https://www.263chat.com/wp-content/uploads/2015/06/Prison-Image.jpg",
    "source": "263chat.com"
  },
  {
    "title": "Sialkot Stallionz appoint Tim Paine as Head Coach",
    "desc": "He brings vast experience as a strategist, mentor, and high-performance leader",
    "image": "https://i.tribune.com.pk/media/images/1897810-timpaine-1548566428/1897810-timpaine-1548566428-640x480.webp",
    "source": "The Express Tribune"
  }
]