[
  {
    "title": "Mitre 10 Mega Prestons opens in Christchurch as $30m store unveiled",
    "desc": "The expansion and growth of Mitre 10 is continuing with a number of new stores opened last year and one new outlet opening today. A spokeswoman for the...",
    "image": "https://www.nzherald.co.nz/resizer/v2/NWABXXRB5ZEIFG6QBEYC5DUTY4.jpg?auth=322b18f778d0e1cdbe2090d8dc17abb6ded2a31e1f4d89c4e03baef726805742&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "Auckland hospitality crunch: Trident’s Little Sicily in Onehunga to close its doors",
    "desc": "Auckland is losing another hospitality business, with Italian restaurant Trident’s Little Sicily in Onehunga set to close its doors this week. In a post on...",
    "image": "https://www.nzherald.co.nz/resizer/v2/2FT7M2I6QRG4XHB4C5VRG2KU74.jpg?auth=65062071e6975552a07a6b344279292d53f9fd2d64bec229f27e93b26f469800&width=1200&height=675&quality=70&focal=1855%2C2533&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Brooke van Velden announces changes to hazardous substance rules for research labs",
    "desc": "Brooke van Velden says the updated hazardous substance regulations for research laboratories will save the industry billions.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--Req0uUI5--/t_tohu-badge-facebook/v1769478781/4JU59DK_260127_Chocolate_Fish_9_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Voters split on who Labour should rule out as governing options",
    "desc": "Leader Chris Hipkins has so far refused to say which parties Labour would or would not work with in a future government.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--LGoUiQxJ--/t_tohu-badge-facebook/v1769478771/4JU59NY_260127_Chocolate_Fish_3_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Brain Waste System Insights May Aid Intracranial Diagnosis",
    "desc": "A new study led by investigators from Mass General Brigham shows that a brain waste- \"clean-up\" system is influenced by intracranial pressure. The",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1453847668862-487637052f8a%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1176%26amp%3Bq%3D80",
    "source": "Mirage News"
  },
  {
    "title": "Doctors to Marcos: Slow down",
    "desc": "President Marcos’ activities remained limited to private meetings yesterday even as Malacañang maintained he was in “good condition” days after undergoing observation in a hospital for stomach “discomfort.”",
    "image": "https://media.philstar.com/photos/2026/01/27/a2-1-16_2026-01-27_22-13-18.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "160,000-year-old sophisticated stone tools discovered in China may not have been made by Homo sapiens",
    "desc": "Archaeologists have found the oldest known evidence of hafted tools in East Asia, and they challenge a previously held assumption about stone tool use.",
    "image": "https://cdn.mos.cms.futurecdn.net/DpN2UB72PmwyCfBFMMGkBV-1600-80.png",
    "source": "Live Science"
  },
  {
    "title": "Kai Montinola grows closer to fellow Cebuano Kyle Echarri after ‘Roja,’ ‘MMK’",
    "desc": "Before being paired as Ice and Olsen in “Roja,” viewers had already noticed the undeniable onscreen chemistry between Kai Montinola and Kyle Echarri when they first worked together in “Maalaala Mo Kaya.” They were featured in the June 21, 2025 episode, which told the story of viral content creators and couple Hajie Alejandro and Lenie Aycardo, also known online as “Team HaNie.”",
    "image": "https://media.philstar.com/photos/2026/01/27/3-1_2026-01-27_19-45-09.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Eddie Awards 2026 Nominations List From American Cinema Editors",
    "desc": "American Cinema Editors has revealed the nominees for its 76th annual Eddie Awards on February 27 at UCLA's Royce Hall. See the full list.",
    "image": "https://deadline.com/wp-content/uploads/2026/01/Ace-Eddies.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Alcaraz flicks on genius switch to put himself two matches from career grand slam",
    "desc": "One moment by the world No 1 in his quarter-final against Alex de Minaur showed he is on a different plane to almost everyone else",
    "image": "https://i.guim.co.uk/img/media/02371f13246676b692ef52e8f0cdc8f06e552f48/1376_0_6828_5463/master/6828.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2f13cdc9c081a0406497194e7bcdfbfb",
    "source": "The Guardian"
  }
]