[
  {
    "title": "Govt to review outdated circulars, including civil servants’ shareholding rules",
    "desc": "The public service department says circulars over 20 years old or no longer relevant will be updated to reflect changes in governance, the economy and technology.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/01/447229cf-penjawat-awam-resize-bernamapic-050125.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Super Rugby Pacific season preview: Chiefs favourites, Hurricanes on the rise",
    "desc": "As a new Super Rugby Pacific season arrives, the usual suspects gather again. If there’s one team who could upset the all-too-familiar theme, though, it’s...",
    "image": "https://www.nzherald.co.nz/resizer/v2/DBEC4FZ2VRHGDCU7QGIAD6LKIY.JPG?auth=df2cff965a65b0a7b3b930b1386a9ea6151765fe17342c2b8cffa751c18c773f&width=1200&height=675&quality=70&focal=1306%2C1144&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Strike by Air New Zealand flight attendants leaves traveller in limbo",
    "desc": "By Susan Edmunds of RNZ An Air New Zealand customer is upset after discovering at the last minute that a cabin crew strike has disrupted her travel plans. “I...",
    "image": "https://www.nzherald.co.nz/resizer/v2/GH3K7IM3DZHMTDDSLVII273XXQ.jpg?auth=e89c4abd03964bc9912bffc55c52218af92d0bcc5c7655dea2b2104a252b1d91&width=1200&height=675&quality=70&focal=779%2C584&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Tax refund payments ahead of schedule, full settlement by Feb 2026",
    "desc": "KUALA LUMPUR: The Government is aiming to complete tax refund payments for the Year of Assessment 2023 ahead of schedule, with full settlement now expected by February 2026, earlier than its original first-quarter target, says Datuk Seri Amir Hamzah Azizan.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/12/3766905.JPG",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Israel’s 'generous' burial policy to become unsustainable as population ages, study warns",
    "desc": "With annual death toll expected to double by the mid-2040s, report from Taub Center calls to rethink current approach to burials, including adopting higher density practices to prevent 'cities of the dead'",
    "image": "https://static-cdn.toi-media.com/www/uploads/2025/11/IMG_20251117_115256.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Crusaders target another title as Super Rugby aims to speed up",
    "desc": "An All Blacks-heavy Canterbury Crusaders kick off their Super Rugby title defence against the Otago Highlanders on Friday as the southern hemisphere competition trials a raft of rule changes designed…",
    "image": "https://s.france24.com/media/display/0994217e-07c8-11f1-8de1-005056bf30b7/w:1280/p:16x9/efd59d0c01faff405ac83758187a4d7cf3120d9b.jpg",
    "source": "France 24"
  },
  {
    "title": "SENSEX falls over 350 points, NIFTY50 below 25,850; Infosys, TCS among top drags",
    "desc": "The SENSEX fell as much as 395 points and NIFTY50 index touched an intraday low of 25,836 dragged down by losses in index heavyweights like Infosys and Tata Consultancy Services.",
    "image": "https://assets.upstox.com/content/assets/images/news/nifty-sensex-nse-bse-buzzing-feb-4-2026.webp",
    "source": "Upstox"
  },
  {
    "title": "Mount Maunganui landslide: Paul Davison named to lead Tauranga City Council probe",
    "desc": "A former judge has been appointed to lead Tauranga City Council’s review into the deadly Mount Maunganui landslide. Six campers died after a section of Mauao...",
    "image": "https://www.nzherald.co.nz/resizer/v2/NKBVBQ5QSZAR5EUXTWPUK2A76A.jpg?auth=affc8a6e24fc70ee734bb2047552dbc52be9f42e0af981d1564e8fa405f9eea0&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "Singapore To Host Special Viewing Event For March's Total Lunar Eclipse",
    "desc": "The Lion City will witness a rare total lunar eclipse on March 3. Here’s how to watch it at Science Centre Singapore and what to expect.",
    "image": "https://images.travelandleisureasia.com/wp-content/uploads/sites/7/2026/02/10134537/file-photo-of-total-lunar-eclipse-on-march-13-14-2025-1600x900.jpeg",
    "source": "Travel and Leisure Asia"
  },
  {
    "title": "Probe finds Air India crash was intentional, pilot turned off fuel switch: Report",
    "desc": "Air India flight AI 171 crash was likely caused by a deliberate pilot action. The findings raise concerns over pilot mental health and aviation safety standards in India.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/air-india-plane-crash-155715947-16x9.jpg?VersionId=cSRAGEYHEqExFq8XzzZdXtbFtMrDYm2F",
    "source": "India Today"
  }
]