[
  {
    "title": "Matt Weston and Tabitha Stoecker win thrilling mixed team skeleton gold at Winter Olympics",
    "desc": "Matt Weston becomes the first Briton to win two gold medals at a Winter Olympics with a thrilling victory in the mixed team skeleton alongside Tabitha Stoecker.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f7a1/live/74b86510-0aa1-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Stop horsing around: What to expect in the Year of the Horse",
    "desc": "A horse year favours action over hesitation, but also carries connotations of volatility and intensity, among other things.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--smEJxyFg--/t_tohu-badge-facebook/v1770952179/4JT9LWB_52520446_l_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Young mum’s cancer fight highlights need for $22.5m Northland Cancer Lodge",
    "desc": "A young Whangārei mum diagnosed with breast cancer while pregnant is backing the new Northland Cancer Lodge. The Cancer Society Northland Auckland is working...",
    "image": "https://www.nzherald.co.nz/resizer/v2/QHRMPMQ2JNCERJITQDKXKUMEIU.jpg?auth=b40fadaa49c57f828daab30d7c77ff2ee5125e0acb4e5121836281267206c27f&width=1200&height=675&quality=70&focal=1561%2C335&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Disney Battles ByteDance Over Seedance AI Copyright Issues",
    "desc": "Disney sent ByteDance a cease-and-desist for using its characters on Seedance. When OpenAI's Sora did it, however, Disney struck a deal.",
    "image": "https://i.insider.com/699111dbe1ba468a96ac1af1?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "'Wuthering Heights' Faces Surprise Threat in 'Goat'",
    "desc": "Wuthering Heights is still tipped to top the Valentine's Day/Presidents Day holiday box office but GOAT is gaining ground far too quickly for comfort.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2025/11/rev-1-WHE-T2-0081r_High_Res_JPEG-H-2025.jpg?w=1296&h=730&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "Canadian passport holders can travel to China visa-free starting this week",
    "desc": "Canadian passport holders can travel to China visa-free starting Tuesday until the end of 2026, a spokesperson for China's Foreign Affairs Ministry announced Sunday — marking another step in Canada's thawing relationship with the Chinese government.",
    "image": "https://i.cbc.ca/ais/4b905739-53ef-4193-87d9-8b0dfc67ab9f,1771176746059/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C480%2C7835%2C4407%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Stamped in time: UNE research features in new Australia Post stamp collection",
    "desc": "NEARLY two decades of UNE research into a deposit of ancient fossils found at Emu Bay on South Australia’s Kangaroo Island has become the subject of a new limited edition stamp collection released by Australia Post. Featuring full colour artistic reconstructions of the fossils, the stamps paint a clear picture of the spectacular diversity of […]",
    "image": "https://moreeonlinenews.com.au/wp-content/uploads/USEanomalocaris-170-1024x710.png",
    "source": "Moree Online News"
  },
  {
    "title": "Canada's Connor McDavid makes Olympic tournament history",
    "desc": "With his third-period goal against France on Sunday, McDavid became the first NHLer in the Olympics to register three points in three consecutive games, while his nine points are the most through the first three games of an Olympic tournament with NHL players.",
    "image": "https://www.sportsnet.ca/wp-content/uploads/2026/02/McDavid-2.jpg",
    "source": "Sportsnet"
  },
  {
    "title": "Why Are Celebrities Avoiding Politics at Berlin Film Festival?",
    "desc": "The sidelining of politics — and artists unwillingness to speak out — has become the central theme of the 2026 Berlinale",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-2261626726.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Andrew's time as trade envoy should be investigated, says Vince Cable",
    "desc": "The former prince's alleged actions were \"totally unacceptable\", the ex-business secretary says.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f435/live/6e0b03a0-0a90-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  }
]