[
  {
    "title": "Cloudflare Launches Vertical Microfrontend Template for Path-Based Edge Routing",
    "desc": "Cloudflare has launched a Worker template for Vertical Microfrontends (VMFE), enabling independent teams to manage their stacks for specific URL paths, improving CI/CD efficiency. This architecture st",
    "image": "https://res.infoq.com/news/2026/02/cloudflare-vmfe-template/en/headerimage/generatedHeaderImage-1770214763062.jpg",
    "source": "infoq.com"
  },
  {
    "title": "Dimarco helps Inter to eight-point lead in Serie A",
    "desc": "Juventus were held 2-2 by Lazio after a late equaliser from Pierre Kalulu",
    "image": "https://i.tribune.com.pk/media/images/whatsapp-image-2026-02-09-at-4-30-34-am1770633110-0/whatsapp-image-2026-02-09-at-4-30-34-am1770633110-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Traiser of Tharun Bhascker’s Gaayapadda Simham promises quirky satire",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/02/Gaaya-Padda-Simham-1.webp",
    "source": "123telugu.com"
  },
  {
    "title": "Quantum Tycoon: Game Unlocks Quantum Computing Basics",
    "desc": "The Institute of Cosmos Sciences (ICCUB) and the Institute of Nanoscience and Nanotechnology (IN2UB) at the University of Barcelona have released",
    "image": "https://web.ub.edu/documents/2710030/46107399/quantumtycoonweb1.jpg/f1d33cf4-10de-e3b4-1655-29b58f9b64e3?version=1.0&t=1770631992054&download=true",
    "source": "Mirage News"
  },
  {
    "title": "53 migrants, including two babies, dead or missing after boat capsizes off Libya",
    "desc": "One survivor reported losing her husband, while the other said she lost her two babies in the tragedy, according to the International Organization for Migration (IOM).",
    "image": "https://e3.365dm.com/26/02/1600x900/skynews-migrant-boat-libya_7159917.jpg?20260209103059",
    "source": "news.sky.com"
  },
  {
    "title": "Musim Mas and NTU Singapore Launch Multi-Year Study to Understand How Sustainability Spreads Among Smallholder Farmers",
    "desc": "A multi-year collaboration to study what motivates smallholder farmers to adopt sustainable palm oil practices, and how such behaviours can spread across farming communities in Indonesia.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/09/930099.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "How allegations of wife beating nearly ruined my marriage - Teddy A",
    "desc": "Reality television personality Tope Adenibuyan, widely known as Teddy A, has spoken publicly about the emotional and reputational damage caused by past",
    "image": "https://dailypost.ng/wp-content/uploads/2023/04/Teddy-A-1424x802-1.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Rate variation and recurrent sequence errors in pandemic-scale phylogenetics",
    "desc": "Phylogenetic analyses of genome sequences from infectious pathogens reveal essential information regarding their evolution and transmission, as seen during the coronavirus disease 2019 pandemic. Recently developed pandemic-scale phylogenetic inference methods reduce the computational demand of phylogenetic reconstruction from genomic epidemiological datasets, allowing the analysis of millions of closely related genomes. However, widespread homoplasies, due to recurrent mutations and sequence errors, cause phylogenetic uncertainty and biases. We present algorithms and models to substantially improve the computational performance and accuracy of pandemic-scale phylogenetics. In particular, we account for, and identify, mutation rate variation and recurrent sequence errors. We reconstruct a reliable and public sequence alignment and phylogenetic tree of >2 million severe acute respiratory syndrome coronavirus 2 genomes encapsulating the evolutionary history and global spread of the virus up to February 2023. Performing pandemic-scale phylogenetic analysis poses multifaceted challenges. This study develops methods for identifying and accounting for mutation rate variation and recurrent sequence errors, leading to an improved global phylogenetic tree of >2 million severe acute respiratory syndrome coronavirus 2 genomes.",
    "image": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41592-025-02932-8/MediaObjects/41592_2025_2932_Fig1_HTML.png",
    "source": "Nature"
  },
  {
    "title": "Norwegian ambassador resigns as she faces scrutiny over contacts with Epstein",
    "desc": "A Norwegian ambassador who was involved in Israeli-Palestinian peace efforts in the 1990s and most recently served in Jordan has resigned as she faces scrutiny over her contacts with Jeffrey Epstein, the country’s Foreign Ministry says",
    "image": "https://i.abcnewsfe.com/a/0e75c187-1f6a-4dda-b9a4-c247bdbc502e/wirestory_509650a0dfaaf8ae31cffae048f80e53_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Young Israeli entrepreneurs take global stage at Unistream international investment p",
    "desc": "Teen innovators from across Israel pitch startups to global business leaders; flagship EdVenture program simulates real-world fundraising and entrepreneurship; social and tech solutions aim to improve health, confidence and daily life for youth",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/09/SkgESEwwbl/SkgESEwwbl_0_0_1229_563_0_large.jpg",
    "source": "Ynetnews"
  }
]