[
  {
    "title": "Real Madrid Player Ratings vs. Rayo Vallecano: Mbappe Penalty Keeps Title Charge Alive",
    "desc": "Kylian Mbappé’s stoppage time penalty ensured Madrid edged the relegation-threatened Rayo.",
    "image": "https://images2.minutemediacdn.com/image/upload/c_crop,x_0,y_19,w_1024,h_576/c_fill,w_1440,ar_1440:810,f_auto,q_auto,g_auto/images/voltaxMediaLibrary/mmsport/si/01kgcwyvbkgn4zm46rtm.jpg",
    "source": "Sports Illustrated"
  },
  {
    "title": "Highlights as Hull FC narrowly defeated at Wigan despite Lewis Martin hat-trick",
    "desc": "Hull FC take on Wigan Warriors at the Brick Community Stadium.",
    "image": "https://i2-prod.hulldailymail.co.uk/incoming/article10789459.ece/ALTERNATES/s1200/3_WWHFC60620.jpg",
    "source": "Hull Live"
  },
  {
    "title": "Big win for Cork as they impressively defeat Louth in Drogheda",
    "desc": "John Cleary's side make it two wins from first two games",
    "image": "https://www.echolive.ie/cms_media/module_img/9906/4953410_7_seoimageog_Louth_20v_20cork_201_5356.jpg",
    "source": "echo live"
  },
  {
    "title": "Australian Open 2026: Carlos Alcaraz celebrates 'job done' after 'honour' of completing historic career Grand Slam",
    "desc": "Carlos Alcaraz says it is an \"honour to put his name in the history books\" after becoming the youngest man to win singles titles at all four majors.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7b6c/live/562ed0c0-ff84-11f0-a8b8-bdd2c5f9bcad.jpg",
    "source": "BBC"
  },
  {
    "title": "What Novak Djokovic said to Carlos Alcaraz on court after his historic triumph",
    "desc": "Carlos Alcaraz carved his name into the history books by capturing his first Australian Open title on Sunday. The Spaniard defeated Novak Djokovic in the final at Melbourne Park to become the youngest player ever to complete a career Grand Slam.",
    "image": "https://s.yimg.com/os/en/hitc_articles_832/e431cc16c0a5a5eb40f1bd61cd8fafa4",
    "source": "Yahoo Sports"
  },
  {
    "title": "Man United vs Fulham live: Fans protest outside Old Trafford ahead of Premier League clash",
    "desc": "Carrick has overseen wins against Man City and Arsenal but faces a different test from Fulham",
    "image": "https://static.independent.co.uk/2026/02/01/15/15/GettyImages-2259403074.jpeg?width=1200&height=800&crop=1200:800",
    "source": "The Independent"
  },
  {
    "title": "India knocks out Pakistan to seal semi-final berth",
    "desc": "The Indian cricket team beat Pakistan in their Super Six match to qualify for the U19 World Cup 2026 semi-finals. Vedant Trivedi scored 68 while Ayush Mhatre got three wickets.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/qy7w4zo8kea95udiqb4o",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "PSV 3-0 Feyenoord: First-half blitz sends leaders 17 points clear",
    "desc": "Robin van Persie was left stunned as his Feyenoord team were demolished in the first half by Eredivisie leaders PSV on Sunday.",
    "image": "https://prod-media.beinsports.com/image/1769961605259_bce3f243-52d0-490e-ba2f-51be6496a7dc.1080.jpg",
    "source": "beIN SPORTS"
  },
  {
    "title": "Galactic Monsters Grew in Cocoons Like Giant Bugs, Scientists Say",
    "desc": "Astronomers say that ancient almost impossibly massive \"Little Red Dots\" may be black holes trapped in \"cocoons.\"",
    "image": "https://futurism.com/wp-content/uploads/2026/01/james-webb-red-dots_e58e15.jpg?quality=85&w=1200",
    "source": "Futurism"
  },
  {
    "title": "Ethiopia bets on technical training to turn skills into sustainable jobs",
    "desc": "Ethiopia is placing technical and vocational training at the core of its growth strategy\nThe policy targets youth employment amid high urban",
    "image": "https://www.ecofinagency.com/media/k2/items/cache/4865243ab6c311ed503920fd89b8d47f_S.jpg",
    "source": "Ecofin Agency"
  }
]