[
  {
    "title": "Secelela Balisidya: Leading through listening in the face of climate change",
    "desc": "Secelela Balisidya is the founder and chairperson of the private media organisation Environment Media Agenda (EMA).",
    "image": "https://www.thecitizen.co.tz/resource/image/5356714/landscape_ratio3x2/1200/800/ac106521a2232318448a59ff516b33ef/Bx/balisisya-pic.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Sabarimala gold theft: Kerala court grants bail to former Devaswom President N Vasu",
    "desc": "A Special Judge in Kollam passed the bail order after the SIT failed to file chargesheets within the prescribed time limit under the law, entitling Vasu to default bail",
    "image": "https://media.assettype.com/barandbench%2F2023-12%2F904f3986-05b4-44c2-b5ab-ba0b5ae5b626%2Fsabarimala_temple_2.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Bar and Bench"
  },
  {
    "title": "Solar storms at sea: Why space weather matters for shipping",
    "desc": "The US National Oceanic and Atmospheric Administration (NOAA) recently warned that the strongest solar radiation storm in 20 years could affect Earth’s atmosphere, with potential disruption to communication and navigation systems. This article takes a closer look at what ‘space weather’ is and its implications for shipping and marine insurance.",
    "image": "https://images.eu.ctfassets.net/jchk06tdml2i/3vEUbY65GumkhHirtKhQOM/2f687a0b4b6d49d22b5057c651f25b11/OliverGoossens.jpg",
    "source": "Gard.No"
  },
  {
    "title": "How today's Malaysian grandparents are raising happier, healthier families",
    "desc": "With life changing so quickly, Malaysia's grandparents are pivoting too. Here's how today's silvers are raising happier, healthier families.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/11/3765165.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "David and Eileen Thompson",
    "desc": "The death has occurred of David and Eileen Thompson (née Sheehan) of Ballydesmond, Cork Ireland, on 31/10/2025. You can view the full death notice and add your condolences here.",
    "image": "https://img-dedicated.rip.ie/w188/a5272649-5a01-4f29-80e9-9ded7168499d_9f961289c485dbe47255cdc95dc9118166c75c715e3614e2.jpeg",
    "source": "RIP.ie"
  },
  {
    "title": "Why are we going back to the Moon?",
    "desc": "Roughly 384 400 km from the pale blue dot we call Earth hangs an orb that has fascinated humanity for millennia. The Moon is our planet’s only natural satellite and is about a quarter of Earth’s size. Only 12 people set foot on it between 1969 and 1972, but more than 50 years later the Artemis programme aims to add to that number. In early March, NASA’s Artemis II mission will carry four astronauts on a lunar flyby during a 10-day trip, with later missions set to put feet back on the Moon’s surface.",
    "image": "http://news.nwu.ac.za/sites/news.nwu.ac.za/files/styles/news_photo_attached/public/files/attach/2026-02/pexels-izafi-18547959.jpg?itok=lWBwfeAa",
    "source": "NWU News"
  },
  {
    "title": "As it happened: WA news on Thursday, February 12",
    "desc": "Follow our live coverage here.",
    "image": "https://static.ffx.io/images/$zoom_0.18539915966386555%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_198/t_crop_custom/q_86%2Cf_auto/f5e2fb72d86bd60605b11c241f5a4b74ce1c4a98764fb1ab8c66eb856e2ef42b",
    "source": "WAtoday"
  },
  {
    "title": "Nipah virus: Singapore closely monitoring global situation, prepared to adjust public health measures",
    "desc": "No Nipah virus cases associated with the situations in India or Bangladesh have so far been detected in Singapore.",
    "image": "https://dam.mediacorp.sg/image/upload/s--T6FnRdfo--/c_crop,h_575,w_1022,x_1,y_26/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2023-11:afp_watermark_14112023,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/01/28/000_33v77x4.jpg?itok=Jlf2DECi",
    "source": "CNA"
  },
  {
    "title": "Enyaq and Elroq now double as gaming consoles - and that's not all",
    "desc": "Škoda’s electric vehicles have recently gained new entertainment applications integrated directly into their infotainment systems. The Spotify app simplifies access to music and podcasts, Škoda Play offers video content, and Air Console effectively transforms the vehicles into gaming consoles.",
    "image": "https://cdn.skoda-storyboard.com/2026/02/Skoda-PR-1-copy_ad1a1c49-1440x960.jpg",
    "source": "Škoda Storyboard"
  },
  {
    "title": "Uefa Nations League: Northern Ireland could face Scotland and Republic of Ireland",
    "desc": "Before Thursday's Uefa Nations League draw in Brussels, BBC Sport NI takes a look at Northern Ireland's potential opponents, including the Republic of Ireland and Scotland.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d9a4/live/6ec74870-0753-11f1-9322-05e0dac521f4.png",
    "source": "BBC"
  }
]