[
  {
    "title": "Ectoin: The Quietly Brilliant Skincare Ingredient Your Routine Has Been Missing",
    "desc": "The skincare sleeper hit you didn't know you needed.",
    "image": "https://ed66c6w9sxw.exactdn.com/wp-content/uploads/2026/01/Grazia-Header-Image-5.jpg",
    "source": "Grazia Singapore"
  },
  {
    "title": "Woman charged with spitting water while on a train, remanded at IMH",
    "desc": "The woman said she was remorseful and would control her anxiety attacks and not do it again.",
    "image": "https://dam.mediacorp.sg/image/upload/s--frFSsNsR--/c_crop,h_618,w_1099,x_1,y_0/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/01/28/6327582645423901983.jpg?itok=vE2zQOJi",
    "source": "CNA"
  },
  {
    "title": "Claire Danes Recalls Learning She Was Pregnant at 43, Says She Had a 'Meltdown'",
    "desc": "Claire Danes Recalls Learning She Was Pregnant at 43, Says She Had a ‘Meltdown’ Claire Danes is looking back at her last pregnancy. The 46-year-old Emmy-winning actress and The Beast In Me star was revealed to be pregnant with her third child…",
    "image": "https://cdn01.justjared.com/wp-content/uploads/headlines/2026/01/claire-recalls.jpg",
    "source": "Just Jared"
  },
  {
    "title": "Diagnostic, Therapeutic, and Evolutionary Profile of Salmonellosis at the CHNEAR in Dakar",
    "desc": "Typhoid fever is a fecal–oral transmitted disease and a common, highly contagious, non-immunizing foodborne infection originating in the gastrointestinal tract and caused by major Salmonella species. It represents a medical and sometimes surgical emergency due to the risk of severe and unpredictable complications. The aim of this study was to evaluate the epidemiological, clinical, evolutionary, and therapeutic characteristics of salmonellosis. This was a retrospective, descriptive, and analytical study conducted among children at CHNEAR over a five-month period, from January 1 to May 31, 2025. All confirmed cases of salmonellosis requiring hospitalization during the study period were included. A total of 52 cases of salmonellosis were identified, of which 31 met the inclusion criteria. The male-to-female sex ratio was 2.1. The mean age was 7.3 years, with a range from 1.5 to 14 years. More than two-thirds of patients (67.74%) originated from suburban areas. The most frequent reasons for consultation were fever, diarrhea, and vomiting, reported in 90.32%, 70.97%, and 58.06% of cases, respectively. Nearly half of the patients (46.43%) had received undocumented treatment prior to hospitalization. None of the patients had received typhoid vaccination, while all children were up to date with their Expanded Programme on Immunization (EPI) vaccines. On physical examination, fever was present in 90.32% of cases. The majority of patients (95.6%) presented with tachypnea. Dehydration (41.94%), abdominal pain (32.26%), and clinical anemia (19.35%) were the most frequently observed physical signs. Laboratory investigations showed that the majority of patients (82.76%) had normal leukocyte counts, with normal lymphocyte levels in more than half of cases (51.72%), while 41.38% presented with lymphopenia (These are the results we found). C-reactive protein (CRP) was elevated in all patients. Blood cultures were positive for Salmonella in 87% of cases. Ceftriaxone was the most commonly administered antibiotic, used in 68.97% of patients. Hyponatremia (80.65%) and hypokalemia (29.03%) were the most frequent metabolic complications observed. A disease duration of ≥3 weeks was significantly associated with an unfavorable outcome, with a p-value of 0.02. Two deaths were recorded. Salmonellosis remains a common condition in our region. Preventive measures, particularly typhoid vaccination and strict hand hygiene, remain essential and effective strategies for reducing disease burden.",
    "image": "https://file.scirp.org/image/ojped2024061315113462.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Marilyn Manson: US judge reopens sexual assault case against musician",
    "desc": "Singer’s former assistant alleges he sexually assaulted her when she worked for Manson Records between 2010–2011",
    "image": "https://i.guim.co.uk/img/media/2cacc84f08fa719eadaca8720ee5af639a31033a/387_0_2504_2003/master/2504.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4fef75c9c4fc9011fa1ace0c5e647468",
    "source": "The Guardian"
  },
  {
    "title": "The Mediating Roles of Online Self-Efficacy and Learning Engagement",
    "desc": "With the rapid development of digital technology, informal English learning (for example, dramas, social media, language-learning apps and so on) has been an important way besides traditional classes. Nevertheless, most of the current research focuses on informal learning environment. So it lacks discussions about how informal ways of learning influence learners’ psychological characteristics. This paper, which is based on Self-Efficacy Theory and Learning Engagement, builds a dual-path model to find the influence mechanism of informal English learning to boost confidence.",
    "image": "https://file.scirp.org/image/ojml2016070117283323.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "West Asymmetric Impacts of Convectively Coupled Kelvin Waves on the West African Monsoon",
    "desc": "Convectively coupled Kelvin waves (CCKWs) are among the most influential sources of synoptic-to-intraseasonal variability affecting the West African monsoon. Yet, how their impacts differ across the West Africa and why rainfall transitions occur earlier in some regions than others remain poorly documented. Using daily observations and reanalysis fields for 1981-2024, this study investigates Kelvin-wave modulation of West African rainfall during July-September, focusing on the contrasting responses of eastern and western West Africa. Composite analyses reveal a coherent wet (phase 2) and dry (phase 6) structure, but with markedly sharper and earlier transitions in the east. The Intertropical Discontinuity and vertical wind shear show little longitudinal dependence, indicating that surface and mesoscale factors do not drive the asymmetry. Instead, the key mechanism originates from the vertical generation of humidity anomalies by Kelvin-wave-induced subsidence and ascent. Eastern West Africa exhibits deeper mid-level drying during the wet-to-dry transition and earlier moistening during the dry-to-wet transition, producing stronger humidity anomalies\nq\n′\n. These anomalies are subsequently redistributed horizontally by the mean monsoon flow, yielding earlier sign reversals in the flux term\nu\n¯\nq\n′\n. Western regions, with a weaker vertical response, transition more gradually. This integrated vertical-horizontal mechanism explains the spatial heterogeneity of Kelvin-wave impacts and highlights the need for forecasting systems to resolve regional differences in vertical humidity sensitivity.",
    "image": "https://file.scirp.org/image/ojmh2016063017194430.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Why haven't police labelled Perth's Invasion Day rally incident terrorism? Here's what we know",
    "desc": "Identifying ideological motivations behind attacks is critical to separating terrorism from other events just designed to cause fear, an extremism expert told the ABC.",
    "image": "https://live-production.wcms.abc-cdn.net.au/dcb6c976f43d472895605792a76ae7f5?impolicy=wcms_watermark_news&cropH=2250&cropW=4000&xPos=0&yPos=234&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Trump Suggests He Will ‘De-Escalate’ in Minneapolis, Without Offering Details",
    "desc": "President Trump continued to put the blame on Alex Pretti for legally carrying a weapon with a permit, saying, “You can’t walk in with guns.”",
    "image": "https://static01.nyt.com/images/2026/01/27/multimedia/27dc-trump-fbpk/27dc-trump-fbpk-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Former Blues star’s NRL career likely over",
    "desc": "Multiple deals have fallen through in his bid to continue playing NRL.",
    "image": "https://www.zerotackle.com/wp-content/uploads/2016/06/542124996.jpg",
    "source": "Zero Tackle"
  }
]