[
  {
    "title": "Patriarch of Jerusalem received hierarchs, diplomats and monks (PHOTO)",
    "desc": "On the 2nd February 2026, Patriarch of Jerusalem, Theophilos III, received Metropolitan Kirill of Kazan of the Moscow Patriarchate, who was leading a group of priests, monks, and pilgrims. The Patriarch received the delegation with warmth and recalled his visit in previous years to the Metropolis of His Eminence Metropolitan…",
    "image": "https://orthodoxtimes.com/wp-content/uploads/2026/02/jerusalem-visits-2.jpg",
    "source": "Orthodox Times"
  },
  {
    "title": "Seremban eatery which allegedly washed, reused leftovers to face probe",
    "desc": "Negeri Sembilan health department director Dr Zuraida Mohamed says she will instruct her staff to investigate the claim by a netizen.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/ed38580c-cuci-sisa-makanan-nasi-kandar-ss-030226.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Reliable rural transparency in Zanzibar power curtails youth migration - RC Kunenge",
    "desc": "COAST REGION: COAST Regional Commissioner Mr Abubakar Kunenge has said reliable electricity services in rural areas have become a major catalyst in enabling youth to start productive activities and reduce migration to cities. He made the statement during a meeting with officials from the Rural Energy Authority (REA) at his office recently. The delegation had",
    "image": "https://dailynews.co.tz/wp-content/uploads/2024/12/Kunenge.webp",
    "source": "dailynews.co.tz"
  },
  {
    "title": "GoFundMe for Galway child who suffered spinal cord injury during surgery",
    "desc": "She has remained in ICU since",
    "image": "https://i2-prod.galwaybeo.ie/article10791915.ece/ALTERNATES/s1200/0_IZZY.jpg",
    "source": "Galway Beo"
  },
  {
    "title": "Grisly Johor discovery: Two men face murder charges after six people, including kids, found dead in charred Kangkar Pulai house",
    "desc": "JOHOR BARU, Feb 3 — Six people, including three children and a teenager, were found murdered with their skeletal remains in a burnt-down house at Kangkar Pulai, Johor, police...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/03/323628.JPG",
    "source": "Malay Mail"
  },
  {
    "title": "Justin Bieber’s Grammys return sparks debate over casual fashion and new tattoo",
    "desc": "Justin Bieber’s return to the Grammy Awards this week was anything but low-key. After several years away from the ceremony’s main stage,",
    "image": "https://minutemirror.com.pk/wp-content/uploads/og-cache/e35421abe231759ea46295f403a0c344.jpg",
    "source": "Minute Mirror"
  },
  {
    "title": "Governor Otuoma appears before EACC over ongoing county probe",
    "desc": "The EACC has not yet disclosed details of the allegations under investigation.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/e151e96e-70b9-449d-9661-56228b847154.png?1770107973200",
    "source": "the-star.co.ke"
  },
  {
    "title": "Fact Check: Iran's President Not Killed in Israeli Bombing",
    "desc": "Fact Check - Iranian President Masoud is reportedly still active as of February 2, 2026.",
    "image": "https://statik.tempo.co/data/2026/02/03/id_1456763/1456763_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "Njoro Girls High School closed indefinitely after student’s death triggers protests",
    "desc": "Angry parents and residents are demanding answers over the Form Four girl's death.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/e49b6b9f-2058-43eb-9361-8da1fb593f5f.png?1770110970741",
    "source": "the-star.co.ke"
  },
  {
    "title": "“Almost anything proven under battlefield conditions can become a commercial product",
    "desc": "Yaniv Jacobi and Lior Segal, Managing Partners at Horizon Capital, joined CTech for its 2026 VC Survey.",
    "image": "https://pic1.calcalist.co.il/picserver3/crop_images/2026/02/02/S160DyRLWe/S160DyRLWe_0_238_3000_1689_0_large.jpg",
    "source": "CTech"
  }
]