[
  {
    "title": "Politicians will soon distribute Range Rovers",
    "desc": "Senior Lecturer at the University of Ghana’s Department of Political Science, Dr Kwame Asah-Asante, has cautioned that Ghana’s growing culture of vote-buying could soon reach alarming levels, with politicians potentially distributing luxury vehicles such as Range Rovers to influence voters.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2022/01/Asah-Asante-Utag.jpeg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Epic insists it gave Horses studio \"context\" following decision to ban controversial horror game",
    "desc": "Epic Games has disputed it made \"provably incorrect statements\" to Horses developer Santa Ragione, insisting feedback w…",
    "image": "https://assetsio.gnwcdn.com/HORSES_Woman.png?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "source": "GamesIndustry.biz"
  },
  {
    "title": "Tough itel City 200 unveiled with 50MP camera and Unisoc T7250 chipset",
    "desc": "It's joined by two Android 15 Go Edition phones, also powered by the T7250. The City 200 is rated IP65 and has been drop tested from 1.5m.",
    "image": "https://fdn.gsmarena.com/imgroot/news/26/02/itel-city-200-a200-a200plus-announced/-952x498w6/gsmarena_000.jpg",
    "source": "GSMArena.com"
  },
  {
    "title": "Winter Olympics 2026: Germany's Julia Taubitz leads after opening runs of women's singles luge competition",
    "desc": "It's a German 1-2 after two runs, as Taubitz's compatriot Merle Malou Fraebel sits second, with Elina Bota in third heading into Tuesday's finale.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/jetfnq8fq193dqufqo6r",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Study claims Europa is more likely 'dead' than teeming with life",
    "desc": "Europa has a deep ocean, but a new study suggests its seafloor may be too quiet to supply the energy life needs to survive.",
    "image": "https://cff2.earth.com/uploads/2026/01/11080842/Europa-ocean-life.jpg",
    "source": "Earth.com"
  },
  {
    "title": "‘Abhorrent’: Methanol poisoning victims’ parents slam small fines given to Laos staff",
    "desc": "The families of the two young Australian women who died from methanol poisoning in Laos have slammed the small fines handed to staff who served their deadly...",
    "image": "https://www.nzherald.co.nz/resizer/v2/KVKCQO2L2ZBVHARRPKPRQI5VJI.jpg?auth=c5215c863a121d2f29e8adc9c369555e28fe31ef95982f269da66f8fdf2caa88&width=1200&height=675&quality=70&focal=729%2C786&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Inazuma Gacha is a hit football franchise inspired simulation experience now open for pre-registration on mobile",
    "desc": "Inazuma Gacha opens Android pre-registration, offering a fully free football gacha game with no in-app purchases or monetization.",
    "image": "https://i0.wp.com/gamingonphone.com/wp-content/uploads/2026/02/Inazuma-Gacha-pre-registration-cover.jpg",
    "source": "GamingonPhone"
  },
  {
    "title": "Catherine Zeta-Jones to Lead Tate Taylor Thriller Cupid",
    "desc": "Cupid, about a couple who seek the help of an unorthodox marriage counsellor, is being directed by Tate Taylor.",
    "image": "https://variety.com/wp-content/uploads/2026/02/CZJ-HeadshotPhoto-Credit-Rene-Radka.jpg?crop=0px%2C0px%2C1000px%2C562px&resize=1000%2C563",
    "source": "Variety"
  },
  {
    "title": "So, what's going on with Musicboard?",
    "desc": "Is Musicboard shutting down? Company says no, but users are worried.",
    "image": "https://techcrunch.com/wp-content/uploads/2022/12/GettyImages-1279377494.jpg?resize=1200,800",
    "source": "TechCrunch"
  },
  {
    "title": "Civil Society Council Vows Expanded Engagement as National Dialogue Reaches Pivotal Stage",
    "desc": "Addis Ababa, February 9, 2026 (ENA)— The Ethiopian Civil Society Organizations Council has pledged to step up its engagement to help ensure the success of Ethiopia’s National Dialogue, saying the consultation process has entered a critical and decisive phase.\nThe Council said it is working closely with the Ethiopian National Dialogue Commission to support consultations aimed at building national consensus by narrowing differences on key political and social issues.\nThe Ethiopian National Dialogue Commission was established by the House of People’s Representatives under Proclamation No. 1265/2022 as an independent body mandated to facilitate an inclusive, nationwide dialogue. The Commission has so far conducted agenda gathering and participant identification in eleven regions and two city administrations.\nSpeaking to the Ethiopian News Agency, President of the Civil Society Organizations Council, Ahmed Hussein, said the Council has been mobilizing civil society organizations to play a meaningful and structured role in the process.\n“We have been working to ensure that civil society organizations contribute significantly to the national consultation,” Ahmed said.\nHe explained that civil society groups are actively engaged in public awareness creation, agenda setting and the recruitment of participants in coordination with the National Dialogue Commission.\nAhmed noted that cooperation between the two institutions has been formalized through a memorandum of understanding, which has enabled joint activities to be implemented.\n“Based on the agreement, many joint activities are being implemented,” he said.\nAccording to Ahmed, the inclusiveness of the consultation is being demonstrated in practice. He said women, youth, persons with disabilities, elders and scholars are participating alongside broader public involvement across regions.\nHe added that as the consultation moves into a more sensitive phase, the Council plans to further strengthen its contribution to help guarantee a successful outcome.\n“The national consultation is a major opportunity to move away from resolving differences through force and towards a political culture guided by dialogue and the power of ideas,” Ahmed said.\nHe also underscored the wider importance of the process, noting that the consultation lays a foundation for state building by enabling citizens to freely deliberate on national issues.\nEthiopia’s National Dialogue is part of a broader effort to address long standing political and social divisions through inclusive discussion rather than confrontation.\nLaunched amid ongoing reforms and post conflict recovery efforts, the process seeks to build a shared national understanding on core political, social and governance questions by engaging citizens across regions and social groups.\nCivil society organizations have been identified as key actors in this effort due to their grassroots presence and experience in community mobilization.\nThe renewed commitment by the Civil Society Organizations Council comes as agenda consolidation and participant engagement advance toward substantive deliberations, making coordination, inclusiveness and public trust central to the credibility and eventual outcomes of the national consultation.",
    "image": "https://www.ena.et/documents/42142/0/civic+%281%29.jpg/54a03d17-a059-d770-f744-d60bdbf50f20?version=1.0&t=1770662418329&download=true",
    "source": "ENA English"
  }
]