[
  {
    "title": "Britain's 'loneliest' sheep Fiona gives birth for first time",
    "desc": "Fiona - who hit the headlines in 2023 after being rescued from the foot of a steep cliff - gives birth to twins at a farm park in the south of Scotland.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/a9c6/live/d57684b0-0748-11f1-8fcf-193eb7dfcf8f.jpg",
    "source": "BBC"
  },
  {
    "title": "Nurse from northern Israel shocked to discover her rented apartment became a drug lab",
    "desc": "Police cleared her of involvement, but the apartment was left uninhabitable with about 135,000 shekels in damage — and the electric company is demanding nearly 167,000 shekels for alleged power theft",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/10/ByGNPnqODWx/ByGNPnqODWx_341_0_2185_1231_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Consortium likely buyer for De Beers, says Anglo CEO",
    "desc": "ANGLO American CEO Duncan Wanblad said the sale of the firm’s 85% in De Beers will almost certainly result in a public-private consortium taking ownership of the diamond group, with the Botswana government expected to increase its existing stake. “We are relatively far advanced” in the process, Wanblad told the Financial Times, adding that he […]",
    "image": "https://www.miningmx.com/wp-content/uploads/2022/10/GettyImages-511257538-scaled-e1666694345931.jpg",
    "source": "Miningmx"
  },
  {
    "title": "Declining habits of traditional hikmat treatment needs govt attention",
    "desc": "Hamza Rahman RAWALPINDI, Feb 11 (APP):Hikmat, also known as the Unani herbal system, and allopathic medicine were once competing methodologies for diagnosing",
    "image": "https://www.app.com.pk/wp-content/uploads/2022/09/Fall-Back-Image-2.png",
    "source": "Associated Press of Pakistan"
  },
  {
    "title": "'He's hale & hearty': Govt opposes Sonam Wangchuk's release on health grounds",
    "desc": "India News: NEW DELHI: The central government on Wednesday opposed Sonam Wangchuk's release on medical grounds, saying the climate activist was \\\"hale and hearty a.",
    "image": "https://static.toiimg.com/thumb/msid-128201414,width-1280,height-720,imgsize-204350,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Latvia could gain another home-grown bank",
    "desc": "According to a statement posted by company co-founder Mārtiņš Šulte on LinkedIn, the Mintos investment platform has begun the necessary procedures to become a bank, reports Labs of Latvia.",
    "image": "https://static.lsm.lv/media/2020/04/large/1/cyfx.jpg",
    "source": "LSM"
  },
  {
    "title": "Police probe fire that destroyed 15 vehicles in Mogoditshane",
    "desc": "Police in Mogoditshane are investigating a fire incident in which 15 vehicles were burnt to ash early Saturday morning at a garage storage facility located on a farm on the outskirts of Gakuto village.",
    "image": "https://www.mmegi.bw/mmegi/uploads/images/2026/02/11/162929.jpg",
    "source": "Mmegi Online"
  },
  {
    "title": "Jamal Yunos auctions off infamous slipper, towel for RM66,000 to pay Teresa Kok",
    "desc": "KUALA LUMPUR: Datuk Seri Jamal Md Yunos has auctioned off a slipper and a towel for RM66,000, which will be used to pay Teresa Kok.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/11/3765746.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Duale dares ex-DP Gachagua to TV debate over North Eastern development",
    "desc": "\"President Ruto, leave him (Gachagua) to me. I will deal with him,” Duale said.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/84cb6246-099c-43d6-ad10-b09ccf6e8629.jpeg?1770807869033",
    "source": "the-star.co.ke"
  },
  {
    "title": "Blizzard forecast for Latvia on Friday",
    "desc": "On Friday, February 13th – yes, it's Friday the 13th – and overnight into Saturday, February 14th, Latvia is expected to experience heavy snowfall, according to the latest weather forecasts.",
    "image": "https://static.lsm.lv/media/2026/02/large/1/soiw.jpg",
    "source": "LSM"
  }
]