[
  {
    "title": "Mehmet Oz's vaccine call is 'too little, too late'",
    "desc": "Measles is still spreading in the US but calls from government officials for Americans to vaccinate now won’t be enough to keep the country from losing a quarter-century of success eradicating the disease.",
    "image": "https://static.dw.com/image/75952928_6.jpg",
    "source": "dw.com"
  },
  {
    "title": "Daily Post Nigeria",
    "desc": "In a bold move to redefine customer value and appreciation, Africa’s Global Bank, United Bank for Africa (UBA), has officially launched \"The Red Vault,\"",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/1001765140-1.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Catholic Authorities: Over 100 Christians Killed, 90,000 Displaced in Nigeria",
    "desc": "The Catholic Diocese of Wukari has raised an urgent alarm over what it describes as relentless and systematic attacks by suspected Fulani militants across Southern Taraba State, leaving more than 100 people dead, thousands injured, and over 90,000 Catholics displaced since September 2025. In a press briefing held Thursday at the Catholic Secretariat in Jalingo,",
    "image": "https://persecution.org/wp-content/uploads/2025/06/Nigeria-01-1.jpg",
    "source": "International Christian Concern"
  },
  {
    "title": "PSG stunned by rampant Rennes, giving Lens chance to move top",
    "desc": "Rennes, four days after firing coach Habib Beye, stunned Paris Saint-Germain 3-1 on Friday, snapping the defending champions' seven-match winning run in Ligue 1.",
    "image": "https://s.france24.com/media/display/6a629728-0918-11f1-9576-005056bfb2b6/w:1280/p:16x9/deb11d0be3cca23d50b106cd6f7bbe6f1f4d3f21.jpg",
    "source": "France 24"
  },
  {
    "title": "iOS 26 recently added five new ways to customize your iPhone",
    "desc": "Recent updates to iOS 26 have given users a variety of new settings to customize the way their iPhone looks and works.",
    "image": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2025/08/ios-26-clock-lock-screen-b6.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "source": "9to5Mac"
  },
  {
    "title": "Federal officers may have lied about shooting of migrant in Minneapolis, officials say",
    "desc": "ICE chief Todd Lyons says the two officers were immediately placed on administrative leave.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5e24/live/11e37690-091c-11f1-a919-a96c5a4ca48c.jpg",
    "source": "BBC"
  },
  {
    "title": "Au Pair Juliana Peres Magalhães Sentenced to 10 Years in Banfield Double Murder Case",
    "desc": "Juliana Peres Magalhães, 25, had cooperated with prosecutors, who sought a lenient sentence. But the judge said the woman, who pleaded guilty to manslaughter, merited the state maximum.",
    "image": "https://static01.nyt.com/images/2026/02/13/multimedia/13-va-aupair-1-pcvl/13-va-aupair-1-pcvl-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Pakistan, Turkey conduct Turgutreis",
    "desc": "The newly commissioned Pakistan Navy ship PNS Khaibar visited Turkey’s Aksaz Naval Base and participated in joint exercises. The visit matters as it strengthens bilateral naval cooperation and regional security. The exercise and coordinated patrol directly involved Pakistan and Turkish naval forces in operational collaboration.",
    "image": "https://dailytimes.com.pk/assets/uploads/2026/02/13/1317395627ce5f6-convert.io_.jpg",
    "source": "Daily Times"
  },
  {
    "title": "FBI describes Nancy Guthrie case suspect, backpack as sheriff asks locals for video",
    "desc": "The suspect in the disappearance of Nancy Guthrie is described as male, approximately 5’9” - 5’10” tall, with an average build, according to the FBI, which increased its reward to $100,000 from $50,000.",
    "image": "https://assets.foxnews.com/liveblog/fn/prod/images/2026/02/365e65a89094040e9b6396e498b294b2.jpg",
    "source": "Fox News"
  },
  {
    "title": "Lenovo China Shows Off Tiny 96GB LPCAMM2 Memory Module",
    "desc": "Unsurprisingly for memory in 2026, you can't buy it yet.",
    "image": "https://i.pcmag.com/imagery/articles/00wd2PWkEBA6IcEKGYgS0ta-2.fit_lim.size_1200x630.v1771013109.jpg",
    "source": "PCMag"
  }
]