[
  {
    "title": "Kuria’s ex-running mate Faith Mwaura defects to UDA, eyes Roysambu seat",
    "desc": "Mwaura said she was excited and privileged to join President William Ruto's party.",
    "image": "https://cdn.radioafrica.digital/image/2026/01/93c7e0b3-34ae-4e43-b642-19b725d45bd3.png?1769604040274",
    "source": "the-star.co.ke"
  },
  {
    "title": "Latvian project head: Rail Baltica will be years late",
    "desc": "The first phase of the Rail Baltica railway project could be delayed by 3 to 5 years, said Māris Dzelme, chairman of the board of Eiropas Dzelzceļa līnijas (EDzL), the national implementer of the Rail...",
    "image": "https://static.lsm.lv/media/2025/10/large/1/rq57.jpg",
    "source": "LSM"
  },
  {
    "title": "Long-distance transport of siRNAs with functional roles in pollen development",
    "desc": "Small interfering RNAs (siRNAs) play a crucial role in plant reproduction, yet their mobility and function remain incompletely understood. We report that a large proportion of siRNAs found in pollen of Capsella rubella relies on mobile siRNAs from maternal sporophytic tissues, highlighting the importance of non-cell-autonomous siRNAs in male gametophyte development. Unlike tapetal siRNAs, which guide DNA methylation and require CLASSY3 and DNA-dependent RNA polymerase IV (Pol IV) activity in the tapetum, we found that Pol IV-dependent mobile siRNAs (PMsiRNAs) mainly function post-transcriptionally and do not guide DNA methylation. Nevertheless, PMsiRNAs share key features with tapetal siRNAs, including Pol IV dependency, clustering and a size range of 21–24 nucleotides. Using a grafting approach, we show that sporophytic Pol IV-dependent siRNAs act as non-cell-autonomous mobile signals that trigger PMsiRNA formation through post-transcriptional gene silencing. This process parallels reproductive phased siRNA biogenesis, which is widespread across angiosperms but has been considered absent in Brassicaceae. Loss of PMsiRNAs causes pollen arrest, underscoring their essential role. Together, these findings highlight siRNAs as long-distance communication signals from maternal sporophytic tissues to the male gametophyte with critical functions in developmental regulation. This study shows that many small RNAs in Capsella rubella pollen originate from maternal tissues. These mobile small RNAs support proper pollen development, revealing that non-cell-autonomous small RNAs are crucial for successful plant reproduction.",
    "image": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41477-026-02219-6/MediaObjects/41477_2026_2219_Fig1_HTML.png",
    "source": "Nature"
  },
  {
    "title": "Dollar slips to four-year low following Trump remarks",
    "desc": "Confidence in the US dollar seems shaken as the Donald Trump administration continues with erratic trade, foreign, and economic policies, with the weakness likely to continue.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=80,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/01/84e5a0e9-dollar-1.jpg",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Aer Lingus confirms Manchester base closure",
    "desc": "Aer Lingus had been reviewing the future of its only English base",
    "image": "https://www.irishtimes.com/resizer/v2/WB4ARQGMMGM6MRC3AWIGGN77G4.jpg?smart=true&auth=81b7595463be8b4dc9f5734ec6b28f7218485da13b562ebde6afe85a90599cc0&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Three people arrested following discovery of drugs in Sligo and Gurteen",
    "desc": "Three people have been arrested following drugs seizures by Gardai in Sligo and Gurteen.   All three are due to appear before Tubbercurry District Court today....",
    "image": "https://img.resized.co/oceanfm-ie/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltZy5vY2VhbmZtLmllXFxcL3Byb2RcXFwvdXBsb2Fkc1xcXC9TbGlnby1zZWl6dXJlcy0yNnRoLUphbnVhcnktMjAyNi0xMDI0eDc2OC5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvc3RnLXd3dy5vY2VhbmZtLmllXFxcL2ltYWdlc1xcXC9uby1pbWFnZS5wbmc_dj01XCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6ImJkNTRkMTRjYzVkZGIxZTgwYjQ3Y2MyMWQ1MTE3YWMwMjRjMGE1NjUifQ==/three-people-arrested-following-discovery-of-drugs-in-sligo-and-gurteen.jpg",
    "source": "oceanfm.ie"
  },
  {
    "title": "Monsanto is new NBI",
    "desc": "CEBU CITY – The new chief of the National Bureau of Investigation-Central Visayas (NBI-7) formally assumed his post on Tuesday, Jan. 27.Atty. Jose Ermie...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/28/74995.jfif",
    "source": "mb.com.ph"
  },
  {
    "title": "16,000 Temporary Houses to Be Built in Aceh for Disaster Victims",
    "desc": "Aceh Tamiang has achieved the most, with around 1,000 temporary houses completed and 1,600 more under construction.",
    "image": "https://statik.tempo.co/data/2026/01/28/id_1455742/1455742_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "St Brigid’s activities: Fire displays, parades and gigs to see over bank holiday weekend",
    "desc": "Live podcast shows, workshops and free concerts part of festivities across country",
    "image": "https://www.irishtimes.com/resizer/v2/6VIL4P5I7FHTNKAEZ6HGR2VYZM.jpg?smart=true&auth=27117fa8a70a952b68289815428b679bfe8ded4cce30850772085eddc61ab323&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Browns head coach search: Team eliminates candidate, continues process",
    "desc": "The Cleveland Browns head coach search is now down to 3 names with the team eliminating a finalist",
    "image": "https://platform.dawgsbynature.com/wp-content/uploads/sites/73/2026/01/imagn-19513688.jpg?quality=90&strip=all&crop=0%2C3.9822162730663%2C100%2C80.091024193272&w=1200",
    "source": "Dawgs By Nature"
  }
]