[
  {
    "title": "Apple’s Shot on iPhone Chinese New Year film blends live action with stop",
    "desc": "Apple launches Glad I Met You, a Shot on iPhone Chinese New Year film directed by Bai Xue, blending live action and stop-motion animation.",
    "image": "https://marketech-apac.com/wp-content/uploads/2026/02/Apples-Glad-I-Met-You.jpg",
    "source": "marketech apac"
  },
  {
    "title": "Unforgettable Grammys 2026 Looks: Chappell Roan, Sabrina Carpenter, Bad Bunny",
    "desc": "Feathered gowns, sequined suits, freed nipples and more.",
    "image": "https://static01.nyt.com/images/2026/02/01/multimedia/01moststylish-grammy-top-mgjv/01moststylish-grammy-top-mgjv-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Today's NYT Mini Crossword Answers for Feb. 2",
    "desc": "Here's today's NYT Mini Crossword answer. These answers will help you solve New York Times' popular crossword game, Mini Crossword, every day!",
    "image": "https://www.cnet.com/a/img/resize/4a7dc34963db8f9a51abae1ab77ec99b498be36f/hub/2024/07/25/50d61b9b-1c76-4678-9a92-f6eca531f4a8/nyt-mini-crossword-234876.jpg?auto=webp&fit=crop&height=675&width=1200",
    "source": "CNET"
  },
  {
    "title": "Nuggets guard Jamal Murray named All",
    "desc": "Nuggets guard Jamal Murray, averaging career bests in points, assists and rebounds, was named an All-Star for the 1st time.",
    "image": "https://cdn.nba.com/manage/2026/02/GettyImages_murray.jpg",
    "source": "NBA"
  },
  {
    "title": "Oil slides as Trump signals Iran talks, easing supply shock fears",
    "desc": "Oil prices slid as investors dial back fears of a supply shock after Donald Trump said Iran was \"seriously talking\" with Washington over the weekend.",
    "image": "https://image.cnbcfm.com/api/v1/image/108258747-1769664898982-gettyimages-2158379973-oilfieldpano.jpeg?v=1769664910&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Latin American Universities Lead Global AI Adoption as Students Demand Better Training",
    "desc": "Over 30,000 students and faculty across Latin America are using artificial intelligence tools regularly, surpassing global adoption rates but raising urgent questions about educational quality and fairness, according to a major regional survey released Monday. The Digital Education Council AI in Higher Education Latin America Survey 2026 gathered responses from…",
    "image": "https://www.newsghana.com.gh/wp-content/uploads/2024/08/logo-newsghana.png",
    "source": "News Ghana"
  },
  {
    "title": "Tested tough: How Aussie CTI raises the standard for central tyre inflation systems",
    "desc": "Aussie CTI prides itself on building every system with premium components that are made to last.",
    "image": "https://bigrigs.com.au/wp-content/uploads/2026/01/1.-Rotator-Testing-Machines.jpg",
    "source": "bigrigs.com.au"
  },
  {
    "title": "YGG Play, GIGACHADBAT Launch ‘CHAD Raids’ Ahead of CHAD Token Release on Feb 6",
    "desc": "YGG Play and GIGACHADBAT team up for a limited-time CHAD Raid event featuring double rewards and a lead-up to the CHAD token launch on February 6.",
    "image": "https://bitpinas.com/wp-content/uploads/2026/01/YGG-Play-GIGACHADBAT-Launch-‘CHAD-Raids-Ahead-of-CHAD-Token-Release-on-Feb-6.png",
    "source": "BitPinas"
  },
  {
    "title": "Sea Mining Plan to Cut Rare",
    "desc": "Japan is accelerating a decade-old plan to extract rare earths from the deep seabed, an ambitious initiative given extra impetus by the country’s drive to cut reliance on Chinese supply.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i6F3S3BsEbPc/v0/1200x800.jpg",
    "source": "Bloomberg.com"
  },
  {
    "title": "USAID Nigeria: A new path for NGOs and Renewed Hope Ward programme",
    "desc": "The Nation Newspaper Post-USAID Nigeria: A new path for NGOs and Renewed Hope Ward programme",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/02/02051858/Post-USAID-Nigeria.jpg",
    "source": "The Nation Newspaper"
  }
]