[
  {
    "title": "Comparative spectral analysis of blood and saliva in breast cancer, benign breast disease and healthy controls using ATR-FTIR",
    "desc": "Breast cancer (BC) ranks among the most prevalent tumors affecting women. This research explores the ability of Attenuated Total Reflection Infrared Spectroscopy (ATR-FTIR) to identify different biochemical elements found in bodily fluids such as serum and saliva from individuals with BC, individuals with benign breast disease (BBD), and healthy individuals. A cross-sectional analysis was performed on samples from 73 participants, comprising 31 with BC, 18 with BBD, and 24 healthy subjects, to examine biochemical differences across the groups. The findings indicated that the levels of the biochemical elements nucleic acids, proteins, lipids and glycogen significantly differed among the fluids. Specifically, the wavenumber of 2930 cm− 1 in saliva was capable of statistically differentiating BC patients from BBD patients and healthy controls. In the serum samples, a significant difference was observed at 1295 cm− 1 (p = 0.0014). However, serum collection has some disadvantages such as invasiveness and the need for trained personnel. Wavenumbers in saliva have emerged as potential breast cancer biomarkers, suggesting that this approach could serve as a valuable, noninvasive method and readily available option for breast cancer screening. ATR-FTIR spectroscopy has the potential to pave the way for the investigation of more efficient and less invasive clinical diagnostic methods.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "The White House's Valentine's Day cards 'Made just for you'",
    "desc": "Marking a departure from traditional romantic themes, the administration shared comic-style digital",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260214045037_VD.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "The White House's Valentine's Day cards 'Made just for you'",
    "desc": "Marking a departure from traditional romantic themes, the administration shared comic-style digital",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260214045037_VD.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "Clingan and Hansen Both Prominent in NBA All-Star Rising Stars Challenge",
    "desc": "Two Trail Blazers stood tall at All-Star Weekend.",
    "image": "https://platform.blazersedge.com/wp-content/uploads/sites/34/2026/02/imagn-28231755.jpg?quality=90&strip=all&crop=0%2C1.5000234378662%2C100%2C78.534031413613&w=1200",
    "source": "Blazer's Edge"
  },
  {
    "title": "Ruto Urges Africa to Seize $2.3 Trillion Climate Investment Shift",
    "desc": "'Our climate agenda is inseparable from development, energy access and industrialisation,” Ruto said. - Kenya breaking news | Kenya news today | Capitalfm.co.ke",
    "image": "https://www.capitalfm.co.ke/news/files/2026/02/Ruto-AU-e1770999514550.jpg",
    "source": "Capitalfm.co.ke"
  },
  {
    "title": "Major construction starts on Adelaide's first skyscraper Festival Tower Two",
    "desc": "Festival Tower Two is set to tower over South Australia's Parliament House, which the premier says will bring money and people into the city, but others remain against the $800 million project.",
    "image": "https://live-production.wcms.abc-cdn.net.au/d52c505caa6ac54e095aa64324749ef2?impolicy=wcms_watermark_news&cropH=2054&cropW=3652&xPos=901&yPos=587&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Changing 5 Phone Settings Can Limit The Amount Of Data Apps Collect About You",
    "desc": "Ways of limiting the data smartphone apps collect include opting out of ad tracking, limiting permissions, and changing app privacy settings.",
    "image": "https://www.slashgear.com/img/gallery/changing-5-phone-settings-can-limit-the-amount-of-data-apps-collect-about-you/l-intro-1770787168.jpg",
    "source": "SlashGear"
  },
  {
    "title": "Winter Olympics 2026 quick guide: What to watch on Day 8",
    "desc": "Find out what's on at the Winter Olympics in Milan.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ffeef48469005d1f48a839790dcd0da4?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=234&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "A major HIV breakthrough is being tested in Cape Town | Here’s why it matters",
    "desc": "In a monumental stride towards combating one of the continent’s most pressing health crises, South Africa has launched the BRILLIANT 011...",
    "image": "https://www.businessghana.com/site/img/../../cms/img/news/2026-02-13-160941002.jpg",
    "source": "BusinessGhana"
  },
  {
    "title": "Pulwama terror attack anniversary: PM Modi, CRPF, other leaders pay tribute to fallen soldiers on ‘Black Day'",
    "desc": "As the nation observes Black Day on February 14, tributes poured in for the 40 CRPF martyrs of the Pulwama attack. Leaders across India honoured their sacrifice on the occasion of Pulwama terror attack seven-year anniversary.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/14/1600x900/logo/CRPF_1771043649004_1771043649288.jpeg",
    "source": "Mint"
  }
]