[
  {
    "title": "Dr Johnson Asiama meets 24HR+ economy secretariat to strengthen policy coordination",
    "desc": "Governor of the Bank of Ghana, Dr Johnson Asiama, has hosted the Secretariat of the 24HR+ Economy for a high-level strategic engagement aimed at aligning monetary policy tools with national development priorities.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/505/50532649.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "WATCH: What we learned from Day 3 of the first 2026 pre-season test in Bahrain",
    "desc": "Catch up on the big talking points from Day 3 of the first pre-season test in Bahrain with the F1 TV crew.",
    "image": "https://d2n9h2wits23hf.cloudfront.net/image/v1/static/6057949432001/789982c5-f81c-4e3f-a666-4fe1f1a806ab/576812a6-4bd9-4dde-9187-0a42a8aeb3ff/640x360/match/image.jpg",
    "source": "Formula 1"
  },
  {
    "title": "ZAMBIA: Parish Leaders Oriented on Revised Pastoral Guide in Lusaka, Zambia",
    "desc": "Lusaka Archdiocese Media\nParish leaders from across the Archdiocese of Lusaka, on Saturday, 7th February 2026, gathered at Pope Square for the orientation of the revised Pastoral Guide (Second Edition), which has now been extended to the lay faithful.\nThe Pastoral Guide serves as a key reference for clergy, religious, and lay leaders, providing principles, policies, and procedures to ensure harmony in pastoral ministry.\nRooted in Sacred Scripture, the Catechism of the Catholic Church, Canon Law, and Papal teachings, the document also reflects the Archdiocese’s vision, mission, and values.\nThe revised guide aims to strengthen unity, integrity, and fidelity within the Local Church while promoting integral human development.\nBy offering clear direction on sacraments, worship, administration, and pastoral conduct, the guide is expected to equip parish leaders to serve with compassion and renewed zeal for evangelization.\nThe orientation marks an important step in fostering a culture of faith, hope, and love across the Archdiocese.\nEND",
    "image": "https://communications.amecea.org/wp-content/uploads/2016/05/cropped-AMECEA-LOGO-32x32.jpg",
    "source": "AMECEA"
  },
  {
    "title": "McDavid scores first career goal at Olympics to give Canada early lead",
    "desc": "Connor McDavid scored his first career Olympic goal on Friday, opening the scoring for Canada on the power play in the first period against Switzerland.",
    "image": "https://www.tsn.ca/resizer/v2/2W45KJYQTRAARIGDDWIJUSYTKA.jpg?smart=true&auth=83c6ff25a2e610a213401af2c5cf5ba7c64a18d7da31e90b115a57aec7ca041f&width=1200&height=630",
    "source": "TSN"
  },
  {
    "title": "iOS 26 Hits 50% Adoption: Why It's Slower Than iOS 18",
    "desc": "Apple's recent iOS 26 adoption numbers tell a fascinating story about how users respond to major operating system updates—and how quickly narratives can...",
    "image": "https://assets.content.technologyadvice.com/photo_1533568749383_2b0bf33e53cb_0902b22ea0.webp",
    "source": "Gadget Hacks"
  },
  {
    "title": "Iddrisu, Sukparu recovering at 37 Military Hospital after accident",
    "desc": "The Parliament of Ghana has expressed deep concern over a road traffic accident involving two of its senior members: the Minister for Education, Haruna Iddrisu, and the Deputy Minister for Communications, Digital Technology and Innovation, Adam...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/198/19814280.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Michael O'Neill: How will he juggle Northern Ireland and Blackburn Rovers?",
    "desc": "After the announcement that he will manage both Northern Ireland and Blackburn Rovers this season, how will Michael O'Neill juggle two jobs?",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/a088/live/a57329f0-08ef-11f1-93bd-a513005671be.jpg",
    "source": "BBC"
  },
  {
    "title": "Pattullo Bridge permanently closed as replacement fully opens this weekend",
    "desc": "It's a bittersweet time for local drivers as the Pattullo Bridge has now permanently closed to all vehicles.",
    "image": "https://images-dh-production-baselayer.dailyhive.com/uploads/2026/02/Pattullo-Bridge-1.jpg?format=auto",
    "source": "Daily Hive Vancouver"
  },
  {
    "title": "‘Long, long way to go’: Lindsey Vonn says she’ll have fourth surgery on broken leg",
    "desc": "The US skier who crashed out of the Olympic downhill event said she hopes to soon leave an Italian hospital and return to the US for another surgery",
    "image": "https://i.guim.co.uk/img/media/d0308f7fa5a39b4f5235232478611a571e99f6b2/0_288_1080_864/master/1080.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a2d5f8f3f00f0b3431eae06cdb9adf6f",
    "source": "The Guardian"
  },
  {
    "title": "Saskatchewan highlights open dialogue on sexual health",
    "desc": "Province observes Sexual and Reproductive Health Awareness Week with focus on communication and care",
    "image": "https://www.lmtimes.ca/content/images/size/w256h256/2023/03/Asset-8LMT-small-logo.png",
    "source": "Last Mountain Times"
  }
]