[
  {
    "title": "Barcelona player ratings vs Girona: Lamine Yamal misses penalty and Pau Cubarsi goes from hero to zero as controversial late winner dents Catalans' title hopes",
    "desc": "Girona sprung a huge shock in the title race as they beat Barcelona 2-1 at Montilivi. Lamine Yamal missed a penalty and Hansi Flick's side were left fuming by a controversial late goal, as the Catalan side dropped important points in the title race amidst a fierce battle with Real Madrid at the summit.",
    "image": "https://assets.goal.com/images/v3/blt4e5fcd7c533597c3/GOAL%20-%20Multiple%20Images%20-%203%20Stacked%20-%20Facebook(1)%20(1).jpg",
    "source": "Goal.com"
  },
  {
    "title": "DA leverages road budget to support Philippine tourism goals",
    "desc": "The Department of Agriculture (DA) will align the construction of farm-to-market roads (FMRs) with tourism road projects nationwide to position the country as a...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/16/79749.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Virginia freight forwarder sentenced for illegally shipping millions worth of U.S. goods and technology to Russia",
    "desc": "The owner of a Virginia-based freight forwarding company was sentenced for a scheme to illegally export goods and technology from the United States to",
    "image": "https://cdllife.com/wp-content/uploads/2026/02/AdobeStock_576700478_Editorial_Use_Only.jpeg",
    "source": "CDLLife"
  },
  {
    "title": "Irish contribution to US presidency celebrated",
    "desc": "The contribution of Ireland to the United States in this, the 250th anniversary year of the US Declaration of Independence, was marked by wreath laying ceremonies in Washington, DC, at the grave of John F Kennedy.",
    "image": "https://www.rte.ie/images/0023e875-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Frederick Wiseman, 96, Penetrating Documentarian of Institutions, Dies",
    "desc": "He exposed abuses in films like “Titicut Follies,” a once-banned portrait of a mental hospital, but ranged widely in subject matter, from a Queens neighborhood to a French restaurant.",
    "image": "https://static01.nyt.com/images/2023/05/29/obituaries/00Wiseman6/00Wiseman6-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Ray J performs with bleeding eyes weeks after saying he has months to live",
    "desc": "Singer Ray J performed a concert on Saturday with what appeared to be bleeding eyes and something taped to his chest, weeks after claiming he only has months to live: 'I'm putting my life on the line for this show!'",
    "image": "https://ew.com/thmb/okII8LkjDEyDI2ScRcs1J2J9Yck=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/ray-j-01-012926-dcdcab4045f9474ca0f69f0b2c33499e.jpg",
    "source": "Entertainment Weekly"
  },
  {
    "title": "How dark web agent spotted bedroom wall clue to rescue girl from abuse",
    "desc": "Detectives desperate to locate a 12-year-old, seen abused online, found a surprising lead.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5ef8/live/d681e5e0-0827-11f1-b5e2-dd58fc65f0f6.png",
    "source": "BBC"
  },
  {
    "title": "What Larry Madowo said about the filmed encounters involving Russian national",
    "desc": "A Kenyan journalist and CNN International correspondent, Larry Madowo, has revealed that a Russian national identified as Yaytselav, accused of filming his sexual escapades with several Ghanaian women, had been operating across Africa for some time.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/912/91263663.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Bulldogs legend Matt Utai hospitalised after being shot multiple times in drive-by attack",
    "desc": "Bulldogs legend hospitalised after being shot in ‘shocking’ drive-by attack as new details emerge",
    "image": "https://content.api.news/v3/images/bin/83aa9066740387481661ec86f0f74f68",
    "source": "fox sports"
  },
  {
    "title": "Sam Ruthe mile record: How a Tauranga teen’s simple routine fuels freakish speed",
    "desc": "Sam Ruthe is an anomaly. The 16-year-old recently broke Sir John Walker’s New Zealand record for the fastest mile, clocking 3m 48.88s in Boston. Over the...",
    "image": "https://www.nzherald.co.nz/resizer/v2/VOU4C52BTZCZRIWV47CBFY7OUY.jpg?auth=036b8bd707574efdc3f815f8f2f97662f64297435b629dca6812428dc5848025&width=1200&height=675&quality=70&focal=497%2C105&smart=false",
    "source": "NZ Herald"
  }
]