[
  {
    "title": "Barca taught 'lesson' in Atletico drubbing: Flick",
    "desc": "Barcelona coach Hansi Flick said his players did not work as a team and were taught a lesson in the first half of the 4-0 Copa del Rey semi-final first leg defeat by Atletico Madrid on Thursday.",
    "image": "https://s.france24.com/media/display/496eba94-0867-11f1-85af-005056a97e36/w:1280/p:16x9/88bda1bc288e09e9cd0f6a15288131c4a75a9bc4.jpg",
    "source": "France 24"
  },
  {
    "title": "DJI RS 5 Review: Refined Power for the Run-and-Gun Creator",
    "desc": "The DJI RS 5 isn’t just a minor iteration; it is a thoughtful evolution of what a mirrorless gimbal should be. While it maintains the familiar silhouette of the RS series, the quality-of-life upgrades—particularly regarding balance and automation—make it one of the most frictionless tools I’ve used in the field.",
    "image": "https://cdn.fstoppers.com/styles/medium/s3/lead/2026/02/jav04888.jpg?itok=4cYAIaB5",
    "source": "Fstoppers"
  },
  {
    "title": "'Decisions like this can decide titles' - Fans left outraged after Gabriel escapes red card in Arsenal's draw with Brentford",
    "desc": "Fans have reacted with fury and bemusement after Arsenal defender Gabriel avoided a red card against Brentford. The Brazil centre-back had been yellow carded earlier in the London derby, and was walking a disciplinary tight-rope when he brought down Dango Ouattara with a rash challenge, but he was not sent off.",
    "image": "https://assets.goal.com/images/v3/getty-2256850888/crop/MM5DCOJQGQ5DCMBXGE5G433XMU5DCMBSGI5DCNZZ/GettyImages-2256850888.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Why a hybrid pension model is Malaysia’s next essential reform",
    "desc": "Experts say a blend of private savings and guaranteed monthly base income is essential to save the next generation from old-age poverty.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2024/10/26fd723f-elderly-warga-tua-resize-fmt-151024.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Yes, Malaysians can expect annual updates to price guide for private hospitals; expanded list possible",
    "desc": "KUALA LUMPUR, Feb 13 — Did you find the new online list of estimated prices for 26 common medical procedures at Malaysia’s private hospitals useful to plan your budget, and...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/12/325268.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "In an Upset, Analilia Mejia, a Progressive, Wins a Democratic House Race",
    "desc": "Ms. Mejia, a political organizer, beat her main opponent in the New Jersey primary, Tom Malinowski, by a narrow margin after he was battered by negative ads from a pro-Israel group.",
    "image": "https://static01.nyt.com/images/2026/02/11/multimedia/00MET-NJ-MEJIA-mlzg/00MET-NJ-MEJIA-mlzg-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "President Isaac Herzog reacts to Trump's Benjamin Netanyahu pardon request",
    "desc": "President Isaac Herzog responded to US President Donald Trump's push to pardon Benjamin Netanyahu mid-flight as he returned from a four-day visit to Australia.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/699676",
    "source": "The Jerusalem Post"
  },
  {
    "title": "'John Wick' Video Game in the Works",
    "desc": "A \"John Wick\" video game is in the works from Saber and Lionsgate.",
    "image": "https://variety.com/wp-content/uploads/2026/02/John-Wick-Video-Game.jpeg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "The Jacob Elordi Wuthering Heights Casting Controversy, Explained",
    "desc": "Emerald Fennell hired her Saltburn actor Jacob Elordi to play Heathcliff in her Wuthering Heights film, but that was a controversial bit of casting. Here's why.",
    "image": "https://www.slashfilm.com/img/gallery/the-jacob-elordi-wuthering-heights-casting-controversy-explained/l-intro-1770928936.jpg",
    "source": "SlashFilm"
  },
  {
    "title": "Legacy of Kain: Ascendance, the First New Legacy of Kain Game in Over Two Decades, Is Out Next Month",
    "desc": "Crystal Dynamics has revealed the first brand new Legacy of Kain game in over two decades. It's called Legacy of Kain: Ascendance, and it's out sooner than you'd think: on March 31, 2026. That's next month!",
    "image": "https://assets-prd.ignimgs.com/2026/02/10/screen-3-kain-kill-1770744188774.png?width=1280&format=jpg&auto=webp&quality=80",
    "source": "IGN"
  }
]