[
  {
    "title": "Trump says US 'very close' to Ukraine-Russia settlement",
    "desc": "US President Donald Trump on Friday said that he believes a settlement between Ukraine and Russia may be within reach, even as he acknowledged the deep animosity between",
    "image": "https://www.nation.com.pk/digital_images/large/2026-01-31/trump-says-us-close-ukraine-russia-settlement-1769836277-5944.jpg",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "Kylie Jenner Stuns in Top With Bold Cutout After ‘The Moment’ Premiere",
    "desc": "After stunning at the Los Angeles premiere of “The Moment,” Kylie Jenner left fans in awe by posting a selfie that captured her in a top featuring a bold cutout. On January 29, she took to her Instagram Stories to share the mirror selfie she took before stepping out for the after-party. Kylie Jenner drops […] The post Kylie Jenner Stuns in Top With Bold Cutout After ‘The Moment’ Premiere appeared first on Mandatory.",
    "image": "https://s.yimg.com/os/en/mandatory_995/13e286f04c7dd8b92f415afbf9a4451f",
    "source": "Yahoo"
  },
  {
    "title": "US government partially shuts down despite funding deal",
    "desc": "The soonest the US House of Representatives can vote on the funding deal and end the shutdown is Monday.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/bb3d/live/cc76c230-fe4c-11f0-9326-27237dddd2a5.jpg",
    "source": "BBC"
  },
  {
    "title": "US government partially shuts down despite funding deal",
    "desc": "The soonest the US House of Representatives can vote on the funding deal and end the shutdown is Monday.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bb3d/live/cc76c230-fe4c-11f0-9326-27237dddd2a5.jpg",
    "source": "BBC"
  },
  {
    "title": "Singapore Art Week 2026 Redefines The Way Travelers Experience Cities Merging Art Community And Urban Exploration Into A Powerful Tourism Showcase",
    "desc": "Singapore Art Week 2026 turns the city into a living cultural destination, drawing travelers into immersive art, public spaces, and unforgettable urban experiences.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/01/istockphoto-590050726-612x612-1-1.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "I spent decades in energy. Here are the problems with UK nuclear plans",
    "desc": "IT is clear that the issue of Scotland’s moratorium on new nuclear power will be a key battle line in May’s Scottish Parliament election.",
    "image": "https://www.thenational.scot/resources/images/20486946.jpg?type=og-image",
    "source": "TheNational.scot"
  },
  {
    "title": "Charli XCX Models Chic Black Dress After ‘Wuthering Heights’ Premiere",
    "desc": "Charli XCX stepped out in a sleek after-premiere look in new paparazzi photos from Los Angeles. The pop star kept the moment minimal and camera-ready after the world premiere of “Wuthering Heights,” then arrived at the Chateau Marmont, per the X post caption. Charli XCX poses in all-black look after ‘Wuthering Heights’ premiere in LA […] The post Charli XCX Models Chic Black Dress After ‘Wuthering Heights’ Premiere appeared first on theFashionSpot.",
    "image": "https://s.yimg.com/os/en/the_fashion_spot_348/6bc00d4670d3ba11318cbb4b9b38317f",
    "source": "Yahoo"
  },
  {
    "title": "The traditions, myths and miracles of Saint Brigid",
    "desc": "Catherine Healy, Historian in Residence at EPIC, discusses the history, myths, miracles, and traditions associated with Ireland's female patron saint.",
    "image": "https://www.rte.ie/images/001d492f-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "US government enters shutdown as funding deadline passes",
    "desc": "The US government has entered a partial shutdown as a funding deadline passed without Congress approving a 2026 budget, but disruption is expected to be limited with the House of Representatives set to move early next week to ratify a Senate-backed deal.",
    "image": "https://www.rte.ie/images/0011421a-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Is Harry Styles losing his ‘Mr Perfect’ image? Six things you need to know",
    "desc": "After a three-year hiatus, the former One Directioner has announced a record-breaking tour. But this week he’s facing a backlash. Will his big comeback go to plan?",
    "image": "https://i.guim.co.uk/img/media/81a106d4c5573c5491e0abcc2f9d62fb51f8b2cb/0_0_3000_2400/master/3000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=07b149ffbac3c12436c10a216d1f084a",
    "source": "The Guardian"
  }
]