[
  {
    "title": "Infrastructure and Network Technician. at NRF National Research Foundation",
    "desc": "Postion Summary: The Digital Services unit seeks to appoint Infrastructure and Network Technician whose key responsibilities will include Key Responsibilities: Identify problems, determine cause and implement solutions:Use diagnostic tools, check connections and replace faulty components Consider potential hardware failures, driver issues and improperconfigurations Update software, fix bugs, uninstall and reinstall programs, or adjustsettings Reboot servers, […]",
    "image": "https://recruiter.careerjunction.co.za//_service/p/RecruiterSiteTypePlugin_1_0/recruiter/logpixeltrackingjobview?id=c85ea7ee-00f9-11f1-8008-02f22c7af7eb",
    "source": "it-online.co.za"
  },
  {
    "title": "Relief as government plans tax cuts for low-income earners",
    "desc": "The government plans to introduce tax amendments once Parliament resumes, aiming to ease the burden on low-income earners.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/1ImDkulvlteRYngamqgrwen9REGrg6fp7Jl963YH.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "South Africa: SA Medical Research Council Conducts Groundbreaking HIV Vaccine Trial in Humans",
    "desc": "The first participant in the BRILLIANT 011 first-in-human clinical trial for the HIV vaccine has been enrolled at the Desmond Tutu HIV Foundation (DTHF) site at the Groote Schuur Hospital.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "No exception in implementing party manifesto - Nandi-Ndaitwah",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% President Netumbo Nandi-Ndaitwa has warned Swapo members that all government deployees, without exception, must implement the party’s manifesto.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-04-at-1.05.32-PM-1.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "Maremma Teaser Promises a Dark Rural Action Drama",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/02/Marema.webp",
    "source": "123telugu.com"
  },
  {
    "title": "Lilly reports fourth-quarter 2025 financial results and provides 2026 guidance",
    "desc": "Revenue in Q4 2025 increased 43% to $19.3 billion driven by volume growth from Mounjaro and Zepbound. Q4 2025 EPS increased by 51% to $7.39 on a reported basis...",
    "image": "https://mma.prnewswire.com/media/133140/eli_lilly_and_company_logo.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "India can become largely energy self-sufficient with tech breakthroughs: Mukesh Ambani",
    "desc": "India's economic growth hinges on energy independence. Technological advancements are expected to significantly cut energy imports within a decade. This shift will strengthen India's economic resilience and reduce external vulnerabilities. Investments in energy and infrastructure will drive this multi-decade opportunity. AI is also transforming global energy systems and productivity.",
    "image": "https://img.etimg.com/thumb/msid-127909216,width-1200,height-630,imgsize-41324,overlay-economictimes/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Education PS Julius Bitok moves to save parents from exploitative uniform prices",
    "desc": "The Ministry of Education has directed all regional and county directors of education to make sure that all heads of public senior schools ...",
    "image": "https://www.radio47.fm/wp-content/uploads/2026/02/New-Project-2026-02-04T143618.585.jpg",
    "source": "radio47.fm"
  },
  {
    "title": "Find out how your local hospital is doing on cancer waits",
    "desc": "Is your local hospital service meeting the NHS waiting time targets in England?",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5ae9/live/a016f310-01ab-11f1-b6ab-2307e83ecd56.png",
    "source": "BBC"
  },
  {
    "title": "Young Chef Olympiad 2026: Global Student Delegates Engage With Goa Tourism Leadership",
    "desc": "The interaction underscored Goa’s vision of tourism as a bridge between cultures and communities worldwide",
    "image": "https://static.businessworld.in/WhatsApp Image 2026-02-04 at 16.51.20_20260204165137_ogImage_8.jpeg",
    "source": "Everything Experiential"
  }
]