[
  {
    "title": "IIHM's Young Chef Olympiad 2026 Opens in Bengaluru with Spectacle, Soul, and a Shared Heart for Food",
    "desc": "Bengaluru (Karnataka) [India], February 3: The 12th IIHM International Young Chef Olympiad (YCO) 2026 opened in Bengaluru with the kind of scale, theatre, and emotion that instantly signals a world event--an evening designed not just to 'begin' a competition, but to ignite a global movement of young culinary talent. From the very first moments, the ceremony carried the mood of an international arena: teams seated with their country buddies- IIHM students assigned to look after their wellbeing; a charged sense of anticipation in the room, and an atmosphere where tradition, innovation, and youthful ambition all shared the same spotlight.",
    "image": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYWRlYWZlMWMwLTAwYzItMTFmMS05ZTU3LWE1YjYwZTQ0ZTg4ZS5qcGc=",
    "source": "Tribune India"
  },
  {
    "title": "Australian security guard talks being involved in viral chair",
    "desc": "A Melbourne security guard involved in a viral clip didn’t realise how widespread it was until his grandmother contacted him. A security camera clip went...",
    "image": "https://www.nzherald.co.nz/resizer/v2/UA63BEPPINDWZLCAPT7YEKCQUI.png?auth=321dfe6a33b8527f31c589295625798754366756f99045d74ba84d3c12b31d12&width=1200&height=675&quality=70&focal=425%2C212&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Dump truck hits barriers, post on Commonwealth Avenue in QC",
    "desc": "A dump truck slammed into concrete barriers and a concrete post along the eastbound lane of Commonwealth Avenue in Quezon City on Tuesday, Feb. 3, after the...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/03/76344.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Mozilla Adds One-Click Option to Disable Generative AI Features in Firefox",
    "desc": "Mozilla will release Firefox 148 with a new settings toggle that lets users completely turn off all current and future generative AI features.",
    "image": "https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEiJFREHntU9jE2vdgmfzAVYrexFXt9MeruM4HiYozg9V4r-x4KdVLieGy3RgN40mWiE7m_U-d-rinldqoyYhf7hETgMSb-JI6pzdyOyCqm-Xogscv90ZTzis-Hfxe3LwKTWOLoLF52CZz6yVKTVX4Dk6AF4Ad_UwTaDQjqUw7J3DafVFVomKMVyEnoLjioB/s1700-e365/firefox.jpg",
    "source": "The Hacker News"
  },
  {
    "title": "Samuel L. Jackson: Hollywood Icon Enjoys Safari Getaway in Kenya",
    "desc": "Samuel L. Jackson recently enjoyed a luxury safari at Reteti Elephant Conservancy, feeding young elephants and sharing musical moments with Blinky Bill.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/caaee789397a10f9.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "Weather news: States on alert with high fire danger tomorrow as Australia's south",
    "desc": "South-eastern Australia has had its driest January since 2009. There will be high fire danger across the so...",
    "image": "https://imageresizer.static9.net.au/2EPIesc-c0eShv3V0hu9ONb6pY8=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F81cbd67e-f575-411b-be45-986828c339d5",
    "source": "9News.com.au"
  },
  {
    "title": "India-US trade deal effect: Rs 1.5 Nifty Call option becomes Rs 460 in one day; profit of Rs 30,000 per lot",
    "desc": "However, call sellers and put buyers would have faced heavy losses as both the benchmarks rose about 5% at the open, logging their biggest intra-day jump in five years",
    "image": "https://images.moneycontrol.com/static-mcnews/2025/09/20241109033650_sensex_nifty_stock_markets.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "Price competition likely to limit cost impact of beverage container return scheme on consumers: MSE",
    "desc": "The experience in other jurisdictions showed that the deposit return schemes did not have a significant direct impact on beverage prices or beverage sales, said Senior Minister of State for Sustainability and the Environment Janil Puthucheary.",
    "image": "https://dam.mediacorp.sg/image/upload/s--X9rnUddd--/c_crop,h_2547,w_4528,x_0,y_309/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/01/30/jus_3926_0.jpg?itok=41Ff4xMk",
    "source": "CNA"
  },
  {
    "title": "Nigeria Hands Over Africa Energy Bank Headquarters to APPO",
    "desc": "Nigeria has officially handed over the fully furnished headquarters of the Africa Energy Bank to the Association of African Petroleum Producing Countries.",
    "image": "https://economicconfidential.com/wp-content/uploads/2023/11/Heineken-Lokpobiri.jpg",
    "source": "economicconfidential.com"
  },
  {
    "title": "Renewables over 50%, wholesale prices down - is the energy transition… succeeding?",
    "desc": "It wasn’t so long ago pundits claimed Australia’s grid couldn’t run on higher than 20% renewables. Now it’s 50%.",
    "image": "https://images.theconversation.com/files/715622/original/file-20260202-56-gnhfce.jpg?ixlib=rb-4.1.0&rect=0%2C273%2C3969%2C1984&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  }
]