[
  {
    "title": "Kotoka International Airport to be changed to Accra International Airport",
    "desc": "The Majority Leader in Parliament, Mahama Ayariga, has announced the government’s plans to change the name of Kotoka International Airport.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/297/29708123.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Transport pioneer Mohamed Hood Said dies at 90",
    "desc": "Renowned businessman and former owner of Hood Bus Company in Morogoro, Mohamed Hood Said, has passed away on Monday, February 2, 2026, at his home on Mlapakoro Street, Morogoro Municipal Council...",
    "image": "https://www.thecitizen.co.tz/resource/image/5346942/landscape_ratio3x2/1200/800/b625b2499de8a2bcae9482d374708aa2/UB/hood-pic.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Eleven enforcement officers remanded over alleged RM239,000 bribery in Bintulu",
    "desc": "BINTULU (Feb 3): Eleven enforcement officers were remanded by the Malaysian Anti-Corruption Commission (MACC) Sarawak over allegations of soliciting and receiving bribes totalling RM239,000 in exchange for providing protection, refraining from intimidation, and assisting the affairs of several inmates. Magistrate Kasyfurrahman Abang Ahmad granted a four-day remand until Feb 6 for six suspects, while fourRead More",
    "image": "https://www.theborneopost.com/newsimages/2026/02/btu-030226-yy-macc-p-B.jpg",
    "source": "Borneo Post"
  },
  {
    "title": "Exiled Iranian Crown Prince Calls for Global Day of Action in Support of ‘Lion",
    "desc": "Exiled Iranian Crown Prince Reza Pahlavi on Tuesday […]",
    "image": "https://themedialine.org/wp-content/uploads/2026/01/freepik__expand__15956-e1767779505348.jpeg",
    "source": "The Media Line"
  },
  {
    "title": "Preview: Chelsea v Arsenal",
    "desc": "Read everything you need to know about our Carabao Cup semi-final second leg against Chelsea at Emirates Stadium",
    "image": "https://www.arsenal.com/sites/default/files/styles/desktop_16x9/public/images/Arsenal_CarabaoCup_Fixture_16x9_Home_Chelsea_x6jvpeai.png?h=d1ca7a6f&auto=webp&itok=BFaQfslx",
    "source": "Arsenal.com"
  },
  {
    "title": "Spotlight on hypertension in the African Continent!",
    "desc": "It is also estimated that less than half of the adults with hypertension are aware of it or on treatment.",
    "image": "https://thepoint.gm/favicon-32x32.png",
    "source": "The Point.gm"
  },
  {
    "title": "Ghana Reference Rate for February expected to decline to 14.58%",
    "desc": "The Ghana Reference Rate (GRR) for February 2026 is expected to decline to about 14.58 per cent, from the current rate of 15.68 per cent for January.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2024/10/WhatsApp-Image-2024-10-25-at-14.42.30.jpeg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Thousands without heating on icy night in Ukraine as Russia attacks before talks",
    "desc": "Zelenskyy says Putin ‘taking advantage of the coldest days of winter to terrorise people’, as Kyiv hits lows of -20C",
    "image": "https://i.guim.co.uk/img/media/8534e3978ad3e2bbcbcdfdae8079ed43df45025e/556_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=dd8599654b2f93e77606aaa7fc33e57a",
    "source": "The Guardian"
  },
  {
    "title": "Meet Mariam Aziz, President Mahama's personal sign language interpreter",
    "desc": "Iddrisu Mariam Aziz is a name that became synonymous with inclusivity during President John Mahama’s “Building the Ghana We Want Together” campaign, back in 2024.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/210/21060448.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Lily Allen shows gratitude to school mums for one major reason",
    "desc": "Lily Allen’s heart is filled with gratitude for school mums, as they supported her during her “traumatic” marriage with David Harbour.Allen and Harbour tied the knot in a 2020 Las...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-03/1390874_044227_updates.jpg",
    "source": "The News International"
  }
]