[
  {
    "title": "The Structure of Psychopathology on Reddit: Network Analysis of Mental Health Communities in Relation to the ICD Diagnostic System",
    "desc": "Background: Social media platforms such as Reddit have become important spaces where individuals articulate their distress, seek support, and explore alternative ways of understanding mental health outside traditional institutional frameworks. These environments provide an opportunity to examine mental health discourse at scale, offering perspectives that extend beyond traditional clinical and research settings.\nObjective: This study aims to examine the structure of mental health communities on Reddit by identifying patterns of association between mental disorders reflected in user activity and assessing how these relationships align with established diagnostic categories in the ICD (International Classification of Diseases).\nMethods: We manually curated 114 Reddit communities focused on specific mental health conditions from the 20,000 most active subreddits in 2022. Each community was labeled into 49 disorders and categorized under 9 ICD diagnostic categories within the group of mental and behavioral disorders, collectively known as the F codes. We constructed a disorder association network by identifying statistically significant user overlaps based on coposting across subreddit pairs using a bipartite configuration model, with Bonferroni-corrected significance (P<.001). We analyzed the connectivity of the network within and across diagnostic categories, examining inter- and intracategory links. Finally, we compared the structure of disorder associations inferred from Reddit with the ICD classification derived from diagnostic criteria using hierarchical clustering.\nResults: The inferred Reddit network of psychopathology revealed an interconnected structure (density=0.135), with all but 6 disorders forming a single giant component that spans across all 9 diagnostic categories. The most prominent disorders by number of users included hyperkinetic disorders (85,000), depressive episodes and recurrent depressive disorders (73,000), habit and impulse disorders (69,000), pervasive developmental disorders (52,000), and generalized anxiety disorder (44,000). In terms of connectivity, posttraumatic stress disorder (17/48 of all possible connections), obsessive-compulsive disorder (16/48), and depersonalization-derealization disorder (15/48) emerged as the most central in the network of positive disorder associations, while schizotypal disorder, avoidant personality disorder, and agoraphobia were the most central when accounting for the association strength. At the level of disorder categories, several disorders, such as bipolar disorder and premenstrual dysphoric disorder, displayed high intercategory associations but weak intracategory ties, indicating blurred diagnostic boundaries. The network of negative coposting associations revealed a divergence from the expectations of past research; for instance, addiction-related communities (eg, alcohol and opioids) were negatively associated with much of the broader mental health discourse. Finally, hierarchical comparisons showed moderate overlap between the Reddit network of disorder associations and the ICD network of diagnostic criteria, both in pairwise edge similarity (13% of edges present in both networks) and overall clustering (Adjusted Rand Index=0.295).\nConclusions: Reddit-based mental health communities reveal a complementary structure of disorder associations shaped by lived experience, often diverging from formal diagnostic criteria and exhibiting patterns of association that do not align with established diagnostic boundaries.",
    "image": "https://asset.jmir.pub/assets/56371c1bfde5ed475572a0668aa9e97b.png",
    "source": "Journal of Medical Internet Research (JMIR)"
  },
  {
    "title": "Natasha Cloud has stern warning for WNBA with CBA talks set to resume",
    "desc": "With a potential strike looming, players’ frustrations and concerns brewing and the WNBA collective bargaining agreement negotiations stuck at an impasse, several star players and league and union officials are scheduled to meet in New York Monday to discuss CBA matters.",
    "image": "https://nypost.com/wp-content/uploads/sites/2/2026/01/newspress-collage-isq1038up-1769809159857.jpg?quality=75&strip=all&1769791284&w=1200",
    "source": "New York Post"
  },
  {
    "title": "Luigi Mangione will not face death penalty after US judge dismisses murder charge",
    "desc": "A US judge has ruled Luigi Mangione will not face the death penalty if convicted of killing UnitedHealthcare CEO Brian Thompson.",
    "image": "https://dam.mediacorp.sg/image/upload/s--NJwpGGNI--/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2026-01-30T151820Z_2_LYNXMPEM0T0ZL_RTROPTP_3_UNITEDHEALTH-CEO-MANGIONE.JPG?itok=Gz0m2CSg",
    "source": "CNA"
  },
  {
    "title": "Millions of Jeffrey Epstein files released by US justice department",
    "desc": "Three million new documents include hundreds of mentions of Trump and emails between Epstein and a person called \"The Duke\".",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/02e3/live/289bd6d0-fe17-11f0-8a1e-69aa641f4cb6.jpg",
    "source": "BBC"
  },
  {
    "title": "Ohene Faruku launches Triple a Management to represent talent worldwide",
    "desc": "Renowned executive talent manager and entrepreneur Gervin Ohene Addo, professionally known as Ohene Faruku, has officially announced the launch of Triple A Management Ltd, a multidisciplinary management and consultancy firm focused on strategic...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/231/23116124.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "The tide takes away his work each day, but learning to let go has transformed this artist",
    "desc": "Mal Leckie has spent every morning over the past 50 years at the beach, but when illness hurt his ability to surf, he had to find a new reason to get out of bed.",
    "image": "https://live-production.wcms.abc-cdn.net.au/1566252380717f1821e73688727ac58d?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Police warn of disruptions due to protests in Auckland CBD",
    "desc": "Police urged anyone heading into the city to \"plan ahead\" to avoid being delayed by protests or police operations.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/aucklands-viaduct-harbour-QKCFO2OVQNECXGUG74GMIH2F54.jpg?auth=432679465a724d92f5150fd39d1c84b2ef9409dde22f8ecf8b23f750545945c4&quality=70&width=600&height=315&focal=960%2C540",
    "source": "1News"
  },
  {
    "title": "Trump says Iran wants a deal rather than face military action",
    "desc": "Tehran has said it will never negotiate on its missile and defence systems, but that it is open to talks.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/19b8/live/0f1f2a20-fe1e-11f0-bd36-9d8a84b498ee.jpg",
    "source": "BBC"
  },
  {
    "title": "Nylander skates at Maple Leafs practice, 'good chance' to return vs. Canucks",
    "desc": "The Toronto Maple Leafs are close to getting one of their most important pieces back in time for a Canadian tilt.",
    "image": "https://www.sportsnet.ca/wp-content/uploads/2026/01/Toronto-Maple-Leafs-William-Nylander.jpg",
    "source": "Sportsnet.ca"
  },
  {
    "title": "Ava Announces WWE Departure: 'It Has Been An Honor & A Privilege'",
    "desc": "\"WWE NXT\" General Manager Ava, whose real name is Simone Johnson, daughter of The Rock, announced her WWE departure on Friday.",
    "image": "https://www.wrestlinginc.com/img/gallery/ava-announces-wwe-departure-it-has-been-an-honor-a-privilege/l-intro-1769809214.jpg",
    "source": "Wrestling Inc."
  }
]