[
  {
    "title": "Don’t give Moltbook and OpenClaw unfettered access to your systems, warn experts",
    "desc": "“I do not think any enterprises or any individuals should be spinning it up in a serious way and giving it real access, flat out,” HackerOne expert says.",
    "image": "https://cdn.sanity.io/images/bl383u0v/production/1973dfa0dadaf940e1412b72e4645e05353b705a-2000x1334.jpg?rect=0,142,2000,1050&w=1200&h=630&q=70&fit=crop&auto=format",
    "source": "IT Brew"
  },
  {
    "title": "NIH scraps policy that classified basic research in people as clinical trials",
    "desc": "The policy aimed to increase the transparency of research in humans but created “a bureaucratic nightmare” for basic neuroscientists.",
    "image": "https://www.thetransmitter.org/wp-content/uploads/2026/02/cropped-525-social-NIH-policy-change-paperwork-research-clinical-trials-1.png",
    "source": "The Transmitter"
  },
  {
    "title": "'Monster's Paradise' lampooning Trump has world premiere at Hamburg Opera",
    "desc": "Tobias Kratzer unveils his world premiere production of “Monster's Paradise,” a satirical opera lampooning U.S. President Donald Trump.",
    "image": "https://dims.apnews.com/dims4/default/4887fd6/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fba%2Ff8%2F29167680552e2e72c7c64914f844%2F82bb34bf90b94143b4e7ecd576135a08",
    "source": "AP News"
  },
  {
    "title": "'Love Story: John F. Kennedy Jr. & Carolyn Bessette' gets official trailer",
    "desc": "FX released the trailer for \"Love Story: John F. Kennedy Jr. & Carolyn Bessette\" on Tuesday, Feb. 3.",
    "image": "https://i.abcnewsfe.com/a/fe828e54-6b48-42fc-8c0e-18b5c0caec3c/LOVESTORY-FX-AB-260203_1770144649948_hpMain_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Ted Danson’s Retirement Just Got Cancelled Again: A Man on the Inside Renewed for Season 3",
    "desc": "A Man on the Inside renewed for Season 3 as Ted Danson’s cardigan-clad spy keeps cracking cases on Netflix.",
    "image": "https://static.wixstatic.com/media/94ff92_7d878c66044242129d02438e2faa0824~mv2.jpg/v1/fill/w_1000,h_500,al_c,q_85,usm_0.66_1.00_0.01/94ff92_7d878c66044242129d02438e2faa0824~mv2.jpg",
    "source": "The TV Cave"
  },
  {
    "title": "Advanced paramedic played vital role in saving life of Loughglynn man",
    "desc": "“You don’t get to choose the day you get sick. We don’t have that luxury.”",
    "image": "https://www.roscommonherald.ie/cms_media/module_img/7664/3832125_6_articledetail_Ambulance.jpg",
    "source": "roscommonherald.ie"
  },
  {
    "title": "Sydney students tackle climate change livability as world records hottest three years",
    "desc": "The designs include cooling devices for street lights, air-purifying pods for train stations and re-imagined bus shelters to improve livability, after the world records its hottest three years ever.",
    "image": "https://live-production.wcms.abc-cdn.net.au/240aa117f3ca8f6b87e574c01d0681d3?impolicy=wcms_watermark_news&cropH=1125&cropW=2000&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Teen stabbed following Vancouver high school basketball game",
    "desc": "The assault occurred shortly after 9 p.m. at Eric Hamber Secondary, as a game between the Eric Hamber and Killarney Secondary basketball teams was concluding, police said.",
    "image": "https://globalnews.ca/wp-content/uploads/2011/09/erichamber.jpg?quality=65&strip=all&w=620&h=379&crop=1",
    "source": "Global News"
  },
  {
    "title": "Cosmic radiation brought to light: Researchers measure ionization in dark cloud for the first time",
    "desc": "Where starlight doesn't reach, new things are born: For the first time, an international research team has directly measured the effect of cosmic radiation in a cold molecular cloud. The observation shows how charged high-energy particles influence the gas in these lightless regions where stars are formed. Dr. Brandt Gaches, head of the Emmy Noether Group Towards the Next Generation in Cosmic Ray Astrochemistry at the University of Duisburg-Essen, was part of the effort to propose and observe these effects with the James Webb Space Telescope and provided support through astrochemical models of cosmic-ray chemistry. The findings are published in Nature Astronomy.",
    "image": "https://scx2.b-cdn.net/gfx/news/hires/2026/researchers-directly-m.jpg",
    "source": "Phys.org"
  },
  {
    "title": "Ronan O'Gara: Ireland's 10 conversation has turned nasty",
    "desc": "The legendary out-half fears the suffocating fear of Sam Prendergast, Jack Crowley or even Harry Byrne fouling up an opportunity in green is doing neither them or Irish rugby any good.",
    "image": "https://www.irishexaminer.com/cms_media/module_img/9911/4955999_8_seoimageog_3331427.jpg",
    "source": "Irish Examiner"
  }
]