[
  {
    "title": "Ruto urges shift from AfCFTA negotiations to full implementation",
    "desc": "The African Continental Free Trade Area, (AfCFTA), must now move decisively from negotiation to implementation so that it delivers tangible benefits to Africa’s 1.4 billion people, President William Ruto has said. The President said that by bringing African markets together, the AfCFTA will lay the foundation for structural economic transformation by accelerating industrialisation, deepening value […]",
    "image": "https://www.kbc.co.ke/wp-content/uploads/2026/02/RUTO-ADDIS-2.jpg",
    "source": "KBC Digital"
  },
  {
    "title": "Govinda wins hearts by refusing anti-Pakistan role",
    "desc": "Bollywood veteran Govinda, famed for his iconic comic timing, energetic dance moves, and hit films like Hero No. 1, Coolie No. 1, Raja Babu, and Partner,",
    "image": "https://minutemirror.com.pk/wp-content/uploads/og-cache/dc14bc39e4ca83f543a8094e6b776bfe.jpg",
    "source": "Minute Mirror"
  },
  {
    "title": "Rocky planet discovered in outer orbit challenges planet formation theory",
    "desc": "Astronomers have uncovered a distant planetary system that flips a long-standing rule of planet formation on its head. Around the small red dwarf star LHS 1903, scientists expected to find rocky planets close in and gas giants farther out — the same pattern seen in our own Solar System and hundreds of others. And at first, that’s exactly what they saw. But new observations revealed a surprise: the outermost planet appears to be rocky, not gaseous.",
    "image": "https://www.sciencedaily.com/images/1920/lhs-1903-planetary-system.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Rocky planet discovered in outer orbit challenges planet formation theory",
    "desc": "Astronomers have uncovered a distant planetary system that flips a long-standing rule of planet formation on its head. Around the small red dwarf star LHS 1903, scientists expected to find rocky planets close in and gas giants farther out — the same pattern seen in our own Solar System and hundreds of others. And at first, that’s exactly what they saw. But new observations revealed a surprise: the outermost planet appears to be rocky, not gaseous.",
    "image": "https://www.sciencedaily.com/images/1920/lhs-1903-planetary-system.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Winter Olympics 2026: How to watch Australia live - full schedule and medal events on Sunday 15 February",
    "desc": "Find out everything you need to know about Australia’s Olympians on Day 9 of Milano Cortina 2026.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/rjpwsm6thdqvz69oyefw",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Gen Z's Obsession or Brands' Marketing Strategy?",
    "desc": "Bengaluru witnessed an unusual phenomenon on Valentine's Day morning. Youngsters swarmed before Nothing's flagship retail store in the city. Usually, such",
    "image": "https://cdn.gulte.com/wp-content/uploads/2026/02/nothing-craze.jpg",
    "source": "Gulte"
  },
  {
    "title": "DGCA slaps Rs 1-cr fine on Air India for operating plane without requisite certification",
    "desc": "Air India has been fined ₹1 crore by the DGCA for operating an Airbus aircraft eight times without a valid airworthiness permit. The regulator also suspended two senior executives responsible for the airline's Continuing Airworthiness Management Organisation, citing a lapse that eroded public trust in aviation safety.",
    "image": "https://img.etimg.com/thumb/msid-128309415,width-1200,height-630,imgsize-108904,overlay-economictimes/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Today's NYT Mini Crossword Answers for Feb. 14",
    "desc": "Here's today's NYT Mini Crossword answer. These answers will help you solve New York Times' popular crossword game, Mini Crossword, every day!",
    "image": "https://www.cnet.com/a/img/resize/4a7dc34963db8f9a51abae1ab77ec99b498be36f/hub/2024/07/25/50d61b9b-1c76-4678-9a92-f6eca531f4a8/nyt-mini-crossword-234876.jpg?auto=webp&fit=crop&height=675&width=1200",
    "source": "CNET"
  },
  {
    "title": "Bomb scare on Kolkata-Shillong IndiGo flight, plane grounded - what we know so far",
    "desc": "The incident took place on board flight 6E 3074, which was scheduled to depart the Netaji Subhas Chandra Bose International Airport at 9.15 am.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/14/1600x900/logo/INDIA-AVIATION-AIRBUS-7_1771047450717_1771047461699.JPG",
    "source": "Mint"
  },
  {
    "title": "Film Factory Nabs Awaited Spanish Comedy 'Torrente for President'",
    "desc": "Pic is tipped to become the highest-grossing Spanish film of the year in Spain by a large head.",
    "image": "https://variety.com/wp-content/uploads/2026/02/Torrente-for-President.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  }
]