[
  {
    "title": "Carlos Alcaraz vs Novak Djokovic LIVE Score, Australian Open 2026 Men's Singles Final: Alcaraz Beats Djokovic To Win 1st Aus Open Title, Creates History",
    "desc": "Australian Open 2026 Men's Singles Final LIVE Updates, Carlos Alcaraz vs Novak Djokovic: World World No. 1 Carlos Alcaraz has become the youngest men's player to win all four Grand Slam singles' titles.",
    "image": "https://c.ndtvimg.com/2026-02/16r52k48_carlos-alcaraz_625x300_01_February_26.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
    "source": "NDTV Sports"
  },
  {
    "title": "How a crippled NPP delegate crawled over 30m to vote in the flagbearer primaries",
    "desc": "While the several hundreds of delegates across Ghana walked into their polling stations with ease on Saturday, January 31, 2026, Frank Nti’s journey to vote was anything but ordinary.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/599/59908089.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Second Measles Case Lands at LAX",
    "desc": "The Los Angeles County Department of Public Health (LACDPH) announced yesterday that it is investigating a new confirmed case of measles in an individual who recently returned from international travel. This case, the second reported in the county as of February 1, 2026, involves a traveler who was infectious while passing through Los Angeles International Airport (LAX) and visiting at least one other public location.",
    "image": "https://www.vax-before-travel.com/sites/default/files/styles/article_metadata/public/lax-tips-and-shortcuts.jpg",
    "source": "Vax-Before-Travel"
  },
  {
    "title": "Fresh flood risk after rain warning for eight counties",
    "desc": "Met Éireann has warned of further flooding after issuing a Status Yellow rain warning for counties Carlow, Kilkenny, Wexford, Cork, Waterford, Dublin, Louth, Wicklow for tomorrow.",
    "image": "https://www.rte.ie/images/00213334-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "More goals than Cristiano Ronaldo! Why Ivan Toney followed CR7 to the Saudi Pro League as England World Cup hopeful makes bold Premier League statement",
    "desc": "Ivan Toney has explained why he followed Cristiano Ronaldo to the Saudi Pro League, with the England World Cup hopeful netting more goals in that division this season than Portuguese GOAT CR7. Toney has also delivered a bold statement regarding the standard of competition in the Middle East and that which he previously graced in the Premier League.",
    "image": "https://assets.goal.com/images/v3/blt675621666f985c8f/GOAL%20-%20Multiple%20Images%20-%202%20Split%20-%20Facebook%20-%202026-02-01T110505.966.png",
    "source": "Goal.com"
  },
  {
    "title": "Manchester United vs Fulham LIVE: Premier League result, latest updates and fan reaction",
    "desc": "Red Devils continue Michael Carrick resurgence at Old Trafford in remarkable finish",
    "image": "https://static.standard.co.uk/2026/02/01/16/14/benjaminseskomanchesterunitedfulham01022026b-jpg.jpeg?width=1200&auto=webp&quality=75",
    "source": "London Evening Standard"
  },
  {
    "title": "Israelis let NIS 1.5 trillion slowly evaporate",
    "desc": "Leaving large amounts in a bank current account is not a conservative choice - it's a choice to lose money.",
    "image": "https://res.cloudinary.com/globes/image/upload/t_800X392/v1721119036/COT_Pic/400_lczqej.jpg",
    "source": "Globes - Israel Business News"
  },
  {
    "title": "Hot comments on social media under scrutiny by police, AGC",
    "desc": "The IGP, Khalid Ismail, said 'everyone wants to comment to a point where they sometimes go beyond the law, which then requires legal action'.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/03/3f7f72f5-mobile-phone-file-pic-13-225-resize.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Preparations have begun for reopening of Gaza’s Rafah crossing, officials say",
    "desc": "Israel says residents will be allowed to cross on foot only, with a reported 20,000 Palestinians waiting to leave for medical care",
    "image": "https://i.guim.co.uk/img/media/8124d5a33d79995a4484c4701b874e1f050c8da0/670_0_3750_3000/master/3750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6780ba7fc0129e13e15b3673c5ee16c3",
    "source": "The Guardian"
  },
  {
    "title": "Iran says it now considers EU militaries to be terrorist groups",
    "desc": "The speaker of Iran's parliament says that the Islamic Republic now considers all European Union militaries to be terrorist groups",
    "image": "https://s.abcnews.com/images/US/abc_news_default_2000x2000_update_16x9_992.jpg",
    "source": "ABC News"
  }
]