[
  {
    "title": "Farage attack on high street Turkish barber shops is dog-whistle racism, minister says",
    "desc": "Miatta Fahnbulleh accuses Reform leader of ‘politics of grievance’ while having no plan to fix UK high streets",
    "image": "https://i.guim.co.uk/img/media/d5ac37a971ece8065d39beb6fa2027e58ade0035/456_190_3338_2670/master/3338.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d3ae09469e1b8a1a6510af2aa09c8aa1",
    "source": "The Guardian"
  },
  {
    "title": "Sialkot Stallionz Appoint Former Australian Captain as Head Coach",
    "desc": "Sialkot Stallionz have officially announced former Australia captain Tim Paine as their head coach for the 2026 Pakistan Super League (PSL 11), confirming",
    "image": "https://propakistani.pk/wp-content/uploads/2026/01/sialkot-1.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "BBC Verify: Ship-tracking shows arrival of new US warship in Gulf as Iran tensions rise",
    "desc": "Latest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8541/live/f07cd8b0-fcfb-11f0-9972-d3f265c101c6.png",
    "source": "BBC"
  },
  {
    "title": "Girl, 12, strangled and raped in Nuneaton, court hears",
    "desc": "Ahmad Mulakhil and Mohammad Kabir deny offences against the youngster in Nuneaton.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6c77/live/35dbf830-fcf9-11f0-a871-2dc7e156bd40.jpg",
    "source": "BBC"
  },
  {
    "title": "‘Worrying’ rise in repeated self-harming among teenagers, study finds",
    "desc": "Rates significantly higher among females, trans and gender-diverse adolescents, and early school leavers",
    "image": "https://www.irishtimes.com/resizer/v2/VT6KZEHTS5HQ7KSVMK3ZSGXOGI.jpg?smart=true&auth=24f1348bc5c93ed24669d8c1cc0a515a7bd84db87ac19d8a15f24a4e5e654a2b&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Ethioipia's Finance Minister Advocates Regional Energy Integration",
    "desc": "Addis Ababa, January 28, 2026 (ENA) -Finance Minister Ahmed Shide emphasized the critical importance of energy integration for interconnected growth and stability across the Horn region, called for continued support during the 27th Horn of Africa Initiative (HoAI) Ministerial Meeting held in Mogadishu, Somalia.\nThe high-level assembly, which brought together finance ministers and prominent development partners, focused on accelerating energy access financing and deepening regional ties.\nDuring the deliberations, Ahmed articulated a vision of shared prosperity rooted in energy cooperation, highlighting its role as a cornerstone for stability and development in the Horn of Africa.\nThe Minister presented Ethiopia’s ambitious National Energy Compact, a strategic roadmap requiring over 9 billion USD to achieve universal electricity access by 2030.\nHe underscored Ethiopia's significant strides in expanding renewable energy generation and its unwavering commitment to bolstering regional interconnections through shared infrastructure.\nThe meeting reaffirmed the vital nature of the energy sector, with partners pledging to leverage regional windows and private-sector investment to bridge the energy gap.\nPartners confirmed their commitment to financing new power grid links with Somalia and South Sudan, building upon Ethiopia’s existing successful connections with Sudan, Djibouti, and Kenya.\nParticipants at the forum also recognized the transformative potential of the Grand Ethiopian Renaissance Dam (GERD) as a primary engine for sustainable development and regional empowerment.\nRepresentatives from the World Bank, African Development Bank, and the European Union reaffirmed their support for initiatives like Mission 300, which aims to advance universal energy access.\nTo ensure seamless progress, the ministers agreed to establish a high-level committee dedicated to policy harmonization and the acceleration of regional energy integration.\nFollowing the session, Minister Ahmed Shide attended an official dinner hosted by the President of Somalia, fostering further diplomatic engagement among the initiative's participants.",
    "image": "https://www.ena.et/documents/42142/0/ahmed+main.jpg/fb754e6d-74b1-f09c-cbdf-651845794fbe?version=1.0&t=1769686622236&download=true",
    "source": "ENA English"
  },
  {
    "title": "School teacher banned after drinking can of beer in classroom and eating mints after every sip",
    "desc": "A primary school teacher has been banned from teaching indefinitely after he was caught drinking a can of beer in the classroom and eating a mint after every sip.",
    "image": "https://focus.independent.ie/thumbor/ZuXjv6OpuJL8OzhPxjME7vIze_s=/336x0:3253x1945/629x0/prod-mh-ireland/505fea4e-0b36-4518-a78f-1bf7595df532/08e20b2a-1020-4035-8272-6db82e78a5f6/505fea4e-0b36-4518-a78f-1bf7595df532.jpg",
    "source": "The Irish Independent"
  },
  {
    "title": "Ocado says Canadian partner closing robotic warehouse in latest setback",
    "desc": "Shares in Ocado fall almost 10% after revealing Sobeys will close Calgary site that uses UK group’s delivery technology",
    "image": "https://i.guim.co.uk/img/media/f631542e919ff5312b9f222fe7bd5eaafd427de4/282_0_3018_2414/master/3018.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8f947e0133219df661880373a1947d78",
    "source": "The Guardian"
  },
  {
    "title": "Malaysia’s women’s singles players shine at Thailand Masters",
    "desc": "All three women's singles players in the tournament, K Letshanaa, Wong Ling Ching and Goh Jin Wei, have qualified for the quarter-finals.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/01/30ec6a50-k-letshanaa-wong-ling-ching-goh-jin-wei-collage-290126-2.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Path2Response Names Bruce Hammer Senior Vice President of Nonprofit Solutions",
    "desc": "Driving mission-critical results by leveraging real-time behavioral data and modern modeling to identify high-value donor audiences.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/01/29/917416.jpg",
    "source": "The Manila Times"
  }
]