[
  {
    "title": "Thomas Frank confirms Tottenham transfer decision as January deadline nears",
    "desc": "Spurs will not be looking for another striker this month",
    "image": "https://static.standard.co.uk/2026/01/31/12/20/SEI282671760.jpeg?width=1200&auto=webp&quality=75",
    "source": "London Evening Standard"
  },
  {
    "title": "Budget 2026: What gets cheaper and costlier",
    "desc": "Budget 2026: Nirmala Sitharaman, presenting her ninth Budget, introduced significant changes in customs duties that would impact both consumers and industries across India. Here's a look at what gets cheaper for the aam aadmi.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/budget-2026-cheaper--costlier-010946318-16x9_0.jpg?VersionId=9Z3p8.f10zpf3jmLulNpTNgGsrJh63QD",
    "source": "India Today"
  },
  {
    "title": "DHSUD: Over 400 families to benefit from Occidental Mindoro mass housing",
    "desc": "More than 400 families are set to benefit from the mass housing projects in Mamburao, Occidental Mindoro, the first ever horizontal housing units under the...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/01/75936.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Man Utd vs. Fulham: Michael Carrick out to equal Ruben Amorim best in Premier League showdown",
    "desc": "Manchester United interim Michael Carrick could already equal a Ruben Amorim Red Devils best in Sunday's Premier League showdown with Fulham at Old Trafford.",
    "image": "https://www.sportsmole.co.uk/thumbor/seFKSqtBxKIGQ16rpDf63K8jyCg=/720x410/smart/filters:format(webp)/https%3A%2F%2Fsportsmole-media-prod.s3.gra.io.cloud.ovh.net%2Fuploads%2F2026%2F02%2Fns-2-photo-frame-email-sportmole-6-697ef7833c6bc440280415.jpg",
    "source": "Sports Mole"
  },
  {
    "title": "Kazakhstan Celebrates Civil Aviation Worker’s Day: Honoring the Unsung Heroes Who Keep the Skies Open and Ensure Seamless Travel for Global Explorers",
    "desc": "Kazakhstan celebrates Civil Aviation Worker’s Day on February 1, honoring aviation professionals. Discover their role in shaping the country's travel.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/a-cinematic-photograph-of-a-sleek-commer_h96gpiyARh6Ov87O4jaqSA_cOI3d3yhSrueYywWVEeLPA.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "Four people who ‘shocked’ Kennedy Agyapong in the 2026 presidential primaries",
    "desc": "The Member of Parliament for Assin Central, Kennedy Agyapong, lost his highly anticipated New Patriotic Party (NPP) presidential primaries held on January 31, 2026.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/603/60305400.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "speed rail and rare earth corridors among key announcements by FM Nirmala Sitharaman",
    "desc": "India Business News: NEW DELHI: Union finance minister Nirmala Sitharaman on Sunday presented the Budget for the financial year 2026–27 in the Lok Sabha during the ongoing.",
    "image": "https://static.toiimg.com/thumb/msid-127835273,width-1280,height-720,imgsize-1391780,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "A hidden bat virus is infecting humans",
    "desc": "Researchers in Bangladesh have identified a bat-borne virus, Pteropine orthoreovirus, in patients who were initially suspected of having Nipah virus but tested negative. All had recently consumed raw date-palm sap, a known pathway for bat-related infections. Genetic analysis confirmed live virus in several samples, pointing to active human infection. The finding raises concerns that dangerous bat viruses may be circulating undetected alongside Nipah.",
    "image": "https://www.sciencedaily.com/images/1920/nipah-virus-disease.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "A hidden bat virus is infecting humans",
    "desc": "Researchers in Bangladesh have identified a bat-borne virus, Pteropine orthoreovirus, in patients who were initially suspected of having Nipah virus but tested negative. All had recently consumed raw date-palm sap, a known pathway for bat-related infections. Genetic analysis confirmed live virus in several samples, pointing to active human infection. The finding raises concerns that dangerous bat viruses may be circulating undetected alongside Nipah.",
    "image": "https://www.sciencedaily.com/images/1920/nipah-virus-disease.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Govt targets youth, women in cooperative drive",
    "desc": "DODOMA: The Minister of Agriculture, Mr Daniel Chongolo, has directed the newly inaugurated Board of Commissioners of the Tanzania Cooperative Development Commission (TCDC) to ensure that special groups are fully engaged in the cooperative sector so they can tap into available economic opportunities. He issued the directive in Dodoma recently while inaugurating the Board, noting that",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/USHIRIKA-BOARD.jpg",
    "source": "dailynews.co.tz"
  }
]