[
  {
    "title": "'Stark reminder' of Chorley Old Road driver who killed man",
    "desc": "A driver who was on ketamine when he killed a well-loved young motorcyclist shows how “even a moment can be fatal”, police say.",
    "image": "https://www.theboltonnews.co.uk/resources/images/20593933.jpg?type=og-image",
    "source": "The Bolton News"
  },
  {
    "title": "Bridgerton actress finds it 'amazing' that the show disregards her disability",
    "desc": "Gracie McGonigal hopes her performance in the Netflix show will be relatable to others who view having a disability as \"a very, very small part of their lives\".",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--a9kg-mjl--/t_tohu-badge-facebook/f_auto/q_auto/4JSNSMO_d1b8a823_85d5_4183_8efd_820e74031ad8_jfif?_a=BAMABkiu0",
    "source": "RNZ"
  },
  {
    "title": "'He was my dorm mate': Former Dep. GES Director settles debate over Chairman Wontumi’s Prempeh College credentials",
    "desc": "Dr Kwabena Bempah Tandoh, a former Deputy Director-General of the Ghana Education Service (GES), has finally put to rest the long-standing public scepticism regarding the educational background of the NPP’s Ashanti Regional Chairman, Bernard Antwi Boasiako, popularly known as Chairman Wontumi.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Wuntomi-classmate.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Montana cowboys help build trauma ranch for Israeli soldiers",
    "desc": "Group of devout Christian cowboys from Montana trades the open range for the hills of West Bank, helping build a trauma center for Israeli soldiers and at-risk youth, keeping Shabbat and blessing bread: 'We witness redemption in real time'",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/19/rk7PYk004dbx/rk7PYk004dbx_211_350_1814_1021_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Starting grid for the 2026 Thai MotoGP Sprint race",
    "desc": "The full starting grid for the 2026 Thai MotoGP Sprint race at Buriram.",
    "image": "https://cdn.crash.net/2026-02/gng_1294869_hires_1600x900.jpg?width=1600&aspect_ratio=16:9",
    "source": "crash.net"
  },
  {
    "title": "The Royal Suite by Kelvin Thengono: A Tide of Calm",
    "desc": "The No.1 Design Magazine in Indonesia",
    "image": "https://res.cloudinary.com/indonesiadesign/image/upload/ar_1:1,f_auto,fl_progressive,w_1080/JOSA0224.jpg",
    "source": "Indonesia Design"
  },
  {
    "title": "MTN Ghana rings in massive GH¢7.8 bn profit as digital and fintech revenues surge",
    "desc": "Telecommunications giant Scancom PLC (MTN Ghana) has cemented its market leadership with a stellar 2025 fiscal report, announcing a 55.9 per cent leap in profit after tax to GH¢7.8 billion.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2024/05/Stephen-Blewett-CEO-MTN-GHANA_top.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Two Ghanaian footballers face trial in India over rape allegations",
    "desc": "Two Ghanaian footballers arrested in India on rape charges have remained in custody for nearly three years and are scheduled to appear in court on March 19, 2026, as their families intensify calls for government support.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/838/83897299.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Man injured in shooting in Auckland's Papakura",
    "desc": "Police officers were carrying out patrols in the Clevedon Rd area when they heard what they believed to be gunshots.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/armed-police-at-the-scene-in-aucklands-papakura-3H6CKHZBU5FQFK7Y3UPAJPH4VA.png?auth=81a3b343dd746aea4ca623f186ae801cd06abd05d942cbd0f446cb5498dc6f78&quality=70&width=600&height=315&focal=921%2C522",
    "source": "1News"
  },
  {
    "title": "Busayo Olanipekun: Expanding responsible retail credit access in Nigeria",
    "desc": "Busayo Olanipekun is a seasoned credit professional with extensive experience in banking and financial risk management. He began his...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2026/02/Busayo-Olanipekun-Expanding-responsible-retail-credit-access-in-Nigeria.png",
    "source": "Businessday NG"
  }
]