[
  {
    "title": "T20 World Cup: Shimron Hetmyer and Romario Shepherd guide West Indies to win against Scotland",
    "desc": "Scotland begin their T20 World Cup campaign with a 35-run defeat by two-time champions West Indies at Eden Gardens.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2c7/live/8f18b190-0424-11f1-8744-693d5d88296e.jpg",
    "source": "BBC"
  },
  {
    "title": "T20 World Cup: Shimron Hetmyer and Romario Shepherd guide West Indies to win against Scotland",
    "desc": "Scotland begin their T20 World Cup campaign with a 35-run defeat by two-time champions West Indies at Eden Gardens.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/b2c7/live/8f18b190-0424-11f1-8744-693d5d88296e.jpg",
    "source": "BBC"
  },
  {
    "title": "Community in mourning following shock death of 'truly wonderful' young Wicklow nurse",
    "desc": "The Trinity College student \"showed a genuine eagerness to learn and a natural compassion in the care she gave the patients\"",
    "image": "https://i2-prod.irishmirror.ie/article36685722.ece/ALTERNATES/s1200/0_f94b92d6-5f86-496a-b035-2ef9f70edf0c_4c134c245322df5834e879ce996591aa57c21a3a8730c253.jpg",
    "source": "Irish Mirror"
  },
  {
    "title": "Ethiopian Kerchanshe, Brazil’s Embrapa Ink Landmark Coffee Technology Pact",
    "desc": "Addis Ababa, February 7, 2026 (ENA)—Ethiopian Kerchanshe Group and Brazil’s Agricultural Research Corporation (Embrapa) have signed a cooperation agreement aimed at strengthening collaboration in agricultural technology, with a particular focus on coffee development and modern production systems.\nThe agreement was concluded a day after the historic Ethiopia–Brazil Trade and Investment Forum held in Addis Ababa, signaling concrete follow-up action to elevate bilateral economic ties to a new level.\nThe partnership will focus on coffee development in Debeka, Abaya Woreda, West Guji Zone of Oromia region.\nUnder the agreement, the two institutions will jointly work on agricultural quality enhancement and control systems, capacity-building for workers, and other related areas of cooperation.\nSpeaking at the signing ceremony, State Minister of Agriculture Efa Muleta said the agreement will play a significant role in Ethiopia’s economic growth.\nHe emphasized that the government will provide close follow-up and necessary support to ensure the agreement is effectively implemented and delivers tangible results.\nENA reported from the spot that the agreement was signed in the presence of senior government officials and invited guests, including Brazilian Ambassador to Ethiopia Jandyr Ferreira dos Santos and Embrapa President Silvia Maria Fonseca Silveira Massruhá.\nKerchanshe Group Chief Executive Officer Israel Degafa, for his part, noted that Ethiopia and Brazil share many similarities in the agricultural sector.\nHe stated that the agreement framework will help elevate cooperation between the two countries to a higher level, particularly through the transfer of Brazil’s agricultural development experience—especially in coffee development and technology transfer.\nAccording to information shared during the event, Kerchanshe currently exports coffee seedlings to more than 20 countries, underscoring Ethiopia’s expanding footprint in global coffee value chains.\nThe signing ceremony comes on the heels of the largest-ever Ethiopia–Brazil Trade and Investment Forum, held in Addis Ababa on February 6, 2026.\nEmbrapa, a leading research institution under Brazil’s Ministry of Agriculture, Livestock and Food Supply, plays a central role in transforming tropical agriculture through science-driven and sustainable solutions.\nThe corporation is known for its expertise in research, development and innovation (RD&I), including plant genetic improvement, soil-plant systems, bio-inputs, and climate-smart agricultural practices.\nThrough its international cooperation arm, Embrapa has been expanding partnerships across Africa and Latin America, promoting knowledge exchange, technical capacity-building, and technology transfer to address shared ecological and agricultural challenges.\nIts focus on sustainable agriculture, low-carbon production systems, and innovation-driven solutions aligns closely with Ethiopia’s efforts to modernize its agricultural sector, enhance productivity, and strengthen food security.\nThe newly signed agreement is therefore expected to serve not only as a bilateral business arrangement but also as a strategic bridge for technology transfer and long-term collaboration in tropical agriculture—particularly in coffee, a flagship export commodity for Ethiopia.\nWith both countries recognized as global coffee powerhouses, the partnership signals a new chapter in leveraging research, innovation, and South-South cooperation to boost value addition, quality standards, and competitiveness in international markets.",
    "image": "https://www.ena.et/documents/42142/0/631327684_1225966203069123_5925589266758041817_n.jpg/53ba46c7-2988-47e3-5fe8-493c976c45b8?version=1.0&t=1770469704674&download=true",
    "source": "ENA English"
  },
  {
    "title": "Cristian Romero sees red AGAIN after Tottenham captain's reckless challenge on Casemiro - days after criticising club's leadership",
    "desc": "Tottenham captain Cristian Romero was shown a straight red card for the second time this season following reckless challenge on Casemiro.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/07/13/106186901-0-image-a-6_1770469749592.jpg",
    "source": "dailymail.co.uk"
  },
  {
    "title": "Police seek suspect after TTC employee threatened",
    "desc": "Toronto police are requesting the public’s help identifying a suspect who they say is for making a threat against a TTC employee late last year.",
    "image": "https://www.cp24.com/resizer/v2/WOAKZZP27ZHLDKMSIWBZA27JUM.jpeg?smart=true&auth=adb2bc59d68be9646d7c2c164baf5b95278a0caab1070954039952084197f260&width=1200&height=630",
    "source": "CP24"
  },
  {
    "title": "Pressure mounts on American Airlines CEO as carrier lags rivals",
    "desc": "American Airlines made $111 million last year, while rivals Delta Air Lines and United Airlines, brought in $5 billion and $3.3 billion, respectively.",
    "image": "https://image.cnbcfm.com/api/v1/image/108240178-1765397940981-gettyimages-2250480480-ISOM_INTERVIEW.jpeg?v=1765398222&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Winter Olympics 2026: Franjo von Allmen wins first gold of Games in downhill",
    "desc": "Swiss Alpine skier Franjo von Allmen becomes the first champion of the 2026 Winter Olympics in the downhill.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/97d4/live/82e142c0-0433-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Winter Olympics 2026: Franjo von Allmen wins first gold of Games in downhill",
    "desc": "Swiss Alpine skier Franjo von Allmen becomes the first champion of the 2026 Winter Olympics in the downhill.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f41a/live/0752c4a0-0422-11f1-8744-693d5d88296e.jpg",
    "source": "BBC"
  },
  {
    "title": "Gemini just saved me $419.20 with a single prompt",
    "desc": "Thanks to Gemini's advice, I got a 20% discount on my purchase that was over two grand, saving me more than $400.",
    "image": "https://www.androidauthority.com/wp-content/uploads/2026/01/Samsung-Galaxy-A56-gemini-app.jpg",
    "source": "Android Authority"
  }
]