[
  {
    "title": "NSW Waratahs defeat Fijian Drua in Super Rugby Pacific round two, Pete Samu plays after birth of child",
    "desc": "Wallabies veteran Pete Samu has helped the NSW Waratahs to consecutive wins to start the Super Rugby Pacific season, just hours after the birth of his child.",
    "image": "https://live-production.wcms.abc-cdn.net.au/1f52e16838eceb53ce6568ae3a490c5d?impolicy=wcms_watermark_news&cropH=2040&cropW=3626&xPos=252&yPos=252&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Protest planned at FAI headquarters over Ireland's Nations League matches against Israel",
    "desc": "Ireland has been drawn into the same group as Israel, Austria and Kosovo for the Nations League.",
    "image": "https://img2.thejournal.ie/article/6962619/river/?height=400&version=6962673",
    "source": "The Journal"
  },
  {
    "title": "Rare Watches Inspired by Apple and Google Employees Go on Sale",
    "desc": "Watch collector clubs inside Apple and Google have collaborated with watchmaker Tudor on limited-edition timepieces that are available for resale.",
    "image": "https://i.insider.com/69977d70a645d1188189a1ef?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "Southville International School and Colleges signs clean energy partnership with First Gen",
    "desc": "Southville International School and Colleges (SISC) has officially signed a Memorandum of Agreement with First Gen Corporation (FGEN), the country’s leading...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/20/80793.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "UK Athletics admits causing death of Paralympian hit on head by pole",
    "desc": "Abdullah Hayayei, 36, who represented the United Arab Emirates, was fatally injured at Newham Leisure Centre, east London, nine years ago. The national governing body for athletics has now admitted corporate manslaughter, having previously denied the charge.",
    "image": "https://e3.365dm.com/26/02/1600x900/skynews-abdullah-hayayei-uae_7170054.jpg?20260220110346",
    "source": "Sky News"
  },
  {
    "title": "Ex-Welsh Premier footballer charged with attempted murder",
    "desc": "He had spells with Manchester United and Liverpool as an academy player",
    "image": "https://i2-prod.walesonline.co.uk/article33459271.ece/ALTERNATES/s1200/0_Screenshot-2026-02-20-104353.jpg",
    "source": "Wales Online"
  },
  {
    "title": "No more walk‑ins: Malaysia to roll out MyVISA 2.0 in Japan on March 1, ending face‑to‑face visa applications",
    "desc": "KUALA LUMPUR, Feb 20 — The Embassy of Malaysia in Japan will implement the MyVISA 2.0 system for all visa applications effective March 1.The embassy, in a statement posted on...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/20/326399.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "Gentoo Penguins on Heard Island First Birds in Australia Infected with H5N1",
    "desc": "Gentoo penguins hit by bird flu on Australia's Heard Island.",
    "image": "https://gumlet.assettype.com/downtoearth%2F2026-02-20%2F8ghf7iwm%2FiStock-1146417798.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Down To Earth"
  },
  {
    "title": "NESR Expands Services in Libya with New Initiatives to Boost O&G Production",
    "desc": "According to Chairman and CEO Sherif Foda, the company is introducing new technology to unlock Libya’s untapped resources.",
    "image": "https://ecpbucket.s3.eu-central-1.amazonaws.com/wp-content/uploads/2026/02/20132233/Sherif-Foda-NESR-interview.jpg",
    "source": "Energy Capital & Power"
  },
  {
    "title": "Google cleans house, bans 80,000 developer accounts from the Play Store",
    "desc": "Google strengthens its Android safe app ecosystem, blocking malicious apps and boosting developer and user protections in 2025.",
    "image": "https://img.helpnetsecurity.com/wp-content/uploads/2025/08/17144846/google-1500-2.webp",
    "source": "Help Net Security"
  }
]