[
  {
    "title": "Teyana Taylor reveals what lured her back to music after earning fame in acting industry",
    "desc": "Teyana Taylor has weighed in on the one thing which made her return for music after stepping away.\nAs fans will be aware, after making her breakthrough in acting with a series of hit flicks,...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-27/1394022_104023_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "Pakistan's T20 World Cup Semi-Final Qualification Scenario As England Beat New Zealand In Super Eight Clash",
    "desc": "Given Sri Lanka are already eliminated from the tournament, the match between England and New Zealand concerned only Pakistan.",
    "image": "https://c.ndtvimg.com/2026-02/911tgva_team-pakistan-afp_625x300_24_February_26.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
    "source": "NDTV Sports"
  },
  {
    "title": "Why Celebrity GoFundMes Are Popular",
    "desc": "After the deaths of James Van Der Beek and Eric Dane, fans took to GoFundMe to help out the stars' families — a trend that experts believe will grow.",
    "image": "https://www.rollingstone.com/wp-content/uploads/2026/02/Celeb-GoFundMes.jpg?crop=0px%2C0px%2C1800px%2C1014px&resize=1600%2C900",
    "source": "Rolling Stone"
  },
  {
    "title": "Anxious days inside Iran as speculation grows of US strikes",
    "desc": "To many, Iran now seems to be hovering in a tense limbo where everything could change suddenly.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4b90/live/e0f5bd40-1401-11f1-92fa-236e7dddd759.jpg",
    "source": "BBC"
  },
  {
    "title": "England keep Pakistan T20 World Cup hopes alive by beating New Zealand",
    "desc": "England seal top spot in Group 2 at T20 World Cup in Super Eights stage with four-wicket win against New Zealand.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/GettyImages-2263896932-1772211096.jpg?resize=1200%2C675",
    "source": "Al Jazeera"
  },
  {
    "title": "Meet England coaches Janneke Bijl and Arvid Smit",
    "desc": "Get to know the Lionesses’ new assistant coaches Janneke Bijl and Arvid Smit following their arrival in camp this season",
    "image": "https://cdn.englandfootball.com/-/media/EnglandFootball/Article/england/womens-senior-team/2026/February/20262702-1440-janneke-arvind.jpg?h=811&iar=0&w=1440&rev=4fdeffa357964613a18f8d86d85a4030&hash=5B73D30A8EDEB21C1B6101AEC81B6175",
    "source": "England Football"
  },
  {
    "title": "Listening to your heart: Community Health Teams supporting Nova Scotians this heart month",
    "desc": "February is Heart Month – a time to focus on one of the most important muscles in our bodies. Heart health isn’t only shaped in hospitals or clinics. It’s influenced by the everyday choices we make. It’s how we eat, how we move, how we manage stress and how supported we feel along the way.",
    "image": "https://www.nshealth.ca/sites/default/files/favicon.ico",
    "source": "Nova Scotia Health"
  },
  {
    "title": "SoulGroup Spirit Sound drops Ghana medley to honour gospel legends",
    "desc": "SoulGroupGhana’s Spirit Sound has officially released its vibrant new Ghana Medley, a heartfelt celebration of the country’s rich gospel heritage.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/0262e5f9-0d71-410a-ac2a-e4ef41aa5f3b.jpeg",
    "source": "MyJoyOnline"
  },
  {
    "title": "One in Three Rheumatologists View BMS’ Sotyktu as a Substantial Advance in Psoriatic Arthritis Ahead of March 6 FDA Decision, According to Spherix Global Insights Data",
    "desc": "Findings show strong pre-launch awareness, safety-driven TYK2 differentiation from JAK inhibitors, and opportunity for Bristol Myers Squibb to strengthen rheumatology standing.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/28/954340.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "How to watch, lineup notes, and storylines",
    "desc": "Buffalo can further distance itself from the 2-time defending champs.",
    "image": "https://media.d3.nhle.com/image/private/t_ratio16_9-size50/prd/wydcetirodnq0jjilskl.png",
    "source": "NHL.com"
  }
]