[
  {
    "title": "1 dead, 6 seriously injured after charter bus rollover on northern Alberta highway",
    "desc": "Mounties say a woman is dead and multiple people were taken to hospital in serious condition after a charter bus carrying 37 adults and children rolled over on a northern Alberta highway Saturday night.",
    "image": "https://www.castanet.net/content/2026/2/7675cc4073c34553e17d15d545e8d7ebd4b55111fe3ee0808dc24205b73fdd0a.jpg",
    "source": "Castanet"
  },
  {
    "title": "Gold, silver prices turn volatile",
    "desc": "Gold and silver prices experience volatility after reaching all-time highs, anticipating a range-bound trend in the coming weeks.",
    "image": "https://th-i.thgim.com/public/incoming/bmmdbv/article70606601.ece/alternates/LANDSCAPE_1200/2025-12-24T104020Z_425256617_RC2X6CAICN4Q_RTRMADP_3_GLOBAL-PRECIOUS.JPG",
    "source": "thehindu.com"
  },
  {
    "title": "Super Bowl 2026 live updates: Seahawks vs. Patriots score, Q1 highlights and analysis",
    "desc": "Live updates, score and highlights with Seattle and New England set to kick off",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/08/69db665f-73b6-4737-a136-f7f9445be8c7/thumbnail/1200x675/626f444f3e299d26a90381312d116e27/drake-maye.jpg",
    "source": "CBS Sports"
  },
  {
    "title": "After 6 decades, Steve's Music to close most locations in Ontario, Quebec",
    "desc": "It's been an institution in Ottawa, Toronto and Montreal for decades, but soon Steve's Music will be mostly falling silent — save for one store.",
    "image": "https://i.cbc.ca/ais/365bacf7-5d58-478a-a7af-14b51ac1ed0d,1770585286660/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C312%2C6000%2C3375%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Singapore bank DBS' 4Q net profit misses forecasts, flags rate headwinds in 2026",
    "desc": "Singapore's biggest bank DBS Group on Monday maintained expectation that net profit this year will dip slightly from 2025's, after posting a 10% drop in fourth-quarter earnings that was weighed down by a lower net interest margin.",
    "image": "https://assets.theedgemarkets.com/443790010.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "Erice says Philippines needs a president like PNoy",
    "desc": "The next presidential race is still a good two years away, but Caloocan City 2nd district Rep. Edgar",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/09/77760.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Alex Soosay joins call for Sultan Abdullah to lead FAM",
    "desc": "The former AFC general secretary has become the latest football icon to back Al-Sultan Abdullah Sultan Ahmad Shah for the FAM presidency, adding institutional weight to a growing push for reform amid crisis.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/5647cc79-alex-soosay-former-afc-general-secretary-alex-soosay-pic-080226.webp",
    "source": "freemalaysiatoday.com"
  },
  {
    "title": "Brandi Carlile’s ‘America the Beautiful’ performance slapped at the Super Bowl",
    "desc": "Watch Brandi Carlile’s Super Bowl performance of ‘America the Beautiful’ here.",
    "image": "https://s.yimg.com/ny/api/res/1.2/h6c1vaP0bAOqJW58xeL68w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD03NDU7Y2Y9d2VicA--/https://media.zenfs.com/en/sb_nation_articles_115/dfc548c704d29f856845eeaae32bd9dc",
    "source": "Yahoo"
  },
  {
    "title": "Tesla Eyes US Solar Cell Expansion, Musk Targets 100-Gigawatt Power Push For AI Data Centers",
    "desc": "Tesla Inc (NASDAQ:TSLA) is moving quickly to turn Elon Musk's massive solar vision into reality, as the company ramps up plans for U.S.-based solar cell manufacturing alongside its broader AI and robotaxi ambitions. Tesla Scales Up U.S. Solar Manufacturing Plans The electric vehicle giant has started turning Elon Musk's 100-gigawatt solar goal into an active U.S. manufacturing push by scouting multiple sites to make solar cells. The company is weighing an expansion of its Buffalo, New York, fact",
    "image": "https://s.yimg.com/os/en/Benzinga/4c0f5f087305d06a01dfecd8f5100430",
    "source": "Yahoo Finance"
  },
  {
    "title": "MTN FA Cup: Defending champions Kotoko knocked out by Aduana",
    "desc": "The Porcupine Warriors suffered a penalty shootout defeat to the Dormaa-based side at the Baba Yara Stadium on Sunday, losing 4-2 after a goalless draw in regular time.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/IMG_2293.jpeg",
    "source": "MyJoyOnline"
  }
]