[
  {
    "title": "The art and origins of the courtroom sketch",
    "desc": "They're a small and curious cohort in a line of work rapidly evolving. Welcome to the world of courtroom artists.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ba12e5f24f3aa53f14b2b27c0721a873?impolicy=wcms_watermark_news&cropH=705&cropW=1254&xPos=0&yPos=43&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "FC Cincinnati open 2026 MLS season in home opener against Atlanta United FC",
    "desc": "After a long offseason, FC Cincinnati is back in action in the Queen City and ready to kick off the 2026 season at home. The Orange and Blue have spent the last month in preseason preparing for a new season and entering the new year strong.\nWhile that time in",
    "image": "https://images.mlssoccer.com/image/private/t_editorial_landscape_3_4_desktop/mls-cin/tyirl4t7itlrs8a0rq34.jpg",
    "source": "FC Cincinnati"
  },
  {
    "title": "Gibson Dunn Represented Macquarie Asset Management in Acquisition of South American Wireless Tower Operations of IHS Mauritius BR",
    "desc": "Gibson Dunn represented Macquarie Asset Management in its acquisition of the South American wireless tower operations of IHS Mauritius BR Limited, part of IHS Holding Limited.",
    "image": "https://www.gibsondunn.com/wp-content/uploads/2024/09/A.jpg",
    "source": "Gibson Dunn"
  },
  {
    "title": "Canadian freestyle skiier wins shocking Olympic medal with insane final run",
    "desc": "Canada's Brendan MacKay was the last skiier in the freestyle halfpipe event, and his final run vaulted him onto the podium.",
    "image": "https://images-dh-production-baselayer.dailyhive.com/uploads/2026/02/brendan-mackay-canada-olympics.jpg?format=auto",
    "source": "Daily Hive Vancouver"
  },
  {
    "title": "Doug Ford approves early alcohol sales for Team Canada game",
    "desc": "Premier Doug Ford says bars and restaurants across Ontario will be permitted to begin serving alcohol at 6 a.m. on Sunday as Canada’s men’s hockey team competes for Olympic gold.",
    "image": "https://www.cp24.com/resizer/v2/TTDAOAOU5BDE7BVQGIF67C72D4.png?smart=true&auth=9c798be887d8b897f34d1ffc0d8fd324f59203e73f8ef8409af20920c5fbf235&width=1200&height=630",
    "source": "CP24"
  },
  {
    "title": "Israeli settlers kill 19-year-old Palestinian American, officials and witnesses say",
    "desc": "Nasrallah Abu Siyam shot dead in occupied West Bank as UN human rights office accuses Israel of war crimes",
    "image": "https://i.guim.co.uk/img/media/8148e130ddce5208cb5a50f441e25b90bb132aa6/720_0_7200_5760/master/7200.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=588c9f406d9ffaa18a17b294754a1cf3",
    "source": "The Guardian"
  },
  {
    "title": "Savannah Chrisley Slammed On 'The View' For Trump Claim",
    "desc": "\"Sunny Hostin treated that anecdote like a CVS receipt long, unnecessary, and ultimately ignored.\"",
    "image": "https://img.buzzfeed.com/buzzfeed-static/static/2026-02/20/18/thumb/V3LXlBMSw.jpg?crop=2400:1257;0,2%26downsize=1250:*",
    "source": "BuzzFeed"
  },
  {
    "title": "Jony Ive's First OpenAI Device Will Be Smart Speaker With Camera, 2027 Launch Planned",
    "desc": "OpenAI is working on several AI hardware devices in partnership with former Apple designer Jony Ive, and the first product that comes out could be a smart speaker. The company is developing a smart speaker, a smart lamp, and considering AI glasses, according to The Information, with the speaker set to come out in early 2027. OpenAI's smart speaker has an integrated camera and it is designed to learn information about who is using it and what's around them.",
    "image": "https://images.macrumors.com/t/8JXgT8SwMdwVlTu6f-50sKRJFMk=/1600x/article-new/2025/05/jony-ive-sam-altman.jpg",
    "source": "MacRumors"
  },
  {
    "title": "Bomb threat in Paris as major landmarks evacuated by police",
    "desc": "According to reports, 'several emails' were sent to various authorities, involving 'threats to blow up various places in Paris' as a number of buildings in the French capital are evacuated",
    "image": "https://i2-prod.mirror.co.uk/article36757995.ece/ALTERNATES/s1200/0_An-elevated-daytime-view-of-The-Paris-skyline-stock-photo.jpg",
    "source": "The Mirror"
  },
  {
    "title": "Cellulose Breakthrough Could Simplify Rare Earth Separation",
    "desc": "Penn State researchers developed a plant-based nanomaterial to selectively extract dysprosium from rare earth mixtures, reducing environmental impact.",
    "image": "https://investingnews.com/media-library/hand-holding-levitating-minerals-with-digital-periodic-table-elements-and-data.jpg?id=64969004&width=1200&height=600&coordinates=0%2C125%2C0%2C125",
    "source": "Investing News Network"
  }
]