[
  {
    "title": "DENR, Iloilo City partner to combat climate change thru science-based solutions",
    "desc": "ILOILO CITY – The Department of Environment and Natural Resources (DENR) and the Iloilo City government have partnered for a new project to combat the impact...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/16/79650.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "‘There is going to be a reshuffle’ - Fifi Kwetey",
    "desc": "The General Secretary of the National Democratic Congress (NDC), Fifi Fiavi Kwetey, has indicated that President John Dramani Mahama would “soon” reshuffle his government.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/893/89319491.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Nico Mulingtapang set for NCAA homecoming after joining Benilde",
    "desc": "Nico Mulingtapang is making an NCAA comeback after deciding to suit up for powerhouse De La Salle-College of Saint Benilde starting in Season 103.",
    "image": "https://images.gmanews.tv/webpics/2026/02/UAAP_S88_MBB_-_ADU_vs_2026_02_16_15_16_33.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Paris Shatters Records Again, Proving It’s the Unrivaled Leader of World Tourism - Don’t Miss the Magic!",
    "desc": "Paris named the world’s most attractive city for the fifth consecutive year in 2025. Learn about its top tourism offerings and why it continues to lead globally.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/Paris-The-Unbeatable-Global-Capital-of-Elegance-Culture-and-Adventure--See-Why-Its-1-for-5-Straight-Years.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "The February 16th event with Piper Gilles and Paul Poierier at the Milano Fan Village, and everything you can do during the Milano Cortina 2026 Games outside the competition venues",
    "desc": "Gilles and Poirier, bronze medallists in figure skating, will be at the Milano Fan Village. All initiatives, events with athletes, and venues open to the public in the Milano Cortina 2026 area. From Cortina to Bormio, and beyond.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/qaogker4kr2bckl3yoqg",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Hastings residents to pay cyclone recovery rates for next 16 years",
    "desc": "Two years on from Cyclone Gabrielle, the Hastings District Council was facing a $230m recovery bill.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/hastings-ratepayers-will-be-paying-a-cyclone-gabrielle-recov-BBGMJJ2NKJG5NGWZC6C6ANVHXY.jpg?auth=5baead7f71ed2d38e02e380a52486f3b08b42ffcd4788946b0ad384d8f69a0ba&quality=70&width=600&height=315&focal=594%2C371",
    "source": "1News"
  },
  {
    "title": "What to watch on Day 10 at Winter Olympics: Women’s hockey semis, curling, pairs skating",
    "desc": "The two best women's hockey teams in the world appear headed toward a showdown for the gold medal.",
    "image": "https://static01.nyt.com/athletic/uploads/wp/2026/02/14190109/GettyImages-2260777207-scaled.jpg?width=1200&height=630&fit=cover",
    "source": "The New York Times"
  },
  {
    "title": "Schedule, how to watch live",
    "desc": "Discover what you need to know about the women's figure skating competition at Milano Cortina 2026, as three-time world champion and reigning Olympic bronze medallist Sakamoto goes for the title.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/b3hrl5lxmjo5lsxnpybd",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Steve Smith replaces Josh Hazlewood in Australia squad ahead of Sri Lanka clash",
    "desc": "Steve Smith has been named as a replacement for injured Josh Hazlewood in the Australia squad for the T20 World Cup 2026. His inclusion will strengthen Australia’s batting as they prepare to face Sri Lanka in a crucial fixture.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/steve-smith-164014160-16x9_0.jpg?VersionId=k_zK.Av7pvBBiD_eCwBHfOD0r5oN6o7y",
    "source": "India Today"
  },
  {
    "title": "'Some Creases To Be Ironed Out,' Supreme Court Refers Pleas Challenging DPDP Act Amendment To RTI Act To Larger Bench",
    "desc": "The Court however made it clear that it will not stay the operation of the DPDP Act.",
    "image": "https://www.livelaw.in/h-upload/2026/02/14/656077-dpdp-act-and-rti-act-and-sc.jpg",
    "source": "Live Law"
  }
]