[
  {
    "title": "Harrington Rare Disease Scholar Award",
    "desc": "Deadline: 09-Mar-2026 The Oxford–Harrington Rare Disease Scholar Award supports early-stage academic discoveries with strong potential to become patient-ready therapies for rare diseases. The programme provides £100,000 or USD 100,000 in funding, hands-on therapeutics development support, and access to advanced research infrastructure to accelerate translation into clinical practice. The Oxford–Harrington Rare Disease Scholar Award is a",
    "image": "https://fundsforngosmedia.s3.amazonaws.com/wp-content/uploads/2023/12/19141120/icon.png",
    "source": "fundsforNGOs"
  },
  {
    "title": "Neighborhood disadvantage accelerates biological aging through emotional distress",
    "desc": "While scientists have long known that living in a disadvantaged neighborhood is associated with biological symptoms of accelerated aging, emotional distress accounts for a significant portion of these effects, researchers found in a recent study.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/Stress-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Nipah virus: Health Ministry to screen travellers from high-risk countries",
    "desc": "BANGI: The Health Ministry is conducting targeted screening of travellers arriving in Malaysia from high-risk countries, particularly India and Bangladesh, as an initial measure to strengthen the country's preparedness against the potential spread of the Nipah virus.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/29/3743953.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "From questionable credibility to bias, the shame of Judiciary being reduced to loyalty test",
    "desc": "Isaac Ruto has been accused of attending UDA meetings, including a recent NGC gathering at State House, actions termed “unprecedented for a JSC Commissioner.”",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/pMSgemiVnhysPfrzuBoeYUncYNuKZeczQYZI5TgS.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "Man charged with New Year's Day murder of Pukehina woman",
    "desc": "Police were called to a property in western Bay of Plenty around 3pm on January 1, where a woman was found dead.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/a-generic-image-of-a-police-car-XP5UFGVMZJD4ZNCZZLMRBK2JMU.jpg?auth=75db0544ba0e0188254febb2cb01330d90ef4efdccc7ee2577772e690f68b835&quality=70&width=600&height=315&focal=678%2C362",
    "source": "1News"
  },
  {
    "title": "Wembanyama scores 28 points to lead Spurs past Rockets, 111-99",
    "desc": "Victor Wembanyama had 28 points, 16 rebounds and five blocks to help the San Antonio Spurs rally for a 111-99 victory over the Houston Rockets on Wednesday night.",
    "image": "https://assets.tegnaone.com/assets/AssociatedPress/images/e1bed433-0fd6-4fd0-a15c-2c6a64df1fa3/20260129T051510/e1bed433-0fd6-4fd0-a15c-2c6a64df1fa3.jpg",
    "source": "kens5.com"
  },
  {
    "title": "Hilby Named Big Ten Track Athlete of the Week",
    "desc": "MADISON, Wis. -- Wisconsin men's track and field sophomore Patrick Hilby was named the Big Ten Track Athlete of the Week following a standout performance at ...",
    "image": "https://images.sidearmdev.com/resize?url=https%3A%2F%2Fdxbhsrqyrr690.cloudfront.net%2Fsidearm.nextgen.sites%2Fuwbadgers.com%2Fimages%2F2026%2F1%2F28%2Fda5b9c51-a6e5-4f26-82f9-b7c75d85dd8bXC-20250902-MEDIA_DAY-WHITE_BACKDROP-GROVER-Patrick_Hilby-004.jpg&width=1600&type=jpeg",
    "source": "Wisconsin Badgers"
  },
  {
    "title": "Nipah virus fears trigger airport checks across Asia as India confirms 2 cases",
    "desc": "The virus, which is carried by fruit bats and animals such as pigs, can cause fever and brain inflammation and has a fatality rate of between 40 percent and 75 percent. ()",
    "image": "https://www.chinadailyhk.com/upload/main/image/2026/01/29/ceefc9938ff44aceccb1000b0b8a4839.png",
    "source": "chinadailyasia.com"
  },
  {
    "title": "AEW Dynamite Results: January 28, 2026 - Andrade Beats Swerve, Tommaso Ciampa Debuts, Champions Retain, More",
    "desc": "AEW Dynamite was LIVE from Austin, Texas, on TBS and HBO Max! And the stakes were high with three championships on the line and AEW World Championship challengers trying to improve their records.",
    "image": "https://static.wixstatic.com/media/815952_7574e575245f408781ed36efb1057c60~mv2.jpg/v1/fill/w_1920,h_1080,al_c/815952_7574e575245f408781ed36efb1057c60~mv2.jpg",
    "source": "AEW"
  },
  {
    "title": "Hastie and Taylor fail to agree on plan to oust Ley despite clandestine meeting",
    "desc": "The two conservative men vying to replace Sussan Ley as leader of the Liberal Party met in Melbourne before attending a memorial service for their former colleague Katie Allen.",
    "image": "https://live-production.wcms.abc-cdn.net.au/b1d71492397396ed977cf9e7a72da2dc?impolicy=wcms_watermark_news&cropH=450&cropW=800&xPos=0&yPos=28&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  }
]