[
  {
    "title": "Justice Unplugged 2026 LIVE: 'Putting the constitution ahead of everything else is easier said than done': Justice Muralidhar",
    "desc": "Justice Unplugged 2026 LIVE: A joint initiative of The Hindu and VIT, Chennai, will have experts and practitioners in the legal field disussing topics ranging from legal education and technology to constitutional thinking and enhancing legal access.",
    "image": "https://th-i.thgim.com/public/news/national/xvuq7f/article70687774.ece/alternates/LANDSCAPE_1200/38_RVM_9099.jpg.jpeg",
    "source": "The Hindu"
  },
  {
    "title": "Senior iOS Developer at Sabenza IT & Recruitment",
    "desc": "We are seeking a highly skilled Senior iOS Developer to join our mobile development team. The ideal candidate will have extensive experience in iOS application development and a deep understanding of mobile architecture and design. You will be responsible for the development and maintenance of applications aimed at a wide range of iOS devices, including […]",
    "image": "https://recruiter.careerjunction.co.za//_service/p/RecruiterSiteTypePlugin_1_0/recruiter/logpixeltrackingjobview?id=8763a3c4-13ab-11f1-b197-02f22c7af7eb",
    "source": "it-online.co.za"
  },
  {
    "title": "Hour economy policy fails to create promised jobs",
    "desc": "Dennis Miracles Aboagye, Director of Communications for the Bawumia campaign, has accused the Mahama administration of failing to deliver on its flagship 24-hour economy policy, describing it as “a bureaucratic shell” that has yet to create the jobs and economic momentum it promised. Speaking on Newsfile a day after President Mahama’s 2026 State of the Nation Address, Aboagye said millions of young Ghanaians — many voting for the first time in 2024 — were sold a vision of public institutions operating round the clock.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Screenshot-2026-02-28-at-10.58.08-1024x563.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "[CROI 2026] Life4me+: Long-acting PrEP, limits of resistance, and implementation",
    "desc": "An oral abstract session was dedicated to HIV PrEP giving a technically mature assessment of the state of prevention science in 2026.",
    "image": "https://www.eatg.org/wp-content/uploads/2026/02/neel2qzlwc.jpg",
    "source": "European AIDS Treatment Group"
  },
  {
    "title": "President Trump's Nomination of Kevin Warsh as Fed Chair May Come Back to Bite Wall Street",
    "desc": "The stock market's biggest threat may be an upcoming shift at America's foremost financial institution.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F857638%2Fjerome-powell-fomc-meeting-federal-reserve-questions.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Mexicans and Canadians in Puerto Vallarta watch their step in a cartel war’s wreckage",
    "desc": "A tourist haven, once counted among the safest in the country, rethinks its future after El Mencho’s death brings destruction",
    "image": "https://www.theglobeandmail.com/resizer/v2/35MNMDHDOVG2VG7BNEC7XXFDTY.JPG?auth=f209b5a616a2a272e79fa5d797d59621483807cf2e4a414426e8801dbe6f706b&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "KQ suspends flights to UAE over airspace closure",
    "desc": "Kenya Airways has suspended flights to Dubai and Sharjah following the closure of the United Arab Emirates airspace amid the war between the United States, Israel and Iran.  In a statement, KQ announced the cancellation of KQ310, KQ305 and freighter flights, terming the move as a safety measure for its customers and crew. “As a […]",
    "image": "https://www.kbc.co.ke/wp-content/uploads/2026/02/KQ-FLIGHT.webp",
    "source": "KBC Digital"
  },
  {
    "title": "How Trump’s tariffs have reshaped the global economy, in 11 charts",
    "desc": "From factory jobs and consumer prices, to supply chains and trade flows, we take a visual look at how the global economy has changed in the past year",
    "image": "https://www.theglobeandmail.com/resizer/v2/UCSJBUD3T5E3PLSR4D3TIRGAWI.jpg?auth=54dd1de3a3aa6f39fa0b9189bbebc9653336b31567fb4389090437f9d7b335ae&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "Airspace closed, flights cancelled as US, Israel strike Iran",
    "desc": "PARIS: Flights across the Middle East were being cancelled on Saturday (Feb 28) as several countries closed their airspace after the United States and Israel launched strikes on Iran.Iran, I",
    "image": "https://dam.mediacorp.sg/image/upload/s--WaUnyoI1--/c_crop,h_900,w_1600,x_0,y_134/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/28/2026-02-28t112223z_1974428408_rc2xuja8st06_rtrmadp_3_iran-crisis-gulf-emirates.jpg?itok=16Pqgd2C",
    "source": "CNA"
  },
  {
    "title": "Last stand at Signal Iduna Park: Dortmund’s final shot at halting Bayern’s title march",
    "desc": "Saturday’s Bundesliga action closes out with a title-defining clash between bitter rivals Borussia Dortmund and Bayern Munich.",
    "image": "https://footballtoday.com/wp-content/uploads/2026/02/borussia-dortmund-v-1-fsv-mainz-05-bundesliga-2-1000x600.jpg",
    "source": "footballtoday.com"
  }
]