[
  {
    "title": "STI Hits 5,000. 3 Blue Chips I Will Still Buy",
    "desc": "The STI hits 5,000. Discover three blue chip stocks I will still buy for potential value and growth in the market.",
    "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2026/02/Bugis-Junction.png",
    "source": "The Smart Investor"
  },
  {
    "title": "More cash reward for 14-year-old Vaibhav Sooryavanshi as Bihar CM Nitish Kumar honours U19 World Cup hero",
    "desc": "Cricket News: NEW DELHI: Fourteen-year-old cricket sensation Vaibhav Sooryavanshi was honoured by Bihar Chief Minister Nitish Kumar for his outstanding performance .",
    "image": "https://static.toiimg.com/thumb/msid-128678422,width-1280,height-720,imgsize-63154,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Holland Baroque Brings Dutch Baroque Songs to Jakarta",
    "desc": "The Dutch classical music group, Holland Baroque, brought the finest works of composers from the Netherlands to Indonesia.",
    "image": "https://statik.tempo.co/data/2026/02/22/id_1460222/1460222_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "NASA Officially Classifies Boeing Starliner Failure As A Maximum-Level Type A Mishap",
    "desc": "Despite it all, NASA doesn't want to give up on Boeing, and the Starliner project is moving ahead in a reduced capacity.",
    "image": "https://www.jalopnik.com/img/gallery/nasa-officially-classifies-boeing-starliner-failure-as-a-maximum-level-type-a-mishap/l-intro-1771625496.jpg",
    "source": "Jalopnik"
  },
  {
    "title": "ETS beats end-of-break traffic jams",
    "desc": "JOHOR BARU: As the festive break ends, travellers are relieved to be able to avoid gridlock by using the recently launched Johor Baru-Kuala Lumpur Electric Train Service (ETS).",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/23/3781484.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Supercar news: Walkinshaw boss delivers first Toyota assessment",
    "desc": "Walkinshaw TWG Racing CEO Bruce Stewart says his new-look Supercars team has to be happy despite riding the ups and downs of its first weekend with the new Toyota GR Supra. - Australia's #1 motorsport news website - Speedcafe.com",
    "image": "https://speedcafe.com/wp-content/uploads/2026/02/Toyota-Pressroom-ae727255-5d78-45e5-aeb0-4ea0cd5cd326.jpeg",
    "source": "Speedcafe.com"
  },
  {
    "title": "Players Championship: Zhao Xintong produces commanding finish to beat John Higgins",
    "desc": "Zhao Xintong wins the final four frames to beat John Higgins 10-7 and win the Players Championship in Telford.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/db2a/live/bf9c97c0-1043-11f1-9a90-85c4c2190064.jpg",
    "source": "BBC"
  },
  {
    "title": "At Berlin screening, former Israeli hostages see film about their captivity rewritten after redemption",
    "desc": "David and Ariel Cunio and their families received standing ovations at a screening adjacent to the Berlinale.",
    "image": "https://forward.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-20-at-10.03.54.jpeg?_t=1771802434",
    "source": "The Forward"
  },
  {
    "title": "Breaking: Don’t Believe the Puerto Vallarta BS, from someone on the ground.",
    "desc": "UPDATE: Monday, Feb 23, 2026 · 2:26:36 AM +00:00 · DoctorBeast68 3rd update: Now that I’m away from the pina coladas, I edited this to update the latest facts, and to focus on conversations with locals and first-hand observations. It’s been a fun and...",
    "image": "https://cdn.prod.dailykos.com/images/1529528/story_image/IMG_3813.jpeg?1771802125",
    "source": "Daily Kos"
  },
  {
    "title": "Following a whiplash transition from record warmth to very heavy mountain snowfall in California, yet another swing back toward anomalous warmth (first damp, then dry)",
    "desc": "A remarkable snowy interlude during what has thus far been a record warm winter: Disruptive, and even deadly, in the Sierra Nevada Last week's snowfall in the Sierra Nevada--and also at much lower elevations, for the first time this season, into even the lower foothills and Coast Ranges--marked a dramatic shift from a nearly 40-day",
    "image": "https://weatherwest.com/wp-content/uploads/2026/02/ECMWF_tivt72_USWC_latest_F84.png",
    "source": "Weather West"
  }
]