[
  {
    "title": "How Biomarkers and Digital Technologies Will Reshape Oncology Care in Asia by 2026",
    "desc": "How Biomarkers and Digital Technologies Will Reshape Oncology Care in Asia by 2026",
    "image": "https://www.biospectrumasia.com/uploads/articles/purav_gandhi_headshot_1_-27139.png",
    "source": "BioSpectrum Asia"
  },
  {
    "title": "Cancer Diagnosis, Accelerated by AI",
    "desc": "Cancer Diagnosis, Accelerated by AI",
    "image": "https://www.biospectrumasia.com/uploads/articles/ai-27138.jpg",
    "source": "BioSpectrum Asia"
  },
  {
    "title": "Polluting Company's Turnover Can Be Relevant Factor To Determine Environment Damage Compensation : Supreme Court",
    "desc": "The Supreme Court on Friday (January 30) observed that the company's scale of operation (like turnover, production volume, or revenue generation) can be a decisive factor in determining the...",
    "image": "https://www.livelaw.in/h-upload/2024/07/18/550481-ngt.jpg",
    "source": "Live Law"
  },
  {
    "title": "Dad shares experience of how Crohn's disease is impacting diet and sex life",
    "desc": "Phil has taken part in a study to better understand the condition. 'The most debilitating symptom is fatigue. It's not just tiredness, it's a profound draining from within.'",
    "image": "https://i2-prod.cornwalllive.com/article10781311.ece/ALTERNATES/s1200/0_Phil.jpg",
    "source": "Cornwall Live"
  },
  {
    "title": "Jane Doe in R. Kelly’s Infamous Tape Speaks Out for First Time",
    "desc": "In her first-ever interview, Reshona Landfair, the girl in R. Kelly's infamous tape, discusses the singer's abuse and her long road to healing.",
    "image": "https://www.rollingstone.com/wp-content/uploads/2026/01/reshona-landfair-by-akilah-townsend_RC.jpg?crop=0px%2C360px%2C1800px%2C1014px&resize=1600%2C900",
    "source": "Rolling Stone"
  },
  {
    "title": "From technical drawing to international caricature art",
    "desc": "Before turning fully to visual art, Hong Kong-based caricature artist Christine Acedera earned a Bachelor of Science in Industrial Technology, majoring in drafting. Technical drawing trained her eye for precision, a skill she later applied to cake design and decoration while working at a local bakeshop.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/01/31/919936.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "King Charles personally raises charity money, looks away from deeper problems",
    "desc": "King Charles has become U.K.'s most successful royal fundraiser, and he's done it with his own paintbrush. The King's passion for watercolour landscapes has raised serious money for good causes, turning this hobby...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-01-31/l_648282_081552_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Nueva Vizcaya governor calls for indigenous consultations on Dalton project",
    "desc": "NUEVA Vizcaya Gov. Jose Gambito has urged the Department of Public Works and Highways (DPWH) to conduct comprehensive public consultations with Indigenous Cultural Communities (ICCs) whose ancestral domains may be affected by the P67.4 billion Dalton Pass East Alignment Road Project (DPEARP).",
    "image": "https://cdn4.premiumread.com/?url=https://www.manilatimes.net/theme_manilatimes/images/TMT_1920x1008.jpg&w=1920&q=100&f=webp&v=1",
    "source": "The Manila Times"
  },
  {
    "title": "More than 2,000 applications for 145 cost-rental apartments in new Dublin scheme",
    "desc": "Successful applicants for Tallaght development to be chosen by lottery",
    "image": "https://www.irishtimes.com/resizer/v2/QB6HAA4CAVHIXMSG5U5T6JEFPA.png?smart=true&auth=211a8d276f280e4386e398291e29293fb6fafd3631471b949746415ec1c40f7b&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "BI-1808 Plus Pembrolizumab Yield Antitumor Activity in Recurrent Ovarian Cancer",
    "desc": "BioInvent's BI-1808 combined with pembrolizumab shows promising antitumor activity in recurrent ovarian cancer, offering hope for better treatment options.",
    "image": "https://cdn.sanity.io/images/0vv8moc6/targetedonc/6caf394cdec51630d6ab179957c9e2a6b0d64e98-1200x630.png",
    "source": "Targeted Oncology"
  }
]