[
  {
    "title": "Popular Male Singer Caught Spending The Night With Female Star After Relationship Denial",
    "desc": "A popular male singer was recently spotted spending the night with a female star, rekindling dating rumors that have existed for years.",
    "image": "https://image.koreaboo.com/2026/02/FEATURED-IMAGE-2026-02-05T174119.899.jpg",
    "source": "Koreaboo"
  },
  {
    "title": "It was only a dog, say parents of dog-killer boys",
    "desc": "A HORRIFYING case of animal cruelty involving two young boys and fireworks in China's Jiangsu province shocked social media users in the country, Sin Chew Daily reported.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/06/3756980.jpeg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Ireland must 'stop rot' after Paris humbling",
    "desc": "Ireland's heavy defeat by France to open the Six Nations will only further press questions raised by a lacklustre autumn.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9fd6/live/3aa6f9a0-02df-11f1-aed8-6f159d8910de.jpg",
    "source": "BBC"
  },
  {
    "title": "Cristiano Ronaldo: End in sight after fallout with Saudi Pro League",
    "desc": "When Cristiano Ronaldo announced that he was going to play in the Saudi Pro League, it's safe to say that eyebrows were raised in the world of football.",
    "image": "https://livesport-ott-images.ssl.cdn.cra.cz/r1200xfq60/0d9a4a71-81df-41f4-9920-c9922108245b.jpeg",
    "source": "Flashscore.com"
  },
  {
    "title": "Reddit Bets AI Search Will Be Its Next Revenue Goldmine",
    "desc": "Reddit reveals AI-powered search surged to 15M users, positioning it as major monetization play",
    "image": "https://charming-card-d91ad3487b.media.strapiapp.com/file_afdd1894cb.png",
    "source": "The Tech Buzz"
  },
  {
    "title": "Driver forced from car in Vancouver carjacking that left it flipped on its roof",
    "desc": "A suspect is in hospital and police custody after an alleged carjacking in Vancouver that left the car flipped on its roof.",
    "image": "https://images-dh-production-baselayer.dailyhive.com/uploads/2026/02/vancouver-driver.jpg?format=auto",
    "source": "Daily Hive Vancouver"
  },
  {
    "title": "Trump promises Schumer funding for NY tunnel project - if Penn Station and Dulles Airport are renamed after him",
    "desc": "President Donald Trump told Senate Minority Leader Chuck Schumer last month that he was finally prepared to drop his freeze on billions of dollars in funding for a major New York infrastructure project.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/150318130028-breaking-news-t1.jpg?c=16x9&q=w_800,c_fill",
    "source": "cnn.com"
  },
  {
    "title": "Diplomacy or dagger? US pushes Iran to talks as warships close in on Gulf",
    "desc": "The US and Iran have agreed to hold talks in Oman on Friday, officials said, despite differences over Washington’s push to include Iran’s missile programme and Tehran’s demand to limit discussions to nuclear issues.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/us-iran-tension-04384411-16x9.png?VersionId=qoASWUtL4jhtNpeF5Kcgflo7CDyRQNZQ",
    "source": "India Today"
  },
  {
    "title": "Beyond the Songs Inside: After the applause",
    "desc": "Creative prison programs are celebrated for their ability to heal and transform incarcerated people. But are they enough to break the cycle?",
    "image": "https://live-production.wcms.abc-cdn.net.au/635c838822f5c9289591ea73f84da254?impolicy=wcms_watermark_news&cropH=606&cropW=1077&xPos=196&yPos=681&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Baby Giants Were The Fast Food of The Jurassic, Study Reveals",
    "desc": "Baby long-necked dinosaurs might have been the fast food of the Jurassic Period.",
    "image": "https://www.sciencealert.com/images/2026/02/baby-brachiosaurus.jpg",
    "source": "ScienceAlert"
  }
]