[
  {
    "title": "Ernestina Fosu sets the record straight on Daddy Lumba’s second funeral",
    "desc": "Following an earlier confirmation by Dominic Kwadwo Osei of Baba Jamal & Associates that an Accra High Court had granted the Lumba family head, Abusuapanin Kofi Owusu, leave to file an injunction against Akosua Serwaa and others organising a...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/267/26711521.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Can mobile apps change how we eat?",
    "desc": "Evaluating digital tools for sustainable eating, the review highlights initial positive impacts but stresses the importance of long-term effectiveness research.",
    "image": "https://www.news-medical.net/images/news/ImageForNews_830648_17714080508266219.jpg",
    "source": "News-Medical"
  },
  {
    "title": "MultiChoice Ethiopia Introduces Coding Program for Youth",
    "desc": "MultiChoice Ethiopia has launched a new fully funded STEM program aimed at equipping public-school students with practical digital and coding skills, as part",
    "image": "https://ethionegari.com/wp-content/uploads/2026/02/IMG_20260218_123851_214.jpg",
    "source": "Ethio Negari"
  },
  {
    "title": "Uganda: Museveni, IMF Director Discuss Uganda's Economic Growth,Tax Base Expansion",
    "desc": "President Museveni has hosted Abebe Aemro Selassie, Director of the African Department at the International Monetary Fund, at State House Entebbe, where the two discussed Uganda's economic performance and strategies to widen the country's tax base.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Men’s Ice Hockey: Quarter-Final Matchups Confirmed",
    "desc": "Men’s Ice Hockey: Quarter-Final Matchups Confirmed",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/p5erbtwemtriibpmsnrk",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Top-ranked Michigan uses first-half surge to sink No. 7 Purdue",
    "desc": "The top-ranked Wolverines hit the Boilermakers with a 15-0 run in the first half by dominating the offensive boards.",
    "image": "https://on3static.com/uploads/dev/assets/cms/2026/02/17191301/Screenshot-2026-02-17-at-7.35.51%E2%80%AFPM-1024x636.png",
    "source": "On3"
  },
  {
    "title": "ECM Sensing Shapes Pancreatic Cancer Resistance",
    "desc": "Pancreatic cancer cells adjust autophagy based on extracellular matrix signals, switching between growth and drug resistance.",
    "image": "https://assets.technologynetworks.com/production/dynamic/images/content/409801/pancreatic-cancer-cells-unsplash-640x360.jpg?cb=20260218",
    "source": "Technology Networks"
  },
  {
    "title": "DOST launches iHubs in Pangasinan schools UDD, PPC to empower local ideas",
    "desc": "DOST officially unveiled two innovation hubs (iHubs) at the Universidad de Dagupan and the Pangasinan Polytechnic College during 2026 Regional Science and Technology Week for Region I.",
    "image": "https://images.gmanews.tv/webpics/2026/02/ihub_ppc_021826_2026_02_18_17_28_48.jpeg",
    "source": "GMA Network"
  },
  {
    "title": "About 150 people evacuated after fire breaks out at Teban Gardens HDB block",
    "desc": "No one was in the unit at the time of the fire, said SCDF. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/b6ef4f1e9cf68478511f9b2cbe7339d131877896741a51c15d550a952422b593",
    "source": "The Straits Times"
  },
  {
    "title": "Ghana: NLC Summons Tertiary Education Unions Over Ongoing Strike",
    "desc": "The National Labour Commission (NLC) has summoned all four tertiary education unions and their employers to appear before it to address the ongoing strike action in the country's higher education institutions.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  }
]