[
  {
    "title": "Urban Refugees decry “Exploitative” rental fees in Kampala",
    "desc": "Kampala, Uganda | THE INDEPENDENT | When Eri Mary fled Eritrea in search of safety and freedom, she imagined that the hardest part of exile would be leaving home behind. Instead, she says, it has been finding a room she can afford in Kampala. In Uganda’s capital and its surrounding suburbs, urban refugees say the …",
    "image": "https://www.independent.co.ug/wp-content/uploads/2026/02/Panel-discussion-during-UCOBAC-conference-on-coexistence-in-urban-refugee-communities.jpg",
    "source": "The Independent Uganda"
  },
  {
    "title": "London Heathrow flights to Middle East axed as US and Israel launch strikes on Iran",
    "desc": "An overnight BA service from Heathrow to Doha was forced to turn around mid-air and return to London",
    "image": "https://static.standard.co.uk/2026/02/27/07/7bcd4607b3f23151b443d82c9b11f06fY29udGVudHNlYXJjaGFwaSwxNzcyMjYyOTc0-2.78579481.jpg?width=1200&auto=webp&quality=75",
    "source": "London Evening Standard"
  },
  {
    "title": "Today’s Wordle Hints for March 1, 2026",
    "desc": "Scroll down for hints and conversation about the puzzle for Sunday, March 1, 2026.",
    "image": "https://static01.nyt.com/images/2026/02/28/crosswords/01wordle-review-art-1715/01wordle-review-art-1715-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Where to watch Tokyo Marathon 2026: Channel, live stream, start time, route, prize money, past winners and more",
    "desc": "Here's everything you need to know about the 2026 Tokyo Marathon, including TV channel and streaming options for the World Major.",
    "image": "https://library.sportingnews.com/styles/crop_style_16_9_desktop_webp/s3/2024-10/Tokyo%20Marathon%20Shoes%20030120%20Jiji%2016x9b.jpg.webp?itok=-zlpQB27",
    "source": "sportingnews.com"
  },
  {
    "title": "PHOTOS: From Bomas of Kenya to Bomas International Convention Complex",
    "desc": "With a price tag of Sh45.1 billion, the Bomas International Convention Complex (BICC) is being presented to the public as President William Ruto’s transformative legacy project.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/mcTfi9tW63JUhmMN6PzlkXiiPZvNWiA4l31zpP4x.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "'Pushing this competition': SpaceX's Starship might not fly on NASA's newly revamped Artemis 3 mission",
    "desc": "NASA's Artemis 3 mission will no longer land astronauts on the moon — and it might not involve SpaceX's Starship megarocket, either.",
    "image": "https://cdn.mos.cms.futurecdn.net/7tF6HfAJC3fXjcK2RZQx78-2000-80.jpg",
    "source": "Space"
  },
  {
    "title": "How Block's Severance Package Compares to Other Tech Company Layoffs",
    "desc": "Block earned some praise for its \"relatively generous\" severance package. Here is a look at what other Big Tech companies have offered in the past.",
    "image": "https://i.insider.com/69a1d1f3d3e2f1aef369adea?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "Israel performs largest cyberattack in history against Iran",
    "desc": "Critical infrastructure, official news sites, and security communications systems reportedly stopped functioning, leaving the leadership in a communications blackout at home and abroad.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/668944",
    "source": "The Jerusalem Post"
  },
  {
    "title": "The Sandbox Collective introduces open mic, masterclasses",
    "desc": "Sandbox is cranking up the house lights on community vibes with Sandbox Beyond The Stage (BTS) and leveling up its arts education game with Playground: The Sandbox Masterclass Series. Whether you’re a certified theater kid, a backstage lurker, or just someone who ugly-cries at 11 o’clock numbers — there’s a seat (or spotlight) for you.",
    "image": "https://media.assettype.com/tribune%2F2026-02-28%2F2ycm6jzf%2F2212.w026.n002.2836B.p1.2836.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Daily Tribune"
  },
  {
    "title": "From oil to religion: Five things to know about Iran",
    "desc": "Middle East News: Iran is a vast, resource-rich and ethnically diverse Muslim-majority nation that has been governed as an Islamic republic since the 1979 revolution. T.",
    "image": "https://static.toiimg.com/thumb/msid-128883116,width-1280,height-720,imgsize-1239354,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  }
]