[
  {
    "title": "Colonizers Uproot 500 Trees, Damage Property, Near Hebron",
    "desc": "Illegal paramilitary Israeli colonizers uprooted 500 saplings and trees on Tuesday in Khirbet Wadi Al-Rakhim, in the town of Yatta, south of Hebron in the s ...",
    "image": "https://imemc.org/wp-content/uploads/2026/01/saplingsuproot-e1769513924925.jpg",
    "source": "imemc.org"
  },
  {
    "title": "PSL 11: Islamabad United announce Mike Hesson's replacement as head coach",
    "desc": "Historic PSL 11 player auction scheduled for February 11",
    "image": "https://www.geosuper.tv/assets/uploads/updates/2026-01-27/l_52760_044037_updates.jpg",
    "source": "Geo Super"
  },
  {
    "title": "How Ghanaian poultry farmers are tackling the egg glut crisis",
    "desc": "Ghana’s poultry industry has been grappling with an egg glut, a situation where supply far exceeds demand, resulting in excess stock and financial strain for farmers.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/402/40260285.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "PARTLY FALSE: This photo is not of soldiers captured by Fano on 10 December 2025",
    "desc": "The image has been online since 2022.",
    "image": "https://pesacheck.org/content/media/2026/01/partly-false-3a46975c92138860.png",
    "source": "PesaCheck"
  },
  {
    "title": "Black Bombers selection championships set for Accra",
    "desc": "The Ghana Boxing Federation (GBF) will organise a bruising showdown this weekend as Ghana’s finest amateur boxers storm the Bukom Boxing Arena for spots in the national team, Black Bombers, with international exposure and future glory firmly on the line.",
    "image": "https://www.graphic.com.gh/images/2020/sept/14/Bombers.jpg",
    "source": "Graphic Online"
  },
  {
    "title": "Latvian women writers' union forming",
    "desc": "On February 5 at 7 p.m., readings will be held at the Istaba gallery to announce the establishment of the Latvian Women Writers' Union, said the organisation.",
    "image": "https://static.lsm.lv/media/2026/01/large/1/sk2n.jpg",
    "source": "LSM"
  },
  {
    "title": "Harry Brook blasts England to 2-1 series victory",
    "desc": "SL v ENG 2025/26, Sri Lanka vs England Match Report: Joe Root ton bolsters team-mate's quickfire effort as Pavan Rathnayake's century goes in vain",
    "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/412400/412402.6.jpg",
    "source": "ESPNcricinfo"
  },
  {
    "title": "Laryea Kingston willing to coach Ghana national teams under the right conditions",
    "desc": "Former Black Stars midfielder, Laryea Kingston has expressed his readiness to take up a coaching role with any of Ghana’s national teams.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/157/15711998.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "BBC plotting to unleash new method to crack down on TV Licence fee dodgers… everything you need to know",
    "desc": "THE BBC are plotting to unleash a new method to crack down on TV licence fee dodgers.\nAs it stands, a TV licence is required for anyone who...",
    "image": "https://www.thesun.co.uk/wp-content/uploads/2026/01/trr6ga-close-television-licence-united-599498928_b97f04.jpg?quality=90&strip=all&w=1920&h=1080&crop=1",
    "source": "The Sun"
  },
  {
    "title": "How Many Moons Does Saturn Have?",
    "desc": "Saturn leads the solar system with 274 moons. From Titan’s methane lakes to Enceladus’ geysers, explore the diverse worlds of the ringed giant.",
    "image": "https://img.jagranjosh.com/images/2026/01/27/article/image/saturn-moons-1769513179089.png",
    "source": "Jagran Josh"
  }
]