[
  {
    "title": "MB Sustainability Forum: Amplifying voices, inspiring action",
    "desc": "Marking 126 years of service, Manila Bulletin’s growth reflects a legacy that began as a witness to a changing nation. Today, it continues to play that...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/31/75772.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Fabrizio Romano: Liverpool in talks over shock midfielder move",
    "desc": "Fabrizio Romano: Liverpool in talks over shock midfielder move written on January 31, 2026 by Amanda Miller. This article is about Featured, Featured Article, Liverpool FC Articles, Liverpool FC News, Liverpool FC Transfers.",
    "image": "https://anfieldindex.com/wp-content/uploads/2025/12/imago1070179281-scaled.jpg",
    "source": "anfieldindex.com"
  },
  {
    "title": "Six more children die in Tharparkar, monthly toll reaches 50",
    "desc": "Six more children receiving treatment at Civil Hospital Mithi have died over the past five days due to malnutrition and related illnesses, pushing the total number of",
    "image": "https://www.nation.com.pk/digital_images/large/2026-01-31/six-children-die-tharparkar-death-toll-reaches-50-1769842042-7518.jpg",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "You can migrate your Fitbit data to Google till May",
    "desc": "Fitbit users now have until May 19th, 2026 to migrate their data to a Google account, extending the previous deadline of February 2nd.",
    "image": "https://i.cdn.newsbytesapp.com/images/l30820260131111355.jpeg",
    "source": "NewsBytes"
  },
  {
    "title": "Dominic Calvert-Lewin: Leeds striker eyes England return",
    "desc": "Leeds striker Dominic Calvert-Lewin sits down with BBC Sport's Betty Glover to talk about his return to goalscoring form, being a free agent and his England chances.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/091c/live/05780760-fd62-11f0-9c09-35264ee739f3.jpg",
    "source": "BBC"
  },
  {
    "title": "Christina Koch’s long road to the moon, from Antarctic ice to NASA’s Artemis 2",
    "desc": "A veteran of Antarctic winters, record-setting space missions and all-female spacewalks, NASA astronaut Christina Koch is days away from making history as the first woman to travel around the moon aboard Artemis 2",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/01/26/SktLOkHLZx/SktLOkHLZx_0_0_3000_1688_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "It's very cold across Latvia, and particularly in Daugavpils",
    "desc": "On the morning of Saturday, January 31st, the air temperature at the Daugavpils observation station in south-eastern Latvia dropped to -32 degrees Celsius – the biggest freeze recorded in th...",
    "image": "https://static.lsm.lv/media/2026/01/large/1/slhx.jpg",
    "source": "LSM"
  },
  {
    "title": "Six more children die in Mithi hospital amid malnutrition crisis",
    "desc": "Six children died in Mithi Civil Hospital over five days due to malnutrition and illnesses; child death toll in the past month rises to 50, officials cite home births and low birth weight.",
    "image": "https://img.dunyanews.tv/news/2026/January/01-31-26/news_big_images/932741_39561163.jpg",
    "source": "Dunya News"
  },
  {
    "title": "Ondangwa police officer charged with reckless handling of firearm",
    "desc": "THE Namibian Police (NamPol) have registered a case of reckless and negligent handling of a firearm after a 42-year-old off-duty police...",
    "image": "https://informante.web.na/wp-content/uploads/2026/01/624233942_1211043561238035_2710156432355592523_n-1024x677.jpg",
    "source": "Informanté"
  },
  {
    "title": "England cricketer Harry Brook says he lied about New Zealand nightclub incident to protect teammates",
    "desc": "England's ODI and T20 captain Harry Brook issues a statement admitting he lied over the nightclub incident on his side's tour of New Zealand last year, saying other teammates were present when he was hit by a bouncer.",
    "image": "https://live-production.wcms.abc-cdn.net.au/c90809e5be6a5eb472f80319b663356d?impolicy=wcms_watermark_news&cropH=2239&cropW=3980&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  }
]