[
  {
    "title": "Cabinet has discussed proposal for RCI probe into Azam Baki share issue, says PM",
    "desc": "KAJANG: The Cabinet has already discussed the proposal to set up a Royal Commission of Inquiry (RCI) to investigate Tan Sri Azam Baki over the share ownership issue, says Datuk Seri Anwar Ibrahim.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/27/3790274.jpg",
    "source": "The Star"
  },
  {
    "title": "Winning €11m Lotto jackpot ticket sold in Co Mayo shop",
    "desc": "The winning €11m Lotto jackpot ticket was sold in Co Mayo shop, according to the National Lottery.",
    "image": "https://www.rte.ie/images/0015cfe7-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "The Stardew Valley video game community will love you, even if your farm is ugly",
    "desc": "Stardew Valley has sold nearly 50 million copies, outselling Pokémon and The Legend of Zelda. Why can't gamers put it down?",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--Yj9jDpxF--/t_tohu-badge-facebook/f_auto/q_auto/4JSJTJ1_cnn_L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbW0yZnl2M3gwMDBzM2I2cmZ6NXh2Y2Jj_L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NtbTEzZzlsZTAwMXoyY3A0NHI2aWJiY2Y_JPG?_a=BAMABkiu0",
    "source": "RNZ"
  },
  {
    "title": "2 women ask DOJ to file illegal recruitment, estafa vs Italian nationals, Filipino partners",
    "desc": "The Department of Justice (DOJ), through its Sto. Tomas City prosecutor’s office in Batangas, has been asked to file criminal cases for alleged illegal...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/27/82382.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Piyush Goyal At Rising Bharat: US Trade Deal Huge, Will Wait And Watch The Evolving Situation",
    "desc": "Piyush Goyal: \"We will have to wait and watch and ensure interests of India are protected...Should the circumstances change, the deal will be rebalanced…\"",
    "image": "https://images.news18.com/ibnlive/uploads/2026/02/FotoJet-2026-02-27T121725.277-2026-02-463f40560cc4d4b0865ed1e506edba3c-1200x675.jpg",
    "source": "News18"
  },
  {
    "title": "A protest vote is brewing in Sussan Ley’s seat – but it won’t be simple",
    "desc": "Like many Australians, dairy farmer Nick Flanagan finds his WhatsApp group chat is a good barometer of what people are thinking about politics. Its contents will worry the Coalition.",
    "image": "https://static.ffx.io/images/$zoom_1.1767%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/954077b016cfe2ee95a684bf362aa0d64129981ecc569ab36a01501f64fbf1ae",
    "source": "The Age"
  },
  {
    "title": "IBC | Supreme Court Cautions Against Excessive Judicial Review, Criticises Trend Of Unsuccessful Bidders Seeking To Reopen CoC Decision",
    "desc": "The Supreme Court today criticised growing trend of unsuccessful resolution applicants converting challenging almost every commercial decision of the Committee of Creditors under the guise of...",
    "image": "https://www.livelaw.in/h-upload/2024/09/08/559993-insolvency-bankruptcy-code-ibc-sc.jpg",
    "source": "Live Law"
  },
  {
    "title": "My Weekend: 'I feel very fortunate to get to work with my dad'",
    "desc": "Given her dad's background, it is perhaps not surprising that Faye Shortt found herself involved in the world of comedy. Together they wrote a comedy ...",
    "image": "https://www.echolive.ie/cms_media/module_img/9965/4982756_2_seoimageog_ECHO_20FEATURES_20My_20Weekend_20Faye_20Shortt.jpg",
    "source": "echo live"
  },
  {
    "title": "Telenor goes live with Nordic TV platform enabled by AWS and Scalstrm",
    "desc": "Telenor is live with its new cutting-edge Nordic TV platform, leveraging the company’s strategic collaboration with AWS and Scalstrm AB",
    "image": "https://www.telenor.com/binaries/media/newsroom/announcement/telenor-goes-live-with-nordic-tv-platform-enabled-by-aws-and-scalstrm/TV-with-logos-Credit-Oscar-Nord.jpg?w=1200&h=800&mimeType=original",
    "source": "Telenor Group"
  },
  {
    "title": "Malaysian police probe alleged plot to topple government",
    "desc": "The probe centres on claims that a local influencer was working in collaboration with an international media agency. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/1df2d871d363a632ff2de2e1fe6ad09b2b212097932a61e252f3e7e373db07e5",
    "source": "The Straits Times"
  }
]