[
  {
    "title": "UG, UPSA to face off in forest debate on International Day of Forest",
    "desc": "As the world gears up to celebrate the International Day of Forests (IDF) on 21st March 2026, the Ministry of Lands & Natural Resources (MLNR) in",
    "image": "https://i0.wp.com/www.gbcghanaonline.com/wp-content/uploads/2026/02/IMG-20260222-WA0020.jpg",
    "source": "GBC Ghana Online"
  },
  {
    "title": "Best gaming monitor deal: LG’s 34-inch UltraGear OLED model is $600 off at Amazon",
    "desc": "LG’s 34-inch UltraGear OLED gaming monitor drops to $699.99 at Amazon, saving you $600 off its $1,299.99 list price.",
    "image": "https://helios-i.mashable.com/imagery/articles/03QjkJlfObLtnfcYvxrXHrp/hero-image.fill.size_1200x675.v1771838997.jpg",
    "source": "Mashable"
  },
  {
    "title": "Keynote speech by Yaw Nsarkoh at the Noguchi Memorial Institute for Medical Research quality week celebration",
    "desc": "There is a sense in which returning to the University of Ghana’s Noguchi Memorial Institute of Medical Research (NMIMR or more simply just ‘Noguchi’) is a homecoming. For, as some of you no doubt know, Legon holds many fond memories of my childhood and youth. It is now more than four decades ago, though it feels like only yesterday, but I remember your present office premises, way back to when they were being constructed. The area in which it is situated was a thicket of bush that lay between the main campus and the South Legon residential area. To my youthful mind, South Legon was, among other things, the place where Wole Soyinka was to be found.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/yaw.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Police want to speak to this man after schoolgirl followed into toilet",
    "desc": "Detectives believe the man could hold \"vital\" information",
    "image": "https://i2-prod.liverpoolecho.co.uk/article33473389.ece/ALTERNATES/s1200/0_eak-to-this-man-after-school-girl-followed-into-toilet-pic-1.jpg",
    "source": "Liverpool Echo"
  },
  {
    "title": "Australia backs removing Andrew from royal line of succession",
    "desc": "Andrew Mountbatten-Windsor remains eighth in line to the throne despite being stripped of his titles.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1cc2/live/07a98f30-10af-11f1-ae9c-bbdf8b825e1a.jpg",
    "source": "BBC"
  },
  {
    "title": "Simple blood test can forecast Alzheimer’s years before memory loss",
    "desc": "Scientists have created a blood test that can estimate when Alzheimer’s symptoms are likely to begin. By measuring a protein called p-tau217, the model predicts symptom onset within roughly three to four years. The protein mirrors the silent buildup of amyloid and tau in the brain long before memory loss appears. This advance could speed up preventive drug trials and eventually guide personalized care.",
    "image": "https://www.sciencedaily.com/images/1920/brain-disease-inflammation.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Congress leader Rahul Gandhi meets Uttarakhand gym trainer ‘Mohammad Deepak’",
    "desc": "Rahul Gandhi supports Uttarakhand gym owner Mohammad Deepak, pledging to join his gym in a stand for unity and love.",
    "image": "https://th-i.thgim.com/public/incoming/m3r4zm/article70666797.ece/alternates/LANDSCAPE_1200/20260223119L.jpg",
    "source": "The Hindu"
  },
  {
    "title": "Women’s FA Cup talking points: Kerr shows the way and Liverpool resurgence continues",
    "desc": "Sam Kerr is ready for business end of season, Chatham’s goalkeeper made to work and Kim Little continues to shine",
    "image": "https://i.guim.co.uk/img/media/fe24024241f241b7bcfbb5c01d5b959f0ccf6362/0_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1fed170b5a3dfd3936ae66f8e09d619e",
    "source": "The Guardian"
  },
  {
    "title": "Cartoon: Channel 4’s fountain of filth highlights Britain’s sewage crisis",
    "desc": "A shocking new factual drama from Channel 4, Dirty Business, reveals the sick truth behind Britain’s sewage scandal. As the first episode hits our screens, Channel 4 is unveiling a hard-hitting art installation – a fountain of filth – on London’s South Bank",
    "image": "https://i.guim.co.uk/img/media/b7655165f4a9a3e7c2092d55a0f9a903aaf7884f/451_0_2323_1860/master/2323.jpg?width=700&quality=85&auto=format&fit=max&s=1e736eb41027c1c07cb46a9033e056ca",
    "source": "The Guardian"
  },
  {
    "title": "Singapore may lose slight competitive edge under new 15% US tariffs, but analysts say it remains resilient",
    "desc": "Singapore offers a “certainty premium” backed by institutional stability and fiscal strength, observers say.",
    "image": "https://dam.mediacorp.sg/image/upload/s--zY_Fhia---/c_crop,h_1029,w_1829,x_1,y_342/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/13/20260211_bk_br_shipping_2_0.jpg?itok=E2EuDBQO",
    "source": "CNA"
  }
]