[
  {
    "title": "Friday the 13th effect? D-St investors suffer Rs 7 lakh crore shock as Sensex sinks over 1,000 points",
    "desc": "Indian stock markets ended sharply lower on Friday. The Sensex and Nifty saw significant drops. This decline was driven by a major selloff in IT stocks. Investor sentiment was rattled by fears of Artificial Intelligence disruption. Major IT companies experienced substantial losses. This led to a significant erosion of investor wealth on the BSE. The Nifty IT index slumped considerably.",
    "image": "https://img.etimg.com/thumb/msid-128287572,width-1200,height-630,imgsize-2538731,overlay-etmarkets/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Turramurra Music Marks 50 Years with Global NAMM Honours",
    "desc": "Turramurra Music has been named NAMM Best Community Retail Store and shortlisted as a global finalist for Retailer of the Year.",
    "image": "https://content-technology.com/wp-content/uploads/2026/02/Turramurra-Music-NAMM-awards-night-3_small.jpg",
    "source": "Content + Technology"
  },
  {
    "title": "Averting the Next Disaster",
    "desc": "A global pandemic funding crisis threatens our ability to prevent the next major outbreak. Learn how cuts in health financing jeopardize lives worldwide.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2021/12/09194352/Dr-Tedros-Ahebreyesus.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Residents fume over planned air ambulance base near 'peaceful' North Wales village",
    "desc": "The charity says people will struggle to hear its helicopters over noise from the nearby A55",
    "image": "https://i2-prod.dailypost.co.uk/article33415400.ece/ALTERNATES/s1200/0_AFRDPR120226AirAmboBase_02.jpg",
    "source": "North Wales Live"
  },
  {
    "title": "Muthoot Finance share price slumps 10% after Q3 results. Should you buy, sell or hold?",
    "desc": "Muthoot Finance share price dropped 10% on February 13 despite reporting a 94.9% increase in Q3 net profit to ₹2,656 crore. The net interest income rose 64% to ₹4,467 crore, while consolidated loan assets under management reached ₹1,64,720 crore, a 48% increase.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/13/1600x900/3-0-86449917-iStock-1167137273-0_1679793048835_1770955378461.jpg",
    "source": "Mint"
  },
  {
    "title": "Katie Holmes pays tribute to Dawson's Creek co-star James Van Der Beek in handwritten letter",
    "desc": "Holmes says she is mourning the loss of her friend \"with a heart holding the reality of his absence and deep gratitude for his imprint on it\".",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--5E0zT2l6--/t_tohu-badge-facebook/f_auto/q_auto/4JT9KZM_AFP__20100204__CIN91105_034__v1__HighRes__DawsonSCreek_jpg?_a=BAMABkiu0",
    "source": "RNZ"
  },
  {
    "title": "North Korea wants South to do more to prevent drone flights",
    "desc": "The sister of North Korean leader Kim Jong Un says it was “sensible” for a South Korean official to express regret for alleged civilian drone flights over North Korea but warned of counterattacks if they recur.",
    "image": "https://dims.apnews.com/dims4/default/74fd4c5/2147483647/strip/true/crop/6000x3998+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F1a%2F2c%2F9acfc58700c567896a0fcc64a0a8%2Fe7d272d8246740cd8472cae35a468540",
    "source": "AP News"
  },
  {
    "title": "origami G-SHOCK watches by casio have washi paper texture",
    "desc": "casio’s origami-inspired G-SHOCK watches let the wearer feel the texture of washi paper around the accessory’s bezel and band.",
    "image": "https://www.designboom.com/twitterimages/uploads/2026/02/origami-inspired-watch-casio-texture-washi-paper-designboom-fb.jpg",
    "source": "Designboom"
  },
  {
    "title": "NASA crew set for flight to ISS",
    "desc": "NASA is set to launch four astronauts to the International Space Station on Friday, replacing a crew that was evacuated early due to a medical issue.",
    "image": "https://www.enca.com/sites/default/files/styles/large/public/afp/2026-02/doc-97BU7ZQ-%40photo0.jpg.webp?itok=1v5ruBVC",
    "source": "eNCA"
  },
  {
    "title": "Guntas Kaur Sandhu tied 17th after Round 1 of Women's Amateur Asia",
    "desc": "Part of the four-member team sent by the Indian Golf Union (IGU), Guntas began on a modest note with a bogey on the first hole before sinking birdies on the third, eighth and 12th holes. But a bogey on the 15th hole pegged her back. She trails the leader, Yunseo Yang of South Korea, by seven strokes.",
    "image": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTg2MWE0ZjIwLTA4OTAtMTFmMS1hMGQ5LTc1OTJkMGM1MWUxYy5qcGc=",
    "source": "Tribune India"
  }
]