[
  {
    "title": "Public consultation on the Operational Guidance for banks on Business Reorganisation Plan Analysis Reports and quantitative template",
    "desc": "Public consultation on the Operational Guidance for banks on Business Reorganisation Plan Analysis Reports and quantitative template",
    "image": "https://www.srb.europa.eu/themes/custom/srbtheme/favicon.ico",
    "source": "Single Resolution Board"
  },
  {
    "title": "Supreme Court asks Telangana HC to reconsider Shaadi.com founder's plea to quash cheating case over fraud user",
    "desc": "The Court also granted the Shaadi.com founder, Anupam Mittal, interim protection for eight weeks.",
    "image": "https://media.assettype.com/barandbench%2F2025-09-30%2F5ifraq8i%2F01.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Bar and Bench"
  },
  {
    "title": "SK bioscience Licenses RSV Monoclonal Antibody from Gates MRI for Global Development",
    "desc": "SK bioscience announced on February 3 that it will advance a novel respiratory syncytial virus (RSV) monoclonal antibody program under a license agreement with the Gates Medical Research Institute (Gates MRI).Under the agreement, SK bioscience has obtained rights to develop and commercialize a clini",
    "image": "https://www.koreaittimes.com/news/thumbnail/202602/150523_99938_3412_v150.jpg",
    "source": "Korea IT Times"
  },
  {
    "title": "Correlation between Ultrasound Findings and Histological Data of Thyroid Nodules at Louga Regional Hospital",
    "desc": "Objectives: To clarify the role of cervical ultrasound in the investigation and characterization of thyroid nodules and its predictive value for malignancy or benignity by searching for a correlation between ultrasound findings and histology results. Materials and Methods: We performed a prospective study of 34 patients who underwent surgery for nodular thyroid disease at the Louga Regional Hospital Centre over a ten-month period, from 1 January 2023 to 31 October 2023. Results: There were 33 women and 1 man, giving a sex ratio of 0.03. The average age of patients was 42.35 years. Thyroid nodules were discovered in 94.1% of cases due to anterior cervical swelling. A family history of thyroid goiter was noted in 23.5% of patients, and 20.6% of patients had thyroid hyperfunction. On ultrasound, 52.9% of nodules were solitary and 47.1% were part of a multinodular goiter. The nodules were bilobar in 41.2% of cases, with an average size of 26.2 mm. The nodules were solid in 52.9% of cases, mixed in 41.2% and spongiform in 5.9%. The form was oval for 33 nodules (97.1%) and non-oval for 1 nodule (2.9%); 5.9% of nodules had irregular borders. In terms of echogenicity, 17.6% of nodules were hyperechoic, 50% were isoechoic, 20.6% were mildly hypoechoic, 5.9% were severely hypoechoic and 5.9% were anechoic. Microcalcifications were found in 5.9% of cases. The nodules were classed as EU-TIRADS 2 in 5.88% of cases, EU-TIRADS 3 in 64.71%, EU-TIRADS 4 in 20.59% and EU-TIRADS 5 in 8.82% of cases. On histology, 17.6% of nodules were malignant. The risk of malignancy was 0% for score 2, 4.5% for score 3, 28.6% for score 4 and 100% for score 5. The risk of malignancy was associated with nodule size, non-oval shape, irregular contours, hypoechoic appearance and the presence of microcalcifications. Conclusion: Pertinent ultrasound analysis remains highly useful in the pre-surgical identification of factors predictive of malignancy in thyroid nodules.",
    "image": "https://file.scirp.org/image/ojmi2024061316494959.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Okahao to experience water shutdown on Tuesday, Wednesday",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% The Namibia Water Corporation (NamWater) says Okahao in the Omusati region will experience a two-day water shutdown due to a ground reservoir fill-up.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-03-at-9.25.28-AM-1024x683.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "Citi Expects Limited Impact From Google's Project Genie on TENCENT",
    "desc": "Regarding market concerns that whether last Friday's US gaming stock sell-off triggered by Google's Project Genie (a global generative AI) ann...",
    "image": "https://plib.aastocks.com/aafnnews/image/medialib/20180926143353545_m.jpg",
    "source": "AASTOCKS.com"
  },
  {
    "title": "Citi Expects Limited Impact From Google's Project Genie on TENCENT",
    "desc": "Regarding market concerns that whether last Friday's US gaming stock sell-off triggered by Google's Project Genie (a global generative AI) ann...",
    "image": "https://plib.aastocks.com/aafnnews/image/medialib/20180926143353545_m.jpg",
    "source": "AASTOCKS.com"
  },
  {
    "title": "DGCA says no fault found in Boeing fuel control switch after Air India grounds plane",
    "desc": "The Boeing 787-8 jet was grounded after a pilot reported a possible issue with the fuel control switch.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/b14a/live/d8714e10-00b9-11f1-bafa-09e23c2efc9d.jpg",
    "source": "BBC"
  },
  {
    "title": "DCEs, Assemblymen allegedly undermining anti-galamsey operations - NAIMOS",
    "desc": "The National Anti-Illegal Mining Operations Secretariat (NAIMOS) has disclosed that in many instances, illegal miners flee mining sites before operatives arrive, as DCEs and Assemblymen share intel with illegal miners before NAIMOS raids.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/668/66838911.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Ghanaian man in Denmark reportedly commits suicide after DNA test results",
    "desc": "A Ghanaian man identified as Benjamin Offei has reportedly committed suicide in his garage in Copenhagen, Denmark.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/445/44534428.jpg",
    "source": "GhanaWeb"
  }
]