[
  {
    "title": "PM asks Sir Jim Ratcliffe to apologise for saying UK 'colonised by immigrants'",
    "desc": "Sir Keir Starmer says comments by the businessman and Manchester United co-owner are \"offensive and wrong\".",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/694d/live/d76b6120-079b-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Gmail for Android finally lets you create new labels",
    "desc": "The Gmail mobile apps lack a handful of features found on the website, but Google is now adding the ability to create new labels on Android.",
    "image": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2026/01/Gmail-generic-logo-1.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "source": "9to5Google"
  },
  {
    "title": "'Harold and Maude' Star Was 77",
    "desc": "'Harold and Maude' star Bud Cort is dead at 77.",
    "image": "https://www.indiewire.com/wp-content/uploads/2026/02/MSDHAAN_EC017-2.jpg?w=650",
    "source": "IndieWire"
  },
  {
    "title": "Future of Port Hedland's West End uncertain after buyback scheme ends",
    "desc": "As Port Hedland's controversial dust buyback scheme winds up, Pilbara Ports quietly walks away from major plans to build a training facility and accommodation, with development plans for the area still uncertain.",
    "image": "https://live-production.wcms.abc-cdn.net.au/4acf9f1b32bb71fa80d0633d8807d4cc?impolicy=wcms_watermark_news&cropH=2214&cropW=3936&xPos=0&yPos=2&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Bethlehem soccer pitch becomes unlikely flashpoint in global soccer politics",
    "desc": "The pitch, the IDF Central Command claimed, sat too close to the seam zone, alleging that the structure and its occupants provided an observation point too sensitive for its volatile location. In the ...",
    "image": "https://s.yimg.com/os/en/jerusalem_post_articles_818/798bc44699b8e4cc5d0b122a3c7c8833",
    "source": "Yahoo"
  },
  {
    "title": "America’s Largest Particle Collider Just Shut Down. Here’s What Happens Next",
    "desc": "Don't worry, it's all good.",
    "image": "https://gizmodo.com/app/uploads/2026/02/bnl-rhic-shutdown-1200x675.jpg",
    "source": "Gizmodo"
  },
  {
    "title": "Mercedes Is Bringing Back Its Famed Black Series AMG Cars",
    "desc": "The company confirmed that there are new Black Series AMG cars in the works.",
    "image": "https://s.yimg.com/os/en/robb_report_967/c1ed4fda0751bef2f8f635bec9415e63",
    "source": "Yahoo News Singapore"
  },
  {
    "title": "JetBlue to Participate in Fireside Chat at Barclays 43rd Annual Industrial Select Conference",
    "desc": "JetBlue Airways Corporation (Nasdaq: JBLU) will participate in a fireside chat at the Barclays 43rd Annual Industrial Select Conference on February 18th, 202...",
    "image": "https://www.businesswire.com/bw-logo.png",
    "source": "Business Wire"
  },
  {
    "title": "NOBLE CORPORATION PLC ANNOUNCES FOURTH QUARTER AND FULL YEAR 2025 RESULTS",
    "desc": "Approximately $1.3 billion in new contract awards since October fleet status report, increasing backlog to $7.5 billion. Completed divestiture of five jackups...",
    "image": "https://www.prnewswire.com/content/dam/prnewswire/icons/2019-Q4-PRN-Icon-32-32.png",
    "source": "PR Newswire"
  },
  {
    "title": "User Profiles and Engagement in a Hypertension Self-Management App: Cross-Sectional Survey",
    "desc": "Background: Mobile health (mHealth) technologies can improve hypertension self-management, yet real-world adoption remains limited and unequally distributed. Objective: This study aimed to characterize the profiles, usage patterns and engagement of active users of a hypertension self-management app (Hypertension.APP) in Germany, with a focus on user engagement and potential digital divides. Methods: We conducted a cross-sectional online survey among adult users of Hypertension.APP in Germany between January and September 2023. An 88-item questionnaire assessed app usage patterns, perceived utility, integration into clinical care, sociodemographic and clinical data, and digital health literacy (eHealth Literacy Scale, eHEALS; scores 16–40). Digital health literacy was categorized as low (16–23.99), moderate (24–31.99), or high (32–40). Descriptive statistics and univariable ordinal logistic regression were used to explore associations between sociodemographic and clinical variables and app usage frequency. Results: Of 254 respondents (mean age 53.6 years, 54.3% male), 44.5% had a university or technical college degree, and 44.5% reported a monthly net income higher than €2500. Most participants (88.2%) reported access to at least two digital devices. Overall, 88.2% had moderate or high digital health literacy (eHEALS ≥24). App engagement was high: 80.7% used the app at least weekly, and 52.4% used it to prepare for medical visits. However, only 20.1% reported that the app was formally integrated into their medical care, and 11.8% indicated that medication had been adjusted based on app data. In univariable ordinal logistic regression, higher education, longer duration of hypertension, and living in a small town (5,000–20,000 inhabitants) were associated with more frequent app use, whereas systolic blood pressure ≥140 mmHg was associated with less frequent use. Digital health literacy was not clearly associated with app usage frequency among current users. Conclusions: Users of this hypertension self-management app were predominantly well-educated, digitally literate individuals with established hypertension, reinforcing concerns about a persistent digital divide. While app usability and engagement were high, formal clinical integration remained limited. Simply making an app available is insufficient; strategies to promote equitable access, strengthen clinical integration, and support patients with lower digital health literacy are needed for mHealth to contribute effectively to hypertension management. Clinical Trial: German Clinical Trials Register (DRKS00029761)",
    "image": "https://asset.jmir.pub/assets/eb09b7bc151064df9bd41b87f162e042.png",
    "source": "Journal of Medical Internet Research"
  }
]