[
  {
    "title": "Chow Kon Yeow urges swift action to resolve Penang airport congestion",
    "desc": "NIBONG TEBAL, Feb 8 — The recent congestion at Penang International Airport must be addressed immediately by the relevant authorities to ensure smooth passenger processing and to...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/08/324450.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "The Riviera’s invisible partner: Who will care for Gaza’s children?",
    "desc": "Analysis: Gaza's children deserve a new future; They will not find it at a table where the Muslim Brotherhood and its supporters are already seated",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/06/09/r1IT8VUNXlg/r1IT8VUNXlg_0_95_1280_720_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "CRISPR gene-drive technology reverses antibiotic resistance in bacteria",
    "desc": "Antibiotic resistance (AR) has steadily accelerated in recent years to become a global health crisis. As deadly bacteria evolve new ways to elude drug treatments for a variety of illnesses, a growing number of \"superbugs\" have emerged, ramping up estimates of more than 10 million worldwide deaths per year by 2050.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/pill_antibiotics-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Kuaishou’s Kling AI 3.0 Launch Sparks Questions On Undervalued Shares",
    "desc": "Kuaishou Technology has launched Kling AI 3.0, a new version of its AI video and image generation tool. The update introduces features such as improved narrative control, stronger photorealistic consistency, longer video support, and native multilingual audio generation. The release is positioned to support creators who want more control and higher quality outputs from generative AI content tools. Kuaishou Technology, listed as SEHK:1024, is adding Kling AI 3.0 to its product lineup at a...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/ee047812921f935c11e8b8a18a28c857",
    "source": "Yahoo Finance"
  },
  {
    "title": "Police record major drugs bust at border post",
    "desc": "AUTHORITIES have reported the interception of a consignment of drugs that was about to be smuggled into the country through Maitengwe Border Post recently leading to the arrest of one suspect. The Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi, confirmed the arrest of 41-year-old Christopher Dube in connection with the matter. “On February […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2021/02/19165033/marijuana-mbanje-e1614188096779.jpg",
    "source": "newzimbabwe.com"
  },
  {
    "title": "Falcons' James Pearce Jr. arrested in Florida on battery charges",
    "desc": "Falcons linebacker James Pearce Jr., who finished third in Defensive Rookie of the Year voting, was arrested after police said he fled a domestic dispute and crashed his vehicle during a police chase.",
    "image": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0114%2Fr1600305_1296x729_16%2D9.jpg",
    "source": "ESPN"
  },
  {
    "title": "Assessing ERAMET (ENXTPA:ERA) Valuation After Recent Share Price Momentum And DCF Upside Potential",
    "desc": "ERAMET (ENXTPA:ERA) has recently drawn investor attention after a period where the share price showed mixed short term moves, followed by a strong gain over the past 3 months. This has prompted a closer look at fundamentals. See our latest analysis for ERAMET. At a share price of €68.05, ERAMET has seen a 28.4% 90 day share price return and a 23.6% 1 year total shareholder return, while the 3 year total shareholder return remains negative. This indicates that recent momentum looks stronger...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/3eb1acfa01a97be66f224c62f2ff60fd",
    "source": "Yahoo Finance"
  },
  {
    "title": "Assessing Sumitomo Chemical (TSE:4005) Valuation After Strong Recent Share Price Momentum",
    "desc": "Sumitomo Chemical Company (TSE:4005) has drawn investor attention after a recent period of positive share returns over the past week, month and 3 months, prompting closer scrutiny of its fundamentals. See our latest analysis for Sumitomo Chemical Company. At a share price of ¥535.2, Sumitomo Chemical Company has seen short term momentum build, with a 7 day share price return of 13.87% and a 90 day share price return of 23.95%. This is set against a 1 year total shareholder return of 63.28%,...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/ed7b28f41a9633edb07cf3d85648ff36",
    "source": "Yahoo Finance"
  },
  {
    "title": "PM in Malaysia LIVE: India's message on terrorism is clear; no double standards, no compromise, says Modi",
    "desc": "PM Modi Malaysia visit LIVE: PM Modi holds bilateral talks with Malaysian leaders to boost ties between the two countries. Follow The Hindu for more updates.",
    "image": "https://th-i.thgim.com/public/incoming/ud7ex8/article70606505.ece/alternates/LANDSCAPE_1200/2026-02-08T032209Z_1371583283_RC2FHJAM3TMZ_RTRMADP_3_MALAYSIA-INDIA.JPG",
    "source": "thehindu.com"
  },
  {
    "title": "Met Office warns of new damaging bugs coming to the UK",
    "desc": "The UK temperature is rising and that brings the risk of new pests becoming established in the UK, posing threats to agriculture and forestry warns…",
    "image": "https://www.dorsetecho.co.uk/resources/images/19455469.jpg?type=og-image",
    "source": "Dorset Echo"
  }
]