[
  {
    "title": "Ganduje reacts to El-Rufai's comment linking him to Dadiyata’s disappearance",
    "desc": "For several years, many Nigerians on social media have accused Mr El-Rufai, who was Kaduna governor during the abduction, of being behind the incident.",
    "image": "https://media.premiumtimesng.com/wp-content/files/2026/02/MixCollage-14-Feb-2026-01-58-PM-4893.jpg",
    "source": "Premium Times Nigeria"
  },
  {
    "title": "'One of the Worst Decisions Ever Made': God of War Creator Tears 'Total Crap' 2D Title Apart",
    "desc": "\"Who the f*ck wants to play this?\" - God of War creator David Jaffe is not happy with Sons of Sparta, the newly released side-scrolling spin-off in the long-...",
    "image": "https://images.pushsquare.com/fd47b4622742e/large.jpg",
    "source": "Push Square"
  },
  {
    "title": "Glass and pottery found near sinkhole on Hunstanton Prom",
    "desc": "Crockery and glass dating back a century has been revealed after a sinkhole appeared in a seaside town's prom.",
    "image": "https://www.edp24.co.uk/resources/images/20538921.jpg?type=og-image",
    "source": "Eastern Daily Press"
  },
  {
    "title": "Police set up national group to deal with UK-related Epstein allegations",
    "desc": "Senior policing source says ‘tsunami’ of claims expected after US release of papers relating to disgraced financier",
    "image": "https://i.guim.co.uk/img/media/0bd9a7c72e36f34bac2827b73743f2b6a7646857/346_0_2496_1997/master/2496.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ea092c366586088d1307578078aa51dc",
    "source": "The Guardian"
  },
  {
    "title": "Food Allergy Diagnostics are Enhanced by Machine Learning and Deep Learning AI Models",
    "desc": "/PRNewswire/ -- Both machine learning and deep learning AI models show significant improvements over existing clinical criteria of food allergy diagnostics,...",
    "image": "https://mma.prnewswire.com/media/2631132/The_American_Academy_of_Allergy_Asthma_Immunology_Logo.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "The M1 MacBook Air Is Missing, But Why?",
    "desc": "Walmart seems to have run out of stock on new-in-box Apple M1 MacBook Airs. Is this a casualty of the RAM crisis or the precursor to a new affordable era in Mac laptops?",
    "image": "https://sm.pcmag.com/t/pcmag_au/opinion/t/the-m1-mac/the-m1-macbook-air-is-missing-but-why_hhm9.1200.jpg",
    "source": "PCMag Australia"
  },
  {
    "title": "Scientists discover a hidden gut bacterium linked to good health",
    "desc": "A global study has uncovered a mysterious group of gut bacteria that shows up again and again in healthy people. Known as CAG-170, these microbes were found at lower levels in people with a range of chronic diseases. Genetic clues suggest they help digest food and support the broader gut ecosystem. Researchers say the discovery could reshape how we measure and maintain gut health.",
    "image": "https://www.sciencedaily.com/images/1920/intestinal-bacteria-gut-microbiome.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Burundi’s President Évariste Ndayishimiye Takes the Helm as African Union Chair for 2026",
    "desc": "Burundi’s President Évariste Ndayishimiye has been formally elected Chairperson of the African Union (AU) for 2026, taking over from Angola’s João Manuel",
    "image": "https://birrmetrics.com/wp-content/uploads/2026/02/image-1400x900-63.png",
    "source": "Birr Metrics"
  },
  {
    "title": "Baha And Georgina Njenga Say They Are Each Other's Valentines' Fuelling Reunion Rumours",
    "desc": "Former Machachari actor Baha and ex-partner Georgina Njenga appear to have reunited for Valentine's Day, sharing a tender video that sparks reunion speculation.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/c0793809d7c7742b.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "18s live highlights as United run out 3",
    "desc": "Manchester City U18s were beaten 3-1 by Man United in the mini-Manchester derby on Saturday.",
    "image": "https://i2-prod.manchestereveningnews.co.uk/sport/football/article33417645.ece/ALTERNATES/s1200/2_mcfc-united.png",
    "source": "Manchester Evening News"
  }
]