[
  {
    "title": "Winter Olympics 2026: Centenary celebrations will reach a crescendo in Milano Cortina",
    "desc": "Milano Cortina 2026 sits at a pivotal moment in Olympic history, marking a century of the Winter Games.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/agpmrfogkc7qpjo6aafa",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Azitra Announces Adjournment of Special Meeting and Information for Reconvened Special Meeting",
    "desc": "/PRNewswire/ -- Azitra, Inc. (NYSE American: AZTR), a clinical stage biopharmaceutical company focused on developing innovative therapies for precision...",
    "image": "https://mma.prnewswire.com/media/2555910/Azitra_Logo.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "Horseshoe Crab fossil found near Cliffs of Moher",
    "desc": "A horseshoe crab fossil dating back more than three hundred million years, has been discovered in the Clare County Council-managed Burren and Cliffs of Moher UNESCO Global Geopark. The fossil, which is only 2cm in size, has been identified as Euproops danae, a species familiar to the UK, Europe, Russia and North America. This is the […]",
    "image": "https://clareherald.com/wp-content/uploads/2017/01/Cliffs-of-Moher-Drone-1.jpg",
    "source": "The Clare Herald"
  },
  {
    "title": "Jennifer Garner’s Once Upon a Farm Rises 17% After $198 Million IPO",
    "desc": "The closing price gives the company a market value of $847 million, based on the outstanding shares. Berkeley, California-based Once Upon a Farm sold about 7.6 million shares and the selling holders offered around 3.4 million shares, which priced in the middle of the $17 to $19 marketed range. Garner and former Annie’s Chief Executive Officer John Foraker joined in 2017.",
    "image": "https://s.yimg.com/ny/api/res/1.2/7vqr03CPuy9MDJtDjf4ytg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/bloomberg_holding_pen_162/f463588f4912af5cf3fbc2cee30b57b8",
    "source": "Yahoo Finance"
  },
  {
    "title": "Timothy Busfield indicted on four counts of child sexual contact in New Mexico",
    "desc": "A grand jury indictment announced on Friday supersedes initial charges brought by state prosecutors last month.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5a06/live/d9d93220-0390-11f1-a36d-4dc7f32cefeb.jpg",
    "source": "BBC"
  },
  {
    "title": "Hedge Funds Slash Bullish Natural Gas Bets to 13-Month Low",
    "desc": "Hedge funds cut bullish bets on US natural gas after forecasts for mild weather triggered the largest single-day price decline in front-month gas futures in 30 years, forcing traders with long positions to rapidly unwind those bets at a loss.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/imx4FpLlp8Jo/v1/1200x800.jpg",
    "source": "bloomberg.com"
  },
  {
    "title": "Can apes play pretend? Scientists use an imaginary tea party to find out",
    "desc": "For the first time, an experiment hints that an ape in captivity can have an imagination.",
    "image": "https://d3i6fh83elv35t.cloudfront.net/static/2026/02/AP26036547415356-1024x768.jpg",
    "source": "PBS"
  },
  {
    "title": "Dollar heads for weekly rise, yen slumps ahead of Japan's election",
    "desc": "The dollar slipped from two-week highs on Friday, returning some safe-haven gains as risk assets rebounded from a deep rout driven by concerns over a surge in AI-related spending this year.\n...",
    "image": "https://cdn.zonebourse.com/static/resize/0/0//images/reuters/2025-04/2025-04-21T004523Z_1_LYNXMPEL3K00C_RTROPTP_4_SVB-FINANCIAL-GROUP-STOCK.JPG",
    "source": "marketscreener.com"
  },
  {
    "title": "Updated Urticaria Guidelines Clarify Diagnosis, Biomarkers, Treatment Pathways",
    "desc": "The 2024 global update for urticaria preserves the stepwise algorithm and clarifies evidence on biomarkers, provocation testing, pediatric care, and emerging therapies.",
    "image": "https://cdn.sanity.io/images/0vv8moc6/hcplive/b72631fc2644301c8304420ce7b366d1c28a1126-1200x630.png",
    "source": "HCPLive"
  },
  {
    "title": "Watch: Kiwi athletes take part in Winter Olympics opening ceremony",
    "desc": "Three‑time Olympic medallist Zoi Sadowski‑Synnott and freestyle skier Ben Barclay led the way as Aotearoa’s flagbearers, carrying the flag in the town of Livigno.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/flagbearers-zoi-sadowski-synnott-and-ben-barclay-of-team-new-XL5OZ4D2VZDBNBYGKKYSCLTUNQ.jpg?auth=5491177d41d0a70b87dd5c0efaa522049a1d9c138550ed7d57c1f149ee106915&quality=70&width=600&height=315&focal=3061%2C1993",
    "source": "1News"
  }
]