[
  {
    "title": "Doctor Who fans get chance to bid for famous props",
    "desc": "Memorabilia from the cult BBC Wales series is being auctioned online, with lots starting at £100.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4a04/live/c1379970-00f5-11f1-b7e1-afb6d0884c18.png",
    "source": "BBC"
  },
  {
    "title": "Trump urges Republicans to ‘nationalize the voting’ in 15 states, sowing doubt in elections - US politics live",
    "desc": "US president, who is also due to meet Colombia’s president Gustavo Petro weeks after threatening military action in the country, makes comment on elections",
    "image": "https://i.guim.co.uk/img/media/355196f855a99d9d2fc2c3af75c8e325c1a39da6/334_0_3331_2666/master/3331.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=534f7808069fe8a24d974c7c2ac73e19",
    "source": "The Guardian"
  },
  {
    "title": "UN peacekeeping patrols suspended along Lebanon-Israel Blue Line",
    "desc": "UN peacekeepers temporarily suspended patrols and other activities along parts of the ‘Blue Line’ in southern Lebanon after the Israeli military said it would release what it described as a non-toxic chemical substance near the frontier, the UN said on Monday. The incident took place north of the Blue Line on Sunday morning and led to the suspension of more than a dozen UN",
    "image": "https://peacekeeping.un.org/sites/default/files/field/image/un_peacekeeping_patrols_suspended_along_lebanon-israel_blue_line.jpg",
    "source": "United Nations Peacekeeping"
  },
  {
    "title": "RE in NI schools: Paul Givan says Christianity will remain central to syllabus",
    "desc": "The minister adds that the RE syllabus will change to include other main religions and philosophical traditions.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/6c2b/live/76514b20-b87c-11f0-aa13-0b0479f6f42a.jpg",
    "source": "BBC"
  },
  {
    "title": "Sunny Deol Starrer Surpasses Ajay Devgn's Singham Again!",
    "desc": "After entering the 400 crore club recently, Border 2 has now surpassed two big Hindi films at the worldwide box office on its day 11.",
    "image": "https://www.koimoi.com/wp-content/new-galleries/2026/02/border-2-worldwide-box-office-day-11-crosses-ajay-devgns-singham-again-01.jpg",
    "source": "Koimoi"
  },
  {
    "title": "Ancient DNA reconstruction of late holocene ecosystems within the Carpathian basin from paleo-meanders and archaeological deposits",
    "desc": "The diverse ecology in the Carpathian Basin supported a variety of subsistence strategies throughout the Holocene, ranging from animal husbandry to the management of woodlands, grasslands, and wetlands. The earliest evidence of aquatic resource use in the region dates back to the Early Neolithic (~ 6200−5300 cal BC), with cultural practices extending into recent times. This is reflected in the numerous open-air archaeological sites widely distributed across the landscape and on the Danube meanders. However, the archaeological record, especially organic remains and fossils, may not fully capture the region’s species diversity due to degradation and scarcity, hindering the accurate reconstruction of past human-environment interactions. Recent studies have shown that ancient DNA in sediments (sedaDNA) can survive even in the absence of visible fossils, however, these studies have primarily been limited to cave-, lake- and permanently frozen sedimentary deposits. Here, we investigate two open-air archaeological sites and three paleo meander deposits of the Danube in Serbia (southeastern Europe) using sedaDNA. Our analysis reveals genetic traces from past freshwater and terrestrial ecosystems and local exploitation of the migratory sturgeon species, currently extirpated from the region. We find sedaDNA preserved in sediments from unsheltered archaeological contexts and explore the associated challenges that require further investigation.",
    "image": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41598-026-35509-2/MediaObjects/41598_2026_35509_Fig1_HTML.png",
    "source": "Nature"
  },
  {
    "title": "WhatsApp makes reacting to Status more fun with THIS amazing feature: Details inside",
    "desc": "Meta owned platform Whatsapp has introduced a new feature making group chat more creative and engaging.The feature Status Reaction Stickers—allows users to react to status updates with reaction strickers, similar to how reactions...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-03/l_648788_041212_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "The Under-the-Radar AI Infrastructure Stock You Won't Want to Miss",
    "desc": "Brookfield Infrastructure is building a leader in AI infrastructure.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F854117%2Fgettyimages-1482224658-1201x615-8f01a84.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "IDF names Ella Waweya as Arabic spokesperson",
    "desc": "Major Ella Waweya, known as \"Captain Ella,\" will replace Col. Avichay Adraee as the IDF’s Arabic-language spokesperson, taking charge of Arabic outreach across platforms.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/608743",
    "source": "The Jerusalem Post"
  },
  {
    "title": "New catalyst turns carbon dioxide into clean fuel source",
    "desc": "Researchers have found that manganese, an abundant and inexpensive metal, can be used to efficiently convert carbon dioxide into formate, a potential hydrogen source for fuel cells. The key was a clever redesign that made the catalyst last far longer than similar low-cost materials. Surprisingly, the improved manganese catalyst even beat many expensive precious-metal options. The discovery could help turn greenhouse gas into clean energy ingredients.",
    "image": "https://www.sciencedaily.com/images/1920/abstract-hot-energy-chemistry-reaction.webp",
    "source": "ScienceDaily"
  }
]