[
  {
    "title": "Who will Arsenal face in Champions League last-16 knockout stage?",
    "desc": "Gunners cruised through the league phase as table-toppers with 100 per cent winning record",
    "image": "https://static.standard.co.uk/2026/01/28/21/05/arsenal28012026a-jpg.jpeg?width=1200&auto=webp&quality=75",
    "source": "standard.co.uk"
  },
  {
    "title": "'Bombshell': What top general's fall means for China's military",
    "desc": "BEIJING: China has purged top generals before, but the announcement that Zhang Youxia (pic), the vice-chairman of the powerful Central Military Commission (CMC), is being investigated for corruption shocked defence observers.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/29/3743733.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Trade setup for Jan 29: Can NIFTY50 hold the gains above 25,300 levels on Thursday?",
    "desc": "The GIFT NIFTY futures indicate a gap-down opening for Indian markets on Thursday amid mixed cues from the global markets. The NIFTY50 held the 200 EMA support level for the second consecutive session, indicating for a reversal from the bearish setup.",
    "image": "https://assets.upstox.com/content/assets/images/news/stockmarketwrap11133.webp",
    "source": "Upstox"
  },
  {
    "title": "GIC and Sony Music Group Announce New Investment Partnership",
    "desc": "New Capital Vehicle Aims to Acquire and Grow Value for Music Catalogs Singapore and New York, January 28, 2026 – GIC, a global institutional investor, and Sony Music Group (SMG), one of the world’s leading music groups, today announced the establishment of an investment partnership to acquire and amplify high‑quality, marquee music catalog assets across a range of […]",
    "image": "https://www.gic.com.sg/tachyon/2021/03/default-demo.jpg",
    "source": "gic.com.sg"
  },
  {
    "title": "Stock market today: Trade guide for Nifty 50, gold, silver rates, US Fed meet to Economic Survey 2026 - 8 stocks to buy",
    "desc": "Stock market today: Experts have recommended these eight stocks to buy today — Canara Bank, Jindal Steel, Paytm, Hindustan Petroleum, UPL, HBL Engineering, Rashtriya Chemicals and Fertilizers, and BHEL",
    "image": "https://www.livemint.com/lm-img/img/2026/01/29/1600x900/logo/Economic_Survey_2026_Gold_Silver_rate_today_1769650972347_1769650972543.png",
    "source": "Mint"
  },
  {
    "title": "Blue Bombers add All-CFL receiver White on one-year deal",
    "desc": "The Winnipeg Blue Bombers made a major addition to their offence on Wednesday, signing All-CFL wide receiver Tim White to a one-year contract.",
    "image": "https://www.tsn.ca/resizer/v2/EYOSVBF4AROZBEJ4MW65XFNUIE.jpg?smart=true&auth=68443c2e4e7eb2c7b2fb0d5c6640fb191fa22decfc3477e6563e32997b5359fd&width=1200&height=630",
    "source": "TSN"
  },
  {
    "title": "Democrats visit detained 5-year-old at Texas facility",
    "desc": "Democratic Reps. Joaquin Castro and Jasmine Crockett have met with a 5-year-old Ecuadorian boy and his father at a Texas immigration detention center, a case that has stirred anger over the Trump administration’s immigration policies.",
    "image": "https://dims.apnews.com/dims4/default/271a22a/2147483647/strip/true/crop/3508x2337+0+2/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fb2%2F55%2F4fd164074e134e9b79edef07a746%2F3875c8ff001444ea8d496e205dcbaad7",
    "source": "AP News"
  },
  {
    "title": "Xiaomi’s SU7 Ultra enters Gran Turismo 7, marking first Chinese car in flagship racing game",
    "desc": "Xiaomi’s flagship electric vehicle, the SU7 Ultra, has been added to Sony’s hit racing game Gran Turismo 7, becoming the first car from a Chinese brand to",
    "image": "https://technode.com/wp-content/uploads/2026/01/su7-ultra.png",
    "source": "TechNode"
  },
  {
    "title": "Angry Bhumi Pednekar reacts to 6-year-old being gang-raped by three minors in Delhi: ‘Wake up India’",
    "desc": "Bhumi Pednekar took to Instagram to repost screenshot of an article around six-year-old gang-raped by three boys, aged 10-14, in Delhi, and express her outrage. | Bollywood",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/01/29/550x309/Bhumi_1769654113147_1769654118168.webp",
    "source": "Hindustan Times"
  },
  {
    "title": "Proton AMA02 launching in 2026 - Saga Cross SUV, MPV or hatchback, DHT120 hybrid to debut?",
    "desc": "Proton is being incredibly bullish this year, targeting a 26% increase in sales to 200,000 units. Central to its expected surge is the new Saga, but the national carmaker will also need new product to …",
    "image": "https://paultan.org/image/2026/01/Proton-Saga-Cross-render-2026-1-e1769423013901-1200x678.jpg",
    "source": "Paul Tan's Automotive News"
  }
]