[
  {
    "title": "Some schools closed today in GTA, buses cancelled in Toronto on Feb. 18, 2026",
    "desc": "Here is a look at some of the school bus cancellations in the GTHA on Feb. 18, 2026.",
    "image": "https://www.cp24.com/resizer/v2/F42L75EFJ5F6FN5AQT6DLWVUDQ.jpg?smart=true&auth=fa21d68cff61cb193d2ce1f18a330360aee2c9f2a767b7c52319ba964589bf7b&width=1200&height=630",
    "source": "CP24"
  },
  {
    "title": "Tanzania renews efforts to increase honey export from 24 to 50 percent by 2027",
    "desc": "DODOMA: TANZANIA’S Forestry and Beekeeping Department has been directed to develop deliberate strategies to increase honey production and exports in order to boost economic benefits and contribute more to the national GDP. Deputy Minister for Natural Resources and Tourism Hamad Hassan Chande made the call during a working session with beekeeping sector experts in Dodoma,",
    "image": "https://dailynews.co.tz/wp-content/uploads/2023/01/download.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "David Maraga Convoy Stoned",
    "desc": "Maraga was forced to drive off after the youths blocked the road and began hurling stones.",
    "image": "https://nairobileo.co.ke/storage/uploads/2026/02/HAJL730XYAEJCBf-1770030021.jpg",
    "source": "Nairobi Leo"
  },
  {
    "title": "Video shows great white shark circling divers in Australia",
    "desc": "SYDNEY: Life savers have released chilling helicopter footage of a 4.5-metre (15-foot) great white shark that was circling two unsuspecting divers in Western Australia.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/18/3775447.jpg",
    "source": "The Star"
  },
  {
    "title": "Hayley Williams reveals new detail behind Taylor Swift 'Speak Now' collab",
    "desc": "Hayley Williams collaborated on her longtime friend Taylor Swift's Speak Now song Castles Crumbling, but fans still didn't know how the song really came along.The 37-year-old rockstar discussed the beginning of her creative...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-18/l_651586_042556_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Barcelona presidential candidate unfurls huge Lionel Messi banner in city centre & uses slogan from previous Joan Laporta campaign",
    "desc": "Barcelona presidential candidate Marc Ciria has unfurled a huge banner featuring club legend Lionel Messi in the city centre as he continues his campaign to replace Joan Laporta at the helm of the Catalan giants. Ciria has also added the slogan used by Laporta in a poster near the Santiago Bernabeu in his previous election campaign: \"Looking forward to seeing you again.\"",
    "image": "https://assets.goal.com/images/v3/blte8488fd4d6c7e47c/GOAL%20-%20Blank%20WEB%20-%20Facebook(1).jpg",
    "source": "Goal.com"
  },
  {
    "title": "Barcelona presidential candidate unfurls huge Lionel Messi banner in city centre & uses slogan from previous Joan Laporta campaign",
    "desc": "Barcelona presidential candidate Marc Ciria has unfurled a huge banner featuring club legend Lionel Messi in the city centre as he continues his campaign to replace Joan Laporta at the helm of the Catalan giants. Ciria has also added the slogan used by Laporta in a poster near the Santiago Bernabeu in his previous election campaign: \"Looking forward to seeing you again.\"",
    "image": "https://assets.goal.com/images/v3/blte8488fd4d6c7e47c/GOAL%20-%20Blank%20WEB%20-%20Facebook(1).jpg",
    "source": "Goal.com"
  },
  {
    "title": "Jhon Duran booked FIVE MINUTES into Zenit debut after ugly clash with opposition defender",
    "desc": "Jhon Duran’s career continues to be a whirlwind of goals and controversy, with his latest chapter in Russia starting in explosive fashion. The former Aston Villa striker, who recently completed a loan move to Zenit St Petersburg, found himself in the referee's notebook just five minutes into his debut for the club. It was a baptism of fire for the Colombian international, whose reputation for high-intensity play—and occasional loss of discipline—preceded him to his new surroundings. The 22-year-old was named in the starting XI for a pre-season friendly against Shanghai Port, a match intended to integrate him into the squad. However, the \"friendly\" nature of the contest was quickly forgotten when Duran became embroiled in a physical altercation with an opposition defender while chasing a long ball. The forward appeared to lose his composure during a battle for possession, leading to a confrontation that left spectators and officials stunned by its intensity so early in the game.",
    "image": "https://assets.goal.com/images/v3/getty-2257121678/crop/MM5DIMBQGA5DEMRVGA5G433XMU5DONRXHIYTKNY=/GettyImages-2257121678.jpg",
    "source": "Goal.com"
  },
  {
    "title": "As War Nears Its End, Experts Say Israel’s Trauma Is Only Beginning",
    "desc": "More than two years after the worst terrorist […]",
    "image": "https://themedialine.org/wp-content/uploads/2025/08/freepik__the-style-is-candid-image-photography-with-natural__48539-e1761479013538.jpeg",
    "source": "The Media Line"
  },
  {
    "title": "Israeli biotech Starget secures $18 million Series A to accelerate precision cancer t",
    "desc": "The Israeli startup is set to launch advanced trials for first-of-its-kind sarcoma treatment in collaboration with MD Anderson.",
    "image": "https://pic1.calcalist.co.il/picserver3/crop_images/2026/02/18/SJ4F66z00bx/SJ4F66z00bx_0_132_1921_1081_0_large.jpg",
    "source": "CTech"
  }
]