[
  {
    "title": "Max Scherzer, Blue Jays reach agreement on 1-year deal: reports",
    "desc": "The Toronto Blue Jays and Max Scherzer have reached an agreement on a one-year deal worth $3 million US, according to multiple reports.",
    "image": "https://i.cbc.ca/ais/f98ba1a5-1f73-4dc4-a29b-cd60bd765dcc,1772087140002/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C184%2C2274%2C1279%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Rescue service volunteers hoped to find Noah Donohoe alive, inquest told",
    "desc": "The boy’s body was found in a storm drain tunnel in north Belfast in June 2020 that could ‘could be easily opened’, the inquest heard.",
    "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjZcXFwvMDJcXFwvMjYwNjI3MzJcXFwvMi41NDI4NTc2Ny5qcGdcIixcIndpZHRoXCI6MTIwMCxcImhlaWdodFwiOjYyNyxcImRlZmF1bHRcIjpcImh0dHBzOlxcXC9cXFwvd3d3LmJyZWFraW5nbmV3cy5pZVxcXC9pXFxcL2JuLW5vaW1hZ2UucG5nXCIsXCJvcHRpb25zXCI6W119IiwiaGFzaCI6ImM5MGRiMmI1OTA1ODExNGUyOTQ4NTNiMGQyZjA5N2Y5MzlkMzUzY2EifQ==/rescue-service-volunteers-hoped-to-find-noah-donohoe-alive-inquest-told.jpg",
    "source": "BreakingNews.ie"
  },
  {
    "title": "Exclusive | Yash’s 'Toxic' Signs Massive Distribution Deal In Tamil",
    "desc": "In a landmark deal for the Tamil Nadu trade, Yash’s Toxic: A Fairy Tale for Grown Ups, has been signed for a huge deal value of₹63 crore advance on a commission basis, marking one of the most significant distribution deals in the territory in recent years. Unlike one single distributor taking over the rights like in other territories, the model in Tamil would see a network of multiple distributors executing the film’s rollout. This is expected to not only increase the film’s reach but also help manage the massive expectations that the Yash-starrer comes along with.",
    "image": "https://cdn.hollywoodreporterindia.com/article/Toxic.webp",
    "source": "The Hollywood Reporter India"
  },
  {
    "title": "Sree Vishnu’s Vishnu Vinyasam: Crisp Runtime Turns Big Advantage",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/02/Untitled-10-4.webp",
    "source": "123telugu.com"
  },
  {
    "title": "US Billionaire David Blitzer Joins RCB Ownership Race. Reports Reveals Mammoth Valuation",
    "desc": "Billionaire David Blitzer is eyeing a majority stake in an Indian Premier League cricket team and is holding talks with two franchises, two sources said, stoking a bidding war against Manchester United co-chairman Avram Glazer and Indian tycoons.",
    "image": "https://c.ndtvimg.com/2026-02/nkcf4e14_sc_625x300_26_February_26.jpeg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
    "source": "NDTV Sports"
  },
  {
    "title": "CMC proposes local processing drive to stabilise cocoa sector",
    "desc": "The Cocoa Marketing Company (CMC) Ghana Limited has proposed a set of measures, including increased local processing and strengthened forward sales strategies, to stabilise Ghana’s cocoa sector.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Screenshot-2026-02-26-at-5.54.14-AM.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "'Inadequate' Liverpool care home placed under special measures",
    "desc": "The care home, in Croxteth, Liverpool, has been rated inadequate three times in four years.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/bf01/live/dc7b6460-126f-11f1-bdac-03d06e968f36.jpg",
    "source": "BBC"
  },
  {
    "title": "Auckland and Northland hospitals hit by 'major' IT outage",
    "desc": "It is the second critical IT failure in less than a month, the union says.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--NllO-xT_--/t_tohu-badge-facebook/v1644796659/4LWFKLK_copyright_image_286473?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "LHC rules government employees cannot insist on preferred postings, dismisses transfer plea",
    "desc": "Justice Raheel Kamran Sheikh of the Lahore High Court has ruled that public servants cannot claim the right to serve at a station of their choice, observing that",
    "image": "https://www.nation.com.pk/digital_images/large/2026-02-26/lhc-rules-government-employees-cannot-insist-preferred-postings-dismisses-transfer-plea-1772087198-2611.jpg",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "Daily Post Nigeria",
    "desc": "Atletico Madrid manager, Diego Simeone has noted that Club Brugge missed midfielder, Raphael Onyedika during their UEFA Champions League Round of 16",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/Diego-Simeone.jpg",
    "source": "Daily Post Nigeria"
  }
]