[
  {
    "title": "WHO sees low risk of Nipah virus spreading beyond India",
    "desc": "HYDERABAD — There is a low risk of the deadly Nipah virus spreading from India, the World Health Organisation said on Friday (Jan 30), adding that it did not recommend travel or trade curbs after two infections reported by the South Asian nation.Hong Kong, Malaysia, Singapore, Thailand and Vietnam are among the Asian locations that tightened airport screening checks this...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Jan2026/thailand%20airport%20nipah%20virus%20screening_0.jpg?itok=BsjptPbc",
    "source": "AsiaOne"
  },
  {
    "title": "Powerful bomb cyclone to deliver snow and hurricane-force winds to Southeast this weekend",
    "desc": "Snow, damaging winds and dangerous coastal flooding are expected to impact parts of the southern Appalachians, the Carolinas and southern Virginia this weekend as a powerful winter storm rapidly intensifies off the Southeast coast.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/web-storm-setup-0130.png?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "You have the chance to reverse your prophecy or we will call you fake - Opare Ansah to pastors",
    "desc": "Former Member of Parliament for Suhum, Fred Opare Ansah, has warned pastors who have prophesied against former Vice President Dr Mahamudu Bawumia ahead of the New Patriotic Party (NPP) presidential primaries scheduled for January 31, 2026, to...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/597/59728830.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "From Fuel Stations to Rolls-Royce: Assets seized in ex-NPA CEO trial",
    "desc": "The Office of the Special Prosecutor (OSP) says it has seized and is managing a range of high-value assets linked to the ongoing criminal case against former National Petroleum Authority (NPA) CEO, Dr Mustapha Abdul-Hamid, and nine others.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/360/36029836.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Patient-reported outcomes data enhances how cancer treatment toxicities are evaluated",
    "desc": "An international study has demonstrated that access to patient-reported outcome data improves the evaluation of cancer treatment adverse events.",
    "image": "https://www.oncology-central.com/wp-content/uploads/2026/01/Oncology-central-feature-image-7.png",
    "source": "Oncology Central"
  },
  {
    "title": "Trump says he plans to talk to Iran while Pentagon prepares for possible action",
    "desc": "WASHINGTON — President Donald Trump said on Thursday (Jan 29) he planned to speak with Iran, even as the US dispatched another warship to the Middle East and Pentagon chief Pete Hegseth said the military would be ready to carry out whatever the president decided.Speaking to reporters, Trump did not elaborate on the nature or timing of any dialogue or...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Jan2026/0130_US%20Defense%20Secretary%20Pete%20Hegseth%20speaks%20next%20to%20President%20Donald%20Trump.jpg?itok=XX5DKWw7",
    "source": "AsiaOne"
  },
  {
    "title": "Hamid Ansari's 'Ghazni Indian looter' remark sparks row, BJP says Congress ecosystem 'eulogises' Hindu haters",
    "desc": "BJP spokesperson Shehzad Poonawalla on Friday shared an interview clip of Ansari in which he could be heard mentioning the Mahmoud of Ghazni and the Lodi rule.| India News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/01/30/550x309/hamid_ansari_1769756550889_1769756555027.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Another setback for Zii Jia as he retires against Alwi in Thailand",
    "desc": "PETALING JAYA: Shuttler Lee Zii Jia suffered a fresh blow after he was forced to retire from his quarter-final match against Indonesia's Alwi Farhan in the Thailand Masters.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/30/3746266.JPG",
    "source": "thestar.com.my"
  },
  {
    "title": "AI Boosts Early Breast Cancer Screening, Study Finds",
    "desc": "Researchers and professionals stress that any rollout should be done cautiously, and with human supervision.",
    "image": "https://media.says.com/2026/01/pXrqy89W-Ians-Cover-Images.png",
    "source": "SAYS"
  },
  {
    "title": "Causal evidence for a domain-specific role of left superior frontal sulcus in human perceptual decision-making",
    "desc": "Disrupting left superior frontal sulcus selectively impaired perceptual but not value-based decisions, revealing segregated prefrontal circuits for integrating sensory evidence versus subjective preferences in human choice behaviour.",
    "image": "https://elifesciences.org/assets/images/social/icon-600x600@1.52e87ee6.png",
    "source": "eLife"
  }
]