[
  {
    "title": "bailable arrest warrant for CM Afridi in cybercrime case",
    "desc": "ISLAMABAD, JAN 28 /DNA/: An Islamabad district and sessions court on Wednesday issued a non-bailable arrest warrant for Khyber Pakhtunkhwa",
    "image": "https://islamabadpost.com.pk/wp-content/uploads/2026/01/ARTICAL-PIC-81.png",
    "source": "islamabadpost.com.pk"
  },
  {
    "title": "Adu Boahene Case: Supreme Court throws out AG's review application",
    "desc": "The Supreme Court has reportedly dismissed a review application filed by the Attorney General, Dr Dominic Akuritinga Ayine, challenging the court's earlier ruling on criminal disclosures in the case involving former National Signals Bureau...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/692/69270952.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "60% of Filipinos distrust China, survey reveals",
    "desc": "(UPDATE) A MAJORITY of Filipinos distrust China and view Beijing as a threat, according to the latest survey conducted by OCTA Research.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/01/28/915300.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "French company Carester teams up with Malaysian miner Malaco on rare earths project, French government adviser says",
    "desc": "French rare earths specialist Carester and Malaysian miner Malaco Mining Group have teamed up to work on a rare earths separation plant, and will also collaborate on rare earth mining, an adviser to...\n-January 28, 2026 at 07:51 am EST\n- MarketScreener",
    "image": "https://www.marketscreener.com/images/twitter_MS_fdnoir.png",
    "source": "marketscreener.com"
  },
  {
    "title": "Trump says 'time running out' as Iran rejects talks amid 'threats'",
    "desc": "Time running out for Iran to make nuclear deal: Trump.US president says ‘massive armada' heading to Iran.Turkiye urges US to start nuclear talks with Tehran.PARIS: President Donald Trump on Wednesday warned...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-01-28/l_647721_055158_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "What is Tanzania's economy performance in 2025? - TICGL",
    "desc": "Tanzania Economic Performance Evaluation 2025: Comprehensive Analysis & 2026 Outlook | TICGL Tanzania Economic Performance Evaluation 2025 Review and 2026 Outlook GDP Growth: 5.9% in 2025 | Projected 6.1% in 2026 📊 Introduction Tanzania's economy demonstrated robust resilience in 2025, achieving real GDP growth of 5.9%, slightly exceeding initial projections and maintaining the country's position",
    "image": "https://ticgl.com/wp-content/uploads/2026/01/Blue-Economy.jpg",
    "source": "Tanzania Investment and Consultant Group Ltd"
  },
  {
    "title": "'Wonder Man' Sets New MCU Record with Audience Rotten Tomatoes Score",
    "desc": "The MCU has been struggling to find a show that pleases audiences, and all it needed to do was be less MCU.",
    "image": "https://static0.moviewebimages.com/wordpress/wp-content/uploads/2025/11/yahya-abdul-mateen-ii-in-wonder-man-1.jpg?w=1600&h=900&fit=crop",
    "source": "MovieWeb"
  },
  {
    "title": "MACC seizes RM18.8mil in assets, freeze 121 bank accounts with RM11.5mil in massage parlour chain graft probe",
    "desc": "KUALA LUMPUR: Some RM18.8mil in luxury vehicles and assets were seized while 121 bank accounts with RM11.5mil in funds were frozen by graft busters in connection with alleged enforcement-related corruption involving a prominent massage parlour chain.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/28/3743130.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "The 2 Johnnies share €719,000 in directors' pay in another bumper year for comedy duo",
    "desc": "The 2 Johnnies are laughing all the way to the bank after sharing directors’ pay of more than €715,000 at their firm last year",
    "image": "https://www.kildare-nationalist.ie/cms_media/module_img/7662/3831163_1_articledetail_cc-rte-new-season56.jpg",
    "source": "kildare-nationalist.ie"
  },
  {
    "title": "Emulate Sarawak rather than shut down pig farms, says MP",
    "desc": "PKR’s Tan Kar Hing says MPs should propose better regulations to supervise the industry, not just call for the closure of pig farms.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/01/4fa2953b-pig-farm-file-resize-120125.webp",
    "source": "Free Malaysia Today"
  }
]