[
  {
    "title": "Thailand votes after three leaders in two years",
    "desc": "BANGKOK: Thais voted Sunday in an election pitting the popular reformists who came first last time against the conservative who ended up as prime minister, with ex-leader Thaksin Shinawatra looming large from his prison cell. The Southeast Asian nation’s next government will need to contend with anaemic economic growth — the tourism sector vital but arrivals yet to return to",
    "image": "https://www.arabnews.pk/sites/default/files/styles/660x371_watermarkpakistan/public/main-image/2026/02/08/4682888-998240959.jpg?itok=IDFsvN9J",
    "source": "Arab News PK"
  },
  {
    "title": "Sir David Beckham posts message to estranged son Brooklyn Peltz Beckham",
    "desc": "As the family feud tearing the Beckham clan apart deepens, Sir David Beckham has posted on social media with a subtle reference to his estranged son,...",
    "image": "https://www.nzherald.co.nz/resizer/v2/N5NCFREZVJA4TFTUOQHF3GEWJ4.jpg?auth=bd3232281f598535b4e5e22dc75d4976236d7e6ab4d05fb020ab6f6d8a8b7310&width=1200&height=675&quality=70&focal=699%2C224&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "For Nigeria to achieve food security, government must treat manufacturing as infrastructure",
    "desc": "Adeola Balogun, founder and the CEO of Limlim Foods Production Company Ltd, is into African agricultural food processing and in the...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2026/02/Untitled-design-2026-02-08T054639.598-1.png",
    "source": "Businessday NG"
  },
  {
    "title": "EPL: Great finisher, so humble - Owen Hargreaves hails two Man Utd players",
    "desc": "Former Manchester United player, Owen Hargreaves has praised Bryan Mbeumo and Kobbie Mainoo for their standout performances against Tottenham Hotspur in",
    "image": "https://dailypost.ng/wp-content/uploads/2024/04/Owen-Hargreaves.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Reaction to Trump’s Racist Post Shows He Is Not Always Immune to Politics",
    "desc": "With the midterm elections nearing, President Trump has found himself in the uncomfortable position of backtracking, even if only by degrees, at key moments.",
    "image": "https://static01.nyt.com/images/2026/02/06/multimedia/07dc-trump/06trump-news-reporter-updates-mtfz-facebookJumbo-v2.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Voting under way in rare winter election in Japan",
    "desc": "Japanese voters are casting their ballots in an election predicted to hand Prime Minister Sanae ⁠Takaichi a win, but record snow in some parts of the country snarled traffic and could dent turnout.",
    "image": "https://www.rte.ie/images/0023dcea-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Early tuberculosis treatment reduces sepsis deaths in HIV patients",
    "desc": "Sepsis is a leading global cause of hospital deaths, occurring when the body's response to infection damages tissue and causes organs to fail. Africa bears the world's highest burden of sepsis, with an estimated 48 million cases each year leading to about 11 million deaths.",
    "image": "https://www.news-medical.net/image-handler/picture/2018/9/By_royaltystockphoto_d68ea3ab1d0440e8ab54454b7f5609db-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Haas to leave Broncos for Souths in one of game's biggest coups",
    "desc": "South Sydney are set to pull off one of the NRLs biggest recruitment coups after Samoan superstar Payne Haas told the Broncos he plans to leave at the end of the season.",
    "image": "https://www.nrl.com/contentassets/3059ad21c19043f49e7c92dbb78ddc5f/79829203_haasp-251006_sd_1300_202510615318.jpg?center=0.541%2C0.484&preset=share",
    "source": "NRL.com"
  },
  {
    "title": "JJ Redick reveals critical Deandre Ayton injury news for Lakers",
    "desc": "Deandre Ayton is out on a day-to-day basis for the Los Angeles Lakers, head coach JJ Redick told reporters after the team's 105-99 Saturday win over the Golden ...",
    "image": "https://basketnews.com/image-453202-any1200x1200.jpg",
    "source": "BasketNews.com"
  },
  {
    "title": "Marriage solemnisations to return to Canning Rise in 2029 after redevelopment",
    "desc": "Discover how marriage solemnisations will return to a redeveloped Canning Rise in 2029, offering couples enhanced facilities and scenic spaces in Singapore. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/d62c1fc1c52f1c6cbf960df68c29fa09b5cbf29f1f73fe8931d452fe0accc496",
    "source": "The Straits Times"
  }
]