[
  {
    "title": "Lainey Wilson brings 6-year-old girl fighting stage 4 cancer on stage",
    "desc": "Lainey Wilson gave love and support to a young fan at her concert in Australia.",
    "image": "https://thenationaldesk.com/resources/media2/16x9/3331/986/0x236/90/5a743722-38ac-43ce-b5fb-a2bb4b19f7aa-GettyImages2259472607.jpg",
    "source": "The National News Desk"
  },
  {
    "title": "Memon questions hike in POL prices ahead of Ramazan",
    "desc": "Sindh’s Senior Minister Sharjeel Inam Memon expressed deep concern over the increase in petroleum product prices, stating that the rise of 5 rupees per liter in petrol and 7.32 rupees per liter in diesel just before the holy month of Ramadan will further intensify inflationary pressures. In his statement on the social media platform X, […]",
    "image": "https://dailytimes.com.pk/assets/uploads/2026/02/Sharjeel-Memon-copy-2.jpg",
    "source": "Daily Times"
  },
  {
    "title": "Sultan confirms crescent sighting — Ramadan to begin Wednesday",
    "desc": "Muhammad Sa’ad Abubakar, president of the Supreme Council for Islamic Affairs (NSCIA), has confirmed that the crescent signalling…",
    "image": "https://www.thecable.ng/wp-content/uploads/2026/02/Ramadan-moon.jpeg",
    "source": "TheCable"
  },
  {
    "title": "King Charles shares important message for Muslims",
    "desc": "King Charles has wished a blessed and peaceful Ramadan to all the Muslims around the world.On Tuesday, February 17, the royal family's official Instagram handle shared a special message of Ramadan Mubarak.Buckingham...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-18/l_651450_012812_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Man in tactical vest with loaded shotgun arrested after charging US Capitol, police say",
    "desc": "An 18-year-old in a tactical vest who charged the US Capitol with a loaded shotgun Tuesday was quickly arrested, US Capitol Police said.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gun-arrest-2-17-26-1.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "US military strikes three alleged drug",
    "desc": "US News: The US military struck three alleged drug-trafficking vessels in the eastern Pacific and Caribbean on Monday night, killing all 11 people on board, US.",
    "image": "https://static.toiimg.com/thumb/msid-128480213,width-1280,height-720,imgsize-16914,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Mail reporter denies making payments for Stephen Lawrence information",
    "desc": "Stephen Wright was giving evidence at the privacy case brought by the mother of the murdered teenager and others against the newspaper's publisher.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/fbad/live/ca9c6cb0-0c1d-11f1-9962-d3ccfadea8b5.jpg",
    "source": "BBC"
  },
  {
    "title": "US president’s son Eric Trump invests in drone maker with gov’t contracts",
    "desc": "Israel’s Xtend recently won US Defense Department contract, is bidding for another before merger with JFB Construction.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/2026-02-17T154334Z_2123575230_RC2WYIAITY79_RTRMADP_3_JFB-CONSTR-HLDG-XTEND-1771349187.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Saudi Arabia announces start of Ramadan as Nigerian muslims await crescent moon",
    "desc": "“Crescent has been SIGHTED. Subsequently, tomorrow, i.e., Wednesday, 18 February 2026, will be the first day of Ramadan 1447,” a statement on the official Facebook page of the holy mosques read.",
    "image": "https://media.premiumtimesng.com/wp-content/files/2024/04/moon-7362632_1920.jpg",
    "source": "Premium Times Nigeria"
  },
  {
    "title": "Edem Agbana to petition GES over colonisation content in Aki-Ola textbook",
    "desc": "Member of Parliament for Ketu North, Eric Edem Agbana, has announced that he will formally petition the Ghana Education Service (GES) to immediately review",
    "image": "https://citinewsroom.com/wp-content/uploads/2026/02/Edem-Agbana.jpg",
    "source": "CitiNewsroom.com"
  }
]