[
  {
    "title": "Please Don't Hack Your Ray-Ban Smart Glasses to Buy Things for You",
    "desc": "As tempting as it may be, it's also a huge security risk.",
    "image": "https://gizmodo.com/app/uploads/2025/10/Meta-Ray-Ban-Display-review-05-1200x675.jpg",
    "source": "Gizmodo"
  },
  {
    "title": "Two skiiers dead following avalanches in French Alps",
    "desc": "The incidents occurred just two days after two skiiers were killed in an avalanche near the village of Saint-Veran.",
    "image": "https://img2.thejournal.ie/article/6952211/river/?height=400&version=6952216",
    "source": "The Journal"
  },
  {
    "title": "If Eileen Gu seems to have it all, it’s because she does",
    "desc": "The wealth machine created by the young Chinese-American Olympic sensation and global brand seems unstoppable - so far",
    "image": "https://www.theglobeandmail.com/resizer/v2/MFB6JQIDWJBE3NTBTTPC5ACFBM.jpg?auth=89b30944d2d365c3ebe94b1a5018afca72dbcbd1b07fc794483371c1805189d9&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "Edinburgh bus fire LIVE: Flames erupt in city centre as people flee",
    "desc": "One eyewitness has described their panic after seeing huge flames erupt from the bus.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/1/1200x630/6731341.jpg",
    "source": "Daily Express"
  },
  {
    "title": "Big Take: What’s at Stake for US",
    "desc": "Understand every aspect of the global economy – and know how to make your next move.",
    "image": "https://www.bloomberg.com/favicon-black.png",
    "source": "Bloomberg.com"
  },
  {
    "title": "The character of a Christian must reflect Jesus Christ - EPCG Moderator",
    "desc": "By Emmanuel Nyatsikor Ho, Feb 9, GNA – Right Rev. Dr. Lt. Col. (Rtd) Bliss Divine Agbeko, Moderator of the General Assembly of the Evangelical Presbyterian Church, Ghana…",
    "image": "https://gna.org.gh/web/wp-content/uploads/2022/04/cropped-cropped-WhatsApp-Image-2022-04-06-at-7.25.37-AM-150x150.jpeg",
    "source": "Ghana News Agency"
  },
  {
    "title": "SFUSD teachers strike, Day One: Where have all the children gone?",
    "desc": "With schools closed, the parents of 50,000 students try to figure out where to put them.",
    "image": "https://assets.sfstandard.com/image/994911177489/image_6207ctrfl50ep8qgpa8e67a518/-S1200x630-FPNG",
    "source": "The San Francisco Standard"
  },
  {
    "title": "Two-thirds of Albertans would vote to stay in Canada or lean that way, new poll suggests",
    "desc": "Petition signings and packed town halls haven't swayed a vast majority of Albertans toward separating from Canada, new data suggests. A poll released Monday found that 65 per cent say they would either vote to stay in Canada or lean that way if a referendum on Alberta independence were held today, while 29 per cent say they lean toward or would definitely vote for separation.",
    "image": "https://i.cbc.ca/ais/a5acb0c0-46d5-4a65-b2d4-baec34b4bb33,1770606668370/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C590%2C4032%2C2268%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "High-fibre diet boosts gut health in people with Prader-Willi syndrome",
    "desc": "A U of A research team is looking at whether fibre might improve symptoms for people with Prader-Willi syndrome, a rare genetic disorder that causes insatiable appetite and leads to childhood obesity.",
    "image": "https://www.ualberta.ca/favicon.svg",
    "source": "ualberta.ca"
  },
  {
    "title": "Let the games begin: Stars looking forward to “experience of a lifetime” at Olympics",
    "desc": "Seven different Stars players and general manager Jim Nill are gearing up to go for gold over an exciting two-week journey in Milan",
    "image": "https://media.d3.nhle.com/image/private/t_ratio16_9-size50/prd/vhc1asppwea1habbiwux.png",
    "source": "NHL.com"
  }
]