[
  {
    "title": "Pollution, changing lifestyle surging autoimmune diseases in women",
    "desc": "The prevalence of autoimmune diseases is increasing, especially in women, and the ongoing winter season, along with high pollution, may be worsening the symptoms",
    "image": "https://media.assettype.com/sentinelassam-english%2F2026-02-17%2Fsxepehau%2Fww.webp?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "The Sentinel - of this Land, for its People"
  },
  {
    "title": "Buying Up Cargo All the Way to China",
    "desc": "Blueray Cargo charges Rp250 million to clear one container of counterfeit goods. A specialist in imports from China.",
    "image": "https://statik.tempo.co/data/2011/01/14/id_60838/60838_620.jpg",
    "source": "Tempo.co"
  },
  {
    "title": "Academy move to strengthen talent development, inducts new mentees",
    "desc": "BJUMP Africa has reaffirmed its commitment to nurturing Africa’s next generation of industry leaders and help accelerate their growth.",
    "image": "https://cdn.guardian.ng/wp-content/uploads/2026/02/ghgh-4.png",
    "source": "The Guardian Nigeria News"
  },
  {
    "title": "YouTube services resume after global glitch",
    "desc": "YouTube services are resuming after a glitch in its recommendations system affected thousands of users globally in multiple countries. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/766f395473fb3e8b88691683e5d11b6cb1579c58b58e0bc2547dec8bd2566096",
    "source": "The Straits Times"
  },
  {
    "title": "Rescuers try to reach 6 skiers still alive after California avalanche, another 10 still missing",
    "desc": "Rescue crews on skis and snowcats battled dangerous, blizzard conditions on Tuesday in an effort to reach six backcountry skiers trapped after an avalanche high in the rugged Northern California mountains that left 10 other skiers missing.",
    "image": "https://i.cbc.ca/ais/1ee77ee5-4fcd-4e18-9396-bd16b63003c6,1771383802400/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C22%2C4819%2C2710%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "'Pay or he dies', families told as more Egyptians risk Mediterranean crossing",
    "desc": "Weeks after Hamdy Ibrahim left his village in Egypt's Nile Delta hoping to reach Europe, his brother's phone rang with a chilling message from Libya: pay now or the boy would die.A smuggler was on the line, demanding 190,000 pounds ($4,000) to secure the 18-year-old's place on a boat, part of a rising exodus that last year made Egyptians the top African and second-largest global group of irregular migrants to Europe.\"I told him we couldn't afford it,\" his brother Youssef told AFP from Kafr Abdallah Aziza in Sharqiya, an hour's drive from Cairo.",
    "image": "https://www.al-monitor.com/sites/default/files/styles/social_media_share/public/2026-02/65d03c1552e55ecdb67d52661cf778e107a07f82.jpg?h=69f2b9d0&itok=eCXw76gN",
    "source": "AL-Monitor"
  },
  {
    "title": "From Sh80b deal to dramatic handshake: How Sakaja auctioned Nairobi to State House",
    "desc": "Johnson Sakaja formally ceded key county functions to William Ruto at State House under a cooperation deal that has sparked political debate.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/QQeET0yK4fi7HdigoT9KyLW04AIl1jxibJ2WAFlM.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "From Sh80b deal to dramatic handshake: How Sakaja auctioned Nairobi to State House",
    "desc": "Johnson Sakaja formally ceded key county functions to William Ruto at State House under a cooperation deal that has sparked political debate.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/QQeET0yK4fi7HdigoT9KyLW04AIl1jxibJ2WAFlM.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "Whangārei murder trial told of knife in pocket and victim Jasmaine Reihana ‘not herself’",
    "desc": "WARNING: This article discusses violence and may be upsetting to some readers. A key witness in a murder trial has described the last night he saw his...",
    "image": "https://www.nzherald.co.nz/resizer/v2/QZKNAGGXABC6POB4FYT7IXOXMM.jpg?auth=28a5b4837e6a2bbcf328a778fa63d41e50f8330c8795addfc26cab7421f759bd&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "Benson Amps release the Redland, available in three configurations",
    "desc": "Benson Amps has officially released the Redland, a new amplifier design that has been quietly making the rounds for some time. For those who follow the brand closely, it won’t be an entirely new name – the amp has surfaced in videos, on stages and in the hands of collaborators over recent months. The official […]",
    "image": "https://mixdownmag.com.au/wp-content/uploads/2026/02/Screen-Shot-2026-02-18-at-2.01.49-pm-1024x707.png",
    "source": "Mixdown Magazine"
  }
]