[
  {
    "title": "British tourist ‘killed for her body parts to be used in witchcraft’",
    "desc": "Holidaymaker Lorna McSorley from Devon vanished without trace in an area of South Africa where belief in the power of muti — and fear — may obstruct the law",
    "image": "https://www.thetimes.com/imageserver/image/%2F368d06f0-085c-4d98-b6d0-891fa172e92a.jpg?crop=1600%2C900%2C0%2C0&resize=1200",
    "source": "The Times"
  },
  {
    "title": "ZAMBIA: Consecrated Persons Called to Be Light in Today’s World, Leave No Room for Pride",
    "desc": "Sandra Kunda\nThe Zambia Conference of Catholic Bishops (ZCCB) joined Catholics around the world in celebrating Mass for all consecrated men and women on the Feast of the Presentation of the Lord.\nThe celebration that took place in the Chapel at the Catholic Secretariat began with a procession by members of staff and all the consecrated men and women at ZCCB.\nThe Mass was celebrated by Fr. Charles Searson SJ, who urged the consecrated to continue their good works and encouraged all to cherish their vocation, whether in marriage or religious life.\nMeanwhile, a similar Celebration was held at the Cathedral of the Child Jesus -Pope Squire, with Lusaka Archdiocese Vicar General, Very Rev Fr. Andrew Simpasa SJ, presiding over Mass.\nIn his homily, Fr. Simpasa called on consecrated men and women to live their vocation with humility, self-giving, and fidelity to Christ in a world facing new challenges.\nFr. Simpasa said consecrated life is a call to serve in the Lord’s vineyard with meekness, not pride.\nHe noted that in an age marked by Artificial Intelligence and social media, human consciousness can easily be manipulated, making it vital for the consecrated to be the light of the world.\nFr. Simpasa emphasized that this light is not their own but Christ’s, meant to pierce false narratives and expose the contradictions of the times.\nHe urged the faithful to stand for truth, obedience to God, and self-giving, which he said leads to the fullness of life.\nFr. Simpasa reminded Christians of their shared baptismal calling as priests, prophets, and kings, encouraging humble leadership, truth-telling, and faithfulness to God’s mission as they step out in faith, trusting in the One who holds the future.\n \nEND.",
    "image": "https://communications.amecea.org/wp-content/uploads/2016/05/cropped-AMECEA-LOGO-32x32.jpg",
    "source": "AMECEA"
  },
  {
    "title": "Winter Olympics 2026: How to watch Team GB live - full schedule and medal events on Saturday 7 February",
    "desc": "Find out everything you need to know about Great Britain's Olympians on Day 1 of Milano Cortina 2026",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/zxawgailjmkkmrjqyttk",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Jim Carrey 'Grinch' sequel rumours addressed by costar Taylor Momsen after fan speculation",
    "desc": "Taylor Momsen says she knows of no concrete plans for a 'Grinch' sequel but has not ruled it out",
    "image": "https://i.tribune.com.pk/media/images/Jim-Carrey1595412768-0/Jim-Carrey1595412768-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Red Dead Redemption 2 Enhanced Edition Still Coming 'This Year', It's Claimed",
    "desc": "An insider has claimed that Red Dead Redemption 2 Enhanced Edition is scheduled to release 'this year'. Here are more details.",
    "image": "https://insider-gaming.com/wp-content/uploads/2025/11/red-dead-redemption-2-fail.jpg",
    "source": "Insider Gaming"
  },
  {
    "title": "Xiaomi Unveils REDMI Note 15 Series: REDMI Titan Durability Meets Advanced Imaging",
    "desc": "Kampala, Uganda, February 6th, 2026 :  Xiaomi today announced the launch of REDMI Note 15 Series, comprising three models — REDMI Note 15 Pro+ 5G, REDMI Note 15 Pro, and REDMI Note 15. Defined by REDMI Titan Durability, the lineup highlights long-lasting battery performance, reinforced drop resistance, and enhanced dust and water protection, alongside upgraded imaging …",
    "image": "https://www.independent.co.ug/wp-content/uploads/2026/02/Redmi-note-1.jpg",
    "source": "The Independent Uganda"
  },
  {
    "title": "ICC T20 World Cup: Nora Fatehi, Badshah, Sivamani, Rishab Rikhiram Sharma to perform at opening ceremony",
    "desc": "Badshah, in a press note, said that he is incredibly excited to be part of this global celebration of sport, entertainment and culture. | Bollywood",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/06/550x309/Nora_Fatehi_1770381843193_1770381854815.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Sir Elton calls press intrusion into his baby son 'truly sickening'",
    "desc": "The musician says his privacy was breached in relation to health issues and the birth of his son.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/c83e/live/127ccd10-034d-11f1-b5ce-37ba15bd4d91.jpg",
    "source": "BBC"
  },
  {
    "title": "Scientists Just Uncovered That Earth Had Continents and Mountains Way Before Plate Tectonics",
    "desc": "Scientists stunned as Earth’s oldest minerals expose a whole new story about the planet’s early surface!",
    "image": "https://dailygalaxy.com/wp-content/uploads/2026/02/Scientists-Just-Uncovered-That-Earth-Had-Continents-and-Mountains-Way-Before-Plate-Tectonics-scaled.jpg",
    "source": "The Daily Galaxy"
  },
  {
    "title": "Milano Cortina 2026: Miura Riku / Kihara Ryuichi put Japan back into medal conversation in figure skating team event",
    "desc": "Japan’s Miura Riku / Kihara Ryuichi top pairs short segment of team event while defending champions USA retains overall lead.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/z5dtdjmoowneajg639hb",
    "source": "Milano Cortina 2026"
  }
]