[
  {
    "title": "right Israeli Minister Storms West Bank Town Amid Expanding Annexation Measures",
    "desc": "Far-right Israeli Finance Minister Bezalel Smotrich stormed the town of Ni’lin in the central occupied West Bank, a day after Tel Aviv announced decisions",
    "image": "https://nannews.ng/wp-content/uploads/2026/02/IMG_5876.jpeg",
    "source": "News Agency of Nigeria"
  },
  {
    "title": "India Cooperation Across Trade, Tech, and Health",
    "desc": "A new report calls a reimagining of Africa-India relations charting a path to deeper cooperation on infrastructure, AI, green energy, and health, with a 50-year strategic vision.",
    "image": "https://shegastrpool.blob.core.windows.net/media-prod/media-prod/large_photo_2026_02_10_13_18_49_75018511c6.jpg",
    "source": "Shega Media and Technology PLC"
  },
  {
    "title": "For Women Scotland",
    "desc": "We are pleased to confirm that full and final settlement has been reached with the Scottish Ministers regarding recovery of costs incurred in pursuing the judicial review all the way to the Supreme Court. We have received a total of £392,500 (£150,000 for the Court of Session part of the case and £242,500 for the Supreme Court part).",
    "image": "https://forwomen.scot/wp-content/uploads/FWS-flag-image.jpg",
    "source": "For Women Scotland"
  },
  {
    "title": "Nenadi Usman set to take over Labour Party national secretariat",
    "desc": "The Interim National Chairman of the Labour Party, Senator Nenadi Usman, is set to officially take over the party's national secretariat in Abuja. Usman",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/Nenadi-Usman-set-to-take-over-Labour-Party-national-secretariat.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "10 key highlights from President Mahama's visit to Zambia",
    "desc": "Ghana and Zambia are taking steps to foster greater economic partnership and bilateral trade on the continent following President John Dramani Mahama's recent visit to Zambia.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/270/27034060.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Zimbabwe: Man in Court for U.S.$8k Vehicle Scam",
    "desc": "A 31-year-old man appeared in court accused of swindling a Harare man out of US$8 050 after misrepresenting that he could import a Honda Vezel vehicle on his behalf.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Senegal arrests TV star Pape Diallo, singer Djiby Dramé in homosexuality crackdown",
    "desc": "TV presenter Pape Diallo and singer Djiby Dramé have been arrested and charged with committing “unnatural acts” – a term used in Senegal",
    "image": "https://lifestyle.thecable.ng/wp-content/uploads/2026/02/markup_1000165903.jpg",
    "source": "TheCable Lifestyle"
  },
  {
    "title": "Africa’s 10 most expensive countries to live In",
    "desc": "Numbeo’s 2026 cost of living data reveals Africa’s most expensive countries to live in, highlighting the impact of import dependence, income levels and purchasing power. | Business Insider Africa",
    "image": "https://ocdn.eu/pulscms-transforms/1/NtCktktTURBXy81ZWVlMThjOC00N2I1LTQ2OWMtOGE4MC1mMGVjNzM3YzRmM2UucG5nkpUDAMylzQNzzQHxkwXNBLDNAnY",
    "source": "Business Insider Africa"
  },
  {
    "title": "‘Agonizing, pointless,’ Lacson warns Carpio, Batongbacal on Marcoleta debate",
    "desc": "Lacson urged Carpio and Batongbacal to skip a proposed debate with Marcoleta.",
    "image": "https://media.philstar.com/photos/2026/02/10/lacson-marcoleta_2026-02-10_16-57-05.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "MACC Head Azam Baki Returns to Malaysia Stock Market, Years After Public Outcry",
    "desc": "Malaysian anti-corruption chief Azam Baki held millions of shares in a financial-services company, a corporate filing shows, the first public disclosure of a major stake in his name since an uproar over his shareholdings several years ago spurred protests calling for him to step down.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i49v_IQoOZgk/v1/1200x857.jpg",
    "source": "bloomberg.com"
  }
]