[
  {
    "title": "Can manganese unlock affordable green hydrogen in acidic water electrolysis?",
    "desc": "Producing green hydrogen efficiently and affordably remains a major challenge for the global energy transition, particularly in acidic water electrolysis",
    "image": "https://img.einnews.com/facebook/1045264/multifunctional-roles-of-mangan.jpeg",
    "source": "EIN Presswire"
  },
  {
    "title": "Of borrowed wheels and brand new GD6",
    "desc": "What began as a simple favour of borrowing a sibling’s car to run errands has turned into a life-changing moment for 34-year-old Koketso Motshegwe of Mochudi.",
    "image": "https://www.mmegi.bw/mmegi/uploads/images/2026/02/04/162279.jpg",
    "source": "Mmegi Online"
  },
  {
    "title": "Austin Appelbee's incredible tale of survival has made international headlines. How did the 13yo do it?",
    "desc": "Austin Appelbee, 13, has made international headlines after swimming for four hours in rough seas to save his mum, sister and brother stranded in the ocean. How did he do it?",
    "image": "https://live-production.wcms.abc-cdn.net.au/7caa73a1a4404e30b2ae5aaad8ca8cce?impolicy=wcms_watermark_news&cropH=2812&cropW=5000&xPos=0&yPos=51&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Malaysian Islamic banks under deposit war pressures as financing speeds up",
    "desc": "Malaysian Islamic banks are under pressure to boost their deposits and other funding sources amid strong financing growth, Fitch Ratings flagged.",
    "image": "https://assets.theedgemarkets.com/20250304_PLA_KLCC_6_LYY_20260204153630_theedgemalaysia.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "Mouthy Ireland stuck in neutral ahead of Six Nations",
    "desc": "Ireland's horizons have shrunk a touch heading into this year's Six Nations amid injuries, discipline issues and worrying form",
    "image": "https://www.rte.ie/images/0023d731-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "CCP project bears fruit as 70 local jobs created",
    "desc": "FRANCISTOWN: Francistown West Constituency Community Project (CCP) initiative comes to life with the opening of a new Choppies Store in Gerald Estate, providing employment opportunities for 70 locals and injecting economic activity into the area.",
    "image": "https://www.mmegi.bw/mmegi/uploads/images/2026/02/04/162257.jpg",
    "source": "Mmegi Online"
  },
  {
    "title": "SEBI not considering any immediate F&O measures; capital market stocks rise",
    "desc": "'There will be no new F&O curbs and no change in weekly expiry,' says SEBI chief",
    "image": "https://images.moneycontrol.com/static-mcnews/2025/12/20251216063337_tuhin-kanta8.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "FAO Launches Free Virtual Course on Improving Ruminant Biosecurity",
    "desc": "The Food and Agriculture Organization of the United Nations (FAO) has launched a new free, self-paced virtual course designed to help ruminant farmers and veterinarians strengthen biosecurity practices on farms. Titled Improving Ruminant Biosecurity, the course is available through FAO Virtual Learning Centres in English, Russian and Turkish, and aims to promote safer livestock production,",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Software sell-off over AI fears hits global stock markets, but FTSE 100 hits record on £8bn insurance takeover - business live",
    "desc": "Rolling coverage of the latest economic and financial news",
    "image": "https://i.guim.co.uk/img/media/cc21511a496ca3abf0d917fe5db08013f7607f6a/537_0_5800_4640/master/5800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=45e54a3559a0486d70540c03d40a3353",
    "source": "The Guardian"
  },
  {
    "title": "Methane detected 3I/ATLAS comet, size estimates updated",
    "desc": "The findings, detailed in papers posted on arXiv, mark a rare scientific achievement for an object that formed around a star other than the Sun, News....",
    "image": "https://news.az/photos/2026/02/1770189706.webp",
    "source": "Latest news from Azerbaijan"
  }
]