[
  {
    "title": "Labour think tank commissioned firm to investigate journalists, the BBC understands",
    "desc": "Labour Together paid at least £30,000 to \"investigate the sourcing, funding and origins\" of a story about undeclared donations.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/cbb1/live/14205ca0-0a2c-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  },
  {
    "title": "Review: Kindle Scribe Colorsoft is a $600 stunner of an e-reader",
    "desc": "Amazon's note-taking e-reader adds color, but at a steep, steep cost. Still, after trying it out, its appeal is undeniable.",
    "image": "https://helios-i.mashable.com/imagery/reviews/053GdkujqZEyJE0nFPrC5Or/hero-image.fill.size_1200x675.v1770833450.png",
    "source": "Mashable"
  },
  {
    "title": "The long haul: Commitment, continuity and national resolve",
    "desc": "When I wrote some months ago that Pakistan must transition from episodic reaction to sustained resolve in its fight against terrorism, the intent was not rhetorical, it",
    "image": "https://www.nation.com.pk/assets/thenation_202006/images/no-image-large.jpg",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "A 3-year-old girl asked a simple question - and sparked a US$600 million camera revolution",
    "desc": "Meet the original Steve Jobs: the man who invented the \"impossible\" decades before the iPhone",
    "image": "https://cdn.mos.cms.futurecdn.net/27CtDGqAxEDZNWpwaXttoV-2560-80.jpg",
    "source": "Digital Camera World"
  },
  {
    "title": "Detective sues force for 'psychiatric injury' after policewoman fiancee cheats on him with colleague at the station - then sleeps with and marries the senior cop brought in to investigate",
    "desc": "For one of Britain's sleepiest police forces is at the centre of a real life thriller - and the lurid tale's twists and turns are set to be played out in court.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/14/22/106396031-0-image-m-9_1771109942873.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Hazmat team called to Leicester building after report of suspicious smell",
    "desc": "The smell was noticed on the upper floors of the four-storey building",
    "image": "https://i2-prod.leicestermercury.co.uk/article10816009.ece/ALTERNATES/s1200/0_WhatsApp-Image-2026-02-14-at-50241-PM-1jpeg.jpg",
    "source": "Leicester Mercury"
  },
  {
    "title": "'Madness!' - Man Utd players' true thoughts on Harry Maguire revealed as popular defender nears end of contract",
    "desc": "Harry Maguire's Manchester United team-mates hope that the defender is offered a new contract and stays on beyond the end of this season, a report has revealed, as the 32-year-old nears the end of his Old Trafford deal. The defender sees his contract run out this summer and his future remains unresolved, though his team-mates apparently think it would be \"madness\" if the 64-cap England international is not kept on at the Red Devils.",
    "image": "https://assets.goal.com/images/v3/getty-2260483983/crop/MM5DGOJYGQ5DEMRUGE5G433XMU5DCORZGU======/GettyImages-2260483983.jpg",
    "source": "Goal.com"
  },
  {
    "title": "3 dead, 3 seriously injured in Bagan Datuk lorry-car crash",
    "desc": "Bagan Datuk police chief Ali Jali says the dead were the driver and two children in the car.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/5996bf7b-kemalangan-jalan-hutan-melintang-bagan-datuk-ipd-bagan-datuk-pic-150226-1.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Winter Olympics 2026: Alpine skiing's Dave Ryding set to take his final Olympic bow",
    "desc": "Dave Ryding talked to Olympics.com ahead of his last Alpine skiing season about his upcoming retirement following a fifth Winter Olympics and what comes next",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/lyrbv8b2enzf2uwkdatm",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Bersatu regains full control of Facebook page after sabotage posts mocking Muhyiddin",
    "desc": "KUALA LUMPUR, Feb 15 — Parti Pribumi Bersatu Malaysia (Bersatu) has successfully regained full control of its official Facebook account after it was hijacked by unauthorised...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/15/325711.jpeg",
    "source": "Malay Mail"
  }
]