[
  {
    "title": "Magda Szubanski: Australian comedian in remission from cancer",
    "desc": "The actress announced last year that she was undergoing treatment for a rare and aggressive cancer.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8eae/live/7087b190-1392-11f1-801d-ed3cff6bf876.jpg",
    "source": "BBC"
  },
  {
    "title": "World-first stem-cell therapy shows promise for treating spina bifida in the womb",
    "desc": "Six pregnant women participated in a small trial in which placenta-derived stem cells were applied to fetal spinal cords and the treatment was found to be safe.",
    "image": "https://media.nature.com/lw1200/magazine-assets/d41586-026-00602-z/d41586-026-00602-z_52098126.jpg",
    "source": "Nature"
  },
  {
    "title": "Kenyan Newspapers Review: Gov't Proposes Shifting Civil Servants from Permanent to Contract Terms",
    "desc": "The Kenyan govt, through proposals from the Ministry of Public Service, is pushing to transition civil servants from permanent and pensionable terms to contract.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/83c45ff3d96c33db.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "Table No 8 and a 'first date': Israel PM Netanyahu recalls India link behind love story with wife Sara",
    "desc": "Middle East News: Israeli Prime Minister Benjamin Netanyahu on Thursday recalled a personal connection with India revealing that an Indian restaurant in Tel Aviv played.",
    "image": "https://static.toiimg.com/thumb/msid-128836716,width-1280,height-720,imgsize-1840189,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "At least 10 FBI agents who worked on Trump investigation fired",
    "desc": "The terminated FBI staffers all participated in a probe into Trump's handling of classified documents after his first term.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f09f/live/b469b1f0-1316-11f1-9b9a-9d7ed2eef502.jpg",
    "source": "BBC"
  },
  {
    "title": "JNU protests escalate as arrests rise, clashes leave police and students injured",
    "desc": "Protests at JNU erupted into violence, resulting in multiple arrests, including key student leaders, while many police personnel were also injured.  | Latest News Delhi",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/27/550x309/JNU-PROTEST-2_1772164244707_1772164284467.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Sensex down 600 pts, Nifty below 25,300: Weak global cues among key factors behind market decline",
    "desc": "Sensex, Nifty declined as a U.S. tech selloff and subdued Asian cues kept sentiment subdued.",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260219081655_sensex_nifty_sensexdown.jpg",
    "source": "Moneycontrol.com"
  },
  {
    "title": "Major music festival announces cancellation one week out from festivals",
    "desc": "Global hip-hop music festival R﻿olling Loud Australia has announced that one week out from its two events i...",
    "image": "https://imageresizer.static9.net.au/ICSvgvUCNa685wxIyfxAGxS5W4I=/0x100:1277x819/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fcde0b032-d418-4328-aad7-24bc20f79b45",
    "source": "9News.com.au"
  },
  {
    "title": "US-Iran tensions LIVE: Iran, US talks ended after ‘significant progress,’ next round set for Vienna, says Oman minister",
    "desc": "US-Iran tensions LIVE Updates: “We have finished the day after significant progress in the negotiation between the United States and Iran,” Badr Albusaidi, Oman's foreign minister, said, adding that technical level discussions will take place next week in Vienna. Keep checking for latest updates",
    "image": "https://www.livemint.com/lm-img/img/2026/02/26/1600x900/logo/SWITZERLAND-IRAN-US-OMAN-NUCLEAR-DIPLOMACY-0_1772128144020_1772128164017.jpg",
    "source": "Mint"
  },
  {
    "title": "Storm set to snap up Shark if Lomax plans fall through",
    "desc": "He has been shopped around by the Sharks and remains off-contract at the end of the year.",
    "image": "https://www.zerotackle.com/wp-content/uploads/2023/06/GettyImages-1499385728-copy.jpg",
    "source": "Zero Tackle"
  }
]