[
  {
    "title": "Dango Ouattara tips seesaw contest Brentford’s way to sink Newcastle",
    "desc": "Dango Ouattara scored a late winner to give Brentford a 3-2 victory at Newcastle",
    "image": "https://i.guim.co.uk/img/media/60d53ed7c644f7c8d6b5c48c67ef647a880490ff/255_0_2278_1822/master/2278.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c4fa3df70db125f41b77ed4e9081414b",
    "source": "The Guardian"
  },
  {
    "title": "CDMMM: a comprehensive platform of traditional Indian medicinal plant DNA barcodes and metabolite fingerprints database",
    "desc": "Herbal medicines, derived from medicinal plants, are in high demand due to global population growth and the increasing prevalence of chronic diseases; however, the use of substitutes or adulterants can compromise the quality of these medicines. DNA barcoding and metabolite fingerprinting are used to identify plants and ensure the safety of drugs. The effectiveness of authentication methods depends on the availability and coverage of the reference library. However, reference DNA barcodes and metabolite fingerprint libraries for traditional Indian medicinal plants are lacking, which hinders the authentication of herbal drugs and the elucidation of the therapeutic effects of secondary metabolites. In the present study, we developed a user-friendly ‘Comprehensive Database of Medicinal Plants, Molecular Markers, and Metabolite Fingerprinting (CDMMM)’ that provides extensive details on traditional Indian medicinal plants used in drug formulations, DNA barcode sequences, metabolites, and their therapeutic targets associated with diseases. CDMMM is an expandable data resource comprising 89 experimentally obtained DNA barcode accessions from 67 plant species, 3033 annotated plant metabolites, and 1414 therapeutic targets associated with 441 diseases from 20 plant species. The ever-expanding CDMMM resource is available at https://slsdb.manipal.edu/cdmmm/. Overall, it is a powerful platform for taxonomy, systematics, species identification, and drug discovery, promoting knowledge and addressing taxonomic uncertainties.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "3 Brentford (Feb 7, 2026) Game Analysis",
    "desc": "Expert recap and game analysis of the Newcastle United vs. Brentford English Premier League game from February 7, 2026 on ESPN.",
    "image": "https://a.espncdn.com/combiner/i?img=/i/espn/misc_logos/500/soccer.png",
    "source": "ESPN"
  },
  {
    "title": "Here's What Happened Today: Saturday",
    "desc": "The most important Irish and international stories you need to know today.",
    "image": "https://img2.thejournal.ie/article/6950475/river/?height=400&version=6950513",
    "source": "The Journal"
  },
  {
    "title": "Based Dietary Changes Linked to Improved Glycemic Control and Lipid Profiles in Pharmacy",
    "desc": "A recent discussion highlights the potential benefits o […]",
    "image": "https://www.geneonline.com/wp-content/uploads/EN_NEWSFLASH_5-1.png",
    "source": "geneonline.com"
  },
  {
    "title": "How the Sydney Gay and Lesbian Mardi Gras after party fell apart",
    "desc": "Two groups, Pride in Protest and Protect Mardi Gras have very different ideas about how to run a party",
    "image": "https://i.guim.co.uk/img/media/e05168c33d7ef9ac31e832e5f353a0685204167f/393_0_3160_2528/master/3160.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4761e9c38abb1828858666924a4d95e9",
    "source": "The Guardian"
  },
  {
    "title": "Doctors Welcome WHO Focus On Wearables",
    "desc": "Reacting to discussions at the WHO’s Montreal meeting, physicians said wrist‑worn devices offered a more reliable alternative to traditional self‑reported surveys, which often underestimate physical inactivity.",
    "image": "https://www.deccanchronicle.com/h-upload/2026/02/07/2007864-dc-cover-oiomedap4i18l94k3gil8rehn5-20180929051401medi.jpg",
    "source": "Deccan Chronicle"
  },
  {
    "title": "owned Cork hotel crowned Munster's Best Wedding Venue 2026",
    "desc": "And they weren't the only Cork winners at this year's awards",
    "image": "https://i2-prod.corkbeo.ie/incoming/article33382444.ece/ALTERNATES/s1200/1_XHSB4628.jpg",
    "source": "Cork Beo"
  },
  {
    "title": "Crowd gasps as Julie Andrews takes revenge in acceptance speech",
    "desc": "Actress Julie Andrews landed one of the most cutting burns of award show history on February 8, 1965.",
    "image": "https://imageresizer.static9.net.au/5yB0KVn-qEGq5EXkhgpdavfW1-0=/0x0:1395x785/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F1651d307-4826-4c0f-a549-e85b9e404762",
    "source": "9News.com.au"
  },
  {
    "title": "Top ICE Lawyer in Minnesota Departs as Immigration Lawsuits Overwhelm Courts",
    "desc": "Jim Stolley, the chief counsel for U.S. Immigration and Customs Enforcement in Minnesota, has left as government prosecutors grapple with a crush of cases.",
    "image": "https://static01.nyt.com/images/2026/02/07/multimedia/07nat-minn-ice-lawyer-vcfq/07nat-minn-ice-lawyer-vcfq-facebookJumbo.jpg",
    "source": "The New York Times"
  }
]