[
  {
    "title": "Moving satellites to meet a plane for rare reentry data",
    "desc": "When satellites eventually fall back down to Earth, they mostly burn up because of the friction caused by the atmosphere. Scientific data about this atmospheric reentry process is urgently needed to design future satellites for a quick, safe and sustainable demise at the end of their mission – reducing risks on the ground and in space.The European Space Agency (ESA) successfully manoeuvred its remaining two Cluster satellites to ensure they can both be observed from a plane as they reenter the atmosphere on 31 August and 1 September 2026.",
    "image": "https://www.esa.int/var/esa/storage/images/esa_multimedia/images/2015/01/cluster/15192611-4-eng-GB/Cluster_pillars.jpg",
    "source": "European Space Agency"
  },
  {
    "title": "Kashmir Solidarity Day exposes Pakistan's politics of deception",
    "desc": "Residents of PoJK and PoGB increasingly reject Pakistan's Kashmir Solidarity Day, calling it symbolic and misleading. Critics say Islamabad curtails local rights while staging rallies, as people continue to face limited autonomy, economic hardship, and lack of representation, despite claims of support for Kashmir.",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20260203092901.jpg",
    "source": "ANI News"
  },
  {
    "title": "Kenya's central bank warns against use of banknotes to make cash bouquets",
    "desc": "Those defacing the currency could face seven years in jail, the central bank says ahead of Valentine's Day.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f591/live/24bea260-00e5-11f1-a8b8-bdd2c5f9bcad.jpg",
    "source": "BBC"
  },
  {
    "title": "Tinubu's Foreign Trips Yield Investments for Nigeria",
    "desc": "The APC chairman defends President Tinubu's foreign trips, stating they have secured over $50 billion in FDI commitments for Nigeria's economy.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2025/07/24150630/482223648_627125213270681_6620795270715423960_n-810x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "‘Didn’t think he was going to fight’: Volk’s big injury secret revealed as legend makes huge call",
    "desc": "‘Didn’t think he was going to fight’: Volk’s big injury secret revealed as legend makes huge call",
    "image": "https://content.api.news/v3/images/bin/f2d4d52da3900b8b66de8ed911d701dc",
    "source": "fox sports"
  },
  {
    "title": "Ministry of Transport Launches Green Number Plates for Electric Vehicles",
    "desc": "According to Transport CS Davis Chirchir, the changes take effect immediately for all the said categories of vehicles countrywide.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/david-chirchir.jpeg?itok=2QKo-g0R",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "PCSO Greetings - 126th Anniversary Manila Bulletin",
    "desc": "CONGRATULATORY MESSAGE On behalf of the Philippine Charity Sweepstakes Office (PCSO), we extend our heartfelt congratulations to the Manila Bulletin on its...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/03/76466.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Hiiumaa ferry runs aground as authorities struggle to keep island connected",
    "desc": "A ferry servicing Hiiumaa, Estonia's second-largest island, ran aground Tuesday morning amid worsening sea ice conditions.",
    "image": "https://s.err.ee/photo/crop/2026/01/27/3167438h8e6bt24.jpg",
    "source": "ERR"
  },
  {
    "title": "What was Jelly Roll in prison for, and how those years shaped his music",
    "desc": "What was Jelly Roll in prison for? Read this post to know every juicy detail about the story of this renowned American rapper, singer, and songwriter.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/b16a771b28dae4b8.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "\"Visit Shanghai: Super Spring Festival” - Discover New Travel Experiences Through Intangible Cultural Heritage",
    "desc": "SHANGHAI, Feb. 03, 2026 (GLOBE NEWSWIRE) -- As the Chinese New Year approaches, Shanghai has officially launched 'Visit Shanghai: Super Spring Festival,” a citywide cultural tourism campaign featuring immersive intangible cultural heritage (ICH) experiences. Taking place on the heel of the 'Discover Shanghai” travel guide competition, which is organized by Shanghai Municipal Administration of Culture and Tourism, the initiative aims at renewing public interest in the city's tourism and heritage, integrating traditional craftsmanship into urban life, revitalizing festive traditions and offering fresh ways to explore Shanghai's cultural roots.",
    "image": "https://cdn4.premiumread.com/?url=https://www.manilatimes.net/theme_manilatimes/images/TMT_1920x1008.jpg&w=1920&q=100&f=webp&v=1",
    "source": "The Manila Times"
  }
]