[
  {
    "title": "Stallholder at Yuhua Place hawker centre seen in video cleaning tables with 'broom', clarifies and apologises",
    "desc": "A stallholder at Yuhua Place Market and Hawker Centre has apologised after a video of him cleaning the tables with a broom sparked hygiene concerns.On Feb 15, a netizen posted a few videos of the man using what looked like a broom to scrub the tables and stools in front of the Wellcome Food cai fan stall.Netizens were split, with...",
    "image": "https://media.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/IMG_8295.jpeg?itok=9J-qErGW",
    "source": "AsiaOne"
  },
  {
    "title": "P CM, Imran's sisters hold meeting ahead of SC hearings",
    "desc": "Bench will take up the cypher, Toshakhana, and defamation cases at 11.30am",
    "image": "https://i.tribune.com.pk/media/images/untitled-design-2026-02-18t105723-5131771394257-0/untitled-design-2026-02-18t105723-5131771394257-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Kenya Roads Board Appoints Judith Otsyula as Director General",
    "desc": "The DG is among other things responsible for the administrator of the Road Maintenance Levy Fund (RMLF) and the Kenya Roads Board Fund.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/davis%20chirchir.jpg?itok=Ub6w6PHk",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "Surprise shark sighting in Antarctica’s near-freezing deep",
    "desc": "A marine researcher says he has video evidence of the first recorded shark in the Antarctic Ocean. Alan Jamieson says many experts had thought sharks didn’t exist in the frigid waters of Antarctica before a sleeper shark was recorded last year.",
    "image": "https://dims.apnews.com/dims4/default/0e86476/2147483647/strip/true/crop/2528x1684+0+0/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fc3%2F06%2F0898c6dd8025cdcc1aa3f89b4a50%2Ff09a585014e74d4a8648a3583d975a58",
    "source": "AP News"
  },
  {
    "title": "Winter Olympics 2026: How to watch day 13 live - full schedule and medal events on Thursday 19 February",
    "desc": "Sakamoto Kaori and Alysa Liu in the figure skating free skate, Eileen Gu in the freestyle skiing halfpipe, and Canada vs USA in the women’s ice hockey gold-medal game. What a Thursday in store at Milano Cortina 2025.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/v1771340385/primary/fqfro48tkmhjvrd2mnyq",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "RSA 'broken' and 'beyond repair', committee to hear",
    "desc": "An Oireachtas committee will hear that the Road Safety Authority is \"broken\" and \"beyond repair\".",
    "image": "https://www.rte.ie/images/000cb8f1-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Once suppressed, now celebrated - Choctaw stickball",
    "desc": "It's a bit like hurling, and used to result in riots - now the Choctaw sport of stickball is enjoying a renaissance",
    "image": "https://www.rte.ie/images/0023e6ff-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "US sanctions turn International Criminal Court judge’s daily life into a nightmare",
    "desc": "French ICC Judge Nicolas Guillou is living a nightmare after the US sanctioned him and other judges for issuing an arrest warrant against Israeli Prime Minister Benjamin Netanyahu, once again exposing the risk of Europeans' reliance on American services.",
    "image": "https://images.euronews.com/articles/stories/09/65/47/95/1200x675_cmsv2_87d2af9a-c2c7-5743-8e9d-e0b1da76872a-9654795.jpg",
    "source": "Euronews.com"
  },
  {
    "title": "SIA, Keppel, or ST Engineering: Which Blue-Chip Still Offers Upside After the Rally?",
    "desc": "Evaluate SIA, Keppel, and ST Engineering after their recent rally. Which blue-chip stock still offers upside potential?",
    "image": "https://thesmartinvestor.com.sg/wp-content/uploads/2026/02/Keppel.png",
    "source": "The Smart Investor"
  },
  {
    "title": "Three cheetah cubs born at Kuno park, taking India’s count to 38",
    "desc": "Gamini gives birth to second litter as arrival of cheetahs from South Africa marks three years",
    "image": "https://thefederal.com/h-upload/2026/02/18/597260-gamini11zon.jpg",
    "source": "The Federal"
  }
]