[
  {
    "title": "Provincial nominees invited in surprise Express Entry draw",
    "desc": "Immigration, Refugees and Citizenship Canada (IRCC) has issued more invitations to apply (ITA) through the Express Entry system. The immigration department issued 279 ITAs in a draw for Provincial Nominee Program (PNP) candidates. To be considered in this draw, candidates needed to have A minimum Comprehensive Ranking System (CRS) score of 789; and Created an",
    "image": "https://www.cicnews.com/wp-content/uploads/2026/02/PNP-draw-1.jpg",
    "source": "CIC News"
  },
  {
    "title": "TCAA ordered to supervise the construction of the Civil Aviation Centre",
    "desc": "DAR ES SALAAM: THE Parliamentary Committee on Infrastructure has urged the Tanzania Civil Aviation Authority (TCAA) to closely supervise the contractor implementing the construction project for modern buildings at the Tanzania Civil Aviation Training Centre (CATC), to ensure the project is completed on time and meets the required standards. The statement was made by the",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-17-at-11.53.48.jpeg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Nigerian PhD Researcher Launches BioSim Lab, a Virtual Biotechnology Platform Gaining Global Industry Recognition",
    "desc": "As the world shifts attention to the future of science education and workforce readiness, a Nigerian based in the UK who is a doctoral researcher and science innovator has launched a new digital solution aimed at transforming how biotechnology skills are taught and practiced. ‎ ‎The innovator, Hammed Tukur, is a PhD candidate at Newcastle As the world shifts attention to the future of science education and workforce readiness, a Nigerian based in the UK who is a doctoral researcher and science innovator has launched a new digital solution aimed at transforming how biotechnology skills are taught and practiced. ‎ ‎The innovator, Hammed Tukur, is a PhD candidate at Newcastle As the world shifts attention to the future of science education and workforce readiness, a Nigerian based in the UK who is a doctoral researcher and science innovator has launched a new digital solution aimed at transforming how biotechnology skills are taught and practiced.",
    "image": "https://muslimvoice.com.ng/wp-content/uploads/2026/02/Nigerian-PhD-Researcher-Launches-BioSim-Lab-a-Virtual-Biotechnology-Platform-Gaining-Global-Industry-Recognition-1.jpg",
    "source": "muslimvoice.com.ng"
  },
  {
    "title": "Mineworkers union calls for urgent reforms in mining sector",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% The Mineworkers Union of Namibia (MUN) has called for urgent reforms to transform labour practices and achieve decent work in the country’s mining sector.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-16-at-3.50.32-PM-1024x682.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "Cocoa Crisis: Randy Abbey, top COCOBOD executives take salary cuts",
    "desc": "The Ghana Cocoa Board (COCOBOD) has announced salary cuts for its executive management and senior staff.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/218/21814602.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "How I went from Cork to playing over 100 shows in just seven months in the US",
    "desc": "Independent Irish musician Podge Lane offers a guide to making the most of gigging opportunities in the USA",
    "image": "https://www.irishexaminer.com/cms_media/module_img/9933/4966553_6_seoimageog_Podge_Lane_16_9.jpg",
    "source": "Irish Examiner"
  },
  {
    "title": "Michael Flatley seeks High Court order in dispute with his former solicitor",
    "desc": "Legal row has erupted amid allegations on both sides about legal fees and an alleged hold on files",
    "image": "https://www.irishtimes.com/resizer/v2/K2DZ65CTE6H7ZPSURY2CTSNACY.jpg?smart=true&auth=2f94e31556f545754901182b769264b63c5611af4b58526e114cab98ac03e4ff&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Bnei Brak riot shows that to integrate Haredim, Israel should expect strife",
    "desc": "A recent study found that by 2050, nearly one in four Israelis will be ultra-Orthodox; leaders have only started to grapple with how that will change the country",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/02/F260215FFF17.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Nigeria: Oyo govt engages Botswana on AfCFTA implementation, explores trade partnerships",
    "desc": "The engagement forms part of Oyo State’s broader strategy to position itself as a competitive sub-national player within the AfCFTA framework",
    "image": "https://static.zawya.com/view/acePublic/alias/contentid/OTdmMWVlZTQtYjU1Zi00/51/210721060323babg-jpeg.jpeg?f=3%3A2",
    "source": "ZAWYA"
  },
  {
    "title": "Malawi launches search for suspects in fake funeral charcoal smuggling",
    "desc": "Officials allege that an empty coffin was placed over concealed bags of charcoal in a hearse.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1f60/live/ef47f2a0-0bd7-11f1-884e-c36fe0e186a7.jpg",
    "source": "BBC"
  }
]