[
  {
    "title": "Grids Are Surviving the Storm. But the Next 5 Years Could Be Rough.",
    "desc": "A group that monitors the U.S. electricity system warns that grid reliability is “worsening” and blackout risks are rising for millions of people.",
    "image": "https://static01.nyt.com/images/2026/01/30/multimedia/30cli-grid-risks-01-kjgp/30cli-grid-risks-01-kjgp-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Anti-ICE 'National Shutdown' protests planned in L.A. County. Here's where",
    "desc": "Here are locations where 'ICE Out' protests are planned in Southern California.",
    "image": "https://ca-times.brightspotcdn.com/dims4/default/c33f2b7/2147483647/strip/true/crop/3463x1818+0+245/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2F99%2F49%2F486273b743f9a4f04a279e9bdbea%2F1539885-me-alex-pretti-vigil-5-gmf.jpg",
    "source": "Los Angeles Times"
  },
  {
    "title": "Every club previewed: Fantasy locks, bargains, rookies, more",
    "desc": "The Traders have previewed every club to help you pick your Fantasy team",
    "image": "https://resources.afl.com.au/afl/photo/2026/01/27/f03967f6-68d9-4fba-a0ad-019826744aad/EveryClub.jpg",
    "source": "afl.com.au"
  },
  {
    "title": "The test changing how one of Australia’s deadliest cancers is treated",
    "desc": "The test, developed by Queensland doctors, requires little more than a sample of blood.",
    "image": "https://static.ffx.io/images/$zoom_0.3521%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_15/t_crop_custom/q_86%2Cf_auto/3cd8b8efcae200aa1cf536968217b91ec4a08b0a6f8acc69799c31c1cf477ddf",
    "source": "Brisbane Times"
  },
  {
    "title": "Record-breaking photons at telecom wavelengths-on demand",
    "desc": "A team of researchers from the University of Stuttgart and the Julius-Maximilians-Universität Würzburg led by Prof. Stefanie Barz (University of Stuttgart) has demonstrated a source of single photons that combines on-demand operation with record-high photon quality in the telecommunications C-band—a key step toward scalable photonic quantum computation and quantum communication. \"The lack of a high-quality on-demand C-band photon source has been a major problem in quantum optics laboratories for over a decade—our new technology now removes this obstacle,\" says Prof. Stefanie Barz.",
    "image": "https://scx2.b-cdn.net/gfx/news/hires/2026/record-breaking-photon.jpg",
    "source": "Phys.org"
  },
  {
    "title": "Eggs, hats and unfettered ambition: what we learned about Melania Trump from her documentary",
    "desc": "The first lady’s political goals, high-stakes clothes fittings and hints that she and Donald still have sex are just some of the highlights from Brett Ratner’s documentary",
    "image": "https://i.guim.co.uk/img/media/579f54fb34b9319562c0174b8c742abbc423ee52/1544_40_2629_2103/master/2629.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f319c0aa0dca571e0a5c17701a861a7d",
    "source": "The Guardian"
  },
  {
    "title": "Microsoft Trials New Menu Bar Feature in Windows 11 PowerToys",
    "desc": "Microsoft's PowerToys team is testing a new dock feature for Windows 11, promising enhanced usability similar to macOS and Linux menu bars.",
    "image": "https://cdn.optcms.com/www.indianewsnetwork.com/assets/2026/202601/20260131-img-20260131-5e8e83a32d3f0989-300.webp",
    "source": "India News Network"
  },
  {
    "title": "DOST-TAPI eyes growth in intellectual property filings, technology adoption",
    "desc": "The DOST-Technology Application and Promotion Institute on Friday said it aims for a 5% increase in intellectual property filings and commercialization and adoption of supported technologies this year.",
    "image": "https://images.gmanews.tv/webpics/2022/11/Philippine_manufacuting_industry_2022_11_02_12_08_39.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Guillermo Del Toro would ‘rather die’ than use generative AI",
    "desc": "When Oscar-winning filmmaker Guillermo del Toro was a kid growing up in Guadalajara, Mexico, he would draw monsters all day. His deeply Catholic grandmother even had him exorcised because of it. But when del Toro saw the 1931 film ‘Frankenstein,’ his life changed. \"I realized I understood my faith or my dogmas better through Frankenstein than through Sunday mass.\" His adaptation of Mary Shelley's classic book is nominated for nine Academy Awards, including Best Picture. Del Toro spoke with Terry Gross about getting over his fear of death, the design of Frankenstein's creature, and his opinion on generative AI.Also, John Powers reviews the noirish drama ‘Islands.’",
    "image": "https://media.npr.org/include/images/facebook-default-wide-s1400-c85.jpg",
    "source": "NPR"
  },
  {
    "title": "Harry Brook: England one-day skipper admits other players were present during nightclub bouncer altercation",
    "desc": "England white-ball captain Harry Brook says other players were present when he was involved in an altercation with a nightclub bouncer.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5387/live/9470a460-fe0f-11f0-a8b8-bdd2c5f9bcad.jpg",
    "source": "BBC"
  }
]