[
  {
    "title": "The 2026 Nedbank Cup in numbers",
    "desc": "The Nedbank Cup returns for a 19th edition in 2026 and remains the only competition in South Africa football that gives amateur players the platform to live their dreams and test themselves against the country’s best.",
    "image": "http://localhost:8080/media/fhblqfrz/nedbank-cup-cheifs-g1920.jpg",
    "source": "Super Sport"
  },
  {
    "title": "‘I'm too big to be anyone’s mole,’ Senator Sifuna fires back at Gachagua mole claims",
    "desc": "Sifuna said claims grew after he met Gachagua at a burial, defends right to attend colleagues’ funerals.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/817c4650-cc8b-422f-8801-f04d23dd2b91.png?1770189424393",
    "source": "the-star.co.ke"
  },
  {
    "title": "AI Hallucinated Case Citations Prompt Sanctions And Delay Class Action Settlement",
    "desc": "Duane Morris Takeaways: On November 20, 2025, in Buchanan v. Vuori, Inc., No. 5:23-CV-01121 (N.D. Cal. Nov. 20, 2025), Magistrate Judge Nathanael M…",
    "image": "https://www.lexology.com/images/share/lexology-social-media.png",
    "source": "Lexology"
  },
  {
    "title": "Mark Belmonte leaves UP for NCAA school",
    "desc": "University of the Philippines Fighting Maroon forward Mark Belmonte is taking his talents to the NCAA after exiting Diliman.",
    "image": "https://media.philstar.com/photos/2026/02/04/untitled-design_2026-02-04_13-31-26.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "LIVE: Harden breaks silence, reveals truth behind blockbuster trade to Cavaliers",
    "desc": "LIVE: Harden breaks silence, reveals truth behind bombshell NBA trade",
    "image": "https://content.api.news/v3/images/bin/c7498478e44a455d98683c878d4528d1",
    "source": "fox sports"
  },
  {
    "title": "Sudan Affirms Full Cooperation With UN Security Council Expert Team On Darfur",
    "desc": "Port Sudan, 3 January 2026 (SUNA) - The government of Sudan reaffirmed its commitment to full cooperation with the UN Security Council's sanctions expert team tasked with Resolution 1591 concerning the Darfur region, the Director of the Peace and Humanitarian Affairs Directorate at the Ministry of Foreign Affairs and International Cooperation, Ambassador Jaafar Soumi Toto, stated.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Synlait slumps on forecast loss as Fisher & Paykel lifts NZX 50 index - Market close",
    "desc": "The New Zealand sharemarket put in a solid performance overall on Wednesday as unemployment crept up, tech stocks were battered and Synlait Milk was facing a...",
    "image": "https://www.nzherald.co.nz/resizer/v2/TMOJ2REPUBBC3LJVBCVMM5HEUQ.jpg?auth=49dad89acaaa9797bc0c5cd6e13b7baa3eca819d8a90527cf42a496ef2a2b4d8&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "Daily Post Nigeria",
    "desc": "The All Progressives Congress, APC, National Chairman, Nentawe Yilwatda, has dismissed claims that President Bola Tinubu's infinity signature is a sign of",
    "image": "https://dailypost.ng/wp-content/uploads/2024/10/Yilwatda.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "World Cancer Day 2026: Reducing the Impact of Cancer for all Australians",
    "desc": "Today is World Cancer Day, the 4th of February 2026. It reminds us of the importance of coming together to support one another through its global",
    "image": "https://c.nationaltribune.com.au/wp-content/themes/news/images/news-image-default.jpg",
    "source": "The National Tribune"
  },
  {
    "title": "Nanlite introduces new FC series models—powerful bi",
    "desc": "Boasting a massive 750W of power, the bi-colour FC-720B and full-colour FC-720C spotlights are perfect for creators and videographers needing high illuminance and excellent light quality. They provide exceptional output that is ideal for larger scenes or for emulating the sun in smaller locations. The FC-720B and FC-720C share the same stylish design language as […]",
    "image": "https://www.cinematography.world/wp-content/uploads/2026/02/9-1.jpg",
    "source": "Cinematography World"
  }
]