[
  {
    "title": "Britain lags behind Europe in diagnosing Alzheimer’s",
    "desc": "Patients have no chance of obtaining breakthrough treatments because the NHS is failing to track the progress of the disease, experts warn",
    "image": "https://www.thetimes.com/imageserver/image/%2Fda957cfd-bfa1-4a82-a8b2-ef9723011d0d.jpg?crop=6389%2C3594%2C0%2C333&resize=1200",
    "source": "The Times"
  },
  {
    "title": "Manchester City keep up title chase with late comeback win at Liverpool",
    "desc": "Manchester City came from behind to beat Liverpool 2-1 at Anfield in a game that ended amid VAR controversy",
    "image": "https://i.guim.co.uk/img/media/6598d3ef475aff23716e2dc9601c82811f64a34b/592_81_5510_4408/master/5510.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=454f4ed6ebf5baaa2fe2bd01cdd725df",
    "source": "The Guardian"
  },
  {
    "title": "Winter Olympics 2026: Anna Gasser into big air finals as Zoi Sadowski-Synnott tops the qualifiers - daily results",
    "desc": "Austria’s two-time defending big air champion Anna Gasser will have to beat three of the best snowboarders for a third gold in the final on Monday, 9 February in Milano Cortina 2026. Zoi Sadowski-Synnott will lead the charge along with Mia Brookes and Murase Kokomo.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/mxe0uhiqju5nib1whupz",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Super Bowl 2026 LIVE: Patriots vs Seahawks, second-half score, radio & updates",
    "desc": "Live score updates from Super Bowl 2026 as the New England Patriots play the Seattle Seahawks at Levi's Stadium, Santa Clara, California.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7101/live/90abd530-0557-11f1-9b5a-17a9212d258f.jpg",
    "source": "BBC"
  },
  {
    "title": "Germany's Social Democrats call for reassessment of relationship with US",
    "desc": "Germany's Social Democrats - the junior partner in the coalition government - believe the country's relationship with the United States must be revamped.",
    "image": "https://www.ghanabusinessnews.com/wp-content/uploads/2026/02/en-gemanytoday-download-image-urn-newsml-dpa.com-20090101-260208-99-426044.jpeg",
    "source": "Ghana Business News"
  },
  {
    "title": "Precision and Power: U.S. and Lithuania Strengthen the Eastern Flank through Integrated HIMARS Live Fire",
    "desc": "In the snow-covered woods of Lithuania, the sound of a M142 High Mobility Artillery Rocket System (HIMARS) pierced through the sky, sending a clear message of readiness and resolve on NATO’s eastern flank. On February 3, 2026, U.S. Army Soldiers from 1st Battalion, 14th Field Artillery Regiment, 41st Field Artillery Brigade, assigned to Task Force Pergale executed a HIMARS live-fire exercise alongside Lithuanian Armed Forces.",
    "image": "https://d1ldvf68ux039x.cloudfront.net/thumbs/photos/2602/9506566/1000w_q95.jpg",
    "source": "DVIDS"
  },
  {
    "title": "Judge orders Fulton County Georgia election case materials unsealed",
    "desc": "The FBI last month raided an election facility central to President Donald Trump's debunked claims of fraud in the 2020 election.",
    "image": "https://image.cnbcfm.com/api/v1/image/108259140-17697153462026-01-29t192846z_1281863462_rc26bjasobac_rtrmadp_0_usa-election-fbi.jpeg?v=1769715363&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Trump Declines To Predict A Super Bowl Winner In NBC Interview",
    "desc": "Tom Llamas sat down with Trump on Wednesday, before a racist video was posted to the president's account.",
    "image": "https://deadline.com/wp-content/uploads/2026/02/05a3abdd6ed653c61253c874-2.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "‘We want to create films anyone can watch, believer or not’ - KAC Studios director",
    "desc": "UK-based creative production house KAC Studios has premiered three short films in Accra, positioning its work as part of a broader effort to reshape how faith-inspired stories are told within the global and African film space.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/311/31139749.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Olympic figure skating music dispute between Armenia and Azerbaijan resolved after ISU review",
    "desc": "ISU review and program change resolve Azerbaijan-Armenia dispute over Olympic skating music after complaint linked to Nagorno-Karabakh tensions today",
    "image": "https://i.guim.co.uk/img/media/8d4a78eb682c7de54d01641b7e0bcd0962c71d76/99_0_3154_2525/master/3154.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e09dc38622bb4bd7c169d2478e3b716",
    "source": "The Guardian"
  }
]