[
  {
    "title": "Thieves dressed as Robin Hood give away stolen food to protest Canada’s rising prices",
    "desc": "Thieves dressed as Robin Hood raided a food store in Montreal on Tuesday night and gave away the stolen goods in a protest against rising food prices – just weeks after the same group targeted a grocery dressed as Santa and his elves.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/cadeaux.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Sugar molecules point to a new weapon against drug-resistant bacteria",
    "desc": "Australian researchers have developed a powerful new way to target deadly, drug-resistant bacteria by designing antibodies that recognise a sugar found only on bacterial cells – an advance that could underpin a new generation of immunotherapies for multidrug resistant hospital-acquired infections.",
    "image": "https://www.wehi.edu.au/wp-content/uploads/2026/02/Immunofluorescence-header.jpg",
    "source": "Walter and Eliza Hall Institute of Medical Research"
  },
  {
    "title": "CROWN HOLDINGS, INC. REPORTS FOURTH QUARTER AND FULL YEAR 2025 RESULTS",
    "desc": "/PRNewswire/ -- Crown Holdings, Inc. (NYSE: CCK) today announced its financial results for the fourth quarter and full year ended December 31, 2025. Highlights...",
    "image": "https://www.prnewswire.com/content/dam/prnewswire/icons/2019-Q4-PRN-Icon-32-32.png",
    "source": "PR Newswire"
  },
  {
    "title": "Prof. Igal Talmi, 1925-2026",
    "desc": "Prof. Igal Talmi, 1925–2026 | | | People | | | Weizmann Wonder Wander - News, Features and Discoveries from the Weizmann Institute of Science",
    "image": "https://wis-wander.weizmann.ac.il/sites/default/files/article_main_image/YT_main_0.jpg",
    "source": "Weizmann Wonder Wander"
  },
  {
    "title": "Trump’s Call to ‘Nationalize’ Elections Adds to State Officials’ Alarm",
    "desc": "Some top state election officials, who run voting across the country, worry that the federal government has become hostile to them and their work.",
    "image": "https://static01.nyt.com/images/2026/02/03/multimedia/pol-election-tension-1-pkmz/pol-election-tension-1-pkmz-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Targeted Brain Stimulation Doubles Efficacy in Parkinson’s Disease",
    "desc": "Targeting neuromodulation treatments to the SCAN brain region involved in Parkinson’s disease can increase their efficacy up to 2.5-fold.",
    "image": "https://www.insideprecisionmedicine.com/wp-content/uploads/2026/02/WashU-Medicine-SCAN-Parkinsons-disease.jpg",
    "source": "Inside Precision Medicine"
  },
  {
    "title": "There's two by-elections this year and some of the runners and riders have already been announced",
    "desc": "The Green Party is the latest party to launch their Dublin-Central candidate today.",
    "image": "https://img2.thejournal.ie/article/6947245/river/?height=400&version=6947309",
    "source": "The Journal"
  },
  {
    "title": "Judge to Trump lawyers trying to move hush money appeal to federal court: ‘You sought two bites at the apple’",
    "desc": "A federal judge was skeptical of President Donald Trump’s argument to try to move the appeal of his hush money conviction to federal court — after lawyers already took their shot in two other courts.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2258367140.jpg?c=16x9&q=w_800,c_fill",
    "source": "cnn.com"
  },
  {
    "title": "Waitangi Day, Laneway, Nick Cave and Nostalgia: The Spinoff event guide",
    "desc": "Reasons to leave the house this week.",
    "image": "https://images.thespinoff.co.nz/1/2026/02/Feb-5-to-12-feature-image.png",
    "source": "The Spinoff"
  },
  {
    "title": "Bulgaria investigates beauty salon images found on porn sites",
    "desc": "Bulgarian prosecutors said today that they have opened an investigation and conducted searches after beauty salon customers complained that photos of them...",
    "image": "https://www.nzherald.co.nz/resizer/v2/EOKYVNMFAVB3ZBN6HRT7WLHDDQ.jpg?auth=959b02994c13fee6203d87df7f1714fbb7d718aa214e8044ebb7cd20e26127a3&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  }
]