[
  {
    "title": "President Ruto directs construction of 28,000 housing units for Prisons Service",
    "desc": "He noted that the directive reflects the government’s commitment to the welfare of those who serve the nation.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/f1c2857a-f7fd-4f49-8d08-95018e24c9a7.jpg?1772107991380",
    "source": "the-star.co.ke"
  },
  {
    "title": "Iran says agreement with US ‘within reach’ as nuclear talks begin in Geneva - Middle East live",
    "desc": "The Oman-mediated discussions take place amid a massive buildup of US warships and aircraft in the Middle East",
    "image": "https://i.guim.co.uk/img/media/96ede4d7ea219e58418bb070a49b9ac98d00954b/0_0_1024_823/master/1024.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=a1059c4b0279ca5aae93b8458b9b1691",
    "source": "The Guardian"
  },
  {
    "title": "Study finds vegetarians over 80 less likely to reach 100",
    "desc": "Avoiding meat might slightly lower the odds of reaching 100 — but only for frail, underweight seniors. In very old age, staying strong and maintaining muscle matters more than long-term disease prevention. Older adults who included fish, eggs, or dairy were just as likely to become centenarians as meat eaters, suggesting that key nutrients may make the difference. The takeaway: nutrition needs change dramatically with age.",
    "image": "https://www.sciencedaily.com/images/1920/woman-holding-birthday-cake-for-100-year-old.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Government pledges to ease burden of cancer treatment costs",
    "desc": "PS Oluga said the government is facilitating agreements with pharmaceutical firms to reduce the cost of cancer medicine.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/1f359fc9-e491-407d-bc68-a0f695da0783.jpeg?1772137345553",
    "source": "the-star.co.ke"
  },
  {
    "title": "Analytical Evidence from the 2014 Cameroon Multiple Indicator Cluster Survey (MICS)",
    "desc": "Objective: Vaccination coverage in Cameroon remains below targets due to missed opportunities for vaccination (MOV) and delays in timely immunization. This study used data from the 2014 Multiple Indicator Cluster Survey (MICS) to assess vaccination timeliness and MOV, with the goal of proposing a reusable analytic framework for future surveys. Methods: Children aged 12 - 35 months with documented vaccination dates were included. Vaccine doses were classified as early, timely, or delayed based on the national immunization schedule. Timeliness-to-completeness with their 95% confidence intervals (IC) measured how many children were protected on time. Missed opportunity for simultaneous vaccines (MOSV) was defined as the failure to receive one or more vaccine due doses during a health system contact. Uncorrected missed opportunity for vaccination (uncorrected MOV) was defined as a child who missed one or more due vaccine doses during a contact and did not subsequently return to receive the missed vaccine(s). All uncorrected MOVs refer to children who failed to receive all due vaccines that were missed during eligible contacts. Analyses included descriptive statistics, meta-analysis of MOV proportions, stratified comparisons, and modeling based on the “All uncorrected MOSV” status with a stepwise logistic regression analyses completed with a decision tree classification. Results: Of 1447 children (65.3% of cards ownership), 66.1% (95% CI = 63.6 - 68.5) were fully vaccinated among which only 11.3% (95% CI = 9.4 - 13.5) received vaccines on time. Timeliness was below 80% for all antigens, from 34.7% (BCG) to 61% (Penta1). Timely and completeness for specific doses ranged from 27% to 52%. MOV for simultaneous vaccines (MOSV) prevalence was 90% (95% CI = 84 - 94) nationally, among which 61% (95% CI = 53 - 69) of children had ALL uncorrected MOSV. MOV was significantly more frequent in rural areas and varied by maternal education, wealth, region, and care use. Dose specific MOV ranged from the lowest of 4% (56/1413) for BCG, to the highest of 53.04% for the yellow fever, to 57.1% for PCV vaccines. A significant difference in MOV between sexes indicates gender-related inequities. Conclusion: Although based on an older survey, this study demonstrates a methodology for analyzing vaccination data, encompassing both timeliness and combined timeliness-completeness, as well as missed opportunities for vaccination (MOV). The MOV analysis highlights equity gaps and underscores the importance of community-driven, gender-sensitive strategies to strengthen vaccine delivery. Additionally, the observed association between maternal experience of domestic violence and the occurrence of missed opportunities for simultaneous vaccination warrants further investigation.",
    "image": "https://file.scirp.org/image/health2024061315252420.png",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Piyush Goyal holds ‘fruitful’ talks with U.S. Commerce Secretary Lutnick, Ambassador Gor",
    "desc": "Commerce Minister Piyush Goyal meets U.S. counterparts to finalize a bilateral trade agreement, enhancing trade relations between the countries.",
    "image": "https://th-i.thgim.com/public/news/national/vcm7tu/article70679018.ece/alternates/LANDSCAPE_1200/piyush%20goyal%20lutnick%20sergio%20gor.jpg",
    "source": "The Hindu"
  },
  {
    "title": "Hungary accuses Ukraine of 'oil blockade,' places soldiers at energy facilities",
    "desc": "Hungary has accused Ukraine of disrupting oil supplies it gets from Russia and has stationed troops at critical energy facilities across the country.",
    "image": "https://image.cnbcfm.com/api/v1/image/107395965-1712137161411-gettyimages-2095058119-AFP_34LY2CL.jpeg?v=1712143520&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "for conservation of Tanzania’s natural resources",
    "desc": "DAR ES SALAAM: THE World Wide Fund for Nature (WWF) has announced that a total of 150bn/- will be spent on the conservation of Tanzania’s natural resources over a five-year period, starting next year through 2030. The goal of the program is to strengthen environmental conservation and protect biodiversity in the country. Speaking during the",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-26-at-08.18.24.jpeg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Gerry Thornley: Andy Farrell is getting Ireland ready for the 2027 Rugby World Cup",
    "desc": "Andy Farrell has used 30 players in the first three rounds of the tournament, with only two playing every minute",
    "image": "https://www.irishtimes.com/resizer/v2/MVVFTAY7FPSDDPTCLRPMZVHFNY.jpg?smart=true&auth=6487c8f24300a94f6664fe706ae2fd6292878a112bd417acd47a665dd68a74ed&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Move over Indy, we've just got our first information about Wolfenstein 3",
    "desc": "The casting for Wolfenstein 3 has begun.",
    "image": "https://assetsio.gnwcdn.com/wolfenstein-the-new-colossus-artwork-showing-a-male-on-his-knees-with-armed-enemies-behind-him-on-a-red-background.jpg?width=1200&height=630&fit=crop&enable=upscale&auto=webp",
    "source": "Eurogamer"
  }
]