[
  {
    "title": "Korean Won Heads for Longest Rally in 13 Years on Inflows, AI",
    "desc": "The South Korean won is set for its longest winning streak in 13 years as exuberance over artificial intelligence and inflows ahead of a key bond index inclusion buoy the currency.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iY.ZpBYtoR0s/v0/1200x800.jpg",
    "source": "Bloomberg"
  },
  {
    "title": "Canara Bank Q3 Results: Stock falls 5% after core income misses estimates, margins under pressure",
    "desc": "It must be noted that the increase in Canara Bank's profitability in Q3 is also due to a higher other income component. Other income for the quarter increased by 36% year-on-year to ₹7,899.4 crore from ₹5,802 crore last year.",
    "image": "https://images.cnbctv18.com/uploads/2022/07/Canara-Bank-Shutterstock.jpg?im=FitAndFill,width=500,height=300",
    "source": "CNBC TV18"
  },
  {
    "title": "Realme P4 Power 5G launched: India’s first 10,001mAh battery smartphone under ₹25K. Check when the sale starts and best deals here",
    "desc": "Realme P4 Power 5G has launched in India with a world-first 10,001mAh Titan Battery, 144Hz 1.5K AMOLED display, and Dimensity 7400 Ultra chipset. Priced effectively from ₹23,999, it offers 80W fast charging, IP69 durability, and a unique transparent design. Sale begins February 5th on Flipkart and Realme.com.",
    "image": "https://img.etimg.com/thumb/msid-127763308,width-1200,height-630,imgsize-68338,overlay-economictimes/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Recruit’s big Knights audition; Flanno to unleash revamped Red V spine — Trials Team Tips",
    "desc": "Recruit’s big Knights audition; Flanno to unleash revamped Red V spine — Trials Team Tips",
    "image": "https://content.api.news/v3/images/bin/58afc1059a941d5d16d06a09de4e38c0",
    "source": "fox sports"
  },
  {
    "title": "When toys learn to talk, AiSpea turns all things into AI",
    "desc": "As children, many of us imagined our toys coming to life—speaking, thinking, and developing personalities of their own. Today, that long-held fantasy is",
    "image": "https://technode.com/wp-content/uploads/2026/01/aispea-0-1.png",
    "source": "TechNode"
  },
  {
    "title": "New Funding to Boost Job Opportunities for Underprivileged Young People",
    "desc": "Oxfordshire Youth, a charity dedicated to transforming young people’s lives, promoting community cohesion, and addressing inequality of opportunity, has been awarded £150,000 in funding by Oxfordshire County Council. The grant, distributed as £50,000 annually over three years, will support the charity’s Business Guardians programme, enabling it to expand its reach and engage with more companies",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Brooklyn Beckham rift: Wedding planner surprised by attack on parents",
    "desc": "Brooklyn Beckham’s wedding planner “didn’t see any tension” while helping plan his big day. The 26-year-old chef released a strongly worded statement about...",
    "image": "https://www.nzherald.co.nz/resizer/v2/3IUTFL73FFCCLEQXR6VKPCLS2Q.jpg?auth=7319b34bf32e4eda263b4030f708ba0f71d7de592a09d471e9ed7cdca3e2f324&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "Botswana, Eswatini, and South Africa’s Bishops Conclude Plenary with Pledge to Foster Synodality in Evangelization",
    "desc": "Members of the Southern African Catholic Bishops’ Conference (SACBC) who are Local Ordinaries in Botswana, Eswatini, and South Africa have concluded their weeklong Plenary Assembly with a commitment to fostering Synodality in their evangelization ministry, their President has said.",
    "image": "https://www.aciafrica.org/images/aci-africa-photo-edit-2026-01-29t083443_1769672482.jpg?w=1200&format=jpeg",
    "source": "aciafrica.org"
  },
  {
    "title": "MRI in Cervical Lymph Nodes with Oral Squamous Cell Carcinoma in a Select Kenyan Population",
    "desc": "Objectives: Accurate assessment of neck lymphadenopathy is crucial in Oral Squamous Cell Carcinoma (OSCC) due to its prognostic significance. This study aimed to evaluate the reliability and validity of radiological tools using histopathology as a reference for assessing cervical lymph nodes in these patients. Methods: A cross-sectional study was conducted involving 30 patients with OSCC, selected through purposive sampling, who underwent neck dissection at Kenyatta National Hospital between February and June 2023. Data from radiological (preoperative) and histopathological (postoperative) assessment of cervical lymph nodes was collected. The agreement, sensitivity, and specificity of different radiological examinations were evaluated. Results: Radiological and pathological nodal categories showed a consensus (κ = 0.629, p = 0.009), reporting CT scan sensitivity was 83.3% (51.6 - 97.9) and MRI sensitivity was 100% (39.8 - 100). Specificity for CT scan was 44.4% (13.7 - 78.8), while specificity for MRI was 60% (14.7 - 94.7). The positive predictive values for CT scan and MRI were 66.7% (51.4 - 79.1) each while the negative predictive values were 66.7% (40.6 - 85.4) and 100%, respectively. Conclusions: The radiological diagnostic tools demonstrated varying levels of reliability, with MRI showing higher validity than CT scan in the assessment of cervical lymph nodes in OSCC patients.",
    "image": "https://file.scirp.org/image/ojst2024061816383964.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "How political dynasties hurt the local economy",
    "desc": "No less than the country’s chief economist has plainly said it: a political dynasty hinders economic growth.",
    "image": "https://media.philstar.com/photos/2026/01/29/laborers_2026-01-29_15-39-32.jpg",
    "source": "Philstar.com"
  }
]