[
  {
    "title": "Health threat of global plastics projected to soar, researchers warn",
    "desc": "The threat posed by plastic production, usage and disposal to human health will skyrocket in the coming years unless the world does something to address this global crisis, researchers warned on Monday, January 26. A British-French team of researchers attempted to cover all the different ways that plastic affects health during its lifecycle, from oil and gas extraction during production to all the products that end up in landfills. 'Public health crisis' However they said that their...",
    "image": "https://www.premiumbeautynews.com/IMG/logo/1050x600_istock-1126668893_gkv-2.jpg?1769677972",
    "source": "Premium Beauty News"
  },
  {
    "title": "Bank Windhoek first to accept deposits of new banknotes",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% Bank Windhoek has become the first bank in Namibia to upgrade its ATMs to accept deposits of the new Namibia Dollar banknotes.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/01/WhatsApp-Image-2026-01-29-at-10.58.40-AM-683x1024.jpeg",
    "source": "namibian.com.na"
  },
  {
    "title": "My Nintendo Store 實施「Nintendo Switch 2」先到先得販售！無須加入 Switch Online，條件為遊玩時間 50 小時以上",
    "desc": "任天堂宣布，將於 My Nintendo Store 於 2026 年 2 月 6 日（五）下午起，實施「Nintendo Switch 2...",
    "image": "https://today-obs.line-scdn.net/0hRVRqstwEDXlvCBJlWNZyLldeAQhcbhdwTToSGh4KUEwVJBp_WzleGk4NVVUSb0snT2kSGB5cWhkXMUonUg/w1200",
    "source": "LINE TODAY"
  },
  {
    "title": "Eight historical exhibits at Rétromobile commemorate 125 years of Škoda Motorsport",
    "desc": "Mladá Boleslav/Paris, 29 January 2023 – Škoda Auto is kicking off this year’s celebrations marking 125 years of Škoda Motorsport at one of the world’s most prestigious historic car exhibitions. Together with Škoda France, the Mladá Boleslav-based carmaker has prepared an attractive presentation for the Rétromobile exhibition, featuring eight exhibits from the Škoda Museum. They highlight key moments from the brand’s racing history – from early successes on two wheels to modern rally specials.",
    "image": "https://cdn.skoda-storyboard.com/2026/01/260129_Retromobile-exhibition-commemorate-the-125th-anniversary-of-Skoda-Motorsport-1_cf545733-1440x810.jpg",
    "source": "Škoda Storyboard"
  },
  {
    "title": "UAE’s $115 Billion Lunate Taps ADQ Boss In Quest to Double Size",
    "desc": "The chief executive officer of Abu Dhabi’s $263 billion wealth fund ADQ is stepping down to take on a new role at Lunate, the region’s largest alternatives manager that’s seeking to more than double assets over the next five years.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/izLDwWaLlADE/v0/1200x857.jpg",
    "source": "Bloomberg.com"
  },
  {
    "title": "Panty Party Coming to Playstation 4 and PlayStation 5",
    "desc": "Press releases and assets from across the games industry - screenshots, videos, logos, packshots, artwork, PR contacts, release dates",
    "image": "https://imgeucdn.gamespress.com/cdn/files/Games%20Press/2022/11/241642-06b60b9b/Sekaiproject-logo-black.png?w=360&mode=max&otf=y&quality=90&format=png&bgcolor=transparent&sky=b8e585e22f091e99e7b724148aa263736bad2f67ebe6cc0d296d8dbb9e988f5a",
    "source": "Games Press"
  },
  {
    "title": "Commonwealth, EU to deploy large observer missions for upcoming polls",
    "desc": "DHAKA, Jan 29, 2026 (BSS) - The Commonwealth and the European Union (EU) are among the leading international organizations set",
    "image": "https://www.bssnews.net/assets/news_photos/2026/01/29/image-355876-1769677804.jpg",
    "source": "Bangladesh Sangbad Sangstha (BSS)"
  },
  {
    "title": "Influencer fined RM40,000 over offensive video of homeless man",
    "desc": "KUANTAN: A social media influencer was fined RM40,000 on Thursday (Jan 29) after he pleaded guilty to posting an offensive video on social media showing three teenage boys giving rice mixed with chicken bones to a homeless man on a sidewalk.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/29/3744434.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Lawmaker Urges Soludo to Reconsider Onitsha Market Closure",
    "desc": "A lawmaker urges Governor Soludo to rethink the Onitsha market closure, citing massive economic losses and calling for dialogue with market leaders.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2023/08/28220904/Afam-Ogene.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Economic crisis forces Health Department to cut anti-polio campaign duration and slash payments to polio workers in Rawalpindi",
    "desc": "Major reductions have also been made to workers' facilities, sparking concerns that the anti-polio drive could be severely impacted. Polio workers, upset over the pay cuts, have staged protests and warned of further demonstrations. Assertions by the district administration regarding the eradication of polio in Rawalpindi have also been proven inaccurate. The next anti-polio campaign in Rawalpindi district is scheduled to start on February 2 and will run from Monday, February 2, to Thursday, February 5, TET reported.",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20260129090633.png",
    "source": "ANI News"
  }
]