[
  {
    "title": "Measles is coming back as vaccination rates fall. What’s next?",
    "desc": "Fewer people are taking their children for the much-needed jabs and experts warn that even more dangerous illnesses could lurking be around the corner",
    "image": "https://www.thetimes.com/imageserver/image/%2Fcdbb0f07-3547-4fd0-8547-34c487cfad0f.jpg?crop=3840%2C2160%2C0%2C0&resize=1200",
    "source": "The Times"
  },
  {
    "title": "Boats, Sea-doos launched to rescue people and animals trapped by flooding near Courtenay",
    "desc": "A state of local emergency has been activated and Comox Valley Search and Rescue is launching boats and two Sea-doos in an effort to reach people, dogs and sheep that are trapped amid a flood warning for Dove Creek.",
    "image": "https://cheknews.ca/wp-content/uploads/2026/01/court-water-e1769804214946.jpg",
    "source": "CHEK News"
  },
  {
    "title": "Neta V now available for only RM40k, but with a limited 6",
    "desc": "Neta V is now cheaper than a Proton Saga MC3 Executive. But would you get an EV with such a short warranty period?",
    "image": "https://soyacincau.com/wp-content/uploads/2023/10/neta-v-my-octlaunch02.jpg",
    "source": "SoyaCincau"
  },
  {
    "title": "Son of Norway crown princess to stand trial for allegedly raping 4 women",
    "desc": "Marius Borg Hoiby, the 29-year-old son of Crown Princess Mette-Marit, has been charged with a total of 38 counts.",
    "image": "https://assets3.cbsnewsstatic.com/hub/i/r/2025/06/27/358f98f6-5236-4843-875d-b8ab9a3d78d6/thumbnail/1200x630g2/fdc4779954f0312a5a460f46b0e9d695/gettyimages-2165187213.jpg",
    "source": "CBS News"
  },
  {
    "title": "Glasgow's troubled Centre for Contemporary Arts to permanently close",
    "desc": "The announcement comes just a year after it secured £3.4m in funding from arts body Creative Scotland.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/66a8/live/1d27f8f0-7a61-11ef-bf50-ada5c94ac00d.png",
    "source": "BBC"
  },
  {
    "title": "One last ride on the V-set: NSW train fans farewell ‘old but plush’ steel rattlers in style",
    "desc": "The beloved train was treated like a visiting superstar on its ‘rowdy but enjoyable’ final journey from Lithgow to Central Station",
    "image": "https://i.guim.co.uk/img/media/5c10556d1b4cc96a3bf43effee08e55bd875245f/641_89_1758_1407/master/1758.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=bcb231b9d2ccee8bd0de893c0f1c85e2",
    "source": "The Guardian"
  },
  {
    "title": "USA Drops Pakistani Fast Bowler From T20 World Cup 2026 Squad",
    "desc": "The United States (USA) has announced its squad for the ICC Men’s T20 World Cup 2026, and one notable name is missing. Despite earlier reports linking",
    "image": "https://propakistani.pk/wp-content/uploads/2026/01/USA-Squad.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Ariana Grande Latest Photoshoot Got Called Out For AI Usage, And Even She Was Shocked",
    "desc": "Ariana Grande responded with clear surprise and a swear word to seeing pictures of herself that had seemingly been altered with AI.",
    "image": "https://cdn.mos.cms.futurecdn.net/SyZTYk2U2HzFFBkJqYu2YC-1280-80.png",
    "source": "Cinemablend"
  },
  {
    "title": "Driver jailed for murdering Aidan Chapman in Shaftesbury Avenue",
    "desc": "Anthony Gilheaney hit four men on Shaftesbury Avenue, killing Aiden Chapman and injuring the others.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/e033/live/e879b820-fde3-11f0-ae54-2fe2ad2173c5.jpg",
    "source": "BBC"
  },
  {
    "title": "Amazfit smartwatch users get long-awaited app UI refresh and badge awards",
    "desc": "Zepp Health has begun rolling out a notable update to the companion app for its Amazfit watches, introducing a refreshed interface and more.",
    "image": "https://www.wareable.com/wp-content/uploads/sites/6/2026/01/Amazfit_Active_Max_review_34500.jpg",
    "source": "Wareable"
  }
]