[
  {
    "title": "BBC Verify: What flight-tracking shows as US moves more military planes closer to Iran",
    "desc": "Latest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/5c5b/live/41254d00-0d7e-11f1-b5e2-dd58fc65f0f6.png",
    "source": "BBC"
  },
  {
    "title": "Arsenal and Liverpool's Champions League path becomes clearer after playoff first legs",
    "desc": "The Champions League took centre stage in midweek and the likes of Arsenal, Chelsea, Liverpool and Manchester City are one step closer to discovering their next challenge",
    "image": "https://i2-prod.mirror.co.uk/article34943065.ece/ALTERNATES/s1200/0_Arsenal-FC-Training-Session-And-Press-Conference-UEFA-Champions-League-202425-Round-of-16-Second.jpg",
    "source": "The Mirror"
  },
  {
    "title": "UNMISS Leadership",
    "desc": "Special Representative of the Secretary-General (SRSG) and Head of UNMISS Mr. Nicholas HaysomIn January 2021, the UN Secretary-General António Guterres announced the appointment of Nicholas Hayso",
    "image": "https://unmiss.unmissions.org/sites/default/files/styles/3_2_lg/public/2025-02/dpo_logo.png?h=adcce010&itok=LJWEWHv6",
    "source": "UNMISS"
  },
  {
    "title": "David Mokaya acquitted in false publication case against President Ruto",
    "desc": "David Mokaya had been charged with publishing a misleading image of President Ruto on X",
    "image": "https://cdn.radioafrica.digital/image/2026/02/44ff877a-7162-4207-83b6-4bd279dedc62.jpg?1771506255598",
    "source": "the-star.co.ke"
  },
  {
    "title": "First Galaxy Z TriFold Screen Problems Appear, Samsung Offers Refund or a Fix",
    "desc": "Two reports on social media show different issues with the inner display of Samsung's first triple-folding phone.",
    "image": "https://i.pcmag.com/imagery/articles/00EZH22jukAuVuXcRFdHjtZ-1.fit_lim.size_1200x630.v1771496985.jpg",
    "source": "PCMag"
  },
  {
    "title": "NHS facing ‘second surge’ in vomiting virus as cases reach highest level this winter",
    "desc": "NHS England » NHS facing ‘second surge’ in vomiting virus as cases reach highest level this winter",
    "image": "https://www.england.nhs.uk/wp-content/themes/nhsengland/static/img/nhs-england-logo-export.png",
    "source": "NHS England"
  },
  {
    "title": "UK police arrest Andrew Mountbatten-Windsor for misconduct in public office",
    "desc": "U.K. police have arrested Andrew Mountbatten-Windsor on suspicion of misconduct in public office. On Thursday, Thames Valley Police said they opened an investigation after assessing reports about his alleged contact with Jeffrey Epstein.",
    "image": "https://dims.apnews.com/dims4/default/1a1374d/2147483647/strip/true/crop/5906x3935+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F82%2F2c%2Ffb3ef81145cb9ee829890253e2be%2Fap26035407432236.jpg",
    "source": "Associated Press News"
  },
  {
    "title": "Pakistan offers Arabian Sea trade routes to Russia, Central Asia, minister says",
    "desc": "ISLAMABAD: Pakistan is offering overland trade routes to Russia and landlocked Central Asian states through its Arabian Sea ports, Communications Minister Abdul Aleem Khan said on Thursday, positioning the country as a strategic transit hub as regional supply chains shift toward alternative corridors. Pakistan has long sought to leverage its geography to connect landlocked",
    "image": "https://www.arabnews.pk/sites/default/files/styles/660x371_watermarkpakistan/public/main-image/2026/02/19/4686546-964186112.jpg?itok=Hp4Xgw8z",
    "source": "Arab News PK"
  },
  {
    "title": "Nasdaq 100, EUR/USD hover above support while WTI rallies",
    "desc": "​​​Technical analysis of the Nasdaq 100 and EUR/USD as they hover above support while WTI is breaking through its January-to-February resistance line.",
    "image": "https://a.c-dn.net/c/content/dam/publicsites/igcom/uk/images/news-article-image-folder/Adobe_eur_usd_07-11-2024.jpg/jcr:content/renditions/cq5dam.web.1280.1280.jpeg",
    "source": "IG Group"
  },
  {
    "title": "Accommodation row rocks Pakistan hockey: PHF chief resigns after banning captain",
    "desc": "Hockey News: Pakistan Hockey Federation president Tariq Bugti has resigned following the controversy over the Pakistan national team’s accommodation during its rec.",
    "image": "https://static.toiimg.com/thumb/msid-128554765,width-1280,height-720,imgsize-63034,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  }
]