[
  {
    "title": "Every day she cycles to the anganwadi, cleans up, lays out the mats – and waits, for kids who never come",
    "desc": "A Saturday meeting may finally end a four-month boycott of a Dalit cook in an Odisha village. But Sarmista Sethi is not holding her hopes too high.",
    "image": "https://images.indianexpress.com/2026/02/anganwadi-3col.jpg",
    "source": "indianexpress.com"
  },
  {
    "title": "Horrific accident in Bengaluru: 5 dead as speeding car crashes into divider, topples, collides head-on with bus coming from opposite direction",
    "desc": "Around five persons died in a tragic road accident involving a car and a Karnataka State Road Transport Corporation (KSRTC) bus near Jindal on Tumakuru Road on the outskirts of Bengaluru on Saturday midnight.\nAccording to police, the accident occurred when a Tata Indica, travelling from Tumakuru towards Bengaluru, reportedly crashed into a road divider, crossed into the opposite lane, toppled, and collided head-on with a KSRTC bus that was coming from the opposite direction around 11.30 pm.\nThe impact of the collision was severe, leaving the car completely mangled and causing extensive damage to its front portion. Based on the preliminary investigation, police suspect overspeeding to be the main cause of the accident.",
    "image": "https://static.toiimg.com/thumb/msid-128369487,width-1280,height-720,imgsize-61252,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "NDDC looks up to new governance structure for consolidation",
    "desc": "Success without succession, according to management experts, is failure. The present administration in the NDDC led by Samuel Ogbuku...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2026/02/Untitled-design-53-1-1-1.png",
    "source": "Businessday NG"
  },
  {
    "title": "Prime Minister announces $3.9 billion 'down payment' towards $30b Adelaide submarine shipyard",
    "desc": "The South Australian and federal government release plans for the shipyard in Adelaide that will build at least eight nuclear-powered submarines under the AUKUS pact with the US and the UK.",
    "image": "https://live-production.wcms.abc-cdn.net.au/4d4cf99522ada337a02cb783a7acf165?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "TFS resolves 96pc of forest conflicts",
    "desc": "DODOMA: THE Tanzania Forest Services Agency (TFS) has resolved 423 out of 438 forest-related conflicts, marking a 96 per cent implementation of government directives aimed at ending long-standing land disputes in protected forest areas. Minister for Natural Resources and Tourism, Dr Ashatu Kijaji, announced the progress yesterday in Dodoma during the inauguration of the TFS",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-15-at-09.36.58-1.jpeg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Moot emphasises energy applications in agriculture",
    "desc": "An international workshop was organised at Pir Mehr Ali Shah Arid Agriculture University Rawalpindi (PMAS-AAUR)",
    "image": "https://i.tribune.com.pk/media/images/smart-farming1741470041-0/smart-farming1741470041-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Big Cats 24/7 | Preview (BBC Two)",
    "desc": "The Big Cats 24/7 team is returning to the Okavango Delta. The Xudum lion pride is now over 40 strong, and its mums must hunt around the clock to feed their growing cubs. The pride males Big Toe and Madumo are missing, leaving the most vulnerable cubs unprotected from dangerous intruder male lions.Leopardess Xudum has left her territory due to an influx of aggressive male leopards. In Xudum’s absence, the team turns its attention to a new female, Lediba, who they think may already have cubs. Che",
    "image": "https://static.wixstatic.com/media/d56877_c0ce8389584747858c9befd32afeadbc~mv2.png/v1/fill/w_1000,h_563,al_c,q_90,usm_0.66_1.00_0.01/d56877_c0ce8389584747858c9befd32afeadbc~mv2.png",
    "source": "TV Zone UK"
  },
  {
    "title": "Elderly uncle cries as Tadika kids visit for CNY",
    "desc": "Islamic kindergarten children brought CNY food packets to elderly Chinese man in Melaka, touching hearts",
    "image": "https://thesun.my/wp-content/uploads/2026/02/Screenshot_31-blurred.webp",
    "source": "The Sun Malaysia"
  },
  {
    "title": "Where Will Nvidia Be in 3 Years?",
    "desc": "Don't expect the same share price returns of the past three years, but more good times could still be ahead for Nvidia.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F855210%2Fgettyimages-1005371528-1200x675-128554e.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Real-Time 3D Room Mapping With ESP32, VL53L5CX Sensor And IMU",
    "desc": "ST's VL53L5CX is a very small 8x8 grid ranging sensor that can perform distance measurements at a distance of up to 4 meters. In a recent video,[Henrique Ferrolho] demonstrated that this little sensor...",
    "image": "https://hackaday.com/wp-content/uploads/2026/02/esp32_time-of-flight_sensor_henrique_ferrolho_youtube.jpg",
    "source": "Hackaday"
  }
]