[
  {
    "title": "Women and LGBTQ+ leaders reshape the face of the US rabbinate",
    "desc": "Once dominated by men, the US rabbinate is becoming more diverse as women, LGBTQ+ Jews and people from varied backgrounds enter religious leadership, reshaping congregations and challenging long-standing traditions",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/01/13/SJM16itXBWg/SJM16itXBWg_1_105_1000_563_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "I have paused on making public prophetic declarations on national, political matters - ElBernard",
    "desc": "The Head Pastor of Spiritlife Revival Ministries, Prophet Bernard ElBernard Nelson-Eshun, has announced a temporary withdrawal from making public prophetic declarations, particularly on national and political matters, following the failure of his...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/352/35220977.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Premier League LIVE: Aston Villa v Brentford, Man Utd v Fulham, & Forest v Palace",
    "desc": "Follow live text and radio commentary of four Premier league matches including, Aston Villa v Brentford, Man Utd v Fulham & Forest v Palace.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e234/live/9668ccc0-ff81-11f0-ba7a-65010dfea24f.jpg",
    "source": "BBC"
  },
  {
    "title": "International Centre for Migration Policy Development (ICMPD) is Seeking for a Policy Intern",
    "desc": "The International Centre for Migration Policy Development (ICMPD) is an intergovernmental organisation with 21 Member States, dedicated to advancing effective",
    "image": "https://i0.wp.com/www.globalsouthopportunities.com/wp-content/uploads/2026/02/ICMPD_logo-new.jpg",
    "source": "Global South Opportunities"
  },
  {
    "title": "Why the biggest Baloch attack in decades is a wake-up call for US, China",
    "desc": "Pakistan Balochistan News: A series of coordinated attacks by BLA rebels across Pakistan's province of Balochistan is a wake-up call to both the US and China. Both countries have high stakes in Balochistan centred around resource extraction and access to alternative trade routes. These moves are fuelling the wave of BLA attacks that have struck Pakistan in the past few years.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/the-coordinated-strike-by-bla-rebels-across-pakistans-balochistan-should-serve-as-a-warning-to-the-013404956-16x9_0.jpg?VersionId=AnFcoPCxIgvQABSjin4RND5yD55grSPJ",
    "source": "India Today"
  },
  {
    "title": "Preparations underway at Gaza's Rafah crossing a day before Israel says travel will resume",
    "desc": "Although Gaza has four other border crossings, they are shared with Israel, and many Palestinians see Rafah as their gateway to the world.",
    "image": "https://live-production.wcms.abc-cdn.net.au/99c907c4a707bbbce32e01bb5b7011e5?impolicy=wcms_watermark_news&cropH=1879&cropW=3340&xPos=0&yPos=174&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Preparations underway at Gaza's Rafah crossing a day before Israel says travel will resume",
    "desc": "Although Gaza has four other border crossings, they are shared with Israel, many Palestinians see Rafah as their gateway to the world.",
    "image": "https://live-production.wcms.abc-cdn.net.au/99c907c4a707bbbce32e01bb5b7011e5?impolicy=wcms_watermark_news&cropH=1879&cropW=3340&xPos=0&yPos=174&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Alliance demands urgent action on Tanzania’s NCD burden",
    "desc": "The Alliance warned lawmakers that Tanzania risks a looming health and economic crisis without urgent, coordinated action.",
    "image": "https://www.thecitizen.co.tz/resource/image/5345002/landscape_ratio3x2/1200/800/9667700cc8dc6b237c349ac26b32c293/eJ/alliance-pic.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Carlos Alcaraz: tennis history-maker with shades of Federer",
    "desc": "The 22-year-old defeated Novak Djokovic in the Australian Open final",
    "image": "https://i.tribune.com.pk/media/images/11769949913-0/11769949913-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "'I was 2mm away from death, exactly the same as Steven Kitshoff'",
    "desc": "Bordeaux's South African juggernaut has charted an extraordinary journey back to the field following a career-threatening neck injury.",
    "image": "https://eu-cdn.rugbypass.com/wp/wp-content/uploads/2026/02/Carlu-Sadie-XV-1200x630.png",
    "source": "Rugbypass.com"
  }
]