[
  {
    "title": "General shot in Moscow conscious after surgery, Russian media say",
    "desc": "Lt Gen Vladimir Alexeyev was shot several times inside his apartment block on Friday morning.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f0a0/live/f162fd50-042a-11f1-9972-d3f265c101c6.png",
    "source": "BBC"
  },
  {
    "title": "Ethiopia’s Market Financing Shift Raises Liquidity Risks as Debt Talks Stall",
    "desc": "Ethiopia’s shift toward market-based financing is improving macroeconomic stability but creating near-term liquidity pressures, as stalled debt restructuring",
    "image": "https://birrmetrics.com/wp-content/uploads/2026/02/IMG_4082.jpg",
    "source": "Birr Metrics"
  },
  {
    "title": "Lewis Capaldi sends Taylor Swift sweet message after 'Opalite' video role",
    "desc": "Lewis Capaldi is thanking Taylor Swift for casting him in her star-studded Opalite music video as a photographer.Capaldi, 29, who’s himself a celebrated singer, took to Instagram on Saturday,...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-07/1391439_090056_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "Philippines prepares for Green Expo 2027 in Japan",
    "desc": "President Ferdinand Marcos Jr. created an inter-agency committee to facilitate preparations for the participation of the Philippines in the Green Expo 2027 in Japan, Malacañang said Saturday.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/07/929117.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "Eileen Gu overcomes an early fall in slopestyle to keep her Olympic dreams in tact",
    "desc": "Freeski star Eileen Gu has overcome a poor start by laying down a strong second run to qualify for the women’s slopestyle final at the Winter Olympics.",
    "image": "https://dims.apnews.com/dims4/default/161a5fd/2147483647/strip/true/crop/6205x4135+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2Fea%2F27%2F3dfde43c7c55f5d75bae15b27ae2%2Fd01b10740fc3456d89f0ef4ba53c0d1a",
    "source": "AP News"
  },
  {
    "title": "Heart attack warning for women as Northland midwife tells survival story",
    "desc": "Northland midwife Denise McCormack is grateful to be alive after first surviving a heart attack, then being faced with an ‘impossible decision’ because of...",
    "image": "https://www.nzherald.co.nz/resizer/v2/VZHCJJO74RAEHJX44TRUS4KPMM.JPG?auth=ed2f881ee9e54a29332c95c6404bc4ce9cfd2abe1bdf3490f1698225758303b4&width=1200&height=675&quality=70&focal=255%2C299&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Bruno saw the future! Man Utd star Fernandes claims he knew Michael Carrick would be a 'great' manager after interim spell as Red Devils make it four wins in a row against Tottenham",
    "desc": "Bruno Fernandes has claimed he knew Michael Carrick would make a great manager after first working with him four years ago when he was Manchester United's interim boss.",
    "image": "https://assets.goal.com/images/v3/bltdead77c820d6eabc/GOAL%20-%20Multiple%20Images%20-%202%20Split%20-%20Facebook%20-%202026-02-07T154524.615.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Italy punish lacklustre Scotland in Rome rain",
    "desc": "Scotland open their Six Nations campaign in miserable fashion, going down 18-15 to Italy in rain-soaked Rome.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/87ec/live/69928b40-0437-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  },
  {
    "title": "Q&A: Making Plant-Based Eating Practical in Pharmacy-Led Cardiometabolic Care",
    "desc": "Incremental, plant-based dietary changes can improve glycemic control, weight, and lipid outcomes while complementing cardiometabolic pharmacotherapy in routine pharmacy practice.",
    "image": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/97432beae7a766248b2d433cd410c931dc91fd01-5760x3840.jpg",
    "source": "Pharmacy Times"
  },
  {
    "title": "Fernandes keeps Carrick’s perfect Manchester United record intact after Romero red card",
    "desc": "Bryan Mbeumo and Bruno Fernandes fired Manchester United to a 2-0 victory at home to Tottenham as Cristian Romero was sent off for the second time this season",
    "image": "https://i.guim.co.uk/img/media/f5e81ada43c1df1ef0baa8cad86260b097b1cb61/286_155_2902_2322/master/2902.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=62a2304097d3425853c36008a2d46976",
    "source": "The Guardian"
  }
]