[
  {
    "title": "Can money buy love? High earners in Malaysia seem to think so, new Ipsos poll shows",
    "desc": "KUALA LUMPUR, Feb 15 — Malaysia has ranked seventh out of 29 countries in the 2026 Love Life Satisfaction Index, placing it among the global top 10 for relationship satisfaction...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/15/325616.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "From succession planning to inherited debt, there's pressure and joy in taking on a family business",
    "desc": "Inheriting a family business comes with the weight of generations past. For these change-makers, the future is in modernising their operation and making it their own.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ac3ad2d4e33155f4ae3488d2593fcfb5?impolicy=wcms_watermark_news&cropH=2812&cropW=4999&xPos=1&yPos=303&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Rufai and limits of unreason",
    "desc": "The Nation Newspaper Kwankwaso, el-Rufai and limits of unreason",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2021/10/12140214/cropped-nation-cropped-l-32x32.jpg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "Over the past month, French authorities have seized nearly 12 tonnes of cocaine around Polynesia",
    "desc": "French authorities said they had seized 2.4 tonnes of cocaine from a vessel in the Pacific during a joint operation with the United States, as officials step...",
    "image": "https://www.nzherald.co.nz/resizer/v2/NS3SVP37VZFMPNCLKD7XNT2RQE.jpg?auth=ed995f2c405a81e84c4c0a6c7f56043b577d155ffe6ee755887e6f95c8950e81&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "Sridhar Vembu doubles down on East India Company comparison for Big Tech, says ‘bigger than most sovereign nations'",
    "desc": "Just weeks after he first made the analogy, Zoho's Sridhar Vembu has again compared Big Tech with the East India Company, stating that these well-funded and ambitious corporates are “bigger than most sovereign nations”.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/15/1600x900/logo/Sridhar_Vembu_big_tech_east_india_company_compare_1771123506604_1771123506727.jpg",
    "source": "Mint"
  },
  {
    "title": "Dr Sammy Ayeh defends Baba Jamal recall, rejects comparison with Hajia Amina Adam",
    "desc": "Government Communicator , Dr Sammy Ayeh, has defended the decision to recall Ghana’s High Commissioner to Nigeria, Mohammed Baba Jamal,...",
    "image": "https://www.businessghana.com/site/img/../../cms/img/news/2026-02-13-1412004.jpg",
    "source": "BusinessGhana"
  },
  {
    "title": "India’s forex reserves slip to $717 billion; gold takes the hit as RBI data flags a sharp drop",
    "desc": "For the reported week (that ended February 6), India's foreign currency assets (FCA), the largest component of foreign exchange reserves, stood at $570.053 billion, up $7.661 billion.",
    "image": "https://images.moneycontrol.com/static-mcnews/2025/09/20250912122919_india-forex-reserve.png",
    "source": "Moneycontrol"
  },
  {
    "title": "RBI gives nod to Manappuram Finance for BC Asia Investments. Details here",
    "desc": "The NBFC stock has faced near-term pressure, with its share price slipping slightly over the past five sessions and declining about 4% over the last month.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/15/1600x900/logo/RBI_1771122963290_1771122963427.JPG",
    "source": "Mint"
  },
  {
    "title": "Onyeka explains Coventry switch, eyes Boro battle",
    "desc": "Super Eagles star Frank Onyeka reveals the reason for his Coventry switch from Brentford, his chat with Frank Lampard, and eyes the Boro clash.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/12034843/Frank-Onyeka-1080x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "History! This will happen for the first time in more than 44 years Sunday...",
    "desc": "It has been more than 44 years since the first and second seeds have played in the final of three ATP Tour events in the same week. That will change on Sunday in Dallas, Rotterdam and Buenos Aires.",
    "image": "https://www.atptour.com/-/media/images/news/2026/02/14/21/48/fritz-saturday-dallas-2026.jpg",
    "source": "ATP Tour"
  }
]