[
  {
    "title": "The Paradise: Makers Announce When Aaya Sher Full Song Will Be Out",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/02/aaya.webp",
    "source": "123telugu.com"
  },
  {
    "title": "Cyclone Gabrielle inquest: FENZ leader admits going against protocol to restart search for dead firefighter",
    "desc": "He told an inquest into the fatal Muriwai slip he knew he was breaking protocol, but believed more could have been done to reach the two buried men.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--gDialn83--/t_tohu-badge-facebook/v1707778748/4KUVMTJ_MicrosoftTeams_image_5_png?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Global trade tensions wake-up call for Africa - ACCP",
    "desc": "The African Chamber of Content Producers (ACCP) has said escalating global trade tensions must serve as a decisive catalyst for Africa to fully...",
    "image": "https://www.businessghana.com/site/img/../../cms/img/news/2026-02-23-123849003.jpg",
    "source": "BusinessGhana"
  },
  {
    "title": "The best countries at creative thinking",
    "desc": "Top 30 countries",
    "image": "https://cdn.radioafrica.digital/image/2026/02/5e602918-7652-423d-93c3-abddfcc6af28.jpeg?1771927783517",
    "source": "the-star.co.ke"
  },
  {
    "title": "Essential Caravans buys Zone RV, but customers left short",
    "desc": "A Melbourne-based company has purchased Zone RV, but customers who collectively paid millions before its collapse will be left out of pocket.",
    "image": "https://live-production.wcms.abc-cdn.net.au/98d2c4781357f2675a5887569dafce8c?impolicy=wcms_watermark_news&cropH=2213&cropW=3934&xPos=98&yPos=572&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Raw recap & reactions (Feb. 23, 2026): AJ goes to the Hall of Fame",
    "desc": "Maxxine Dupri can’t continue, Bronson Reed gets injured, and AJ Styles hangs up his gloves on this week’s Raw.",
    "image": "https://platform.cagesideseats.com/wp-content/uploads/sites/54/2026/02/Screenshot-2026-02-23-at-11.09.08%E2%80%AFPM.png?quality=90&strip=all&crop=0%2C3.4886582462271%2C100%2C93.022683507546&w=1200",
    "source": "Cageside Seats"
  },
  {
    "title": "Effective degradation of Reactive Blue 21 and Reactive Red 195 by copper(II) oxide nanoparticles biosynthesized by pistachio hulls extract",
    "desc": "Textile dyes such as Reactive Blue 21 and Reactive Red 195 are complex organic compounds widely used in the fabric industry, which often cause significant environmental pollution due to their resistance to conventional wastewater treatment methods. The aim of this study is photo-degradation of these organic dyes by copper (II) oxide nanoparticles (CuO-NPs) that biosynthesized via a method based on pistachio hulls extract. The synthesized nanoparticles were characterized by various techniques such as X-ray diffraction (XRD), scanning electron microscopy (SEM), Fourier-transform infrared spectroscopy (FT-IR), dynamic light scattering (DLS), and ultraviolet-visible (UV-Vis) spectroscopy. The characterization results confirm the formation of homogeneous, spherical, crystalline CuO-NPs with an average size of approximately 90 nm. The high quality of CuO-NPs synthesized using pistachio hull extract is attributed to the presence of natural reducing and capping agents in the extract. These agents play a dual role: they reduce the copper precursor to CuO-NPs and simultaneously stabilize the nanoparticles by preventing agglomeration. The biosynthesized CuO-NPs showed high photocatalytic activity in degrading organic dyes under UV light irradiation. Specifically, the degradation efficiencies reached about 83% for Reactive Blue 21 and 75% for Reactive Red 195 after 180 min of irradiation.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Mexico sends thousands of soldiers to stop violence after death of drug lord",
    "desc": "At least 25 members of Mexico's National Guard have died in Jalisco state since the violence erupted.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/13855457-98eb-46bd-9a71-865c53866dd0.jpg?1771909718769",
    "source": "the-star.co.ke"
  },
  {
    "title": "Ukraine conflict: NZ PM to take part in Coalition of the Willing meeting",
    "desc": "The meeting comes on the fourth anniversary of Russia's invasion of Ukraine.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--HecIxnwj--/t_tohu-badge-facebook/v1771889894/4JSPICB_Image_1_jfif?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Oil hovers below seven-month high as traders eye U.S.-Iran talks, trade policy",
    "desc": "Oil neared a seven-month high on Tuesday as traders gauged the outlook for U.S.-Iran nuclear talks, while also weighing uncertainty around U.S. trade policy.",
    "image": "https://image.cnbcfm.com/api/v1/image/108264227-1770775993647-gettyimages-955175174-325086872_0-3.jpeg?v=1771899915&w=1920&h=1080",
    "source": "CNBC"
  }
]