[
  {
    "title": "ASEAN tourism announces at ATF a new era focused on high quality",
    "desc": "ASEAN moves to high-value tourism as ministers adopt ATSP 2026–2030 after record arrivals finally passed pre Covid numbers.",
    "image": "https://www.travelmole.com/wp-content/uploads/2026/02/ASEAN-2026-Homepage-1068x619.jpeg",
    "source": "TravelMole"
  },
  {
    "title": "This \"Japanese Hasselblad\" does things that the original Swedish camera simply can't",
    "desc": "How a self-taught Japanese craftsman created the \"Japanese Hasselblad\" \\u2013\\u00a0which ended up being owned by Tamron",
    "image": "https://cdn.mos.cms.futurecdn.net/v4WBNrjDpEL2853N7TAQ5o-1584-80.jpg",
    "source": "Digital Camera World"
  },
  {
    "title": "Met Office issues yellow weather warning for Northern Ireland",
    "desc": "A yellow alert for ice has been issued for Northern Ireland.",
    "image": "https://focus.belfasttelegraph.co.uk/thumbor/cDjHoZ07gjAtEIwir1MRoq9-1Ic=/0x8:1500x1008/629x0/prod-mh-ireland/fb3899ca-1cbf-4809-8ceb-371bcdd44a5e/6580778e-bae1-4b63-8634-7f12390aae1b/fb3899ca-1cbf-4809-8ceb-371bcdd44a5e.jpg",
    "source": "Belfast Telegraph"
  },
  {
    "title": "Actress Joanne Peh hit by snowboarder, injures her knee while skiing in China",
    "desc": "She was instructed by a doctor to rest for at least one month and avoid unnecessary movement. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/adf60c3e9442d2d2139c4c3fa0e877b9c900c813b045d1d9ecf1132a6cbf05c9",
    "source": "The Straits Times"
  },
  {
    "title": "Jack Grealish and Kyle Walker received drunk texts from Katie Price, claims ex-boyfriend JJ Slater",
    "desc": "Married at First Sight star JJ Slater, now her ex, told the Sun on Sunday he also suspects she was seeing new husband Lee Andrews six months ago while they were still together.",
    "image": "https://assets.goal.com/images/v3/blt1d88ab433b90ffa0/GOAL%20-%20Multiple%20Images%20-%202%20Split%20-%20Facebook%20-%202026-02-01T094159.156.png",
    "source": "Goal.com"
  },
  {
    "title": "Lutsharel Geertruida: Liverpool in talks to sign defender on loan",
    "desc": "Liverpool are in talks to sign Dutch defender Lutsharel Geertruida on loan.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4625/live/dcc805b0-ff53-11f0-861a-555f9d353c11.jpg",
    "source": "BBC"
  },
  {
    "title": "Budget 2026-27: What gets cheaper and what costs more",
    "desc": "The Budget brings relief on several essential items through customs duty cuts, making products such as cancer drugs and household appliances cheaper.",
    "image": "https://greaterkashmir.imagibyte.sortdcdn.net/wp-content/uploads/2026/02/Screenshot-2026-02-01-at-3.36.58%E2%80%AFPM.png",
    "source": "Greater Kashmir"
  },
  {
    "title": "Australian woman dies after mishap on ski lift in Japan's Nagano Prefecture",
    "desc": "NAGANO, (Japan): An Australian national has died in a hospital after being suspended in midair from a ski lift in Tsugaike Mountain Resort in Otari, Nagano Prefecture, on Friday (Jan 31).",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/01/3748937.jpg",
    "source": "The Star"
  },
  {
    "title": "Trump says 'US may make a deal on Cuba': What it means for Cubans?",
    "desc": "US President Donald Trump expressed on Saturday, January 31, 2026, that the United States would work a deal on Cuba.Trump reiterated his call for Cuba to negotiate with the United States. His...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-01/1390602_030613_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "Four Countries In Europe In Adjusting To New Travel Guidelines From Canada’s Super Visa",
    "desc": "Switzerland joins Ireland, Poland, Norway, Spain, Germany, France, and more than forty-four countries in Europe in facing tough travel challenges as Canada unveils its new Super Visa program due to the indefinite closure of the Parents and Grandparents Program (PGP).",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/Canada-visa-1.jpg",
    "source": "Travel And Tour World"
  }
]