[
  {
    "title": "Mariah Carey, Andrea Bocelli, Ghali charm the stage at the opening ceremony",
    "desc": "The Winter Olympics 2026 officially started on 6th Feb with a spectacular opening ceremony, running through Feb 22 in Italy. With remarkable and unforgettable moments, the night featured stunning performances by Mariah Carey, Ghali, and Sabrina Impacciatore.",
    "image": "https://cdn1.wionews.com/prod/wion/images/2026/20260207/image-1770443133247.png?imwidth=1200&imheight=900",
    "source": "WION"
  },
  {
    "title": "PCB to consult government on Sri Lanka’s request to reconsider India match boycott: sources",
    "desc": "PCB to consult with the government on Sri Lanka's request to reconsider India's match boycott at the T20 World Cup.",
    "image": "https://th-i.thgim.com/public/incoming/x4aaad/article70603068.ece/alternates/LANDSCAPE_1200/Pakistan_Asia_Cup_Cricket_91396.jpg",
    "source": "thehindu.com"
  },
  {
    "title": "98% of Mosques in Aceh Operational After 2025 Floods, Landslides",
    "desc": "Most of the mosques or musallas have been re-utilized by the community despite being in an emergency condition.",
    "image": "https://statik.tempo.co/data/2025/12/29/id_1450358/1450358_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "Parañaque gov't warns public against fake FB accounts posing as city mayor",
    "desc": "The Parañaque city government has warned the public to remain vigilant against the spread of fake and unauthorized Facebook pages and accounts falsely using...",
    "image": "https://mb.com.ph/manilabulletin/uploads/global_files/default_meta_image.png",
    "source": "Manila Bulletin"
  },
  {
    "title": "Mandelson suggested holiday home for 'privacy' of Epstein 'guests'",
    "desc": "Former Labour Party peer tells sex offender he found \"a great place to stay\" with \"privacy\", a document suggests.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/205e/live/42be2b60-038c-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Is Tanzania's Rising National Debt Financing Development or Delaying a Crisis?",
    "desc": "Tanzania National Debt 2026: Development Financing or Delayed Crisis? | TICGL Research Is Tanzania's Rising National Debt Financing Development or Delaying a Crisis? A Comprehensive Data-Driven Analysis of Debt Growth and Non-Inclusive Economic Growth Research Date: February 6, 2026 Author: TICGL Economic Research Division Focus: National Debt Impact Analysis Introduction: The Debt Dilemma Over the",
    "image": "https://ticgl.com/wp-content/uploads/2026/02/Tanzanias-Rising-National-Debt-Financing.jpg",
    "source": "Tanzania Investment and Consultant Group Ltd"
  },
  {
    "title": "Mizoram Health Minister bats for behavioural approach to prevent HIV",
    "desc": "Mizoram Health Minister advocates for the ABC approach to effectively combat rising HIV cases and promote youth awareness.",
    "image": "https://th-i.thgim.com/public/news/national/ji3t02/article70603051.ece/alternates/LANDSCAPE_1200/iStock-881076458.jpg",
    "source": "thehindu.com"
  },
  {
    "title": "Female student allegedly ‘gang raped’ during inter-school sports in Koforidua",
    "desc": "A female student of Osino Presbyterian Senior High School has allegedly been gang raped in Koforidua.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/366/36630589.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Nueva Vizcaya solon says mining issue being 'weaponized' against him",
    "desc": "Nueva Vizcaya lone district Rep. Tim Cayton slammed on Saturday, Feb. 7 what he described as the",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/07/77552.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Dustin Yu dedicates sweet birthday message to Bianca De Vera: 'You deserve all the happiness'",
    "desc": "Dustin Yu marked Bianca De Vera’s birthday with a sweet post on Instagram.",
    "image": "https://images.gmanews.tv/webpics/2026/02/dustin_2026_02_07_14_07_35.jpg",
    "source": "GMA Network"
  }
]