[
  {
    "title": "A Case Study at the University of Nizwa, Oman",
    "desc": "Artificial Intelligence (AI) has revolutionized the world in all spheres of life. Starting with the fundamentals, AI has altered key areas in the industry and is now poised to encroach upon the realm of education, most notably in higher education. Undoubtedly, the reliance on AI has been steadily rising in the past few years, and the University of Nizwa, in the Sultanate of Oman has been taken as a case study to establish the link between student performance and the usage of AI. Being exploratory research, this article attempts to shed light on the perspectives of AI being used to bolster students’ motivation and the extent of their involvement in the learning process. The main aim of this study is to observe the moderating factors, such as academic specialization and academic level, which may impact the relationship between the use of AI technologies and the students’ academic performance at the University of Nizwa. In doing so, this study seeks to answer questions on how educational specialization influences students’ gains from AI technologies. What are the challenges students encounter in utilizing AI technologies in their learning? For the research methodology, this study employed a quantitative approach based on a structured questionnaire analyzed using statistical procedures (descriptive statistics, correlation, regression and t-test) for the 115 random samples.",
    "image": "https://file.scirp.org/image/jilsa2016090511393812.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Based Nanofibrous Aerogel Catalysts for Catalytic Infrared Heating",
    "desc": "Catalytic infrared heating offers an energy-efficient and low-emission alternative to traditional flame-based heating. However, its practical application is limited by the insufficient activity, thermal durability, and structural stability of current catalysts under continuous combustion conditions. In this study, Pd-doped TiO2/SiO2/Y2O3 nanofibrous aerogel catalysts (PTSY-NFAs) with tunable Pd loadings were synthesized via a one-step 3D sol-gel electrospinning technique, followed by calcination. This process resulted in a binder-free, continuously interconnected nanofibrous aerogel framework characterized by high surface area, excellent thermal stability, and strong mechanical resilience. The influence of Pd loading on the microstructure, redox behavior, and catalytic performance was examined systematically. The optimized PTSY-11-NFA catalyst achieved an LPG conversion efficiency of 99% and a peak infrared surface temperature of 587˚C. A prototype catalytic infrared heater integrated with this catalyst displayed uniform surface temperatures ranging from 423˚C to 509˚C and maintained stable long-term operation, surpassing the performance of a commercial catalyst. This study demonstrates a scalable design strategy for noble metal-doped ceramic nanofibrous aerogels aimed at achieving high-efficiency catalytic infrared heating.",
    "image": "https://file.scirp.org/image/msce2024061315372631.png",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Foundation reviews strategies",
    "desc": "The Nation Newspaper Foundation reviews strategies",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/02/09092354/Foundation-reviews-strategies.png",
    "source": "The Nation Newspaper"
  },
  {
    "title": "Ex-remisier admits to offences including criminal breach of trust, causing over $11.5m in losses",
    "desc": "Sumiko-Jill Teo Hui-Ni left Singapore in January 2022 before she was arrested in Spain seven months later. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/d93b26176be0d8f2d2fab1fdbf529c6142587f6f93451b8d4cbf6109ee37d9f1",
    "source": "The Straits Times"
  },
  {
    "title": "Punjab campus horror: Law student kills girl classmate, turns gun on himself",
    "desc": "TARN TARAN: In a horrifying incident inside a Tarn Taran law college, a first-year student shot dead his classmate before turning the weapon on himsel.",
    "image": "https://static.toiimg.com/thumb/msid-128107479,width-1280,height-720,imgsize-17850,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "PM’s office to launch social protection policy, NISS today",
    "desc": "DODOMA: THE Prime Minister’s Office – Labour, Employment and Persons with Disabilities is set to launch the National Social Protection Policy of 2023 and the National Social Security Scheme for Self-Employed Persons in the Informal Sector (NISS) in Arusha today. According to a statement issued by the Government Communications Unit in Dodoma over the weekend,",
    "image": "https://dailynews.co.tz/wp-content/uploads/2024/10/General-Masha-Mshomba.jpeg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Italy captain Wayne Madsen injures shoulder in T20 World Cup opener",
    "desc": "The Italy captain hurt his shoulder in the fourth over of Scotland's innings and was ruled out of the match",
    "image": "https://img1.hscicdn.com/image/upload/f_auto/lsci/db/PICTURES/CMS/413100/413153.6.jpg",
    "source": "ESPNcricinfo"
  },
  {
    "title": "Bad Bunny calls for unity at Super Bowl half",
    "desc": "Bad Bunny was joined by pop icon Lady Gaga for a star-studded Super Bowl half-time show, performed almost entirely in Spanish and carrying a message of unity.",
    "image": "https://www.rte.ie/images/0023dddf-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Nigeria is vaccinating millions of girls against cervical cancer but some may be left behind",
    "desc": "BY OLUWADARA ALEGBELEYE AND OLUWATOSIN DONGO Since October 2023, Nigeria has vaccinated more than 13 million girls against…",
    "image": "https://www.thecable.ng/wp-content/uploads/2026/02/HPV.webp",
    "source": "TheCable"
  },
  {
    "title": "Rural and Community Banks' reforms pose confidence test for BoG",
    "desc": "The central bank is facing calls to tread carefully as it rolls out new reforms for the microfinance and rural banking sector, amid concerns that poor execution could unsettle a sub-sector that has only recently regained public trust.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/618/61842086.jpg",
    "source": "GhanaWeb"
  }
]