[
  {
    "title": "Russian strike kills 3 Ukrainian toddlers and father, with pregnant mother injured",
    "desc": "The bodies of two brothers, aged two, their one-year-old sister and father were pulled from the wreckage of a house in north-eastern Ukraine.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4f0c/live/196a1c90-0762-11f1-b436-5dd3555fd4f7.png",
    "source": "BBC"
  },
  {
    "title": "Zimbabwe Shows True Friendship, Donates 370 Tonnes of Maize to Malawi",
    "desc": "Zimbabwe has demonstrated what officials have described as true regional solidarity after donating 370 metric tonnes of maize to Malawi to help ease the country's worsening food crisis.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "More support for workers to be announced at Budget 2026: PM Wong",
    "desc": "PM Wong announces more government support for Singaporean workers to navigate job transitions and technological changes in Budget 2026. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/61c705d290fa7f268ddedb8fdd09f6bb6da9459252487e3bd16507479ef7eaca",
    "source": "The Straits Times"
  },
  {
    "title": "Tumbler Ridge B.C. school shooting: 10 dead including shooter, 27 injured",
    "desc": "At least nine people were killed in a shooting spree Tuesday afternoon that included a school in British Columbia's Peace region, in which the suspected shooter also ended up dead.",
    "image": "https://globalnews.ca/wp-content/uploads/2026/02/06ac944abbc72ef9197378097870f42674d4cfa5aaaaba39b914cf968597e2a4.jpg?quality=65&strip=all&w=720&h=379&crop=1",
    "source": "Global News"
  },
  {
    "title": "Auckland's international convention centre finally opens",
    "desc": "Construction has been mired in delays, partly caused by a massive fire in 2019.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--EBDA3GYS--/t_tohu-badge-facebook/v1770748560/4JTDZ0G_Image_jfif?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Rurusama spends over $2,000 on acting lessons for 1st movie role: 'I think it was very worth it'",
    "desc": "Local cosplayer-actress Rurusama is giving her best efforts for her first movie role in upcoming Chinese New Year film Luck My Life.Speaking to AsiaOne on Feb 9 while promoting the film, the 26-year-old shared that she accepted the role of mahjong trainer Cat as a \"challenge\" to herself.\"I was really glad when director Eric Wong reached out, through a lot...",
    "image": "https://media.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/260210_Luckmyliferurusama.jpg?itok=p3QQG49C",
    "source": "AsiaOne"
  },
  {
    "title": "'Used & threw us like toilet paper, we didn't learn': Pakistan's Khwaja Asif's big remark on US",
    "desc": "Pakistan News: Pakistan’s defence minister Khawaja Asif has delivered a scathing assessment of his country’s past alliances with Washington, telling the National Ass.",
    "image": "https://static.toiimg.com/thumb/msid-128190220,width-1280,height-720,imgsize-837064,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Minister advocates investment budgeting to unlock $1trn economy",
    "desc": "...on how effectively public finance can be redesigned to mobilise the volume of long-term capital required to transform the economy.",
    "image": "https://tribuneonlineng.com/wp-content/uploads/2025/07/Minister-of-industry-trade-and-investment-Doris-Uzoka-Anite.png",
    "source": "Tribune Online"
  },
  {
    "title": "Toxic Assets: Britney Spears Sells Music Catalog for $200M",
    "desc": "The Princess of Pop has cashed out. In a landmark deal that cements her financial independence, Britney Spears has sold her entire music publishing rights,...",
    "image": "https://nyjbuhvfbjutcfbphchh.supabase.co/storage/v1/object/public/media/c54a66eb-818a-481f-9aff-d789a9d141a1/44625896-e0e5-4883-9806-c181ff4e7013.webp",
    "source": "streamlinefeed.co.ke"
  },
  {
    "title": "“The WONDERfools” Responds To Reports About Premiere Schedule",
    "desc": "“The WONDERfools” is set to be released in the second quarter of the year as originally planned. On February 11, a media outlet reported that although",
    "image": "https://0.soompi.io/wp-content/uploads/2026/02/10200215/the-wonderfools-e1770782552402.jpg",
    "source": "Soompi"
  }
]