[
  {
    "title": "OpenAI will reportedly release an AI-powered smart speaker in 2027",
    "desc": "OpenAI may release its first AI-powered consumer device in 2027.",
    "image": "https://s.yimg.com/os/en/engadget_703/a4962d615902ad4c9773a8e49a4df8ef",
    "source": "Yahoo News Singapore"
  },
  {
    "title": "4 vehicles destroyed in early morning fire at Kronum",
    "desc": "Four vehicles were destroyed in an early morning fire at the Kronum branch of GOIL Company Limited in the Suame Municipality of the Ashanti Region on Friday, February 20, 2026.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/236/23641735.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Ministers to consider removing Andrew Mountbatten-Windsor from line of succession",
    "desc": "Move would follow any police investigation after former prince questioned on suspicion of misconduct in public office",
    "image": "https://i.guim.co.uk/img/media/4b98be647a47a76da2b34006b49dd55f7cb76c96/590_0_6253_5000/master/6253.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f533579a295e63763a448ed8afcc51c9",
    "source": "The Guardian"
  },
  {
    "title": "Brace for heavy rains, floods from Saturday: Kenya Met warns",
    "desc": "The Kenya Meteorological Department has issued a heavy rainfall advisory warning that several regions across the country should brace for intensified downpours over the next five days, raising the risk of flooding and travel disruptions.",
    "image": "https://citizentv.obs.af-south-1.myhuaweicloud.com/148919/conversions/rains-ke-og_image.webp",
    "source": "Citizen Digital"
  },
  {
    "title": "I’ve driven the cheapest Tesla you can buy, and I think it’s the best of the lot",
    "desc": "News editor Jamie Edkins has been out driving the new Tesla Model 3 Rear-Wheel Drive, formerly known as the Model 3 Standard. Regardless of what it’s called, he reckons it's the best version to buy.",
    "image": "https://carwow-uk-wp-1.imgix.net/2026-Tesla-Model-3-Rear-Wheel-Drive-Jamie-Edkins-front.jpg?auto=format&cs=tinysrgb&fit=crop&h=800&ixlib=rb-1.1.0&q=60&w=1600",
    "source": "Carwow"
  },
  {
    "title": "Woman who harmed her baby at West Bromwich home guilty of murder",
    "desc": "Zara Arasalan, 31, is convicted of killing baby Harleen in July 2020.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/22c2/live/89f95b30-0e7c-11f1-9120-a910fc22c6ac.png",
    "source": "BBC"
  },
  {
    "title": "Winter Olympics 2026: Four men, one aim",
    "desc": "All eyes will be on Team GB's Bruce Mouat, Grant Hardie, Hammy McMillan and Bobby Lammie on Saturday (18:05 GMT) when they take on Canada with a gold medal at stake at the Winter Olympics.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/43cf/live/c1663f80-0e67-11f1-9f23-b3f349b149c7.jpg",
    "source": "BBC"
  },
  {
    "title": "Wood Mackenzie Says Big Oil’s Strategy Has Snapped Back to Upstream",
    "desc": "The majors are refocusing hard on upstream portfolio renewal for the next decade, according to WoodMac, who analyzed Q4 data.",
    "image": "https://d32r1sh890xpii.cloudfront.net/news/718x300/2026-02-20_n71lpahbrk.jpg",
    "source": "Crude Oil Prices Today | OilPrice.com"
  },
  {
    "title": "Stunning New Maps of Myelin-Making Mouse Brain Cells Advance Understanding of Nervous System Disorders",
    "desc": "Johns Hopkins scientists say they have used 3D imaging, special microscopes and artificial intelligence (AI) programs to construct new maps of mouse brains showing a precise location of more than 10 million cells called oligodendrocytes. These cells form myelin, a protective sleeve around nerve cell axons, which speeds transmission of electrical signals and support brain health.",
    "image": "https://www.newswise.com/legacy/image.php?image=/images/uploads/2026/02/20/699890166deb5_Oligodentrocytesbrain.jpg",
    "source": "Newswise"
  },
  {
    "title": "Manitoba's Joss Reimer is named Canada's new chief public health officer",
    "desc": "Health Minister Marjorie Michel has announced that the face of Manitoba's pandemic immunization efforts, Dr. Joss Reimer, will be Canada's new chief public health officer.",
    "image": "https://i.cbc.ca/ais/c240ff81-f294-4d52-b59c-4f561f87089a,1771610155364/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C3900%2C2193%29%3BResize%3D620",
    "source": "CBC"
  }
]