[
  {
    "title": "APC chieftain lauds Mbah, Otti on projects, seeks action on water in Enugu",
    "desc": "The Nation Newspaper APC chieftain lauds Mbah, Otti on projects, seeks action on water in Enugu",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2025/09/04141958/Basil-Ani.jpg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "ICPC Arraigns Works Director for Money Laundering Allegation",
    "desc": "The ICPC has arraigned a Federal Ministry of Works director, Blessing Lere-Adams, on a money laundering allegation and other corruption charges in Abuja.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2017/03/14064448/ICPC-logo.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Second round of Iran-US nuclear talks in Geneva ends after just four hours",
    "desc": "Discussions held amid US naval buildup and Iranian announcement of live-fire exercises in straits of Hormuz",
    "image": "https://i.guim.co.uk/img/media/3b99d9d3d5046505312140ab30b4fa61484a5fae/1281_233_4709_3767/master/4709.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=53988b8047fc9701f9237ce8b89c191e",
    "source": "The Guardian"
  },
  {
    "title": "GTA 6 may revive Vice City with modern map, dynamic weather, next gen graphics",
    "desc": "Rockstar Games is developing Vice City for GTA 6 because the game will feature a modern-day setting along with improved map design and weather effects and next-generation graphics. The anticipated...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-17/1392651_060026_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "What Kate Nash’s grassroots music protest reveals about touring and streaming",
    "desc": "Local music scenes are shrinking, and young performers lack opportunities to try out new material.",
    "image": "https://images.theconversation.com/files/717954/original/file-20260212-74-h46jnl.jpg?ixlib=rb-4.1.0&rect=0%2C0%2C1920%2C960&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "Rain ends Ireland's campaign in Cricket World Cup",
    "desc": "Ireland are out of the Twenty20 Cricket World Cup after their match with Zimbabwe was abandoned without a ball being bowled due to persistent rain in Pallekele.",
    "image": "https://www.rte.ie/images/0023e8e6-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Tess Jordan, Donegal Town",
    "desc": "Tess Jordan (Nee Mc Ginty), Donegal Town formally Glenfin, Co Donegal, peacefully at home.Sadly missed by Aidan, her son Gary(Saphire), daughter Tania(Enda) gra...",
    "image": "https://img.resized.co/oceanfm-ie/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltZy5vY2VhbmZtLmllXFxcL3Byb2RcXFwvdXBsb2Fkc1xcXC9UZXNzMS5qcGVnXCIsXCJ3aWR0aFwiOjEyMDAsXCJoZWlnaHRcIjo2MjcsXCJkZWZhdWx0XCI6XCJodHRwczpcXFwvXFxcL3N0Zy13d3cub2NlYW5mbS5pZVxcXC9pbWFnZXNcXFwvbm8taW1hZ2UucG5nP3Y9NVwiLFwib3B0aW9uc1wiOltdfSIsImhhc2giOiJiYzBmMzc0YTA2OGQxMzlkMTQzNGExOWQ2NGVmZTY0MTQ0OTdmMDVjIn0=/tess-jordan-donegal-town.jpeg",
    "source": "Ocean FM"
  },
  {
    "title": "Killers smile and laugh as they're cleared of murdering elderly couple in house fire",
    "desc": "But Kevin Weetman and Kylie Maynard were convicted of the manslaughter of Eric Greener and Sheila Jackson, a charge which Lee Owens admitted",
    "image": "https://i2-prod.liverpoolecho.co.uk/article32141647.ece/ALTERNATES/s1200/1_Blank-2-Grids-Collage.png",
    "source": "Liverpool Echo"
  },
  {
    "title": "How Mars' Toxic Soil Actually Makes Stronger Bricks",
    "desc": "Using local resources will be key to any mission to either the Moon or Mars - in large part because of how expensive it is to bring those resources up from Earth to our newest outposts. But Mars in particular has one local resource that has long been thought of as a negative - perchlorates. These chemicals, which are toxic to almost all life, make up between 0.5-1% of Martian soil, and have long been thought to be a hindrance rather than a help to our colonization efforts for the new planet. But a new paper from researchers at the Indian Institute of Science and the University of Florida shows that, when making the bricks that will build the outpost, perchlorates actually help.",
    "image": "https://www.universetoday.com/article_images/Low-Res_2_S_pasteurii_Aloke_lab_20260217_125808.jpg",
    "source": "Universe Today"
  },
  {
    "title": "Obama Took On Recession, Health Care and Iraq. What He Didn’t See Coming Was Trump.",
    "desc": "A new set of oral history interviews documents how Barack Obama and his advisers missed the shifting mood of the country that would ultimately replace him with a successor they considered a “con man,” “clown” and “laughingstock.”",
    "image": "https://static01.nyt.com/images/2026/02/17/multimedia/17dc-obama-top-lzjv/17dc-obama-top-lzjv-facebookJumbo.jpg",
    "source": "The New York Times"
  }
]