[
  {
    "title": "wife gives up custody of children temporarily",
    "desc": "The Nation Newspaper Harrysong’s ex-wife gives up custody of children temporarily",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/01/30094833/IMG_6517.jpeg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "Transforming Education in Kenya",
    "desc": "The Samsung Galaxy Tab A11 series introduces intelligent features that act as a personal tutor for every student.",
    "image": "https://techtrendske.co.ke/wp-content/uploads/2026/01/Samsung-Galaxy-Tab-11-Series.jpg",
    "source": "TechTrendsKE"
  },
  {
    "title": "SpaceX launches Starlink satellites from two coasts in two days",
    "desc": "A SpaceX Falcon 9 rocket carrying 25 Starlink satellites lifted off from California on Jan. 29, 2026. The company repeated the feat the next day with 29 satellites from Florida.",
    "image": "https://cdn.mos.cms.futurecdn.net/vhiV8mN7moM8b4U6Keas28-1920-80.jpg",
    "source": "Space"
  },
  {
    "title": "US life expectancy hit an all-time high last year at 79 years",
    "desc": "In comparison, life expectancy at birth in the EU is 81.7 years.",
    "image": "https://images.euronews.com/articles/stories/09/63/25/05/1200x675_cmsv2_3841ea68-e725-5965-85b6-49231ed8f678-9632505.jpg",
    "source": "Euronews.com"
  },
  {
    "title": "Influencer in M'sia fined S$12.8K for posting video showing chicken bones given to homeless man",
    "desc": "A 23-year-old social media influencer, Tang Sie Luk, was fined RM40,000 (S$12,800) on Thursday (29 Jan) after pleading guilty to posting an offensive video on Instagram that showed three teenage boys giving rice mixed with chicken bones to a homeless man on the sidewalk.",
    "image": "https://mustsharenews.com/wp-content/uploads/2026/01/Malaysian-influencer-fined-RM40000-for-offensive-video-involving-homeless-man.png",
    "source": "mustsharenews.com"
  },
  {
    "title": "CAF Champions League group starting to take shape ahead of first return legs",
    "desc": "Almost all of the groups are delicately poised at the halfway point of the CAF Champions League group stage, with the return legs set to commence this weekend.",
    "image": "http://localhost:8080/media/t0lfcduc/caf-champions-league_previews_16_9.png",
    "source": "Super Sport"
  },
  {
    "title": "Ruben Dias 'Calls Police' After Burglary at His and Maya Jama’s £4m Home",
    "desc": "Ruben Dias Forced to Call Police After Shocking Incident at His and Maya Jama's £4m Home",
    "image": "https://static0.givemesportimages.com/wordpress/wp-content/uploads/2026/01/mixcollage-30-jan-2026-08-28-am-9743.jpg?w=1200&h=675&fit=crop",
    "source": "GiveMeSport"
  },
  {
    "title": "Frida Amani pushes for greater youth action on the environment",
    "desc": "Tanzanian music artiste Frida Amani is expanding her influence beyond entertainment after a strategic meeting with the Permanent Secretary in the Office of the Vice President (Union and...",
    "image": "https://www.thecitizen.co.tz/resource/image/5342964/landscape_ratio3x2/1200/800/28c71d84383702f15fc35c7360c20af7/Vi/frida-pic-1.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "P5.4-M pilfered gas recovered in Quezon",
    "desc": "CANDELARIA, Quezon – Twelve individuals were arrested and large quantities of stolen gasoline were seized during the implementation of a search warrant in a...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/30/75503.webp",
    "source": "mb.com.ph"
  },
  {
    "title": "Nivin Pauly’s Sarvam Maya OTT Movie Review and Rating",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/01/Sarvam-Maya-4.webp",
    "source": "123telugu.com"
  }
]