[
  {
    "title": "Knicks rally to down Rockets as Pistons, Spurs roll on",
    "desc": "New York's Jalen Brunson scored 18 of his 20 points in the second half and the Knicks erased an 18-point fourth-quarter deficit to beat the Houston Rockets 108-106 at Madison Square Garden on Saturday.",
    "image": "https://s.france24.com/media/display/ed3df30a-0fb1-11f1-9e9b-005056a90284/w:1280/p:16x9/Part-GTY-2262892490-1-1-0.jpg",
    "source": "France 24"
  },
  {
    "title": "Inside the Ageing Cell: How a tiny worm revealed a process that may drive ageing in animals?",
    "desc": "Ageing may not simply be the result of damage piling up over time. Scientists studying microscopic worms have discovered a striking structural change inside cells that could play a central role in how animals grow old.",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260222054440_Ageing-in-animals.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "Salceda praises PBBM's handling of flood control projects mess, says credit upgrade imminent",
    "desc": "Former three-term Albay 2nd district Rep. Joey Salceda expects the Philippines to score another credit upgrade, thanks to President Marcos' timely response to...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/22/81047.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Intel Panther Lake vs Apple M5: Which Laptop Reigns Supreme?",
    "desc": "Compare the Intel Panther Lake-powered Asus ExpertBook Ultra and Apple M5 MacBook Pro to find the perfect laptop for your needs.",
    "image": "https://www.geeky-gadgets.com/wp-content/uploads/2026/02/asus-expertbook-ultra-vs-macbook-pro-comparison_optimized.jpg",
    "source": "Geeky Gadgets"
  },
  {
    "title": "Mentioning 'bitcoin' on AI agent OpenClaw's Discord will get you banned",
    "desc": "The project's creator nearly deleted the viral AI agent after crypto scammers hijacked his accounts, launched a fake token that hit $16 million, and harassed him for weeks.",
    "image": "https://cdn.sanity.io/images/s3y3vcno/production/ce6e5878a3bba05bcb92f58c5d32dad187180ea3-1920x1080.jpg?auto=format&w=960&h=540&crop=focalpoint&fit=clip&q=75&fm=jpg",
    "source": "CoinDesk"
  },
  {
    "title": "Daily Post Nigeria",
    "desc": "Atletico Madrid forward, Ademola Lookman, on Saturday, set a record following his side's LaLiga 4-2 win against Espanyol. Recall that a brace from",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/Ademola-Lookman-Scores-On-Atletico-Debut-With-Stunning-Goal-Against-Betis.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Man slashes another over parking space dispute in Cheras",
    "desc": "PETALING JAYA: A dispute over a parking space turned violent when a man allegedly slashed another with a knife at the Seri Melaka Flats in Cheras, leaving the victim with a three-centimetre wound on his left hand.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/22/3780713.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "Annie Awards 2026 Winners List Honoring Animated Films, TV Shows & Video Games",
    "desc": "The 2026 Annie Awards for animations were handed out February 21, and here are the winners.",
    "image": "https://deadline.com/wp-content/uploads/2026/02/Annie-Awards-KPop-Demon-Hunters.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "PCG: One more cadaver found inside wreck of MV Trisha Kerstin 3; death toll reaches 65",
    "desc": "A body was retrieved inside the air-conditioned accommodation area of the sunken ferry MV Trisha Kerstin 3 off Baluk-Baluk Island in Basilan on Sunday, Feb. 22,...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/22/81046.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Man allegedly claiming to be prophet detained in Rawang",
    "desc": "The Selangor Islamic religious department says the man allegedly taught his followers there was no need to perform prayers or fast if they were tired or of old age.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2024/08/df0877e4-handcuff-new-02-fmt-140824.webp",
    "source": "Free Malaysia Today"
  }
]