[
  {
    "title": "'Dawson's Creek' actor James Van Der Beek has died at 48",
    "desc": "Actor James Van Der Beek has died, his wife has confirmed. He was 48.",
    "image": "https://toronto.citynews.ca/wp-content/blogs.dir/sites/10/2026/02/11/CP173546199-1-scaled.jpg",
    "source": "CityNews Toronto"
  },
  {
    "title": "Pistons vs Raptors Prediction, Picks & Odds for Tonight’s NBA Game",
    "desc": "My Pistons vs. Raptors predictions have a moneyline NBA pick for this Eastern Conference clash set to tipoff on Wednesday, February 11.",
    "image": "https://img.covers.com/cms/covers/db034f95-c47c-4b6d-b4ba-ac66174c7700.png",
    "source": "Covers.com"
  },
  {
    "title": "We're raising our price targets on 3 picks and shovel data center buildout stocks",
    "desc": "Every weekday, the Investing Club releases the Homestretch; an actionable afternoon update just in time for the last hour of trading.",
    "image": "https://image.cnbcfm.com/api/v1/image/108200919-17582231922025-09-18t191343z_26856245_rc2fugahes80_rtrmadp_0_usa-ai-microsoft-data.jpeg?v=1758223270&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Winter Olympics 2026: Italy’s Emanuel Rieder and Simon Kainzwaldner claim men’s doubles luge gold after superb second run",
    "desc": "An outstanding second run lifted Rieder and Kainzwaldner from silver into gold as the USA leaders Marcus Mueller and Ansel Haugsjaa faltered on their second run.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/bu9zincj2almggz2kg7m",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "China showcases new Moon ship and reusable rocket in one extraordinary test",
    "desc": "The test marks a significant step in China's push to land humans on the Moon by 2030.",
    "image": "https://cdn.arstechnica.net/wp-content/uploads/2026/02/GettyImages-2261003763-1152x648-1770837268.jpg",
    "source": "Ars Technica"
  },
  {
    "title": "Innovative broadcast coverage bringing fans closer to action than ever before at Milano Cortina 2026",
    "desc": "From drone cameras and AI-powered replays to cinematic production techniques and virtualised workflows, Olympic Broadcasting Services (OBS) is delivering its most innovative and immersive coverage yet at the Milano Cortina 2026 Olympic Winter Games, bringing viewers closer to the action than ever before.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/qdrvwnjepwgstlrkhfet",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Lorde Ultrasound Tour review: Emotional, proud homecoming at Spark Arena",
    "desc": "How do you describe a night with Ella Marija Lani Yelich-O’Connor at her long-anticipated hometown return? Ethereal, raw, quirky, emotional, bizarre? All of...",
    "image": "https://www.nzherald.co.nz/resizer/v2/DRZO6TQ6EBBUZDPASYDVPP6TKI.jpg?auth=1ab788ba037c17ad45291b4fc19630d8987904a32d75975b71a279b6494240cd&width=1200&height=675&quality=70&focal=992%2C183&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Former NEIP CEO Kofi Nkansah to appear in court on February 12",
    "desc": "A former Chief Executive Officer of the National Entrepreneurship and Innovation Programme (NEIP), Kofi Ofosu Nkansah, is expected to appear before court on Thursday, February 12, 2026, after being formally charged by the National Intelligence Bureau...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/709/70966730.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Thirty people stranded by floods in outback NT angry at police",
    "desc": "A day trip to the Tjoritja/West MacDonnell National Park became a 24-hour ordeal for almost 30 people when the Hugh River unexpectedly cut off Namatjira Drive, 50 kilometres from Alice Springs.",
    "image": "https://live-production.wcms.abc-cdn.net.au/7193f8d6280dc53e7b729a2de076e224?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Angus Taylor sets the stage for first Liberal leadership challenge since 2018",
    "desc": "Plus: Strong US jobs growth pushes back Fed rate cut expectations; Surprise jolts US markets as Congress eyes tariff vote; Anthropic takes low-key approach to Aussie market entry.",
    "image": "https://static.capitalbrief.com/assets/c11b8c8d-eec3-47ad-8559-67278a073809/1770839114/?key=img-social",
    "source": "Capital Brief"
  }
]