[
  {
    "title": "Russian fake news network targets Ukraine at Winter Olympics",
    "desc": "Latest updates from the BBC's specialists in fact-checking, verifying video and tackling disinformation.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0a16/live/a3d671f0-0cb5-11f1-b7e1-afb6d0884c18.png",
    "source": "BBC"
  },
  {
    "title": "CNN viewers furious as host points out Donald Trump 'double standard'",
    "desc": "NewsNight panelists were asked to apply the same standard when discussing Donald Trump's gaffes and Alexandria Ocasio-Cortez's performance at the Munich Security Conference",
    "image": "https://i2-prod.themirror.com/article1690036.ece/ALTERNATES/s1200/0_Trump-26048649177952.jpg",
    "source": "The Mirror US"
  },
  {
    "title": "John Swinney was told of Peter Murrell charges weeks before they became public",
    "desc": "Former SNP chief executive Murrell is accused of embezzling £459,000 from the party over a 12-year period.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/889d/live/a6e7de10-d59d-11ef-87df-d575b9a434a4.jpg",
    "source": "BBC"
  },
  {
    "title": "Ghana reaffirms commitment to unified African climate position",
    "desc": "By Albert Oppong Ansah  Addis Ababa, Feb. 17, GNA – Ghana has reaffirmed its commitment, as Chair of the Africa Group of Negotiators (AGN), to promote a unified…",
    "image": "https://gna.org.gh/web/wp-content/uploads/2026/02/Science-Ghana-Commitment--1024x698.png",
    "source": "Ghana News Agency"
  },
  {
    "title": "How Tipperary residents can tackle climate change through everyday shopping",
    "desc": "Some basic changes could make a big difference to the planet.",
    "image": "https://www.tipperarylive.ie/resizer/1200/700/true/2024_01_26/50fcd30f-c11b-4ec5-88ad-0da27cdfa76d-1706272131340.jpg--how_tipperary_residents_can_tackle_climate_change_through_everyday_shopping.jpg?1706272132145",
    "source": "Tipperary Live"
  },
  {
    "title": "Tiny Bubbles, Big Breakthrough: Cracking Cancer's fortress",
    "desc": "CLEVELAND—Researchers at Case Western Reserve University have discovered a way to breach one of cancer's most stubborn defenses: the impenetrable",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=cdn.pixabay.com%2Fphoto%2F2019%2F07%2F17%2F19%2F17%2Fhands-4344711_960_720.jpg",
    "source": "Mirage News"
  },
  {
    "title": "American companies bring jobs, says US ambassador Giordano",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% United States (US) ambassador to Namibia John Giordano says American companies will create jobs for Namibians and contribute to economic growth.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-18-at-12.24.01-PM1-1024x683.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "Zimbabwe: Medicines Authority Warns Against Fake 'Approvals' After Product Seizure",
    "desc": "Medicines regulator, the Medicines Control Authority of Zimbabwe (MCAZ) has issued a public warning over the use of its name and logo by companies falsely claiming official approval for their products.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "European report: Antimicrobial resistance remains widespread in foodborne bacteria",
    "desc": "Antimicrobial resistance (AMR) in common foodborne bacteria such as Salmonella and Campylobacter continues to be a public health concern across Europe, according to a new joint report from the European Food Safety Authority (EFSA) and the European Centre for Disease Prevention and Control (ECDC).",
    "image": "https://www.news-medical.net/image-handler/picture/2016/3/bacteria_-_Sebastian_Kaulitzki_46826fb7971649bfaca04a9b4cef3309-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Kenyan Graduate Masters Actuarial Science, Builds Career Before Graduating with First",
    "desc": "Maxwell Leleur, a 2025 First-Class graduate from Kabarak University in Actuarial Science, shares his journey mastering concepts for career success.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/baecdadcdc27a084.jpeg?v=1",
    "source": "Tuko News"
  }
]