[
  {
    "title": "Cabinet approves 10-year PM term limit",
    "desc": "Law and institutional reform minister Azalina Othman Said says the tenure is in line with mature democratic practices internationally.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/12/2158d9a7-cabinet-meeting-fb-171225.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Tragedies befall Masvingo: Double murder, missing boy found dead and Tugwi",
    "desc": "THE Zimbabwe Republic Police (ZRP) has announced a series of tragic incidents in Masvingo, including the arrest of a 29-year-old man for allegedly killing two minors in Zaka, the death of a four-year-old learner in Chiredzi, and a drowning incident at Tugwi-Mukosi Dam. Police spokesperson Commissioner Paul Nyathi confirmed the arrest of Obedience Makonye (29), […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2022/08/30024446/Paul-Nyathi-1.jpeg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "Adani agrees to receive legal notice in U.S. SEC civil fraud case, to respond in 90 days",
    "desc": "Gautam and Sagar Adani agree to accept legal notice from the U.S. SEC in a civil fraud case, responding in 90 days.",
    "image": "https://th-i.thgim.com/public/incoming/ee02t4/article68891524.ece/alternates/LANDSCAPE_1200/Adani_Bribery_Indictment_86639.jpg",
    "source": "The Hindu"
  },
  {
    "title": "Two Palestinians injured in colonizer attack on Ma’azi Jaba’",
    "desc": "Two Palestinian citizens were injured on Friday evening as they tried to fend off an attack by illegal paramilitary Israeli colonizers on the Ma’azi Jaba’ c ...",
    "image": "https://imemc.org/wp-content/uploads/2026/01/burn-e1769831200213.jpg",
    "source": "- IMEMC News"
  },
  {
    "title": "Some 'impassable' roads closed in Wexford over flooding",
    "desc": "Wexford County Council said multiple roads were closed across the county due to flooding following bad weather conditions.",
    "image": "https://www.rte.ie/images/0023d3e5-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "What’s being said nationally after Michigan basketball beats MSU in top-10 matchup",
    "desc": "The Wolverines downed the Spartans 83-71 Friday for their first win at Breslin Center since 2018.",
    "image": "https://www.mlive.com/resizer/v2/B2GMQM7QYJGY3GH3ME2DYDP3OM.JPG?auth=7f3e19ebe21a1ac56a0e17b80c5fc6ecc14f14f97289f7c12b880542b33f4e27&width=1280&smart=true&quality=90",
    "source": "MLive.com"
  },
  {
    "title": "Retired Air Force officer shot by unidentified assailants at restaurant in Lucknow shopping complex",
    "desc": "LUCKNOW: A retired Indian Air Force officer was critically injured after being shot by unidentified assailants at his restaurant in the Sushant Golf C.",
    "image": "https://static.toiimg.com/thumb/msid-127813940,width-1280,height-720,imgsize-45990,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Radio station One Fm 91.3 criticised for jumping on PLB scandal bandwagon with parody skit",
    "desc": "ONE FM 91.3 recreated the viral PLB cheating exposé in a parody video, but netizens criticised the radio station for being unprofessional.",
    "image": "https://mustsharenews.com/wp-content/uploads/2026/01/290126-one-fm-913-plb-parody.jpg",
    "source": "mustsharenews.com"
  },
  {
    "title": "Kenya’s refugee camp food prices steady, vendors struggle with debt and restocking - report",
    "desc": "According to the report, almost all vendors, 99 per cent in Kakuma and 98 per cent in Dadaab, reported difficulties, primarily linked to high customer debt, red...",
    "image": "https://publish.eastleighvoice.co.ke/mugera_lock/uploads/2025/06/Kakuma.jpeg",
    "source": "The Eastleigh Voice"
  },
  {
    "title": "Judge bars prosecutors from seeking death penalty for Luigi Mangione",
    "desc": "The move foils the Trump administration’s bid to see him executed for what it called a “premeditated, cold-blooded assassination that shocked America”.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/luigi-mangione-appears-in-manhattan-criminal-court-for-an-ev-UQLI3KGJJVB7BJ3WENUVMMRR5I.jpg?auth=6856e1fc5853b518f478ebffc208f9896d50fa12c2791410c573406f20c25560&quality=70&width=600&height=315&focal=1232%2C906",
    "source": "1News"
  }
]