[
  {
    "title": "Activists Protest At French Embassy In Abuja, Demand End To 'Prolonged Imperialist War' In Ukraine",
    "desc": "Activists under the banner of the ‘Comrades’ Anti-Imperialist Campaign’ on Friday stormed the French Embassy in Nigeria’s capital, demanding an immediate end to France's military support that was fuelling the Ukrainian war.",
    "image": "https://saharareporters.com/themes/custom/octavia_sahara/favicon.ico",
    "source": "Sahara Reporters"
  },
  {
    "title": "UN rights chief optimistic on TZ’s handling of challenges",
    "desc": "GENEVA: THE United Nations High Commissioner for Human Rights, Mr Volker Türk, has expressed confidence in Tanzania’s ability to address recent challenges constructively, praising the government’s commitment to dialogue, reconciliation and respect for the rule of law. Türk’s statement came after the Tanzanian delegation, led by Minister for Foreign Affairs and East African Cooperation, Ambassador",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/Rais-wa-Jamhuri-ya-Muungano-wa-Tanzania-Dkt.-Samia-Suluhu-Hassan-amewasilisha-ujumbe-maalum-kw.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Winter Olympics 2026: Highlights and daily results",
    "desc": "Here are the highlights and results from the Olympic Winter Games Milano Cortina 2026 on Saturday (7 February).",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/anfs4vcfv9lx1zt2ehgu",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Travelers Stranded in Indonesia as Garuda Indonesia, Lion, AirAsia, Batik Air, and More Airlines Cancel 12 Flights and Delay 513 in Jakarta and Sultan Hasanuddin Airports",
    "desc": "Jakarta and Sultan Hasanuddin airports experience unprecedented delays and cancellations, affecting travelers worldwide. Here’s what you need to know.",
    "image": "https://www.travelandtourworld.com/wp-content/uploads/2026/02/a-bustling-airport-terminal-scene-captur_mi3ED6pLTee0wvwRQfu38w_3BGRT3WZQBOJJ9EvQl57pQ_hd.jpg",
    "source": "Travel And Tour World"
  },
  {
    "title": "68 Ole Miss (Feb 7, 2026) Game Recap",
    "desc": "Expert recap and game analysis of the Texas Longhorns vs. Ole Miss Rebels NCAAM game from February 7, 2026 on ESPN.",
    "image": "http://s.espncdn.com/stitcher/sports/basketball/mens-college-basketball/events/401808226.png?templateId=espn.com.share.1",
    "source": "ESPN"
  },
  {
    "title": "The Real Madrid Manager Criticizes the Lack of Resolution in the Negreira Case",
    "desc": "The former player and Real Madrid interim manager described the Negreira Case as 'the most serious scandal in Spanish football,' criticizing the lack of resolution while defending the team's planning.",
    "image": "https://prod-media.beinsports.com/image/1770500615556_6b1e9646-a690-4c69-8bfb-403fae4c5d97.1080.png",
    "source": "beIN SPORTS"
  },
  {
    "title": "Software Bear Market: 3 Stocks With 47% to 63% Upside, According to Wall Street",
    "desc": "Many Wall Street analysts still believe software businesses and investment theses are intact.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F854408%2Fbear-market-1-getty.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Madison Chock and Evan Bates reign supreme in Olympic team event",
    "desc": "Madison Chock and Evan Bates took first place in the Olympic team event final ice dance segment – the free dance. They earned the maximum 10 points for Team USA.",
    "image": "https://images.nbcolympics.com/sites/default/files/2026-02/Thumb_Chock_Bates_team_FD.jpg",
    "source": "NBC Olympics"
  },
  {
    "title": "Former French minister Lang resigns from Arab World Institute after Epstein correspondence revealed",
    "desc": "Jack Lang, a former French culture minister, has resigned as president of the Arab World Institute, the French Foreign Affairs Ministry said on Saturday, after revelations of his past contacts with Jeffrey Epstein and the launch of a financial investigation.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/c-2025-09-30t134141z-1092914819-rc2d2haf4s2p-rtrmadp-3-people-claudia-cardinale.jpg?c=16x9&q=w_800,c_fill",
    "source": "cnn.com"
  },
  {
    "title": "Nuclear sees tipping point as Meta makes deals with Bill Gates’ TerraPower, Sam Altman-backed Oklo",
    "desc": "Meta, Google, Amazon, and more all hope to lean on a nuclear construction boom to power AI.",
    "image": "https://fortune.com/img-assets/wp-content/uploads/2026/02/GettyImages-2215966935-e1770338435600.jpg?resize=1200,600",
    "source": "Fortune"
  }
]