[
  {
    "title": "Wada impressed with Kenya's progress in fight against doping",
    "desc": "Wada Africa Director Swigelaar held a meeting with Sports CS Mvurya in Nairobi on Wednesday.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/O9eXQRo2V2QDHtJzpXPPW8VjNwmx0DE6XwPBHSZf.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "Watch Rocket Lab launch Korean disaster-monitoring satellite tonight after long delay",
    "desc": "Rocket Lab will try again tonight (Jan. 29) to launch a South Korean disaster-monitoring satellite, and you can watch the action live.",
    "image": "https://cdn.mos.cms.futurecdn.net/CHUTaU9iNEdusJCMDKuW8a-2560-80.jpg",
    "source": "Space"
  },
  {
    "title": "Brendan Banfield testifies he saw his wife stabbed before shooting attacker",
    "desc": "A Virginia man on trial for allegedly killing his wife and another man told a jury how he found his wife being attacked in their bedroom and shot the man who was stabbing her.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap26014600913153.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Campaign Monitor Introduces Next Evolution of In-App AI Guidance to Support Email Marketing Workflows",
    "desc": "The company will host a live webinar offering a first look at its always-on AI guidance, designed to support email marketers directly within the platform.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/01/30/918329.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "Calgary dentist guilty of decade-long insurance fraud handed 3-year sentence",
    "desc": "Despite an eleventh hour attempt to secure at least a few more weeks of freedom, Calgary dentist Alena Smadych was handed a three-year prison sentence for a decade-long insurance billing fraud.",
    "image": "https://i.cbc.ca/ais/1.7551272,1764972925779/full/max/0/default.jpg?im=Crop%2Crect%3D%2822%2C70%2C368%2C207%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "UNILAG, University of Birmingham sign MoU to run degree programme in Nigeria",
    "desc": "UNILAG and the University of Birmingham in UK have signed a memorandum of understanding to run a degree programme in Nigeria.",
    "image": "https://www.thecable.ng/wp-content/uploads/2018/05/UNILAG-GATE4.jpg",
    "source": "TheCable"
  },
  {
    "title": "Inpex under investigation after suspected sulphur dioxide exposure leaves worker in hospital",
    "desc": "The Australian Workers' Union has raised concerns after a worker at Inpex's Ichthys gas facility was allegedly exposed to sulphur dioxide and hospitalised, prompting an investigation by the NT workplace safety watchdog.",
    "image": "https://live-production.wcms.abc-cdn.net.au/aeef6d7bad6ff80bc5632ab4d5d635fc?impolicy=wcms_watermark_news&cropH=2592&cropW=4608&xPos=0&yPos=337&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Unable to Stop AI, SAG-AFTRA Mulls a Studio Tax on Digital Performers",
    "desc": "SAG-AFTRA is considering whether to seek a contribution to a union fund every time a studio uses a synthetic performer in a film or TV show.",
    "image": "https://variety.com/wp-content/uploads/2025/09/tilly2.png?crop=0px%2C96px%2C2522px%2C1420px&resize=1000%2C563",
    "source": "Variety"
  },
  {
    "title": "Iran threatens instant and decisive blow after US attack",
    "desc": "Tehran says US bases, aircraft carriers are within its missiles range.Says US bases can become 'legitimate targets' if US attacks.Military spox warns Iran's response to US action will not be limited.",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-01-30/l_647982_022056_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Mandy Patinkin Cast as Odin in Amazon's 'God of War' Series Adaptation",
    "desc": "The 'Homeland' star signs onto Prime Video's adaptation of the popular PlayStation game.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2021/03/GettyImages-1035132870-H-2021-1614967165.jpg?w=1296&h=730&crop=1",
    "source": "hollywoodreporter.com"
  }
]