[
  {
    "title": "Awoo Dede Lawson set for April 25 ring return at SEM Promotions’ Night of Reset",
    "desc": "Musah Rahman “Awoo Dede” Lawson, one of Ghana’s most disciplined and resilient boxers, is set to return to the ring on April 25 at the Bukom Boxing Arena as part of SEM Promotions’ Night of Reset.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/686/68604070.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Mt Eden prison death: Name suppression lapses for Auckland manslaughter defendant Peresia Tapui",
    "desc": "A Mt Eden Corrections Facility inmate charged with manslaughter after the death of an elderly cellmate is Peresia Tapui. The 28-year-old was charged last...",
    "image": "https://www.nzherald.co.nz/resizer/v2/XIDAYDHT75EMTHNUNKZWQBE4YQ.JPG?auth=dbd7c5b9d9e140c10eed7533cdf0f85381c0c9f547c04d125c321cd7bc0ea346&width=1200&height=675&quality=70&focal=985%2C402&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Global brand in an EFL world",
    "desc": "After a new £48m investment in Wrexham, what comes next for the club that is majority-owned by Ryan Reynolds and Rob McElhenney?",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/d612/live/2893df30-fbb4-11f0-ab9d-51dbb3242e9b.jpg",
    "source": "BBC"
  },
  {
    "title": "Kate Middleton Debuts an Unexpected DIY Hairstyle on a Royal Outing",
    "desc": "The Princess of Wales sported multiple hair and outfit styles on a busy January outing in the north of England, even wearing a DIY braid.",
    "image": "https://assets.vogue.com/photos/6979290ea7b318f7f3438752/16:9/w_1280,c_limit/GettyImages-2257946384.jpg",
    "source": "Vogue"
  },
  {
    "title": "Dove Cameron Recalls The Moment She Said 'Yes' To Fiancé Damiano David",
    "desc": "Former Disney star Dove Cameron shares the \"intimate: moment her fiancé, Damiano David, popped the question.",
    "image": "https://s.yimg.com/ny/api/res/1.2/wRNddWD89lbpRKsutgoSpQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD01NTQ7Y2Y9d2VicA--/https://media.zenfs.com/en/theblast_73/e0cdcaabb2ba6ef39f27e7604c4ecd64",
    "source": "Yahoo"
  },
  {
    "title": "Dark Energy Survey results: Standard model of cosmology holds up in 6-year study of the universe, with one big caveat",
    "desc": "The six-year Dark Energy Survey has released its full results, showing that two leading models of cosmology are equally valid — but both fail to explain one key observation.",
    "image": "https://cdn.mos.cms.futurecdn.net/he4LUv6a9brqErfbUKF5D-1920-80.jpg",
    "source": "Live Science"
  },
  {
    "title": "Rare Predator Thought to Be Extinct Spotted on Camera in California’s Remote Forests",
    "desc": "Once believed to be lost forever, a rare predator has been spotted in California’s remote forests.",
    "image": "https://indiandefencereview.com/wp-content/uploads/2026/01/rare-predator-thought-to-be-extinct-spotted-on-camera-in-californias-remote-forests-scaled.png",
    "source": "Indian Defence Review"
  },
  {
    "title": "Jay Duplass Family Dramedy",
    "desc": "A review of See You When I See You, Jay Duplass' film centering on family tragedy and a young man suffering PTSD because of it",
    "image": "https://deadline.com/wp-content/uploads/2026/01/See_You_When_I_See_You-Still_1.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Content Days Notes: First Rosenqvist Child Due During Indy 500",
    "desc": "News, notes and quotes from the first NTT INDYCAR SERIES Content Day in Indianapolis, including Felix Rosenqvist (photo) of Meyer Shank Racing talking about impending fatherhood.",
    "image": "https://www.indycar.com/-/media/IndyCar/News/Standard/2026/01/01-27-FRO-Content-Days.jpg?vs=1&d=20260127T210556Z",
    "source": "INDYCAR.com"
  },
  {
    "title": "Don’t let ‘sleepmaxxing’ keep you up at night: Results from the 2025 American Academy of Sleep Medicine survey on sleep tracking",
    "desc": "More Americans are tracking and changing their sleep habits, but the growing cultural focus on sleep data is also increasing anxiety, with orthosomnia leaving many people awake at night.",
    "image": "https://cdn.sanity.io/images/0vv8moc6/mhe/292bc5b31d9585bc77a7c0ca8976e7e4f41fe7b4-1200x675.jpg",
    "source": "Managed Healthcare Executive"
  }
]