[
  {
    "title": "year deal for 21MW solar plant project",
    "desc": "Release has secured a seven-year lease agreement with Tshukudu Metals Botswana, a subsidiary of Sandfire Resources, for the construction of a 21 MW solar power facility at the Motheo Copper Operations near Ghanzi. The partnership signals continued momentum for renewable energy integration within Africa’s mining sector.",
    "image": "https://pumps-africa.com/wp-content/uploads/2026/02/Capture-13.jpg",
    "source": "Pumps Africa Magazine"
  },
  {
    "title": "“I’m not the same, God has rebuilt me’ - Tonto Dikeh",
    "desc": "\"My assignment is to clean God’s house, and He will clean my life from within.\"",
    "image": "https://media.premiumtimesng.com/wp-content/files/2026/02/Tonto-Dikeh-.jpeg",
    "source": "Premium Times Nigeria"
  },
  {
    "title": "Three taken to hospital after fire breaks out at Singapore's Hougang HDB void deck",
    "desc": "SINGAPORE: Three people were taken to hospital after a fire broke out at the void deck of a Hougang HDB block on the eve of Chinese New Year.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/17/3774354.jpg",
    "source": "The Star"
  },
  {
    "title": "Government Commits to Finishing 122km Mamboleo-Kipsitet Corridor",
    "desc": "Reconstruction of 63km of main carriageway, improvement of feeder roads",
    "image": "https://utfs.io/f/v9D9ylrdiyZgpJaYsVXPyCTtNEgdIuYL79UkZbR0H23VF8oG",
    "source": "Dawan Africa"
  },
  {
    "title": "Research Roundup: catfish prevent disease spread, earthquake maps and student with math learning disabilities",
    "desc": "Learn about Stanford scientists’ findings from the past few weeks in this week’s Research Roundup.",
    "image": "https://stanforddaily.com/wp-content/uploads/2024/03/Research-Roundup.png",
    "source": "The Stanford Daily"
  },
  {
    "title": "Larry Murphy linked to search over disappearances of Deirdre Jacob and Jo Jo Dullard",
    "desc": "Gardaí receive information of alleged burial at now disused quarry near Wicklow-Kildare border close to Murphy’s former home",
    "image": "https://www.irishtimes.com/resizer/v2/J22UANCTSFCRHBDAJBXCOG3XRE.jpg?smart=true&auth=16688524ffe93393636cd7fa1785ab32940ee9a55de792c1283ee9ed94fc9034&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Minority Whips are the backbone of my leadership – Afenyo",
    "desc": "The Minority Leader in Parliament, Alexander Afenyo-Markin, has praised the Minority Whips, describing them as the backbone of his leadership and critical to the effective functioning of the caucus in opposition.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Afenyo-Markin-3.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Australian production company Matchbox Pictures to be closed by Universal International Studios",
    "desc": "Matchbox Pictures, the local production house behind Dog Park, The Survivors and Secret City, will be closed by its international parent company, Universal International Studios.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ed758e29aa52d63c87df524e743c134b?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=521&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Late Frafra queen mother’s grave exhumed in Asante Mampong, head chopped off - Report",
    "desc": "Residents of Asante Mampong in the Ashanti Region are reeling in shock following the reported desecration of graves at the town’s public cemetery, including that of the late queen mother of the local Frafra community, according myjoyonline.com...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/407/40782977.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "New powerful battery storage facilities to be built in Valga and Pärnu counties",
    "desc": "Evecon has begun construction of a major battery storage facility in Kirikmäe, Pärnu County, investing €85 million in the project. At the same time, Diotech and Transcom will start building a battery storage facility in Tsirguliina, Valga County, backed by a €35 million investment.",
    "image": "https://s.err.ee/photo/crop/2026/02/16/3210449hea51t24.jpg",
    "source": "news | ERR"
  }
]