[
  {
    "title": "PHC declares placing names on ECL without notice illegal",
    "desc": "The Peshawar High Court (PHC) has ruled that placing any citizen’s name on the Exit Control List (ECL) or any other travel ban list without prior notice or a",
    "image": "https://www.nation.com.pk/digital_images/large/2026-02-26/phc-declares-placing-names-ecl-without-notice-illegal-1772103394-6129.jpg",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "30 Jubilee strategy to develop children, families, communities",
    "desc": "DAR ES SALAAM: THE Minister for Community Development, Gender, Women and Special Groups, Dr Dorothy Gwajima, has launched World Vision Tanzania’s five-year Jubilee Strategy (2026–2030) aimed at improving the well-being and sustainable development of children, families, and communities across the country. Speaking at the launching ceremony in Dar es Salaam, the minister said the strategy",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/Waziri-wa-Maendeleo-ya-Jamii-Jinsia-Wanawake-na-Makundi-Maalum-Mhe.-Dkt.-Dorothy-Gwajima-ak-4.webp",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Ilia Malinin, Alysa Liu on entry list, Olympic champion Mikhail Shaidorov opts out",
    "desc": "U.S. superstar Malinin will look to win his third straight world title in Prague next month following his shock eighth-place finish at Milano Cortina 2026, while Olympic women’s champion Alysa Liu will also aim to defend her world crown.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/i1n1brlgxk1qv9z3mqs5",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Tanzania pledges to solve psychological problems caused by family conflicts",
    "desc": "MWANGA: THE Tanzanian government has pledged to continue strengthening child upbringing and the provision of social welfare education to the public in order to reduce challenges related to stress, family conflicts, and psychological problems. The move also aims to build a society grounded in strong values, stability and the ability to cope with everyday life",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/SERIKALI-KUIMARISHA-ELIMU-YA-MALEZI-KUPITIA-KAMPASI-YA-KISANGARANa-Jackline-Minja-WMJJWMKilima-2.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "hour free cancellation: DGCA modifies ticket refund rules, sets deadline for airlines",
    "desc": "India Business News: Air passengers can now cancel or modify their tickets without paying additional charges within 48 hours of booking, subject to certain conditions, aft.",
    "image": "https://static.toiimg.com/thumb/msid-128811162,width-1280,height-720,imgsize-639304,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "New HIV research reveals major treatment gaps in Africa",
    "desc": "New HIV research from University of Nairobi reveals critical gaps in DTG treatment outcomes among children, adults, and older patients, highlighting urgent need for Africa-specific data.",
    "image": "https://www.capitalfm.co.ke/news/files/2026/02/Dr.-Loice-Ombajo-Co-director-CEMA-presenting-on-how-the-centre-works.jpg",
    "source": "Capitalfm.co.ke"
  },
  {
    "title": "Tanzania: How the New FGM Strategy Protects Girls",
    "desc": "MORE than 8.2 per cent of Tanzanian women aged 15 to 49 have undergone Female Genital Mutilation (FGM), according to the 2022 Tanzania Demographic and Health Survey (TDHS), with prevalence reaching as high as 58 per cent in some regions.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Google’s Circle to Search Gets Gemini 3 Bond: Now You Can Shop the \"Whole Vibe\" at Once",
    "desc": "Google announced an evolution of Circle to Search (CtS), introducing a Gemini 3 features that allow people to search for multiple items...",
    "image": "https://techeconomy.ng/wp-content/uploads/2026/02/Gemini-3-on-Google-Circle-to-Search.png",
    "source": "Techeconomy"
  },
  {
    "title": "Man found dead after alleged fall near Titiwangsa MRT",
    "desc": "KUALA LUMPUR: A 47-year-old man was found dead after he is believed to have fallen from the elevated Titiwangsa MRT track near Jalan Tun Razak on Thursday (Feb 26).",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/26/3789065.jpg",
    "source": "The Star"
  },
  {
    "title": "Copper Interest Builds in Botswana Amid Energy Transition",
    "desc": "Botswana Diamonds renames to Botswana Minerals Plc\nCompany shifts focus toward copper exploration\nDiamonds account for nearly 80% of",
    "image": "https://www.ecofinagency.com/media/k2/items/cache/b5447ac4b31a15427f0a57b7dfd9a3e3_S.jpg",
    "source": "Ecofin Agency"
  }
]