[
  {
    "title": "Ali Khamenei reappears for Islamic Republic's 47th anniversary",
    "desc": "Ayatollah Ali Khamenei made a public appearance to pray at the tomb of former Iranian Supreme Leader Ruhollah Khomeini, according to a post on his official X account.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/675206",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Roberto De Zerbi clarifies Marseille future after reportedly handing in resignation following Champions League exit",
    "desc": "Roberto De Zerbi has clarified his Marseille future after reports surfaced he had resigned following the French side's Champions League exit. The Ligue 1 outfit were dumped out of the competition in midweek after a 3-0 loss at Club Brugge, coupled with Benfica's dramatic 4-2 win over Real Madrid. After speculation mounted the Italian had stepped down from his role, De Zerbi has now set the record straight.",
    "image": "https://assets.goal.com/images/v3/getty-2258158234/crop/MM5DIOBUHA5DENZSG45G433XMU5DAORQ/GettyImages-2258158234.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Kathleen (Cattie) Martin (née McAteer), Coolback, Kindrum, Fanad, Co. Donegal",
    "desc": "The death has taken place of Kathleen (Cattie) Martin (née McAteer), Coolback, Kindrum, Fanad, Co. Donegal, peacefully at home surrounded by her loving family. Predeceased by her husband Joe and her daughters Roisin and Mary. Deeply regretted by her children Margaret, Johnny, Paula, Gerard, Enda and Karen. Sadly missed by her sisters Nora Cronin (Letterkenny) […]",
    "image": "https://highlandradio.com/wp-content/uploads/2026/01/Obit-Template-2026-01-31T093408.520.jpg",
    "source": "Highland Radio"
  },
  {
    "title": "Catherine O'Hara: Pedro Pascal and Meryl Streep lead tributes",
    "desc": "The Canadian comedic actress died in Los Angeles on Friday at the age of 71 following a brief illness.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/c486/live/751149c0-fe88-11f0-a8b8-bdd2c5f9bcad.jpg",
    "source": "BBC"
  },
  {
    "title": "Ruto to Launch Political School for UDA Using Communist Party of China Framework",
    "desc": "UDA Party seeks to emulate the Chinese Communist Party (CCP), which has been in power for 76 years and has established control over mainland China through a leadership school.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/ruto-uda.jpg?itok=1J90fYyw",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "The Architect of Credit: Zaar Kingdom Celebrates Dogara’s Strategic Appointment to the NCGC",
    "desc": "The Zaar Kingdom has erupted in celebration following President Bola Ahmed Tinubu’s appointment of the former Speaker of the House of Representatives, Rt. Hon. Yakubu Dogara, as the Board Chairman of the National Credit Guarantee Company Limited (NCGC). In an official communiqué from the Gung Zaar Council, the appointment was hailed as a \"divine testament\"",
    "image": "https://www.naijapreneur.com/wp-content/uploads/2026/01/The-Architect-of-Credit-Zaar-Kingdom-Celebrates-Dogaras-Strategic-Appointment-to-the-NCGC.jpg",
    "source": "naijapreneur"
  },
  {
    "title": "It's all in the mind for Wei Chong-Kai Wun, says Herry",
    "desc": "PETALING JAYA: For men's doubles shuttlers Man Wei Chong-Tee Kai Wun, it is a battle of the mind.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/31/3747798.JPG",
    "source": "thestar.com.my"
  },
  {
    "title": "IDF Fire Kills 19 Palestinians in Gaza, Wounds 48 Since Morning, Health Officials Say",
    "desc": "19 People Killed, 48 Wounded in Gaza Since Midnight, Health Officials in Gaza Say . Moody's Raises Israel's Credit Outlook From Negative to Stable, Citing Gaza Cease-fire. Israeli Singer Achinoam Nini Among Left-wing Activists Harassed by Far-right Agitator",
    "image": "https://img.haarets.co.il/bs/0000019c-1234-d0f1-abfd-3674be840005/30/72/f5f5b52f46109684a3a596a0bce1/sdfsdfdass.webp?precrop=600,349,x0,y0&width=1200&height=630&cmsprod",
    "source": "Haaretz"
  },
  {
    "title": "China protests PH action over own waters",
    "desc": "China has protested the Philippines' recent move to deploy coast guard vessels and aircraft near Bajo de Masinloc to secure Filipino fishers in the Philippine...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/31/75851.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Cambodia Heightens Medical Preparedness as Nipah Virus Raises Concerns in the Region",
    "desc": "PHNOM PENH – Cambodia’s Ministry of Health has intensified measures to prevent the possible entry of the deadly Nipah virus following confirmed c...",
    "image": "https://img.cambodianess.com/uploads/article/01-2026/1769842674.jpg",
    "source": "Cambodianess"
  }
]