[
  {
    "title": "China's marine corps gets ready to kick in doors",
    "desc": "The US Marine Corps (USMC) is America's go-to expeditionary force, a military service designed to react quickly to crises around the world. Likewise, China has a similar force in the shape of the People's Liberation Army Navy Marine Corps.",
    "image": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTBmYjdkZGQwLTBiYWEtMTFmMS1hMGQ5LTc1OTJkMGM1MWUxYy5qcGc=",
    "source": "Tribune India"
  },
  {
    "title": "Bushfire breaks out in hot, windy conditions in Trawool, northern Victoria",
    "desc": "A dangerous bushfire that has broken out in Victoria's north has quickly climbed to the highest emergency w...",
    "image": "https://imageresizer.static9.net.au/vwnGKcxOYnW8SXYLlNC99GszLlA=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F69904793-ec58-44c0-be46-0ba69b3bfda0",
    "source": "9News.com.au"
  },
  {
    "title": "Teen was speeding SUV for reels, lost my son due to him: Mother of dead Delhi man",
    "desc": "The mother of a 23-year-old man killed in a Delhi car crash on February 3 alleged that the minor was speeding his SUV while he was busy shooting reels, and that his reckless driving costed his son's life.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/dwarka-road-accident-175203683-16x9_0.jpg?VersionId=MGIkUCkIbv9aJvLs7gbiWiYjjrsQW_8G",
    "source": "India Today"
  },
  {
    "title": "In English, please",
    "desc": "Request from a Duterte loyalist: “Hi Alvin! Is it possible for you to paraphrase the statement of Atty. Kaufman so ordinary people, like me, can understand it better? You may show him the simpler/paraphrased form before you post it for us. Thanks in advance! More power to you and to the Defence Team of FPRRD!”",
    "image": "https://verafiles.org/wp-content/uploads/2026/02/Vlogger-Alvin-Sarzate-and-Nicholas-Kaufman-in-front-of-Scheveningen-prison.jpg",
    "source": "VERA Files"
  },
  {
    "title": "Roberts accuses public servant of sexual assault",
    "desc": "Vanessa Turnbull-Roberts says she stepped down as the ACT's first Aboriginal and Torres Strait Islander children and young people commissioner to prioritise her safety after being subjected to sexual harassment and sexual assault by a public servant.",
    "image": "https://live-production.wcms.abc-cdn.net.au/7c7081399c3db45a03829554725b44ce?impolicy=wcms_watermark_news&cropH=2268&cropW=4032&xPos=0&yPos=105&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "China's marine corps gets ready to kick in doors",
    "desc": "The US Marine Corps (USMC) is America's go-to expeditionary force, a military service designed to react quickly to crises around the world. Likewise, China has a similar force in the shape of the People's Liberation Army Navy Marine Corps.",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20260217023641.jpg",
    "source": "ANI News"
  },
  {
    "title": "3 suspects charged with murder of policewoman and son in Quezon City",
    "desc": "3 suspects face murder charges in policewoman, son killings",
    "image": "https://images.gmanews.tv/webpics/2026/01/slain_cop_2026_01_29_22_37_32.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Public Service Commission report into Teaching Council finds ‘highly concerning failures’; firm run by CEO’s husband gets $1.7m in contracts",
    "desc": "This story has been updated after the Public Service Commission clarified the $1.7m figure in its review was the amount in contracts awarded, not the amount...",
    "image": "https://www.nzherald.co.nz/resizer/v2/ZRWBOLGPKVDAFH4RFBXBU5MTOE.jpg?auth=e8ca44178efc7be2cc1bda7cc8a5345924dad8da5ca5ec0f66be9438486570dd&width=1200&height=675&quality=70&focal=1070%2C485&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Rafale deal, AI, trade on table: French President Emmanuel Macron set to meet PM Modi in Mumbai - what's on agenda",
    "desc": "India News: French President Emmanuel Macron and First Lady Brigitte Macron arrived in Mumbai on Tuesday for a three-day India visit till February 19.Macron is sc.",
    "image": "https://static.toiimg.com/thumb/msid-128445675,width-1280,height-720,imgsize-1024893,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Giving people cash didn’t cause more injuries or deaths",
    "desc": "As cash transfer programs expand across the United States, critics often warn that giving people money could spark reckless behavior, leading to injuries or even deaths. But a sweeping 11-year analysis of Alaska’s long-running Permanent Fund Dividend program tells a different story. Researchers examined statewide hospital records and death data and found no increase in traumatic injuries or unnatural deaths after annual payments were distributed.",
    "image": "https://www.sciencedaily.com/images/1920/hand-giving-cash-money.webp",
    "source": "ScienceDaily"
  }
]