[
  {
    "title": "World No. 1 Se-young anchors South Korea's first Asia team triumph",
    "desc": "PETALING JAYA: Women's singles sensation An Se-young added another feather in her cap by leading South Korea to a maiden Asia Team Championships title.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/08/3760324.jpg",
    "source": "The Star"
  },
  {
    "title": "Yasmien Kurdi's daughter Ayesha gives speech about healing and growth at school",
    "desc": "Yasmien Kurdi is one proud mom as her eldest daughter, Ayesha, was one of the speakers of the De La Salle Santiago Zobel School Open House.",
    "image": "https://images.gmanews.tv/webpics/2026/02/ayesha_2026_02_08_15_39_58.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Police recover four illegal firearms in Baringo",
    "desc": "Police in Baringo County have recovered four illegal firearms in separate operations as part of the ongoing disarmament exercise.",
    "image": "https://www.kbc.co.ke/wp-content/uploads/2026/02/firearms-e1770536323730.jpeg",
    "source": "KBC Digital"
  },
  {
    "title": "Small jobs, quick cash: How Iran recruits spies inside Israel",
    "desc": "Over the past two years, Iran has run a broad campaign to recruit Israeli citizens for sabotage, influence and intelligence, using phishing, small payments and minor tasks; reporter Gilad Cohen explains who is caught and Iran’s aims",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/05/HkWCf2ZDWx/HkWCf2ZDWx_206_0_643_362_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Portugal: Socialist tipped for presidential election win",
    "desc": "Though the far right reached the second round for the first time, veteran politician Antonio Jose Seguro is expected to win up to two-thirds of the vote.",
    "image": "https://static.dw.com/image/75860633_6.jpg",
    "source": "DW.com"
  },
  {
    "title": "RSS chief for Bharat Ratna to Savarkar; also speaks on turning 75, retirement",
    "desc": "Bhagwat also spoke about age among other subjects: “I have completed 75 years and informed the RSS, but the organisation asked me to continue working.”| India News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/08/550x309/20260207-MUM-RS-RSS-003-0_1770535878853_1770535885588.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "'Showed him wedding saree, invite’: Bengaluru bodybuilder dies by suicide after girlfriend’s engagement; planned to celebrate Valentine’s Day together",
    "desc": "A 26-year-old gym trainer and bodybuilder allegedly died by suicide at his home in north Bengaluru on Saturday evening after learning that the woman he loved was engaged to marry someone else.\nThe deceased has been identified as Kiran, a resident of Geleyara Balaga Layout in Mahalakshmi Layout.\nHe reportedly left behind a death note naming his lover and her mother as responsible for his death.\nKiran had been in a relationship with the woman for nearly three years. According to the preliminary investigation, the incident came to light on Saturday evening when he locked himself inside his room and died by hanging.\nFamily members told police that Kiran had been deeply distressed for the past two weeks after the woman informed him about her engagement and showed him her wedding invitation and a wedding saree.",
    "image": "https://static.toiimg.com/thumb/msid-128063306,width-1280,height-720,imgsize-46624,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Police Ladies FC cruise to 3-0 victory over Soccer Intellectuals FC",
    "desc": "Police Ladies FC delivered a commanding performance to secure a 3–0 win over hosts Soccer Intellectuals FC in their Matchday 12 fixture of the Malta Guinness Women’s Premier League, played on Friday, February 7, 2026, at the Senya Breku Astro...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/265/26545608.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Mia Brookes at Winter Olympics 2026: Soundtrack to her snowboarding life key for the Team GB phenom",
    "desc": "Snowboarding's youngest world champion is eyeing medal success at her Olympic debut at Milano Cortina 2026, but what soundtrack might she choose if she wins?",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/eo0ih4yvyhtp9nccqyaf",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Connecting home solar and electric vehicle batteries to the grid could boost South Africa’s clean energy and strengthen the electricity system",
    "desc": "South African homes need two-way meters so that they can feed extra solar power from home systems and electric vehicles back to the grid.",
    "image": "https://images.theconversation.com/files/716220/original/file-20260204-56-tunx1o.jpg?ixlib=rb-4.1.0&rect=0%2C800%2C5999%2C2999&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  }
]