[
  {
    "title": "Britain's Starmer ends China trip aimed at reset despite Trump warning",
    "desc": "Starmer met top Chinese leaders, including President Xi Jinping and Premier Li Qiang during his visit, with both sides highlighting the need for closer ties.",
    "image": "https://dam.mediacorp.sg/image/upload/s--zcWUaNtq--/c_crop,h_1125,w_1999,x_1,y_1/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/01/30/2026-01-29t043722z_960006159_rc2rajac0ekn_rtrmadp_3_china-britain_mod.jpg?itok=0HHn2xWO",
    "source": "CNA"
  },
  {
    "title": "Man randomly attacks four passers-by near Japan station; suspect on the run",
    "desc": "MITO: A man attacked four passers-by on Friday (Jan 30) evening in front of JR Mito Station in Ibaraki, according to police. The man allegedly punched or hit them with a bicycle.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/31/3747624.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "Australian Open 2026 live: Aryna Sabalenka meets Elena Rybakina in women's singles final",
    "desc": "Aryna Sabalenka tries to win her third Australian Open singles title and fifth grand slam crown as she meets 2022 Wimbledon champion Elena Rybakina in the women's singles final. Follow live.",
    "image": "https://live-production.wcms.abc-cdn.net.au/0bf05649f187b3ac2c0e5bd8ce5f7193?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=521&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Stop asking questions and join UDA, Mudavadi tells Western region",
    "desc": "Prime CS Musalia Mudavadi has urged leaders and residents of Western region to stop internal political disagreements and unite under UDA.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/lNCd23WgTt10OfpRUoeO3FcYefQPYPEKQ7XItJHT.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "'Come back home safely': Loved ones fuel RSAF pilots’ focus in Singapore Airshow aerial display",
    "desc": "An F-16C fighter jet and AH-64D Apache attack helicopter will execute 17 manoeuvres in an aerial display this year - some taking them within a whisker of each other.",
    "image": "https://dam.mediacorp.sg/image/upload/s--iFkAyWGV--/c_crop,h_900,w_1600,x_0,y_0/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/01/31/_wal0548.jpg?itok=zL2a6eug",
    "source": "CNA"
  },
  {
    "title": "The NI people named on the Sunday Times Tax List",
    "desc": "The list features the UK's 100 biggest taxpayers with the total amount paid coming to over £5 billion",
    "image": "https://i2-prod.belfastlive.co.uk/article27898603.ece/ALTERNATES/s1200/0_Belfast-City-Rooftop-Views-01_JK.jpg",
    "source": "Belfast Live"
  },
  {
    "title": "No more disappearing parks: Hannah Yeoh says KL must safeguard its green spaces",
    "desc": "KUALA LUMPUR, Jan 31 — Federal Territories Minister Hannah Yeoh said safeguarding Kuala Lumpur’s green spaces is a top priority amid ongoing urban development and increasing...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/01/31/323051.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "S’pore a ‘special place’ in giving journey of Facebook co-founder Eduardo Saverin and wife Elaine",
    "desc": "Facebook co-founder Eduardo Saverin and wife Elaine discuss their philanthropic commitment, with Singapore holding a special place in their giving journey. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/63349255ce769eca63a0fa3d4345c902b7fb4c3e8c3fa9a6fbfd7465dee324d0",
    "source": "The Straits Times"
  },
  {
    "title": "Helen Flanagan's 'real reason' for hitting out at ex after 'protecting him'",
    "desc": "Following fresh criticism of her ex Scott Sinclair, a source tells the Mirror that Helen Flanagan’s relationship comments could be 'the tip of the iceberg'",
    "image": "https://i2-prod.mirror.co.uk/article36637709.ece/ALTERNATES/s1200/0_Helen-Flanagan-2.jpg",
    "source": "The Mirror"
  },
  {
    "title": "If public transport was free, would you use it more?",
    "desc": "A nationwide, well-signalled trial of free public transport and shared bikes, for a defined period, would provide real evidence rather than assumptions, argues our roads expert.",
    "image": "https://img2.thejournal.ie/article/6940688/river/?height=400&version=6943206",
    "source": "The Journal"
  }
]