[
  {
    "title": "Coup claims on deported Zimbabwean activist Kagoro baseless - lobby",
    "desc": "Zimbabwean activist Brian Kagoro was deported to South Africa after being held for 10 hours",
    "image": "https://cdn.radioafrica.digital/image/2026/02/e759011f-d744-4ad3-8749-06c9ce748f22.png?1772184312362",
    "source": "the-star.co.ke"
  },
  {
    "title": "Stage 4 Liver Cancer Explained as Rinku Singh’s Father Passes Away",
    "desc": "Rinku Singh lost his father, Karanchand Singh, to Stage 4 liver cancer in Greater Noida after his condition worsened and he was placed on ventilator support. Advanced liver cancer, or metastatic liver cancer, spreads beyond the liver, carries low survival rates, and often shows symptoms only in later stages. , Health, Times Now",
    "image": "https://images.timesnownews.com/thumb/msid-153708881,width-1280,height-720,resizemode-75/153708881.jpg",
    "source": "Times Now"
  },
  {
    "title": "NSW teen camping death from red meat allergy a near world-first",
    "desc": "Jeremy Webb, 16, died after after eating a dinner of beef sausages while camping with friends on the NSW Central Coast.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/jeremy-webb-2LMM7YPKHNFAFJLLEZFUO4CXRM.jpg?auth=0f64e466b03b89ef37515a38bf3aec8eb35cd76f9e1b6c827db9f2ebceacc747&quality=70&width=600&height=315&focal=338%2C166",
    "source": "1News"
  },
  {
    "title": "Gregg Wallace and BBC settle damages claim",
    "desc": "Court documents state the claim against the BBC and BBC Studios has been \"discontinued\".",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/09e2/live/803c5660-0b16-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  },
  {
    "title": "Why Commonwealth Bank’s $1 billion suspected loan fraud should change how we bank and do business",
    "desc": "If you’re one of CommBank’s 17 million customers, don’t panic. But given how well AI can now fake documents, all banks will need to rethink their security.",
    "image": "https://images.theconversation.com/files/720868/original/file-20260227-77-z0lxve.jpg?ixlib=rb-4.1.0&rect=0%2C0%2C5051%2C2525&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "JB Danquah’s wife divorced him to join Nkrumah’s CPP - Kwesi Pratt",
    "desc": "Seasoned journalist and Managing Editor of the Insight Newspaper, Kwesi Pratt Jr, has shared insights into the level of backing Ghana’s first President, Dr Kwame Nkrumah, enjoyed, saying his appeal extended even to people closely connected to his...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/137/13765738.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Son of ‘Gasoline Godfather’ Jailed in Indonesia Graft Case",
    "desc": "The son of a reclusive oil merchant who dominated Indonesia’s fuel trade for decades received a prison sentence as part of a $17 billion corruption case centered on the country’s state-owned energy firm.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/igAVQdcxgvWY/v0/1200x800.jpg",
    "source": "Bloomberg.com"
  },
  {
    "title": "BDO bottom line up 6% in 2025",
    "desc": "Sy-led BDO Unibank Inc. reported a 6% growth in its earnings for 2025, its customer lending business posted double-digit growth across all market segments during the year.",
    "image": "https://images.gmanews.tv/webpics/2025/07/IMG_0383_2025_07_28_12_05_54.jpeg",
    "source": "GMA Network"
  },
  {
    "title": "Thaw will set in on Friday in Latvia",
    "desc": "The last working day of the week in Latvia will bring grey weather conditions, with a thaw prevailing, but a frost is also possible in the east of the country, according to the Latvian Environment, Ge...",
    "image": "https://static.lsm.lv/media/2025/02/large/1/ptpw.jpg",
    "source": "LSM"
  },
  {
    "title": "Srila Roy resigns as head of sociology department at Wits after 'offensive' remarks",
    "desc": "However, the initial investigation probed by Wits is reportedly still underway.",
    "image": "https://media.citizen.co.za/wp-content/uploads/2026/02/Wits-University-protest-GBV-1200x800-3.jpg",
    "source": "The Citizen"
  }
]