[
  {
    "title": "Angela Okorie apologises to Mercy Johnson over cybercrime incident",
    "desc": "The Nation Newspaper Angela Okorie apologises to Mercy Johnson over cybercrime incident",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/02/05101357/Angela-Okorie.jpg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "Fox to open Dyson store, distribute products in Israel",
    "desc": "In its first foray into the electrical goods sector Fox will have exclusive rights to import and distribute Dyson products in Israel.",
    "image": "https://res.cloudinary.com/globes/image/upload/t_800X392/v1627378982/direct/shutterstock_1642181209_fkfjbx.jpg",
    "source": "Globes - Israel Business News"
  },
  {
    "title": "State Bank of Pakistan Approves Designs of New Currency Notes",
    "desc": "The Governor of the State Bank of Pakistan, Jameel Ahmad, has confirmed that the design of new currency notes has been finalized. He said the State Bank",
    "image": "https://propakistani.pk/wp-content/uploads/2022/06/SBP-foto-lol.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "UP prof's research could make chemotherapy less painful",
    "desc": "A new compound could lessen the harm chemotherapy has on the body of cancer patients.",
    "image": "https://htxt.co.za/wp-content/uploads/2026/02/klbz-chemotherapy-448578_1920.jpg",
    "source": "htxt.co.za"
  },
  {
    "title": "'If Iran gets nuclear weapons...': JD Vance warns of regional nuke arms race, mentions Saudi Arabia",
    "desc": "US Vice President JD Vance stressed that President Donald Trump’s agenda prioritises reducing the threat of nuclear weapons worldwide and said the president has “no interest” in repeating mistakes made during the Iraq conflict in the early 2000s.",
    "image": "https://cdn1.wionews.com/prod/wion/images/2025/20251015/image-1760500179519.jpg?imwidth=1200&imheight=900",
    "source": "WION"
  },
  {
    "title": "4th Continental Dialogue on Youth, Peace and Security",
    "desc": "Moving Beyond Speeches to Concrete Action for the YPS Agenda",
    "image": "https://www.accord.org.za/wp-content/uploads/2026/02/f76c0017-7037-454b-b330-2e30e5347c85.jpg",
    "source": "accord.org.za"
  },
  {
    "title": "Europol operation: Tammy Caruana accused of €1m fraud",
    "desc": "Tammy Caruana, accused of defrauding 200 victims out of €1 million, faces charges after a Europol-led operation spanning Malta, the UK, and Ireland. Learn more about the case.",
    "image": "https://prod-img.crimeworld.com/public/incoming/9npg32-conall-sw-16.png/alternates/SIXTEEN_NINE_1200/Conall%20SW%2016.png",
    "source": "Sunday World"
  },
  {
    "title": "BI nabs 5 Chinese in separate operations for working sans visas",
    "desc": "A Chinese man who was allegedly found to have been working in the Philippines without a proper visa was apprehended in Zamboanga City, the Bureau of Immigration (BI) said on Wednesday.",
    "image": "https://images.gmanews.tv/webpics/2020/11/Bureau_of_Immigration_building_2020_11_28_16_00_28.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Microsoft launches LiteBox, a security",
    "desc": "Microsoft has released LiteBox, a project intended to function as a security-focused library OS that can serve as a secure kernel for protecting a guest",
    "image": "https://img.helpnetsecurity.com/wp-content/uploads/2026/02/05101241/microsoft-litebox-1500.webp",
    "source": "Help Net Security"
  },
  {
    "title": "Kwesi Pratt blasts Majority, Minority leaders over KIA renaming debate",
    "desc": "The Managing Editor of Insight newspaper, Kwesi Pratt Jnr, has launched a scathing attack on the leadership of both the Majority and Minority caucuses in Parliament, describing the ongoing debate over the renaming of Kotoka International Airport...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/800/80087960.jpg",
    "source": "GhanaWeb"
  }
]