[
  {
    "title": "Young Australian Daniel Jackson says he is president of his own European country",
    "desc": "Daniel Jackson says he has started his own country, Verdis, in Europe.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--lSbBE0P1--/t_tohu-badge-facebook/v1769926714/4JTVL53_8d0f508ccae8ff1b943ffcb90b65dcd2_avif?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Researchers in Australia open 'window to the brain' with new cancer-detecting chip",
    "desc": "SYDNEY: Scientists in Australia have developed a diagnostic device that can tell how deadly brain tumours respond to treatment from a simple blood test, in what they describe as a \"window to the brain,\" reported Xinhua.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/01/3748636.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "Hansi Flick talks Yamal, De Jong, Fermin, Olmo after Elche 1-3 Barcelona",
    "desc": "Chances were in no shortage when Barcelona took on Elche at Estadio Martinez Valero on Saturday night, as the Catalans simply dominated and produced an xG of over 6 against Eder Sarabia’s men. What they failed to do, however, was convert their chances and deliver a dominant scoreline, and it was only a 3-1 lead that they […]",
    "image": "https://barcauniversal.com/wp-content/uploads/2026/02/elche-cf-v-fc-barcelona-laliga-ea-sports-1000x600.jpg",
    "source": "Barca Universal"
  },
  {
    "title": "Angela Rayner has already launched campaign to replace Keir Starmer",
    "desc": "The former Deputy Leader has raised a £1 million war chest for her bid to become the new Labour leader - and there are two other candidates",
    "image": "https://cdn.images.express.co.uk/img/dynamic/139/1200x630/6712591.jpg",
    "source": "Daily Express"
  },
  {
    "title": "New ADHD Prescriptions Easier From Feb 1",
    "desc": "As of 1 February 2026, changes to New Zealand's prescribing rules for Attention-Deficit Hyperactivity Disorder (ADHD) stimulant medicines have come",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=cdn.pixabay.com%2Fphoto%2F2013%2F11%2F24%2F11%2F10%2Flab-217043_960_720.jpg",
    "source": "Mirage News"
  },
  {
    "title": "Union Budget 2026-27: Centre announces sustainable mountain trails for J&K, other states",
    "desc": "Presenting the Budget in Parliament, Sitharaman said that Jammu and Kashmir will be development for ecologically sustainable mountain trails",
    "image": "https://greaterkashmir.imagibyte.sortdcdn.net/wp-content/uploads/2026/02/Nirmala-Sithraman-allocates-10000-cr-for-biopharma.jpg",
    "source": "Greater Kashmir"
  },
  {
    "title": "Estonia plans to create smaller pig farms to reduce swine fever outbreak risks",
    "desc": "The Estonian state plans to create smaller pig farms in the future to protect farmers against African swine fever (ASF) outbreaks, but the continued spread of the disease in Europe and falling pork prices are making investments difficult.",
    "image": "https://s.err.ee/photo/crop/2025/10/23/3062634h8b3ct24.jpg",
    "source": "ERR"
  },
  {
    "title": "When the ducks quacked war: the night Israel almost went to war by accident",
    "desc": "A late-night IDF call-up broadcast on April 1, 1959, meant as a routine drill, panicked civilians, rattled the Knesset, mobilized Arab armies and forced senior generals to resign before officials admitted it was only an exercise",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2016/01/27/6781842/6781842_1_126_1300_732_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "The Kazakhstan billionaire behind Elena Rybakina’s Open triumph",
    "desc": "A diplomat and industrialist, he funded the career of the Russian-born player who won her second grand slam and first Australian Open.",
    "image": "https://static.ffx.io/images/$zoom_0.4531366726912815%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_340%2C$y_108/t_crop_custom/q_86%2Cf_auto/c7d67986c330699082807c929caebe55b0e32e77",
    "source": "The Age"
  },
  {
    "title": "Police appeal for information on missing 31-year-old man last seen in Joo Chiat area",
    "desc": "Police on Feb 1 issued an appeal for information regarding the whereabouts of Mr Cavan Yeo Ying Yong, 31.",
    "image": "https://cassette.sphdigital.com.sg/image/stomp/20840827cee4d6da6eeff787538a5c9e56905d67dbcd601acdd282faffb8fb82/imgonline-com-ua-FrameBlurred-JTgEvYVEcu8TJj201.jpg",
    "source": "Stomp"
  }
]