[
  {
    "title": "Cork v Tipperary: Rebels name team with six changes from last week",
    "desc": "As with the wins over Galway and Waterford, ten of the side that started the All-Ireland final loss to Tipp are included",
    "image": "https://www.echolive.ie/cms_media/module_img/9920/4960256_2_seoimageog_3192673.jpg",
    "source": "echo live"
  },
  {
    "title": "Marc Cucurella ambushed AGAIN by Adama Traore as Spanish duo face off on TV show following Chelsea vs West Ham melee",
    "desc": "Chelsea left-back Marc Cucurella was ambushed again by West Ham star Adama Traore after their fracas during the London derby at Stamford Bridge. The Spanish pair appeared on a chat show in their native country, and an awkward reunion followed.",
    "image": "https://assets.goal.com/images/v3/getty-2259343738/crop/MM5DKMBQGQ5DEOBRGU5G433XMU5DAORSGYYQ====/GettyImages-2259343738.jpg",
    "source": "Goal.com"
  },
  {
    "title": "NPFL: Enyimba firmly focused on Bendel Insurance clash - Edidiong",
    "desc": "Enyimba midfielder Edidiong Ezekiel says the team is focused on their Nigeria Premier Football League, NPFL, matchday 25 clash against Bendel Insurance.",
    "image": "https://dailypost.ng/wp-content/uploads/2024/01/FB_IMG_1701154165747-2.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Mines researcher part of NASA-selected satellite mission",
    "desc": "Mines geophysics professor Matt Siegfried is a member of NASA’s EDGE mission to map the planet’s ice and ecosystems with the most accurate spaceborne altimeter ever.",
    "image": "https://www.minesnewsroom.com/sites/default/files/2026-02/edge_orbit_orange_tracks_will_extend_to_the_polar_regions_allowing_for_dense_mapping_around_the_edges_of_ice_sheets_and_sea_ice_pack.png",
    "source": "Mines Newsroom"
  },
  {
    "title": "The entry-level iPad is now rumored to get Apple Intelligence support this year",
    "desc": "The next iteration will be almost identical to the current one, with two very important upgrades. Apple's latest entry-level iPad dates from March last...",
    "image": "https://fdn.gsmarena.com/imgroot/news/26/02/next-entry-level-ipad-leak/-952x498w6/gsmarena_000.jpg",
    "source": "GSMArena.com"
  },
  {
    "title": "Dietitians Agree: This Type of Bean Packs More Fiber Than Any Other",
    "desc": "It’s not pinto, black, or kidney beans.",
    "image": "https://s.yimg.com/ny/api/res/1.2/wsT6g43aWOMhUhJr9HzG7A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/real_simple_700/10ca20142c40391cba5e6c3d416855be",
    "source": "Yahoo News Singapore"
  },
  {
    "title": "Google Supercharges Gemini 3 Flash with Agentic Vision",
    "desc": "Google has added agentic vision to Gemini 3 Flash, combining visual reasoning with code execution to \"ground answers in visual evidence\". According to Google, this not only improves accuracy, but more",
    "image": "https://res.infoq.com/news/2026/02/google-gemini-agentic-vision/en/headerimage/gemini-agentic-vision-1770402717807.jpg",
    "source": "infoq.com"
  },
  {
    "title": "interest instruments to unlock long",
    "desc": "CFG Africa is pushing for broader role for non-interest banking in Nigeria’s financial system, arguing that larger and more frequent Sukuk...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2024/12/Sukuk.png",
    "source": "Businessday NG"
  },
  {
    "title": "Goldman Sachs teams up with Anthropic to automate banking tasks with AI agents, CNBC reports",
    "desc": "Goldman Sachs is working with technology startup Anthropic to ​develop AI-powered agents aimed at automating ‌a widening range of internal functions, CNBC reported ‌on Friday, citing the bank's chief information officer. Goldman Sachs confirmed the accuracy of the report. The Wall Street bank has spent ⁠the past six ‌months collaborating with Anthropic engineers embedded within its teams to ‍build autonomous agents for tasks including trade and transaction accounting as well as client due diligence ​and onboarding, Marco Argenti told CNBC.",
    "image": "https://s.yimg.com/os/en/reuters-finance.com/79da75a123fb110e48b1e5cb93a712ef",
    "source": "Yahoo Finance"
  },
  {
    "title": "SMIU organises TechFest, over 160 students display projects",
    "desc": "KARACHI  -  The Faculty of Information Technology at Sindh Madressatul Islam University (SMIU), in collaboration with the Business Incubation Centre (BIC) and",
    "image": "https://www.nation.com.pk/assets/thenation_202006/images/no-image-large.jpg",
    "source": "The Nation (Pakistan )"
  }
]