[
  {
    "title": "Two Drunk Bengaluru Women Ram Into A Cab, Then Assault And Abuse Driver",
    "desc": "According to the complaint, the cab driver confronted them over the collision, which soon escalated into a heated argument.",
    "image": "https://images.news18.com/ibnlive/uploads/2026/02/Untitled-design-2026-02-08T125108.664-2026-02-f672673442e1dded16bd5a22313c201f-16x9.jpg",
    "source": "News18"
  },
  {
    "title": "Iran: Talks With U.S. Progressing, Tehran Won't Bow Down to Pressure",
    "desc": "Iranian President Says U.S.-Iran Talks Progressing, While Foreign Minister Says Iran Won't Bow Down to Pressure. GOP’s Graham Says Iran Deal ‘Tough Sell,’ Hints at Congressional Roadblocks. Israeli Troops Kill Two Palestinians Crossing Yellow Line in Gaza, IDF Says",
    "image": "https://img.haarets.co.il/bs/0000019c-3b7b-df99-a19f-7b7f2af50000/59/d5/e657ed564c5aa82f830b75d6a8e6/502664-2.jpg?&width=1200&height=630&cmsprod",
    "source": "Haaretz"
  },
  {
    "title": "Scientists found a gut compound that helps protect the liver",
    "desc": "What a mother eats during pregnancy may quietly shape her child’s liver health years down the road—but new research suggests there may be a way to tip the odds back in a healthier direction. Scientists found that a natural compound made by healthy gut bacteria dramatically reduced fatty liver disease in the offspring of mice whose mothers ate a high-fat, high-sugar diet. The compound, called indole, appeared to protect the liver, improve blood sugar, limit weight gain, and even reshape the gut microbiome in lasting ways.",
    "image": "https://www.sciencedaily.com/images/1920/diseased-liver-illustration.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Shahid Butt defends Birmingham election candidacy despite bomb plot past",
    "desc": "Shahid Butt will stand in Birmingham's council election and says his conviction in 1999 was unsafe.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/7036/live/1fe26a90-035d-11f1-bab5-81d0d0b0abce.png",
    "source": "BBC"
  },
  {
    "title": "Another police recruit collapses and dies during training in Kiganjo, Nyeri",
    "desc": "This is the fourth such incident to happen in the service.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/c87f25ef-79d0-4b2e-af65-cb26abb3aa33.jpg?1770540724619",
    "source": "the-star.co.ke"
  },
  {
    "title": "'Pancake Day training' and 'dancing at Highgrove'",
    "desc": "Our weekly round-up of photos from across the West region.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/f5b9/live/ec4cc470-035a-11f1-bf09-218341647648.png",
    "source": "BBC"
  },
  {
    "title": "Indonesia-Australia Agree on Customs Mutual Recognition Agreement",
    "desc": "The agreement between the Directorate General of Customs and Excise and Australia aims to expedite trade flows while strengthening international supply chain security.",
    "image": "https://statik.tempo.co/data/2026/01/05/id_1451618/1451618_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "Assam: Congress slams BJP's 'point-blank shot' video for targeting minorities",
    "desc": "Congress criticizes Assam BJP's controversial video targeting minorities, urging the judiciary to take decisive action against hate speech.",
    "image": "https://th-i.thgim.com/public/incoming/od4bc2/article70606975.ece/alternates/LANDSCAPE_1200/PTI02_08_2026_000173B.jpg",
    "source": "thehindu.com"
  },
  {
    "title": "Postponement of the lighting of the Olympic Cauldrons scheduled for Sunday, 8 February",
    "desc": "The lighting of the Cauldrons in Milan and Cortina has been postponed by one hour.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/wzholjahb8xpihglir2s",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "If 1.25 crore Hindus decide to fight...: RSS chief's big remark on Bangladesh",
    "desc": "Speaking at an event in Mumbai to mark 100 years of the RSS, Mohan Bhagwat said that 1.25 crore Hindus in Bangladesh will get global Hindu support if they stay and fight for their rights amid rising violence against minorities.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/if-125-crore-hindus-want-rss-chiefs-message-for-bangladesh-minorities-081427826-16x9_0.jpg?VersionId=_41ul74w2SH4d7Pc5PQIHUSThVAYjooX",
    "source": "India Today"
  }
]