[
  {
    "title": "Silver jumps Rs 4,500/kg, gold rebounds despite easing US-Iran tensions. What should your strategy be?",
    "desc": "Gold and silver futures saw an upward opening on MCX on Wednesday. This occurred even as progress in US-Iran talks eased geopolitical tensions, reducing safe-haven demand for precious metals. Analysts suggest caution due to market volatility. Physical gold prices varied across major Indian cities. Investors are advised to avoid fresh positions this week.",
    "image": "https://img.etimg.com/thumb/msid-128491152,width-1200,height-630,imgsize-67782,overlay-etmarkets/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Dagoon on a roll, dominates national junior netfest in GenSan",
    "desc": "Jan Cadee Dagoon continued her blazing run on the national junior circuit, delivering another commanding performance at the Mayor Lorelie Pacquiao National Junior Tennis Championships at the GenSan City and Camp Lira courts",
    "image": "https://media.philstar.com/photos/2023/12/11/tennis_2023-12-11_20-14-58.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Sportsplex pool tagged again for measles exposure",
    "desc": "Breaking News, Sports, Manitoba, Canada",
    "image": "https://www.brandonsun.com/wp-content/uploads/sites/3/2022/04/161021Sportsplex04TS.JPG?w=1600",
    "source": "Brandon Sun"
  },
  {
    "title": "vivo X300 FE color options, RAM, and storage variants tipped",
    "desc": "It is expected to be equipped with a Snapdragon 8 Gen 5 chipset. vivo is expected to launch the X300 FE soon. The phone has recently received...",
    "image": "https://fdn.gsmarena.com/imgroot/news/26/02/vivo-x300-fe-ram-storage-colors-leak/-952x498w6/gsmarena_000.jpg",
    "source": "GSMArena.com"
  },
  {
    "title": "Potential measles exposure reported at Walmart in South Carolina",
    "desc": "Officials report a possible measles exposure at a Powdersville Walmart amid a 962-case South Carolina outbreak",
    "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/walmart-measles-6994b22927160.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
    "source": "WYFF News 4"
  },
  {
    "title": "Tesla dodges 30-day suspension in California after removing 'Autopilot'",
    "desc": "The decision comes a month after Tesla discontinued Autopilot, its basic driver-assistance system.",
    "image": "https://techcrunch.com/wp-content/uploads/2026/01/tesla-autopiot-Getty.jpg?resize=1200,800",
    "source": "TechCrunch"
  },
  {
    "title": "'I don't feel any pressure to perform straight away' – Oscar Onley starts 'figuring out' Ineos Grenadiers at Volta ao Algarve with Tour de France the clear target",
    "desc": "'It's no secret that the Tour is the main focus for the year, for myself and for the team' says the 23-year-old who made late transfer",
    "image": "https://cdn.mos.cms.futurecdn.net/8o7zuMTxLP2koiRi9dBmuZ-1024-80.jpg",
    "source": "Cyclingnews"
  },
  {
    "title": "Trainspotting artist hosts new exhibition 30 years on",
    "desc": "Perhaps as much as Trainspotting captured a time and a place on camera, Mark Blamire’s poster put the film into its cultural postcode",
    "image": "https://www.bigissue.com/wp-content/uploads/2026/02/1704-Trainspotting_at_30_Hero.jpg",
    "source": "Big Issue"
  },
  {
    "title": "Rev. Jesse Jackson, who led the Civil Rights Movement for decades after King, has died at 84",
    "desc": "CHICAGO (AP) — The Rev. Jesse L. Jackson, a protege of the Rev. Martin Luther King Jr. and two-time presidential candidate who led the Civil Rights Movement...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/18/80034.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Hilary Duff addresses 'complicated' family dynamic amid rumored feud",
    "desc": "Hilary Duff has made a rare comment on her strained dynamic with sister Haylie and dad Robert, reflecting that 'just because you're born into a family doesn't mean that it always stays together.'",
    "image": "https://ew.com/thmb/eyZ13-GNIC91JMEGUwZo1jdB8ww=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/Haylie-Duff-Hilary-Duff-Norah-Restaurant-2017-021726-47993d01609742f8afba8b493625bc8d.jpg",
    "source": "ew.com"
  }
]