[
  {
    "title": "‘Ramadan Kareem’: UAE Gifts Indonesia 30 Tons of Dates",
    "desc": "UAE says that the 30-ton date donation reflects the country's wish to build solidarity with the Indonesian people.",
    "image": "https://img2.beritasatu.com/cache/jakartaglobe/960x620-w/2026/02/1771924084-1600x1069.webp",
    "source": "Jakarta Globe"
  },
  {
    "title": "Dangerous heat for Tour de France riders only a ‘question of time’",
    "desc": "Rising temperatures across France since the mid-1970s is putting Tour de France competitors at “high risk”, according to new research.",
    "image": "https://www.carbonbrief.org/wp-content/uploads/2026/02/AX5KDN.jpg",
    "source": "Carbon Brief"
  },
  {
    "title": "Brig Gen Ashong removed as Pres. Mahama appoints Aaron Kanor as GRA Customs boss",
    "desc": "President John Mahama has appointed Aaron Kanor as Acting Commissioner of the GRA Customs Division, replacing Brig Gen Glover Ashong Annan, as part of efforts to strengthen revenue mobilisation and border security in Ghana. Read more.",
    "image": "https://sportal365images.com/process/smp-images-production/pulse.com.gh/24022026/f8cd9b45-c29e-469d-b2e3-e037d2ffb37f.jpg?operations=autocrop(1200:630)",
    "source": "Pulse.com.gh"
  },
  {
    "title": "France bans US ambassador Charles Kushner from meeting French ministers",
    "desc": "Father of Donald Trump’s son-in-law ignored summons over comments on far-right activist’s killing",
    "image": "https://www.irishtimes.com/resizer/v2/EXYFIDH44JMXXAJKJ5QRU3DIZ4.jpg?smart=true&auth=a026d8ccaf0668a2cb33f39a6374976480b9c2d93b3be85a33cc16ca8f63810a&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "SKY DRAGON: Guild Battles - Japan's Hit RPG Arrives Globally Today",
    "desc": "Press releases and assets from across the games industry - screenshots, videos, logos, packshots, artwork, PR contacts, release dates",
    "image": "https://www.gamespress.com/Content/Themes/Games Press/img/favicon.ico",
    "source": "Games Press"
  },
  {
    "title": "Tribunal Upholds CCP Penalty of Rs. 4 Crore Against Two Medicine Distributors",
    "desc": "The Competition Appellate Tribunal has upheld a cumulative penalty of Rs. 40 million imposed by the Competition Commission of Pakistan (CCP) on United",
    "image": "https://propakistani.pk/wp-content/uploads/2024/09/medicines-gst.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Why Khamenei Is Preparing Iran for War With the US to Protect Regime Survival",
    "desc": "Middle East News: Ayatollah Ali Khamenei is restructuring Iran’s leadership, military strategy and internal security as US forces mass in the Middle East. This in‑depth analysis explains why Tehran is simultaneously negotiating in Geneva while preparing for a potential war with the United States, dispersing command, hardening nuclear sites, boosting missile deterrence and cracking down on domestic dissent to ensure regime survival.",
    "image": "https://static.toiimg.com/thumb/msid-128747589,width-1280,height-720,imgsize-19884,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Africa Trade Conference returns to Cape Town with esteemed speakers driving Africa’s trade agenda",
    "desc": "#FeaturedPost | Business Insider Africa",
    "image": "https://ocdn.eu/pulscms-transforms/1/949ktkqTURBXy9lMWM5MzM2ZDc5ZmVhNDg4MjgzZDdjYjhjOTAzMzdkNi5qcGVnkpUDACHNBDjNAl-TBc0EsM0Cdg",
    "source": "Business Insider Africa"
  },
  {
    "title": "AI could hit Philippine jobs, consumer spending-Visa",
    "desc": "A young population is seen to drive consumption growth in the Philippines, but the rise of artificial intelligence (AI) could shed jobs in its mostly...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/24/81435.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Spring season arrives at the Rothko Museum",
    "desc": "From muted and contemplative non-figurative paintings and installations to an emotionally charged photographic story about the imprints of experience on the mind and body – six new exhibition projects...",
    "image": "https://static.lsm.lv/media/2026/02/large/1/ss76.jpg",
    "source": "LSM"
  }
]