[
  {
    "title": "Star half stealing the show in DCE’s Roosters debut after dramatic delay — NRL Trials LIVE",
    "desc": "Star half stealing the show in DCE’s Roosters debut after dramatic delay — NRL Trials LIVE",
    "image": "https://content.api.news/v3/images/bin/8cc058b55da6f1bf86f9d83fe2d8f096",
    "source": "fox sports"
  },
  {
    "title": "Power generation hits record 9,140 GWh in January 2026",
    "desc": "Higher industrial consumption and tariff changes drive surge in grid demand",
    "image": "https://profit.pakistantoday.com.pk/wp-content/uploads/2026/02/Untitled-design-91.png",
    "source": "Profit by Pakistan Today"
  },
  {
    "title": "Dan Rafael Says Conor Benn Will Earn $15M For Zuffa Fight Deal",
    "desc": "Dan Rafael reports eight-figure purse for one-fight agreement",
    "image": "https://www.boxingnews24.com/wp-content/uploads/2025/11/benn-defeats-eubank1.jpg",
    "source": "Boxing News 24"
  },
  {
    "title": "Prince William, Kate reach out Beatrice, Eugenie after Andrew arrest",
    "desc": "Prince William and Princess Kate are playing an important role behind the scenes as the Andrew furore kicks up notch with the police digging deeper into the investigation.Andrew Mountbatten-Windsor had been exiled to Norfolk when he was...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-21/l_652116_014138_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "How Mamelodi Sundowns sporting director Flemming Berg helped Orlando Pirates sell Mbekezeli Mbokazi to Chicago Fire revealed",
    "desc": "The move made by the Bafana Bafana defender to switch from the Premier Soccer League to Major League Soccer remains one of the most controversial transfer stories in recent history. One of the high-profile figures to oppose it was Hugo Broos, and the coach's comments almost rocked the national team camp as it prepared for the 2025 AFCON finals in Morocco. While some argued the move was made in haste, others felt it could end up opening the window for the defender to Europe eventually.",
    "image": "https://assets.goal.com/images/v3/blt596978043b412245/Flemming%20Berg,%20Mamelodi%20Sundowns%20TD.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Floyd Mayweather ends retirement again to return to professional boxing",
    "desc": "Former world champion Floyd Mayweather will come out of retirement for a fourth time following his upcoming exhibition bout with Mike Tyson, to take part in his first professional fight for nearly 10 years.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e13e/live/80c1aa50-0ef8-11f1-af62-d144105cb305.jpg",
    "source": "BBC"
  },
  {
    "title": "PENGASSAN seeks PIA review over oil revenue executive order",
    "desc": "PENGASSAN faults claims of a 30% oil revenue deduction, warning an executive order undermines the law. The union calls for a comprehensive PIA review.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2023/08/03080306/Festus-Osifo.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "KHxRK FIRST GLIMPSE fans' reaction: 'Swag max!' say netizens as Nelson sets the standard for Rajinikanth-Kamal Haasan reunion",
    "desc": "The excitement waiting for the movie that is directed by Rajinikanth and Kamal Haasan, which we all know about, has become much more. Initially, Lokes.",
    "image": "https://static.toiimg.com/thumb/msid-128638810,width-1280,height-720,imgsize-30280,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "N8.14trn richer: Stock investors toast to biggest weekly gain in history",
    "desc": "The Nigerian stock market has entered a historic super-cycle, recording an unprecedented N8.14 trillion gain in just five trading sessions to February 20...",
    "image": "https://cdn.businessday.ng/2023/04/stock-market-1.png",
    "source": "Businessday NG"
  },
  {
    "title": "How will Kevin Warsh's plan to reduce the Fed's balance sheet work?",
    "desc": "\"I've got a lot of sympathy for Warsh's view. But the transition from here to where he wants to get, could be problematic.\"",
    "image": "https://fortune.com/img-assets/wp-content/uploads/2026/02/GettyImages-2223719638-e1771343953154.jpg?resize=1200,600",
    "source": "Fortune"
  }
]