[
  {
    "title": "US says 'meaningful progress' made as Ukraine talks enter second day",
    "desc": "The US special envoy struck an optimistic note after the first day of talks in Geneva, but hopes for a breakthrough remain low.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/734c/live/62395cf0-0c8b-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  },
  {
    "title": "Today's Front pages: Thursday, February 18, 2026",
    "desc": "Myjoyonline.com brings you the front pages of the various newspapers across the country.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/image-1685.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Ejaculation without penetration of penis is only attempt to rape, not rape: Chhattisgarh High Court",
    "desc": "The Court was dealing with an appeal challenging conviction in a rape case. The victim had said that the accused kept his private part above her private part but did not penetrate her.",
    "image": "https://media.assettype.com/barandbench%2F2024-10-15%2Fje7awkhr%2Fchhattisgarhhighcourt.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Bar and Bench"
  },
  {
    "title": "NCAA: Arellano Lady Chiefs snap two-game skid as Catherine Domasig flaunts all-around game vs. JRU",
    "desc": "Arellano University rode Catherine Domasig's overall game to pull off a 25-14, 21-25, 25-16, 25-21 win against Jose Rizal University in the NCAA Season 101 women's volleyball tournament.",
    "image": "https://images.gmanews.tv/webpics/2026/02/IMG_1921_2026_02_18_15_30_45.jpg",
    "source": "GMA Network"
  },
  {
    "title": "How Singapore celebrities celebrated Chinese New Year",
    "desc": "Discover how Singapore celebrities like Zoe Tay, Fann Wong, and Rebecca Lim celebrated Chinese New Year with family and friends. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/af6a0ea17d252b9ecfbbef797af2e4e066b264b7deb0d954d6f60ac841a9e1d1",
    "source": "The Straits Times"
  },
  {
    "title": "Interreg: Two decades of cooperation between the EU and Tunisia",
    "desc": "EuropeanCommission – Regional Policy - Inforegio",
    "image": "https://ec.europa.eu/regional_policy/images/upload/EU-tunisia-2026.jpg",
    "source": "European Commission"
  },
  {
    "title": "Uhuru joins Catholic faithful to mark Ash Wednesday, wishes Muslims a blessed Ramadan",
    "desc": "Uhuru participated in the solemn service alongside congregants at St Francis of Assisi Catholic Church in Nyali.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/730567fa-9156-4de5-880e-f929722e365b.jpg?1771402626901",
    "source": "the-star.co.ke"
  },
  {
    "title": "Maldives moves to merge key elections to cut costs",
    "desc": "MALE: The Maldives will hold a nationwide referendum in April to decide whether the presidential and parliamentary elections can be held on the same day to cut costs, an official said Wednesday.President Mohamed Muizzu has set the plebiscite for April 4, which if approved, would bring forward the next parliamentary vote and shorten the current legislature’s term by about five",
    "image": "https://www.arabnews.pk/sites/default/files/styles/660x371_watermarkpakistan/public/main-image/2026/02/18/4686108-616752230.jpg?itok=QUfYiZjk",
    "source": "Arab News PK"
  },
  {
    "title": "Sheffield woman lost her hearing overnight in her 30s",
    "desc": "Lauren Staniforth is now profoundly deaf and doctors still cannot explain what caused it.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9451/live/91025ed0-0c98-11f1-ab92-c5c4ffbfd0e0.jpg",
    "source": "BBC"
  },
  {
    "title": "Moran accuses cllrs of strategically undermining term",
    "desc": "Limerick's directly elected Mayor John Moran has launched a scathing attack on a number of councillors, accusing them of a deliberate strategy to ensure his term as mayor is not successful.",
    "image": "https://www.rte.ie/images/00231f60-1600.jpg",
    "source": "RTE.ie"
  }
]