[
  {
    "title": "Crime 101 First Reactions Are All Giving the Same Verdict",
    "desc": "Early reactions to Crime 101 have arrived ahead of its US theatrical release, with reviews praising the film's style and cast.",
    "image": "https://www.comingsoon.net/wp-content/uploads/sites/3/2026/02/Crime-101-gets-first-reactions-ahead-of-reviews.jpg?resize=1200,630",
    "source": "ComingSoon.net"
  },
  {
    "title": "Correcting and Replacing: Infinix to Deliver Industry",
    "desc": "HONG KONG SAR - Media OutReach Newswire - 11 February 2026 - Today, Infinix announced its plans to integrate the cutting-edge Snapdragon® platforms from",
    "image": "https://panafricanvisions.com/wp-content/uploads/2026/02/731851-infinix-qualcomm-jpg-400x-1.jpeg",
    "source": "pan african visions"
  },
  {
    "title": "COA lifts P3-M notice of disallowance issued against Occidental Mindoro town",
    "desc": "The Commission on Audit (COA) has set aside the notice of disallowance (ND) it earlier issued against the municipality of Sablayan, Occidental Mindoro for the...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/11/78514.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "JSW warns of delay in first car launch over China parts licence, letter shows",
    "desc": "JSW Motors faces a potential delay in its first car launch. The company needs fast-tracked import licenses for essential parts from China. JSW is investing heavily in hybrid and electric vehicles in Maharashtra. The government's quality control rules are causing the hold-up. This could impact the planned second-half launch of their new car.",
    "image": "https://img.etimg.com/thumb/msid-128195668,width-1200,height-630,imgsize-12738,overlay-economictimes/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Why your health deserves a spot on your goals list",
    "desc": "But here’s the question I always ask next: “What about your health goals?”",
    "image": "https://healthwise.punchng.com/wp-content/uploads/2021/03/Healthcare-workers-1.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Rafale hero of Op Sindoor: Air Force vice-chief ahead of mega jets deal",
    "desc": "IAF Vice-Chief Air Marshal Nagesh Kapoor's remarks come as the country was moving closer to clearing a major proposal to acquire 114 multi-role fighter aircraft (MRFA), with the Rafale emerging as a frontrunner.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/rafale-fighter-jets-114452246-16x9_0.jpg?VersionId=xW6wQlc6i7feBuMSYYcsa2HETONDh4OH",
    "source": "India Today"
  },
  {
    "title": "A Day, and a Nation, at the Kennedy Center",
    "desc": "From Tchaikovsky to redneck humor: the arts in Trump’s America.",
    "image": "https://substackcdn.com/image/fetch/$s_!83jb!,w_1200,h_675,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fbc11fa9c-56c1-492d-8ca6-f7ec9e2fffcb_3000x2001.jpeg",
    "source": "The Bulwark"
  },
  {
    "title": "Hansi Flick rewards 20-year-old Barcelona gem with first-team training call",
    "desc": "Barcelona manager Hansi Flick has once again shown his trust in the club’s young talents, calling up several academy players to first-team training ahead of the crucial Copa del Rey semi-final against Atletico Madrid. According to a report from Mundo Deportivo, Barcelona’s training on Tuesday was far from routine, as Flick had to deal with […]",
    "image": "https://barcauniversal.com/wp-content/uploads/2025/10/fc-barcelona-training-session-1000x600.jpg",
    "source": "Barca Universal"
  },
  {
    "title": "Without explanation, FAA closes El Paso and New Mexico airspace for 10 days, cites national defense",
    "desc": "The Federal Aviation Administration has closed airspace over El Paso and parts of southern New Mexico for 10 days under a national defense designation, offering no explanation for the rare move.An unexplained FAA order has shut down air space over El Paso and parts of southern New Mexico, warning that aircraft violating the restriction could face interception and possible use of deadly force.",
    "image": "https://elpasomatters.org/wp-content/uploads/2026/02/NOTAM.png",
    "source": "El Paso Matters"
  },
  {
    "title": "Nancy Guthrie: Police search Arizona home of person detained in connection with case",
    "desc": "Police had searched the home of the person, who was taken into custody at a traffic stop.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/51c5/live/7b03dca0-071e-11f1-811d-d70cdc846ab3.jpg",
    "source": "BBC"
  }
]