[
  {
    "title": "Conan O'Brien comments on Reiners following their tragic deaths",
    "desc": "Conan O'Brien commented on Rob and Michele Reiner's deaths in a New Yorker interview.",
    "image": "https://pagesix.com/wp-content/uploads/sites/3/2026/02/121856292-1.jpg?quality=75&strip=all&w=1200",
    "source": "Page Six"
  },
  {
    "title": "Internet’s favourite monkey Punch made an IKEA plush toy go viral - Here’s what it costs",
    "desc": "The orange orangutan plush hugged by viral baby monkey Punch has been identified as an IKEA toy. As the heartwarming story spreads online, fans are discovering where the plush comes from and comparing its price in the US and India.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/20/1600x900/logo/punch_plush_from_IKEA_1771622471505_1771622471708.jpg",
    "source": "Mint"
  },
  {
    "title": "Sea-level changes modulate beach face slope in coastal upwelling zones",
    "desc": "Although waves are commonly regarded as the primary drivers of beach profile evolution, observations and experiments show that the slope of the beach face does not always directly reflect the conditions of the incident waves. The mechanisms governing transitions between equilibrium states are unclear due to feedback loops and delayed sediment responses. In this study, we analyze 3.5 years of daily beach profile data from two tropical low-tide terrace sites in order to characterize nearshore transient periods between seasonal equilibria. Our results reveal episodes in which the traditional classification of equilibrium beaches fails to predict slope evolution. We demonstrate that, at these beaches, transient events can be influenced by water-level variations linked to coastal upwelling, thereby altering sediment redistribution across the swash–surf continuum. Complementary laboratory experiments confirm that the observed dynamics can be reproduced by considering both the Dean number ($$\\Omega _0$$), representing wave energy, and nearshore water-level variability. Our findings emphasize that transient sea-level modulations, such as those induced by upwelling, mesoscale eddies or atmospheric systems, can reshape beach profiles across multiple timescales. This highlights the need to extend equilibrium frameworks to account for non-wave-driven processes.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Politicians can’t be trusted with our debt trajectory, NZ needs a fiscal watchdog - Fran O’Sullivan",
    "desc": "THE FACTS If New Zealand was a company you would be thinking when will be the right time to consider placing it under statutory management. Directors – aka...",
    "image": "https://www.nzherald.co.nz/resizer/v2/PWFMBQ2BHJGBPJYLHNSN7DTQEU.jpg?auth=bb5230933210b454891309123a93038fa361b0294b37c4be0dc633657660368f&width=1200&height=675&quality=70&focal=867%2C390&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Puberty blocker trial paused over ‘new concerns’ about fertility",
    "desc": "Recruitment of 250 girls and boys aged between ten and 16 raised fears that some would be asked if they wanted to freeze sperm or eggs",
    "image": "https://www.thetimes.com/imageserver/image/%2F759d8813-4b73-46ef-b7f4-cde93869191f.jpg?crop=3108%2C1748%2C311%2C884&resize=1200",
    "source": "The Times"
  },
  {
    "title": "Phil Spencer Retiring, Sarah Bond Out, Matt Booty Promoted as Microsoft AI Exec Asha Sharma Named New Xbox Boss - EXCLUSIVE",
    "desc": "Big changes are being made at the top of Microsoft's gaming division.",
    "image": "https://assets-prd.ignimgs.com/2026/02/20/philspencer-blogroll-1771607774883.jpg?width=1280&format=jpg&auto=webp&quality=80",
    "source": "IGN"
  },
  {
    "title": "Conor Benn leaves Matchroom, Eddie Hearn to sign with Zuffa Boxing",
    "desc": "Conor Benn is the next big Zuffa Boxing signing, leaving Eddie Hearn and Matchroom amid war of words with Dana White",
    "image": "https://platform.mmafighting.com/wp-content/uploads/sites/109/2026/02/gettyimages-1358484649.jpg?quality=90&strip=all&crop=0%2C5.8656680473655%2C100%2C78.551390837002&w=1200",
    "source": "MMA Fighting"
  },
  {
    "title": "Guard axed to death over dispute",
    "desc": "Guard axed to death over dispute",
    "image": "https://i.tribune.com.pk/media/images/punjab-police1763070172-0/punjab-police1763070172-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Foreign music should inspire Ghanaian artistes, not cause concern - Samini",
    "desc": "Veteran dancehall musician Samini has added his voice to ongoing public complaints about the influence of foreign music in Ghana’s airwaves, urging local artistes to use the trend as motivation rather than see it as a threat.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/621/62181859.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Read Microsoft gaming CEO Asha Sharma’s first memo on the future of Xbox",
    "desc": "Asha Sharma, formerly head of development for Microsoft’s AI enterprise teams, will lead Microsoft Xbox and gaming. Here’s her first full memo.",
    "image": "https://platform.theverge.com/wp-content/uploads/sites/2/2026/02/asha-sharma-1536x1024-1.jpg?quality=90&strip=all&crop=0%2C0%2C100%2C78.534031413613&w=1200",
    "source": "The Verge"
  }
]