[
  {
    "title": "Set to Impress: X300 Pro with the 200 MP ZEISS APO Telephoto Camera and All-New OriginOS 6",
    "desc": "vivo has always expanded the possibilities of what mobile imaging can express, especially in professional photography, the area it knows best. Now, vivo",
    "image": "https://propakistani.pk/wp-content/uploads/2026/01/vivo-1.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Ireland invited to G20 leaders summit at Trump's golf resort in Miami",
    "desc": "It will be only the second time that Ireland participates in the global forum.",
    "image": "https://img2.thejournal.ie/article/6940313/river/?height=400&version=6940348",
    "source": "The Journal"
  },
  {
    "title": "*Brand New* - Challenge Handmade Gravel Tyres",
    "desc": "Brand New handmade gravel tyres, 260TPI, with slightly discoloured side wall(discoloured area size o...",
    "image": "https://media.bikehub.co.za/production/Media/MarketplaceItem/2025/855006/-def79c96.jpg",
    "source": "Bike Hub"
  },
  {
    "title": "Asake extends his record as artiste with most entries in Billboard Afrobeats Songs chart",
    "desc": "Nigerian singer, Asake has extended his record as the artiste with the most entries in Billboard U.S. Afrobeats Songs chart history. The Mr Money crooner",
    "image": "https://dailypost.ng/wp-content/uploads/2024/08/asake.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "CBN issues fresh directive to Nigerian banks on NAFDAC licenses for import",
    "desc": "The Central Bank of Nigeria (CBN) has issued a fresh directive instructing Nigerian banks to temporarily continue accepting National Agency for Food and",
    "image": "https://dailypost.ng/wp-content/uploads/2025/06/CBN.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "A New and Improved DSM? The American Psychiatric Association Shares Strategy and Roadmap",
    "desc": "Along with a new name, the new edition aims to address concerns and critiques of past DSM editions.",
    "image": "https://cdn.sanity.io/images/0vv8moc6/psychtimes/9bdc996f3db47536013fd75de45838def830028a-4504x2789.jpg",
    "source": "Psychiatric Times"
  },
  {
    "title": "Overtime, wages and downtime: why the Labour Law dispute has become critical for Latvia’s economy",
    "desc": "A compromise with trade unions on amendments to the Labour Law must be found, and negotiations should not be suspended once again.",
    "image": "https://bnn-news.com/wp-content/uploads/2026/01/round-clock-increasing-coins-wooden-desk-against-black-backdrop.jpg",
    "source": "Baltic News Network"
  },
  {
    "title": "TVS Motor Q3 FY26 results: Net profit jumps 49% YoY, clocks highest ever sales, revenue",
    "desc": "For the nine months ended December 2025, the operating revenue grew by 29% to ₹34,463 crore as against ₹26,701 crore for the nine months ended December 2024",
    "image": "https://assets.upstox.com/content/assets/images/news/tvs-motor-share-price-dec-30.webp",
    "source": "Upstox"
  },
  {
    "title": "Pakistan eyes mineral-led growth under CPEC 2.0, links mineral-rich regions to Gwadar: Ahsan",
    "desc": "ISLAMABAD, Jan 28 (APP):Federal Minister for Planning, Development and Special Initiatives Professor Ahsan Iqbal on Wednesday said Pakistan and China were",
    "image": "https://www.app.com.pk/wp-content/uploads/2026/01/ahsan.jpeg",
    "source": "Associated Press of Pakistan"
  },
  {
    "title": "CCTV at sea could dramatically…",
    "desc": "The Environmental Justice Foundation exists to protect the natural world and defend our basic human right to a secure environment.",
    "image": "https://ejfoundation.org/imager/media/190332/DJI_20250309155154_0131_edited-cropped_a6c5141cc54bf13eb3cff9f60a7e5c1b.jpg?mtime=1769521030",
    "source": "Environmental Justice Foundation"
  }
]