[
  {
    "title": "Liver Disease News: At-risk groups falling behind in global effort to eliminate hepatitis C",
    "desc": "A systematic review and meta-analysis assessed and compared HCV care cascades in four key populations: PLHIV, PWID, MSM, and incarcerated individuals.",
    "image": "https://www.eatg.org/wp-content/uploads/2025/07/6685574.png",
    "source": "European AIDS Treatment Group"
  },
  {
    "title": "Gaza conflict continues to cast shadow over Berlin Film Festival",
    "desc": "This year's edition has been marked by heated debate over Israel's atrocities in Palestinian territory",
    "image": "https://i.tribune.com.pk/media/images/ber1771714767-0/ber1771714767-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Poland Darts Open: Luke Littler thrashes Mike de Decker to reach last 16",
    "desc": "World champion Luke Littler ruthlessly sweeps aside Mike de Decker 6-1 to reach the last 16 at the Poland Darts Open in Krakow.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/573b/live/3380edb0-0f6f-11f1-b2d8-b16f92c9fce1.jpg",
    "source": "BBC"
  },
  {
    "title": "James Altucher Named a Leading Technology Expert following Recent Presentation",
    "desc": "Paradigm Press recognition reflects his role explaining how emerging technologies reshape industries, enterprise growth, and financial direction",
    "image": "https://www.manilatimes.net/theme_manilatimes/images/TMT_1920x1008.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "Erling Haaland was vital for Manchester City tonight.",
    "desc": "A selfless performance from a Manchester City star was crucial to his team's win over Newcastle. Erling Haaland was vital for City.",
    "image": "https://icdn.esteemedkompany.com/wp-content/uploads/2026/02/manchester-city-v-newcastle-united-premier-league-1.jpg",
    "source": "Esteemed Kompany"
  },
  {
    "title": "Wolves’ Rudy Gobert suspended one game for accruing seventh flagrant foul point",
    "desc": "Wolves’ Rudy Gobert has been suspended one game for accruing his seventh Flagrant Foul of the season",
    "image": "https://cdn.nba.com/manage/2026/02/Wilson_Basketball_1920x1080.jpg",
    "source": "NBA"
  },
  {
    "title": "Galaxy AI Expands Multi-Agent Ecosystem to Give Users More Choice and Flexibility",
    "desc": "Samsung continues to evolve its AI experience by adding a new AI agent across the Galaxy ecosystem to make everyday interactions easier",
    "image": "https://img.us.news.samsung.com/us/wp-content/uploads/2026/02/20164850/Galaxy-AI.png",
    "source": "samsung.com"
  },
  {
    "title": "Galaxy AI just picked up another AI weapon for the Galaxy S26",
    "desc": "Samsung is expanding Galaxy AI again. The Galaxy S26 will introduce a new AI agent integrated across apps, Bixby, and system features. - SamMobile",
    "image": "https://www.sammobile.com/wp-content/uploads/2025/11/Samsung-Galaxy-AI-1200x675.jpg",
    "source": "SamMobile"
  },
  {
    "title": "Doctors, hospital awarded RM1mil costs as negligence suit dismissed",
    "desc": "High Court says the award was justified as the 33-day trial involved searching cross-examination of several medical experts, and lengthy submissions.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/01/af99b948-kompleks-mahkamah-kuala-lumpur-fmt-resize-280126-1.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Email proves Charles was warned about his brother's 'secret deals': Whistleblower told Palace that Royal Family's name was being 'abused' by Andrew",
    "desc": "In a bombshell email, a whistleblower told the Palace that the former Duke had secret financial links to controversial millionaire financier David Rowland, who was abusing his royal links.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/21/22/106572685-0-image-a-25_1771712883571.jpg",
    "source": "Daily Mail"
  }
]