[
  {
    "title": "Clinical trial launched to test experimental intranasal spray against respiratory viruses",
    "desc": "Last year, at least one million people in the U.S. were hospitalized for respiratory virus illnesses like the flu or COVID-19, according to the Centers for Disease Control and Prevention.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/Respiratory-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Mount Maunganui landslide: Why Tauranga City Council commissioned external review",
    "desc": "An external review commissioned by Tauranga City Council into its own actions before the Mauao tragedy may find there was nothing it could have done to...",
    "image": "https://www.nzherald.co.nz/resizer/v2/HFTN5QWT2ZAEJAMZQ5CWMSCY7A.jpg?auth=ea5d3f1ef087998db75cc33f063b302474db30bd17ef3531e2623197dd10f617&width=1200&height=675&quality=70&focal=555%2C335&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Novel RNA molecule may influence patient survival in certain blood cancers",
    "desc": "In a recent study published in the Proceedings of the National Academy of Sciences (PNAS), researchers at the Texas A&M University Health Science Center (Texas A&M Health) identify a novel RNA molecule that plays a crucial role in preserving the integrity of a key cellular structure, nucleolus (a dense region of the cell containing a subset of crucial genetic material).",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/174318220-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "ANC Youth League puts pressure on Ramaphosa to deliver on promised Ekurhuleni university",
    "desc": "Youth league plans picket to address unmet educational commitments",
    "image": "https://www.timeslive.co.za/resizer/v2/7UIS3IBS6BL6RNOCQLHBDCOIXQ.jpg?smart=true&auth=f21323e36be52e7b63a08720041d22a644b6b5cd39a4fa2a1c163d5392d1315f&width=1200&height=630",
    "source": "TimesLIVE"
  },
  {
    "title": "Why Baloch women are taking up arms, raining death on Pak forces",
    "desc": "Balochistan violence latest news: Baloch women fighters played a key role in the BLA's recent coordinated attacks across Balochistan. The involvement of women in the Baloch armed movement is part of the broader trend. After peaceful protests over enforced disappearances and exploitations failed, with men jailed or killed, the once-silent Baloch women are picking up arms, and even turning suicide bombers.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/before-the-recent-attack-involving-two-baloch-women--the-trend-involving-female-fighters-had-begun-w-021508241-16x9_0.jpg?VersionId=SzrkOQIBfxrhTgO3V73Zkq8FeRB0QGsK",
    "source": "India Today"
  },
  {
    "title": "Auckland mayor Wayne Brown mocks government's proposal to cap rates",
    "desc": "Wayne Brown put on a cap saying 'RATES' in a self-described move to mock the proposal.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--AYrwKGEO--/t_tohu-badge-facebook/v1770084742/4JTSJB9_Wayne_brown_cap_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "IPB Lecturer Warns of Health Risks from Whip Pink Gas Abuse",
    "desc": "IPB University's Faculty of Medicine warned the public about the dangers of misusing Whip Pink, which contains nitrous oxide (N2O) gas.",
    "image": "https://statik.tempo.co/data/2026/02/03/id_1456716/1456716_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "New Nanomaterial Design Could Help Solar Tech Harness More Sunlight",
    "desc": "By using gold nanospheres engineered to capture light across the solar spectrum, researchers at Korea University took a step toward lowering barriers to more efficient and cost-effective renewable energy harvesting.",
    "image": "https://cdn.sci.news/images/2026/02/image_14528-Supraballs.jpg",
    "source": "Sci.News"
  },
  {
    "title": "In for Media Production Suite – Sports Video Group",
    "desc": "Panasonic Entertainment & Communication Co., Ltd. announces Image Adjust Pro, a new plug-in for its Media Production Suite platform. Designed for large, complex multi-camera production environments, Image Adjust Pro functions...",
    "image": "https://www.sportsvideo.org/wp-content/uploads/2026/02/panasonic-960x480.webp",
    "source": "Sports Video Group"
  },
  {
    "title": "University of North Carolina Athletics",
    "desc": "Quick takeaways from the first meeting with the Orange.",
    "image": "https://images.sidearmdev.com/resize?url=https%3A%2F%2Fdxbhsrqyrr690.cloudfront.net%2Fsidearm.nextgen.sites%2Func.sidearmsports.com%2Fimages%2F2026%2F2%2F2%2FBogavac_Luka.syr.121.jpg&width=1600&type=jpeg",
    "source": "University of North Carolina Athletics"
  }
]