[
  {
    "title": "Blizzard warnings in New York City, Northeast as snowstorm takes aim",
    "desc": "A high impact nor’easter is about to crush the region with serious snow and strong winds.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/web-storm-setup-0220.png?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "India vs South Africa: T20 World Cup Super Eights - teams, start, lineups",
    "desc": "Defending champions and co-hosts India face debut-title chasing South Africa in rematch of last T20 World Cup final.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/AFP__20260221__98FL2HF__v1__MidRes__CricketIccMensT20Wc2026IndPractice-1771677182.jpg?resize=1200%2C630",
    "source": "Al Jazeera"
  },
  {
    "title": "Man who sexually abused his children jailed for 20 years",
    "desc": "A man who sexually abused five of his children, who were locked in a room for days at a time without food and forced to drink urine, has been jailed for 20 years.",
    "image": "https://www.rte.ie/images/0023ecab-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Bodies found in Eryri mountain range during search for two missing men",
    "desc": "An \"extensive multi-agency operation\" was carried out in full winter conditions to find two men aged 19 and 20, says the head of a rescue team.",
    "image": "https://e3.365dm.com/26/02/1600x900/skynews-snowdon-snowdon-massif_7170808.jpg?20260221115332",
    "source": "Sky News"
  },
  {
    "title": "Tanzania set strategies to protect homes, farms against wild animals pests",
    "desc": "DODOMA: THE Tanzanian government will continue to collaborate with conservation stakeholders in strengthening the protection of protected areas in parallel with addressing the challenge of wild animals and pests that invade farms and people's homes. This was stated by the Deputy Minister of Natural Resources and Tourism, Hamad Hassan Chande, in Dodoma when he met",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-21-at-12.42.28-1.jpeg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Canada's Reece Howden rips 'absolute joke' conditions in Olympic men's ski cross final",
    "desc": "It was an unexpected early end for Canada's men's ski cross team at the Milano-Cortina Olympic Winter Games on Saturday in Livigno, Italy. All four of Canada's entries did not advance past the quarterfinals – including reigning World Cup Crystal Globe winner Reece Howden.",
    "image": "https://i.cbc.ca/ais/99b4c972-c297-4c10-b903-e0d54ff8a711,1771676321104/full/max/0/default.jpg?im=Crop%2Crect%3D%28963%2C1029%2C3940%2C2216%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Andrew Mountbatten-Windsor secret titles from Palace staffers laid bare",
    "desc": "Floodgates seemed to have opened for everyone who has ever worked with Andrew Mountbatten-Windsor, following the humiliating arrest of the ex-prince.Palace staff, who have been encouraged to come forward if they knew anything at all...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-21/l_652167_055607_updates.jpg",
    "source": "Geo TV"
  },
  {
    "title": "Challenges await Prime Minister Mwigulu on Arusha visit",
    "desc": "As Prime Minister, Dr Mwigulu Nchemba, prepares for a three-day official visit to Arusha region, local residents have shared their expectations for the tour.",
    "image": "https://www.thecitizen.co.tz/resource/image/5367468/landscape_ratio3x2/1200/800/c356bd4f6eaa2e34fcf760609d701bd9/jN/nchemba-pic.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Defence force member killed on Karibib road",
    "desc": "A member of the Namibian Defence Force died after he was hit by a vehicle on the C33 road near Karibib on Friday. Immanuel Samoa (39) […]",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/Nampol-Siren.jpg",
    "source": "The Namibian -"
  },
  {
    "title": "Katseye’s Manon Bannerman taking ‘temporary hiatus’ to focus on wellbeing",
    "desc": "The six-member girl group, known for songs such as Touch and Gnarly, was formed in 2023 on the rigorous competition show The Debut: Dream Academy.",
    "image": "https://www.warringtonguardian.co.uk/resources/images/20570604.jpg?type=og-image",
    "source": "Warrington Guardian"
  }
]