[
  {
    "title": "Jiri Prochazka fights Carlos Ulberg for light heavyweight title in UFC 327 main event as Alex Pereira vacates",
    "desc": "Jiri Prochazka and Carlos Ulberg are set to fight for the UFC light heavyweight title with Alex Pereira exiting the division.",
    "image": "https://platform.mmafighting.com/wp-content/uploads/sites/109/2026/01/gettyimages-2239285341.jpg?quality=90&strip=all&crop=0%2C3.0697845650846%2C100%2C77.320113051939&w=1200",
    "source": "MMA Fighting"
  },
  {
    "title": "Famous Male Idol Gets Accused Of Cheating With Adult Entertainment Workers - Shocking Details Exposed",
    "desc": "A well-known male idol has been accused of having inappropriate relationships with adult entertainment industry workers while dating his girlfriend. On the 27th, Ms. A posted on social media exposing…",
    "image": "https://image.koreaboo.com/2026/02/Silhouette-FI-1.jpg",
    "source": "Koreaboo"
  },
  {
    "title": "Diaspora youth activists fear retribution over anti",
    "desc": "ZIMBABWEAN youth activists based in the United Kingdom and the wider diaspora claim they are being targeted for retribution by State authorities for organising campaigns opposing the controversial “2030 Agenda” to extend President Emmerson Mnangagwa’s term of office. Sources within diaspora civic networks told this publication that several young Zimbabweans involved in online mobilisation efforts […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/02/28040940/Kudzai-Weston-Saruwaka-and-Blessed-Geza-872x420-1-e1772251805402.jpg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "Watch: Rocket Lab blasts off on hypersonic mission for US Department of War",
    "desc": "Rocket Lab has launched its latest HASTE rocket from Virginia, deploying a scramjet-powered aircraft in a US hypersonic test mission.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--c61J3oJN--/t_tohu-badge-facebook/v1772246068/4JSHVIM_55119602753_8250424440_o_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Dow Jones Futures: Trump's Anthropic Move Hits Market ETFs; Don't Forget S&P 500's Hottest Stocks",
    "desc": "Dow Jones futures: The major indexes are below support, with key ETFs falling on Trump's Anthropic move. The S&P 500's top stocks are setting up.",
    "image": "https://www.investors.com/wp-content/uploads/2020/03/stock-bull-bear-reflect-01-adobe.jpg",
    "source": "Investor's Business Daily"
  },
  {
    "title": "CGTN: How China's path of democracy safeguards people's rights and interests",
    "desc": "/CNW/ -- A legislative outreach office in Shanghai's Changning District, established in 2015 in the Hongqiao Subdistrict by the Legislative Affairs Commission...",
    "image": "https://www.newswire.ca/content/dam/cision/icons/favicon.png",
    "source": "Newswire Canada"
  },
  {
    "title": "Watch as Asiedu Nketiah jabs Ntim Fordjour over cocoa pod display at SONA",
    "desc": "A lighthearted exchange outside the Chamber of Parliament briefly cut through the ‘chaos’ that had filled the House during President John Dramani Mahama’s State of the Nation Address on February 27, 2026.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/181/18153147.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "OpenAI strikes deal with Pentagon after Anthropic blacklisted by Trump",
    "desc": "OpenAI CEO Sam Altman said on X that his company has come to terms with the Defense Department for use of its models.",
    "image": "https://image.cnbcfm.com/api/v1/image/108267416-1772222217094-108267416-1771518692599-gettyimages-2261852386-INDIA_AI_SUMMIT.jpeg?v=1772251604&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Top 5 books about Charles Dickens, chosen by Annie Elliot",
    "desc": "Books to help readers better understand the novels of Charles Dickens, from his traumatic childhood to relationships with women",
    "image": "https://www.bigissue.com/wp-content/uploads/2026/02/charles_dickens_by_frith.gif",
    "source": "Big Issue"
  },
  {
    "title": "85-year-old woman in Singapore who made illegal right turn against flow of traffic fined S$4,000",
    "desc": "SINGAPORE: While driving her friend home after dinner in 2024, an 83-year-old woman made an illegal right turn from Nicoll Highway into Bras Basah Road, against the flow of traffic. She hit another car, leaving its 41-year-old female passenger with a fractured rib.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/28/3791467.jpg",
    "source": "The Star"
  }
]