[
  {
    "title": "Jean O' Callaghan",
    "desc": "The death has occurred of Jean O' Callaghan (née Quin) of Lahinch, Clare Ireland, on 06/02/2026. You can view the full death notice and add your condolences here.",
    "image": "https://img-dedicated.rip.ie/w188/1000009192_0dbc748d56cede5db7d8879f3e4778069c59e0bde744cf69.jpg",
    "source": "RIP.ie"
  },
  {
    "title": "Israeli Settlers, Military Accelerate Violent Expulsion of Palestinians Off Their Land in the West Bank",
    "desc": "What was once creeping encroachment by settlers has escalated over the past three years into a state-backed campaign of mass expulsion.",
    "image": "https://substackcdn.com/image/fetch/$s_!kAT0!,w_1200,h_675,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Ff773fdff-9008-45a5-a309-29ca8792c06d_4200x2800.jpeg",
    "source": "Drop Site News"
  },
  {
    "title": "Xavier Rudd on visiting Echuca, playing solo, and the spiritual being that follows him",
    "desc": "Xavier Rudd performs solo these days, but he carries a spirit with him wherever he goes.",
    "image": "https://live-production.wcms.abc-cdn.net.au/f7f59866c7151b842d629b237a550576?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=460&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "NASA Telescope Discovers Nearby Planet With Deep Similarities to Earth",
    "desc": "A new candidate exoplanet appears to almost uncanny similarities to Earth — but may differ in at least one major way.",
    "image": "https://futurism.com/wp-content/uploads/2026/02/far-away-planet-earth-chilling.jpg?quality=85&w=1200",
    "source": "Futurism"
  },
  {
    "title": "Samsung Galaxy M36 vs iQOO Z10R: Which is the better smartphone?",
    "desc": "The competition in the sub-₹20,000 smartphone market intensifies as both the Samsung Galaxy M36 and the iQOO Z10R arrive with robust chipsets, decent battery capacity, vlog-ready cameras, and more.",
    "image": "https://staticg.sportskeeda.com/editor/2026/02/1bcdc-17704653651149-1920.jpg",
    "source": "Sportskeeda Tech"
  },
  {
    "title": "Ostrava Open: Katie Boulter wins title with three-set win against Tamara Korpatsch",
    "desc": "Britain's Katie Boulter claims her fourth WTA Tour title with a three-set victory against Tamara Korpatsch at the Ostrava Open on Saturday.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7143/live/2c91c6a0-044d-11f1-86ba-e1ed7e3e3e31.jpg",
    "source": "BBC"
  },
  {
    "title": "OTEC FMs news anchor Akwasi Achiaw laid to rest",
    "desc": "The late OTEC FM news anchor, Akwasi Owusu Achiaw, popularly known as Martin Yahaya, was laid in state on Saturday, February 7, 2026, at the Asewaase Methodist School Park.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/653/65381426.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Ablekuma North MP speaks on daily struggles of cancer patients and families",
    "desc": "The Member of Parliament for Ablekuma North, Ewurabena Aubynn, has pointed out the daily struggles of cancer patients in her constituency.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/118/11831537.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Video Ezy: The complete story of Australia’s forgotten franchise",
    "desc": "Details have come to light of how one time Aussie retail empire Video Ezy really came crashing down – and the killing blow wasn’t what you’d think.",
    "image": "https://www.realcommercial.com.au/news/wp-content/uploads/2026/02/capi_c43aa4b960e1f809159cdf6dc1fee791_d7d8d9808f15316fca14fc319e0b47ba-768x576.jpeg",
    "source": "Real Commercial"
  },
  {
    "title": "Chelsea player ratings vs Wolves: Write off Cole Palmer at your peril! Ice-cold England forward shuts up critics with devastating reminder of his class",
    "desc": "Chelsea beat Wolves 3-1 as Cole Palmer bagged a first-half hat-trick - here's GOAL's player ratings from Molineux",
    "image": "https://assets.goal.com/images/v3/getty-2260391228/crop/MM5DGOJRGQ5DEMRQGI5G433XMU5DAORSGA2A====/GettyImages-2260391228.jpg",
    "source": "Goal.com"
  }
]