[
  {
    "title": "Supreme Court nullifies Liberal single-vote election win in Montreal-area riding",
    "desc": "The Supreme Court of Canada annulled the results of a closely contested riding from last spring's election on Friday.",
    "image": "https://i.cbc.ca/ais/3046d709-bf44-4a9f-9b1e-4f3db0ea4068,1771006544869/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C104%2C5328%2C2997%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Marty Williamson Reflects on Logan Thompson's Journey as He Prepares to Start for Canada Against Switzerland at Olympics",
    "desc": "Marty Williamson, general manager of the Barrie Colts, holds a unique perspective as Logan Thompson prepares to take the ice as the starting goalie for Team",
    "image": "https://news.ssbcrack.com/wp-content/uploads/2026/02/Marty-Williamson-Reflects-on-Logan-Thompsons-Journey-as-He-Prepares.JPGw1200h800modecrop.jpeg",
    "source": "SSBCrack News"
  },
  {
    "title": "Inga Ibsdotter Lilleaas on Sentimental Value & Bad Bunny's Super Bowl",
    "desc": "Inga Ibsdotter Lilleaas talks \"Sentimental Value,\" Bad Bunny’s Super Bowl Halftime performance and Oscar season.",
    "image": "https://variety.com/wp-content/uploads/2026/02/P1040UQ9.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Here's everything new in Android 17 Beta 1 [Gallery]",
    "desc": "Google today officially announced Android 17 Beta 1 for Pixel devices. This joins the stable Android 16 QPR2 release and...",
    "image": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2026/02/Android-17-6.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "source": "9to5Google"
  },
  {
    "title": "How Measurement Can Fix Content Moderation's Language Equity Gap",
    "desc": "Of roughly 7,000 global languages, only a handful are thriving digitally, write Sasha Maria Mathew and Sujata Mukherjee.",
    "image": "https://cdn.sanity.io/images/3tzzh18d/production/17553f415f776d05deab3ca78d16fa365a847b5a-1200x675.png",
    "source": "Tech Policy Press"
  },
  {
    "title": "How Do Athletes Train to Avoid Altitude Sickness?",
    "desc": "At the Milano Cortina 2026 Olympics, venues clustered around Cortina d’Ampezzo span a dramatic vertical range.",
    "image": "https://news.northeastern.edu/wp-content/uploads/2026/02/2026_Olympics_1400.jpg",
    "source": "Northeastern Global News"
  },
  {
    "title": "After Refusing to Cancel Her Super Bowl Sunday Wedding, Bride Makes Bad Bunny's Halftime Show Part of Her Big Day (Exclusive)",
    "desc": "Mia McClain went viral last fall for refusing to cancel her Super Bowl Sunday wedding",
    "image": "https://s.yimg.com/ny/api/res/1.2/J7aph1GZui0cCooCnPwuTw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA7Y2Y9d2VicA--/https://media.zenfs.com/en/people_218/06ad37b4196e393cc31af749781ea621",
    "source": "Yahoo News Canada"
  },
  {
    "title": "ETHIOPIA: Peace Forum Concludes in Borana Zone, Ethiopia",
    "desc": "Habtamu Abrdew Beture\nThe multi-stakeholder Peace Forum, which fostered stability and social cohesion, successfully concluded on Saturday, February 7, at the Pastoralist Technical and Vocational Training College in Yabello.\nThe event was organized by the Spiritan Community Service in Ethiopia (SCORE), Borana office, under the umbrella of the Borana Integrated Community Development Project (BICDP Phase-2) and the Multi-Actor Partnership (MAP) project.\nThe forum brought together a diverse group of leaders and community representatives committed to building a culture of non-violence.\nParticipants engaged in active dialogue focused on practical strategies to strengthen peace at both the grassroots and regional levels. The discussions centered on four critical areas, which are leveraging the wisdom of the Gadaa system and local customs to settle disputes, empowering these key groups to lead peacebuilding initiatives within their neighbourhoods, strengthening mechanisms to detect and prevent potential conflicts before they escalate, and acknowledging the vital need to maintain peace along the Ethiopia-Kenya border to ensure regional stability.\nThis forum has reaffirmed our collective commitment to preventing conflict and fostering unity across the Borana Zone and beyond, organizers noted during the closing ceremony.\nThe forum concluded with a shared pledge to enhance coordination between the government, civil society, and traditional community structures. By aligning these different sectors, the initiative aims to create a sustainable framework for social harmony and development.\nSCORE expressed its heartfelt gratitude to all stakeholders for their dedication to building a peaceful future, emphasizing that such collaboration is essential to the region's long-term prosperity.",
    "image": "https://communications.amecea.org/wp-content/uploads/2016/05/cropped-AMECEA-LOGO-32x32.jpg",
    "source": "AMECEA"
  },
  {
    "title": "In a first, US women beat powerhouse Canada in curling at Winter Olympics",
    "desc": "The U.S. women’s curling team was surprised to learn that their defeat of Canada marked an Olympic first.",
    "image": "https://dims.apnews.com/dims4/default/5043dc3/2147483647/strip/true/crop/7905x5267+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F11%2F6c%2Fb47980a40a18c05d34bba93b3731%2F4b1045921c734273b1e84b535fcb0806",
    "source": "AP News"
  },
  {
    "title": "Antidepressants May Safeguard Against Preterm Birth Risks",
    "desc": "New research explores the risks and benefits of SSRI use during pregnancy, highlighting a link to gestational diabetes and protection against preterm birth.",
    "image": "https://neurosciencenews.com/files/2026/02/ssri-preterm-birth-diabetes-neuroscience.jpg",
    "source": "Neuroscience News"
  }
]