[
  {
    "title": "Manila crime drops 13% as Mayor Moreno pledges continued support for MPD",
    "desc": "Manila City reported a 13.08% drop in overall crime incidents in the fourth quarter of 2025, Mayor Francisco “Isko” Moreno Domagoso announced during the 125th Founding Anniversary of the Manila Police District (MPD). Cases fell from 2,110 in the third quarter to 1,834 in the fourth, while crime s...",
    "image": "https://dzrh-bucket.s3.ap-southeast-1.amazonaws.com/featuredimage/2026/2/rS_4YRLcgjsVrSw7pbMG0.jpeg",
    "source": "DZRH"
  },
  {
    "title": "Sabah court rejects ‘crime of passion’ claim, sentences man to hang for killing ex-girlfriend in Kota Kinabalu mall",
    "desc": "KOTA KINABALU, Feb 14 — A 33-year-old personal assistant of an international firm was sentenced to death by hanging for the murder of a salesgirl three years ago.Justice Datuk...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/14/325467.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "Type Headache in Brazzaville: Prevalence and Sociodemographic Profile from a Cross",
    "desc": "Background: Tension-type headache (TTH) is the most common primary headache disorder worldwide. Urbanization, psychological stressors, and sociocultural factors may influence its epidemiology in Africa. Methods: A cross-sectional, population-based study was conducted in Brazzaville via proportional stratified sampling across the city’s nine districts. Data were collected through a standardized questionnaire and clinical interviews based on the International Classification of Headache Disorders (ICHD-III). The 3-month and 1-year prevalence rates of TTH and its subtypes were estimated. Results: Among the 1650 eligible individuals, 1611 participated (response rate: 97.6%). Primary headaches were reported by 15% of the respondents, 66.5% of whom were diagnosed with TTH. The 3-month prevalence of TTH was 10% [95% CI: 8.5% - 11.5%], adjusted to 9.5% [95% CI: 8.1% - 10.9%] after correction for age and sex, and the adjusted 1-year prevalence was 23% [95% CI: 20.9% - 25.1%]. TTH was episodic (77.6%) or chronic (22.4%), and 33.5% of the participants presented with pericranial tenderness. The median age of participants with TTH was 37 years. The majority were women (male-to-female ratio = 1:2.3), single (51.6%), and employed (54%). Most had secondary (46%) or higher (39.1%) education and reported low (42.9%) or moderate (43.5%) socioeconomic status. Conclusion: TTH is prevalent in Brazzaville, predominantly affecting young, single, educated, and working women living in densely populated areas. Its multifactorial nature underscores the need for targeted prevention and improved headache care strategies in urban African settings.",
    "image": "https://file.scirp.org/image/wjns2016071410205994.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "US drinking water kiosks sometimes contain elevated lead levels",
    "desc": "After high-profile water crises like the one in Flint, Michigan, some Americans distrust the safety of tap water, choosing to purchase drinking water from freestanding water vending machines or kiosks.",
    "image": "https://www.news-medical.net/image-handler/picture/2018/7/shutterstock_1016603317_913529de2164475183968b0534c69347-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Motorcyclist killed in Thailand accident was carrying Valentine's Day gift from girlfriend",
    "desc": "A man in Nonthaburi, Thailand, died in a motorcycle accident on Wednesday (Feb 11) shortly after receiving a Valentine's Day present from his girlfriend.According to Thai media outlet Khaosod, police from Bang Bua Thong station were alerted to the single-vehicle accident at 1am and discovered the body of Narin Suksusom, 26, near the road divider.In the vicinity was a black...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/260214_accident.png?itok=Pxzcmorx",
    "source": "AsiaOne"
  },
  {
    "title": "Carney tells Tumbler Ridge residents that Canadians 'will always be with you' following mass shooting",
    "desc": "Canadian Prime Minister Mark Carney told grieving residents of Tumbler Ridge, British Columbia that Canadians \"will always be with you\" at a vigil to mourn victims of one of the country's worst mass shootings.",
    "image": "https://images.gmanews.tv/webpics/2026/02/Canadashooting_2026_02_14_12_00_02.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Austrian police probe alleged glassing attack on two Irish brothers",
    "desc": "The incident happened in a ski resort in west Austria on Wednesday - and the two brothers were both allegedly hit in the face with a glass, one was hospitalised.",
    "image": "https://i2-prod.irishmirror.ie/article12108397.ece/ALTERNATES/s1200/1_GettyImages-135560781.jpg",
    "source": "Irish Mirror"
  },
  {
    "title": "High Court reduces jail sentence for man who defiled 14-year-old girl",
    "desc": "Judge cut jail term to statutory minimum of 20 years, noting Amai was first-time offender",
    "image": "https://cdn.radioafrica.digital/image/2026/02/79e49463-4ba4-4d92-b86b-00b4530fa0cc.jpeg?1771042502407",
    "source": "the-star.co.ke"
  },
  {
    "title": "Malixi back in hunt as leaders crumble in bizarre finish",
    "desc": "If the third-round finish was any indication, then brace for a wilder, stranger finale to this year’s Women’s Amateur Asia-Pacific Championship in New Zealand.",
    "image": "https://media.philstar.com/photos/2024/02/01/rianne-malixi_2024-02-01_16-26-33.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Stock market crash: Sensex may touch 60,000 by the end of FY27 if....say experts",
    "desc": "Stock market crash: If the experts' claim holds well, the Nifty 50 index may touch 18,000 by the end of March 2027",
    "image": "https://www.livemint.com/lm-img/img/2026/02/14/1600x900/logo/Stock_market_crash_Sensex_today_Nifty_50_US_econom_1771040934074_1771040934213.jpg",
    "source": "Mint"
  }
]