[
  {
    "title": "Schedule, how to watch live",
    "desc": "Discover what you need to know about the ice dance competition at Milano Cortina 2026, as Americans Madison Chock and Evan Bates look to turn three-straight world titles into Olympic gold",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/tcvuvheotfghqfx4soxb",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Toddler opens car door, causes 6-vehicle accident on Jalan Tun Razak",
    "desc": "Kuala Lumpur traffic police say one motorcyclist suffered a broken arm in the accident, while another sustained minor injuries.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/3fa623b1-jatuh-motor-ss-080226.webp",
    "source": "freemalaysiatoday.com"
  },
  {
    "title": "Alibaba’s ‘Wonder on Ice’ brings interactive AI showcase to Milano Cortina 2026",
    "desc": "Worldwide Olympic Partner Alibaba has opened Wonder on Ice, a new interactive public showcase at the Milano Cortina 2026 Olympic Winter Games that uses artificial intelligence (AI) and cloud computing to create an immersive fan experience.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/ldkrsci6njjuub2nmr4w",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Eurostat: 86.1% of Bulgarians own their own home",
    "desc": "In 2025, a total of 86.1 per cent of Bulgarians owned their own home, according to figures posted by European Union statistics agency Eurostat. The percentage has been largely unchanged since Euros…",
    "image": "https://sofiaglobe.com/wp-content/uploads/2024/07/Rows-of-houses-all-bearing-down-on-me-crop.jpg",
    "source": "The Sofia Globe"
  },
  {
    "title": "Russian investigators claim Ukraine behind assassination attempt on top general",
    "desc": "Russia’s Investigative Committee has accused Ukrainian intelligence of being behind the assassination attempt on a Russian general in Moscow on Friday – and says the alleged perpetrator was arrested in Dubai after fleeing Moscow.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap26037499511634.jpg?c=16x9&q=w_800,c_fill",
    "source": "cnn.com"
  },
  {
    "title": "New Zealand and South Africa add Perth gold to their HSBC SVNS collections",
    "desc": "Black Ferns Sevens beat Australia in Perth to claim their third HSBC SVNS title of the season, while Blitzboks hang tough to win a physical encounter with Fiji for their second.",
    "image": "https://resources.worldrugby-rims.pulselive.com/worldrugby/photo/2026/02/08/6862e1cb-0457-48d4-8864-4d801119bee9/HSBC-SVNS-Perth-winners-2026.jpeg",
    "source": "HSBC SVNS Series"
  },
  {
    "title": "2026 commercials with A.I. slop from Meta, Google, and Anthropic",
    "desc": "We’ve seen this game before, and it doesn’t end well for anyone.",
    "image": "https://compote.slate.com/images/39d794ba-8860-4a67-95d3-a1f192f98d5c.jpeg?crop=1560%2C1040%2Cx0%2Cy0&width=1560",
    "source": "Slate"
  },
  {
    "title": "Apple's Messages app to support end-to-end encrypted RCS messages",
    "desc": "Apple is set to introduce end-to-end encryption with RCS in its forthcoming iOS 26 update, enhancing the security of its Messages app.",
    "image": "https://i.cdn.newsbytesapp.com/images/l95920260208161413.jpeg",
    "source": "NewsBytes"
  },
  {
    "title": "Anti graft organizations train journalists to protect whistle-blowers, fight financial crimes",
    "desc": "By Rihana Adam, GNA Accra, Feb. 5, GNA – Two anti graft organizations have organized a three-day training programme for investigative journalists to strengthen their reportage on illicit…",
    "image": "https://gna.org.gh/web/wp-content/uploads/2022/04/cropped-cropped-WhatsApp-Image-2022-04-06-at-7.25.37-AM-150x150.jpeg",
    "source": "Ghana News Agency"
  },
  {
    "title": "Watch Fatawu Issahaku's goal against Birmingham City in English Championship",
    "desc": "Black Stars winger, Abdul Fatawu Issahaku was on the scoresheet in Leicester City's defeat to Birmingham City in the English Championship on Saturday, February 7, 2026.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/498/49822497.jpg",
    "source": "GhanaWeb"
  }
]