[
  {
    "title": "Tirupati researcher shows AI can detect cervical cancer, suicidal tendency",
    "desc": "Tirupati researcher Lalasa Mukku demonstrates AI's potential to detect cervical cancer and prevent youth suicidal tendencies through innovative image analysis.",
    "image": "https://th-i.thgim.com/public/incoming/s4dnxs/article70642503.ece/alternates/LANDSCAPE_1200/10745_17_2_2026_14_47_31_1_IMG_20260217_WA0078.JPG",
    "source": "The Hindu"
  },
  {
    "title": "Winter Olympics 2026: Can Mikaela Shiffrin reclaim slalom gold 12 years after Sochi 2014?",
    "desc": "The women’s slalom will be the U.S. skier’s last chance to win a medal at Milano Cortina 2026, and she’s determined to “turn nervousness into intensity” on the big day.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/obppckfb6uisesxgesk7",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Young Pastoralists Lead Sustainable Rangeland Development in IYRP 2026",
    "desc": "More than 150 young pastoralists from Uganda, Kenya, Tanzania, Ethiopia, and South Sudan recently pledged to lead rangelands and pastoralism toward a peaceful and prosperous future. During a November 2025 gathering, the youth adopted the “Kobebe Declaration,” advocating for the full implementation of the IGAD Transhumance Protocol, a regional framework ensuring the free and orderly",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Seven ways to spiritually prepare for 2026 Ramadan",
    "desc": "The Nation Newspaper Seven ways to spiritually prepare for 2026 Ramadan",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/02/17111114/Ramadan.jpg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "New OC-PAM AI tool tracks cancer organoid drug response",
    "desc": "Explore the OC-PAM AI tool that revolutionizes cancer research with non-invasive imaging of organoids and spheroids.",
    "image": "https://www.drugtargetreview.com/wp-content/uploads/shutterstock_2732078521.jpg",
    "source": "Drug Target Review"
  },
  {
    "title": "Op Corona January seizures total millions in contraband, drugs and stolen vehicles",
    "desc": "Basotho smugglers carrying R14.5 million plus of contraband found their access to South African consumers summarily halted by South African National Defence",
    "image": "https://defenceweb.co.za/wp-content/uploads/2024/11/SANDF_soldiers_river_border_patrol_SANDF.jpg",
    "source": "defenceWeb"
  },
  {
    "title": "Duterte won't participate in ICC confirmation hearing via video, says Kaufman",
    "desc": "“The former President will not participate in the confirmation hearing through video-conferencing. Nor did the former President willingly appear by way of such technology at his initial appearance,\" Kaufman told GMA Integrated News.",
    "image": "https://images.gmanews.tv/webpics/2025/09/Duterte_ICC_2025_09_18_08_35_25.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Heat waves that push up atmospheric nanoparticle levels might explain higher death tolls",
    "desc": "Counter-intuitive finding suggests particle formation from natural and anthropogenic organic compounds might increase during extreme heat events",
    "image": "https://d2cbg94ubxgsnp.cloudfront.net/Pictures/1024x536/5/0/0/545500_wc_09_02_gettyimages1430075071_819962.jpg",
    "source": "Chemistry World"
  },
  {
    "title": "Sifuna Warns Sakaja Ahead of Cooperation Agreement Signing at State house",
    "desc": "This is the second time the Nairobi County Government has been transferred to the National Government, with the last time it happened being under Mike Mbuvi Sonko in 2020, during the leadership of Uhuru Kenyatta.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/sifuna-sakaja.jpg?itok=6H--UwVv",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "Benedetta Porcaroli to star in the Closing Ceremony of Milan Cortina 2026",
    "desc": "On February 22nd, the actress will take part in the Olympic Grand Finale at the Verona Arena.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/hr5xauhzn8kdfv4fediy",
    "source": "Milano Cortina 2026"
  }
]