[
  {
    "title": "‘Robin Hood’ set to return at MGM+",
    "desc": "Season 2 will expand the story beyond Sherwood Forest and Nottingham into the royal courts of England, France and Rome",
    "image": "https://i.tribune.com.pk/media/images/robinhood1771972445-0/robinhood1771972445-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "‘Abolish ICE’ Wins Chicago’s Snowplow Naming Contest",
    "desc": "An annual contest usually draws lighthearted quips. This year, Chicagoans chose a political pun.",
    "image": "https://static01.nyt.com/images/2026/02/24/multimedia/24nat-chicago-snowplow-1-kcfv/24nat-chicago-snowplow-1-kcfv-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "'Only Living Pickpocket in New York' Sells After Sundance Premiere",
    "desc": "'The Only Living Pickpocket in New York' has sold to Sony Pictures Classics after its Sundance Film Festival premiere.",
    "image": "https://variety.com/wp-content/uploads/2026/01/The_Only_Living_Pickpocket_in_New_York.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Wittenoom traditional owners launch $1.5b asbestos contamination claim against WA government",
    "desc": "Banjima traditional owners say the thousands of hectares left poisoned by decades of asbestos mining have caused one of the highest death rates of mesothelioma in the world.",
    "image": "https://live-production.wcms.abc-cdn.net.au/f510e9142386c3b27ef8a623f27cdc2b?impolicy=wcms_watermark_news&cropH=2160&cropW=3840&xPos=128&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "India seeks self-reliance in containers; but has The Great Wall to climb",
    "desc": "Nearly every product that crosses oceans travels in a steel container — and for decades, India was largely absent from this quiet yet critical industry, dominated by China. But container shortages during the pandemic forced a rethink. Today, as domestic manufacturers close the gap on quality and delivery, the challenge is no longer capability, but scale — and whether India can match China on price.",
    "image": "https://img.etimg.com/thumb/msid-128757718,width-1070,height-580,imgsize-74532/photo.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "CMS saved $2 billion by using AI to fight fraud, official says",
    "desc": "Centers for Medicare and Medicaid Services COO Kim Brandt talked about her agency’s use cases for artificial intelligence in the ongoing battle against ...",
    "image": "https://cdn.nextgov.com/media/img/cd/2026/02/24/022426BrandtNG/open-graph.jpg",
    "source": "Nextgov/FCW"
  },
  {
    "title": "Ali May on Macrophages, Branching Organs, and Developmental Crosstalk",
    "desc": "On Thursday, Feb. 19, Ali May, an assistant professor at the Icahn School of Medicine at Mount Sinai presented her research on the various ways tissue resident macrophages shape embryonic salivary gland development as part of the Department of Biology Seminar Series.",
    "image": "https://snworksceo.imgix.net/jhn/6aa52ae9-6e6c-4c7b-ba7d-fb0839b5c513.sized-1000x1000.png?w=800&h=600",
    "source": "The Johns Hopkins News-Letter"
  },
  {
    "title": "Chevy Corvette ZR1 Sets Car And Driver's New Lightning Lap Record, Beats McLaren Senna By 0.7 Seconds",
    "desc": "This isn't one of those, \"Sure it's quick in a straight line, but what about corners?\" conversations that people normally have about cheap American performance.",
    "image": "https://www.jalopnik.com/img/gallery/corvette-zr1-sets-car-and-drivers-new-lightning-lap-record-beats-mclaren-senna-by-0-7-seconds/l-intro-1771972056.jpg",
    "source": "Jalopnik"
  },
  {
    "title": "NNPC to export new crude grade, Cawthorne, in March",
    "desc": "The Nigerian National Petroleum Company (NNPC) Limited will commence exportation of Cawthorne, a new light, sweet crude grade, from the end of March.",
    "image": "https://www.thecable.ng/wp-content/uploads/2025/01/crude-oil1-scaled-e1747244107412.jpg",
    "source": "TheCable"
  },
  {
    "title": "Brazil floods and landslides kill at least 25 in Minas Gerais",
    "desc": "Hundreds of people have been displaced and dozens are missing, with rescue operations still ongoing in Juiz de Fora.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ab29/live/1c7202c0-1191-11f1-9120-a910fc22c6ac.jpg",
    "source": "BBC"
  }
]