[
  {
    "title": "British man in his 70s arrested in Australia over alleged cruise ship assault",
    "desc": "A﻿ British man aged 71 has been arrested after allegedly assaulting somebody on a cruise ship. The man was ...",
    "image": "https://imageresizer.static9.net.au/1S52RZ3R0VZevnRrrkWV0W9t_Os=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F1b3ab375-4367-4d71-9dc6-998a38fd633a",
    "source": "9News.com.au"
  },
  {
    "title": "This Moto G 2026 carrier deal makes a lot of sense right now",
    "desc": "Easy to pick one up for less",
    "image": "https://static0.anpoimages.com/wordpress/wp-content/uploads/wm/2025/12/img_1433.jpg?w=1600&h=900&fit=crop",
    "source": "Android Police"
  },
  {
    "title": "Teofimo Lopez Jr.-Shakur Stevenson live updates, results and analysis",
    "desc": "Teofimo Lopez Jr. puts his WBO junior welterweight world title on the line against Shakur Stevenson. Follow live.",
    "image": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0131%2Fr1608558_1296x729_16%2D9.jpg",
    "source": "ESPN"
  },
  {
    "title": "Alberta's Sturmay beats Nova Scotia's Black to earn semifinal spot at Scotties",
    "desc": "With a Team Selena Sturmay win on Saturday, the Albertan skip is now set to face the winner of an all-Manitoba semifinal.\nMike Koreen has the story from Mississauga.",
    "image": "https://www.sportsnet.ca/wp-content/uploads/2026/01/Sturmay-1.jpg",
    "source": "Sportsnet.ca"
  },
  {
    "title": "Snoop Dogg suffers family tragedy as 10",
    "desc": "Snoop Dogg's granddaughter has died, with his only daughter, Cori Broadus, tragically taken to social media to confirm the news - Cori's partner also honoured their daughter's memory on Instagram",
    "image": "https://i2-prod.mirror.co.uk/article36650131.ece/ALTERNATES/s1200/1_2025-BET-Awards-Arrivals.jpg",
    "source": "The Mirror"
  },
  {
    "title": "ASUS Bridges the Gap Between ProArt Displays and macOS",
    "desc": "Firmware updates now support ASUS DisplayWidget Center software for macOS for instant display adjustments, M-Model P3 color syncing with MacBooks, and more KEY POINTS ASUS has unveiled exciting new features for its ProArt displays, designed to elevate productivity and streamline creative workflows for MacBook, Mac Mini, and Mac Studio users. The latest upgrade includes the […]",
    "image": "https://www.wazzup.ph/wp-content/uploads/2026/02/ProArt-is-the-best-monitor-for-Macbook_1820_1213.jpg",
    "source": "Wazzup.PH"
  },
  {
    "title": "Spanish scientists erase pancreatic tumors in mice",
    "desc": "Researchers at Spain’s National Cancer Research Center have completely eliminated pancreatic tumors in mice using a three drug combination that also prevents the cancer from becoming resistant to treatment, Qazinform News Agency correspondent reports. The findings were published in the journal PNAS.",
    "image": "https://img.inform.kz/kazinform-photobank/media/2026-01-30/520c6c04-969b-42f2-8d8a-9b7d243377e8.jpeg",
    "source": "Qazinform"
  },
  {
    "title": "Margaret Pink's fantastic plastic empire spans 57 years, now she's giving back through Tupperware",
    "desc": "Tupperware parties opened the doors for rural women, bridging social isolation and creating careers. Decades on, this colourful plastic ware is still making a difference.",
    "image": "https://live-production.wcms.abc-cdn.net.au/de1035a034daeefeebd9373e28afdf1a?impolicy=wcms_watermark_news&cropH=2092&cropW=3719&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "China's Xiaomi launches smartphones in Kenyan, eyeing bigger market share",
    "desc": "NAIROBI | Xinhua |  Chinese electronics maker Xiaomi on Friday launched the REDMI Note 15 Series, comprising three smartphone models, in the Kenyan market. The launch event, held in Nairobi, the capital of Kenya, attracted senior executives from the telecommunications sector. Matt Huang, country manager of Xiaomi International, said the devices are aimed at meeting …",
    "image": "https://www.independent.co.ug/wp-content/uploads/2026/02/xiamo-2.jpg",
    "source": "The Independent Uganda"
  },
  {
    "title": "Ugandan Wikimedians urge govt action against",
    "desc": "“When official data is locked away, misinformation thrives. Open, verifiable information should be treated as a national resource, not a privilege,” Ssemanda said.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/f0a21f93-0d67-4495-a8ea-c5d6bd6ade79.jpg",
    "source": "NewVision.co.ug"
  }
]