[
  {
    "title": "Why pre-ordering the S26 Ultra might be a mistake this year (and when to buy instead)",
    "desc": "Sometimes the waiting game is the winning one!",
    "image": "https://m-cdn.phonearena.com/images/article/178305-wide-two_1200/Why-pre-ordering-the-S26-Ultra-might-be-a-mistake-this-year-and-when-to-buy-instead.jpg",
    "source": "PhoneArena"
  },
  {
    "title": "Rangers: Police Scotland investigates online abuse of Fernandez & Gassama",
    "desc": "Police Scotland is investigating after Rangers players Emmanuel Fernandez and Djeidi Gassama shared screenshots of racist abuse aimed at them on their social media accounts after Sunday's match in Livingston.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5a06/live/8e35f5b0-1038-11f1-bf1f-0d6276cd82f6.jpg",
    "source": "BBC"
  },
  {
    "title": "COCOBOD Deputy CEO welcomes probe amid conflict of interest allegations",
    "desc": "The Deputy Chief Executive in charge of Finance and Administration at the Ghana Cocoa Board (COCOBOD), Mr. Ato Boateng, has welcomed potential investigations by the Office of the Special Prosecutor (OSP) and the Commission on Human Rights and Administrative Justice (CHRAJ) into allegations of conflict of interest leveled against him.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/image-2068.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "New Zealander among injured after bus falls from Nepal hillside",
    "desc": "Nineteen of the 44 passengers on board were killed, police said.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--jvUIZCyP--/t_tohu-badge-facebook/v1771839501/4JSQL84_AFP__20260223__XxjpbeE000229_20260223_PEPFN0A001__v1__HighRes__SpotnewsNepalDhadingB_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Johnny Gaudreau's widow and sister react to Team USA's Olympics tribute",
    "desc": "Johnny Gaudreau's widow and sister reacted to Team USA's tribute to the late hockey star at the 2026 Olympics.",
    "image": "https://nypost.com/wp-content/uploads/sites/2/2026/02/gaudreau-kids.jpg?quality=75&strip=all&1771842054&w=1200",
    "source": "New York Post"
  },
  {
    "title": "Sir Keir Starmer makes surprise visit to Gorton and Denton days before by-election - this is what he said",
    "desc": "Gorton and Denton by-election is taking place on February 26",
    "image": "https://i2-prod.manchestereveningnews.co.uk/article33475944.ece/ALTERNATES/s1200/1_JS397611894.jpg",
    "source": "Manchester Evening News"
  },
  {
    "title": "Tajani in Brussels: EU crises and the U.S. trade file",
    "desc": "Italy’s Foreign Minister Antonio Tajani on Monday took part in two key meetings from Brussels: the EU Foreign Affairs Council (FAC) and a G7 video conference of trade ministers on critical materials and preparations for the WTO Ministerial Meeting in Yaoundé. He also chaired a meeting of Italy’s “Tariff Task Force” — a consultation with 40 companies and around 80 trade associations — on the U.S. administration’s decision to temporarily revise tariffs.",
    "image": "https://decode39.com/wp-content/uploads/2026/02/HB2JJdLWoAAuYBC.jpeg",
    "source": "Decode39"
  },
  {
    "title": "Andrew’s former protection officers urged to share what they saw on duty",
    "desc": "Call comes amid fresh scrutiny of Mountbatten-Windsor’s alleged links to Epstein, including claims over security arrangements at his New York home",
    "image": "https://i.guim.co.uk/img/media/22daf97c33e66bbb65204244fddb85b1a8c61fed/589_0_4918_3937/master/4918.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=016665c0a4bf3f39895a64d4147ac5d2",
    "source": "The Guardian"
  },
  {
    "title": "Benfica’s Prestianni gets provisional one-match ban for Vinicius incident",
    "desc": "UEFA announces suspension of Gianluca Prestianni after accusations he racially abused Real Madrid’s Vinicius Junior.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/GettyImages-2261683038-1771858899_00a450-1771858979.jpg?resize=1200%2C630&quality=80",
    "source": "Al Jazeera"
  },
  {
    "title": "Thanksgiving service held for Ebenezer Ahumah Djietror after appointment as Clerk to Parliament",
    "desc": "A thanksgiving service has been held at Jehovah Shamah Assemblies of God Church in honour of Mr Ebenezer Ahumah Djietror following his appointment as Clerk to the Parliament of Ghana.",
    "image": "https://ghanaiantimes.com.gh/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-23-at-12.51.04.jpeg",
    "source": "Ghanaian Times"
  }
]