[
  {
    "title": "Marcos backs 3% cap for unprogrammed funds, Palace says",
    "desc": "President Marcos supports the Department of Budget and Management's (DBM) proposal to lower the cap on unprogrammed appropriations (UAs) to 3 percent,...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/26/82106.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Aboitiz's Davao Light begins ₱2-billion expansion after court win",
    "desc": "Davao Light and Power Co., the utility arm of Aboitiz Power Corp., has secured a court victory allowing it to take over electricity distribution in the Island...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/26/82075.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "FIBA Basketball World Cup 2027 Qualifiers: India face Qatar, Lebanon away in second window",
    "desc": "It’s India vs Qatar and Lebanon in the second window of the FIBA Basketball World Cup 2027 Qualifiers. Know schedule, match times and watch live streaming in India.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/jpzoaqh0yrgzkgygbdfo",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Data show challenges in manufacturing drive",
    "desc": "KILIMANJARO: MICRO enterprises account for the vast majority of Tanzania’s 25,650 mapped industries, new data reveal, highlighting structural challenges in the country’s industrialisation push. Figures released by the Industrial Research and Development Organisation (TIRDO) under the National Industrial Information Management System (NIIMS) show that 15,563 of the mapped industries are micro enterprises, 8,980 are small,",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/TIRDO.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Aaya Sher Takes Global Charts by Storm; Nani’s The Paradise First Single Hits No. 1 on YouTube",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/02/The-Paradise-3.webp",
    "source": "123telugu.com"
  },
  {
    "title": "When is the Champions League last 16 draw? Date, start time, qualified teams and how to watch online",
    "desc": "The Champions League knockout rounds are set to be mapped out this week as the draw for the last-16, quarter-finals and semi-finals takes place in Nyon, Switzerland.",
    "image": "https://focus.independent.ie/thumbor/ocapsZvGJJrp7XBZFyChrB8US1U=/629x460/smart/prod-mh-ireland/5ecc5cbb-674a-4d7d-8cf6-9b2acf1ee49c/45b24736-11d2-43af-bcbb-c63f4561a853/S-RMA-SLB%20%2824%29.jpg",
    "source": "The Irish Independent"
  },
  {
    "title": "Five high-profile Ugandan celebrity splits that shocked fans",
    "desc": "Read about the dramatic breakups of five Ugandan celebrity couples that made major headlines in the entertainment industry.",
    "image": "https://mbu.ug/wp-content/uploads/2026/02/IMG_2889-edited.jpeg",
    "source": "mbu.ug"
  },
  {
    "title": "Study shows the factors that drive the decision to get vaccinated in Brazil",
    "desc": "This article was originally published in The Conversation Brasil, and has been translated in English.",
    "image": "https://cdn.murdoch.edu.au/mu-images/default-source/logos/ngalakwopbiddi.png?sfvrsn=69a04644_1",
    "source": "Murdoch University"
  },
  {
    "title": "Google’s US$2b project in Malaysia on track, set to create 26,500 jobs by 2030, says Anwar",
    "desc": "KUALA LUMPUR, Feb 26 — Prime Minister Datuk Seri Anwar Ibrahim today said Google’s US$2 billion investment in Malaysia is progressing strongly and has exceeded initial...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/26/327353.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "GTA Online Weekly Update (Feb 26th - March 5th, 2026): All Weekly Bonuses, Free Gifts & Discounts",
    "desc": "GTA Online's update this week adds the Shitzu Keitora, introduces Drift Tuning for multiple vehicles, and brings thrilling new discounts and bonuses.",
    "image": "https://fwmedia.fandomwire.com/wp-content/uploads/2026/02/26022547/gta-online-2.jpg",
    "source": "FandomWire"
  }
]