[
  {
    "title": "Gachagua Dismisses CS Duale’s Dare for Televised Political Debate",
    "desc": "In the latest developments, Gachagua has positioned himself as a defender of the Mt. Kenya region, while Duale, on the other hand, seems to represent North Eastern interests.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/gachgua-and-duale.jpg?itok=TLVAUBFA",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "200 families receive immediate aid from Malabon gov't after Tañong fire",
    "desc": "Around 200 families displaced by a fire along C4 in Barangay Tañong on Wednesday, Feb. 11, received immediate assistance from the Malabon City government....",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/12/78818.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Springer Nature launches Nature Progress open access journal series",
    "desc": "Nature Progress Oncology and Nature Progress Brain Health will open for submissions next month",
    "image": "https://www.researchinformation.info/wp-content/uploads/2026/02/shutterstock_2303831051.jpeg",
    "source": "Research Information"
  },
  {
    "title": "Budget 2026: Cost-of-Living special payments of up to S$400, S$500 CDC vouchers for Singaporeans",
    "desc": "Prime Minister Lawrence Wong also announced additional rebates to help households with utility expenses.",
    "image": "https://dam.mediacorp.sg/image/upload/s--omLuuhXS--/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/06/jem_0760_0.jpg?itok=DKvqYO4U",
    "source": "CNA"
  },
  {
    "title": "Snowball Earth was not completely frozen, new study reveals",
    "desc": "Even when Earth was locked in its most extreme deep freeze, the planet’s climate may not have been as silent and still as once believed. New research from ancient Scottish rocks reveals that during Snowball Earth — when ice sheets reached the tropics and the planet resembled a giant snowball from space — climate rhythms similar to today’s seasons, solar cycles, and even El Niño–like patterns were still pulsing beneath the ice.",
    "image": "https://www.sciencedaily.com/images/1920/snowball-earth.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Retired bank officer loses RM1.69mil to online scam",
    "desc": "GEORGE TOWN: A retired bank officer recently lost RM1.69mil after falling victim to an online investment scam.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/12/3767517.jpeg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Chip shortage hits PCs as AI swallows the world's memory supply",
    "desc": "Lenovo has warned about mounting pressure on PC shipments as a worsening memory-chip shortage grips the industry.",
    "image": "https://techcentral.co.za/wp-content/uploads/2026/02/lenovo-thinkpad-1500-800.jpg",
    "source": "TechCentral"
  },
  {
    "title": "Oshiomhole, Umahi trade words during budget defence session at senate",
    "desc": "David Umahi, minister of works; and Adams Oshiomhole, senator representing Edo north; had a heated exchange on Wednesday…",
    "image": "https://www.thecable.ng/wp-content/uploads/2026/02/Umahi-And-Oshiomhole.jpg",
    "source": "TheCable"
  },
  {
    "title": "Man dies in fatal Lagos truck accident, wife injured",
    "desc": "A man was killed and his wife critically injured in a fatal Lagos truck accident after a granite-laden truck crushed their car at Eleko Junction.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/12094138/LASTMA-1200x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Tanzania emerges Africa’s certified coffee leader",
    "desc": "KILIMANJARO: TANZANIA has emerged as Africa’s leading producer of certified coffee after being ranked among the top producers globally, reaffirming the country’s growing influence in the international coffee market. Certified coffee refers to coffee produced under farming systems that promote environmental sustainability, biodiversity conservation and improved soil health through the use of approved inputs and",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/cofee.jpg",
    "source": "dailynews.co.tz"
  }
]