[
  {
    "title": "Goals & Highlights",
    "desc": "Recap the weekend action for Nigerian footballers in Europe. Ndidi, Iwobi, and Onuachu were all on the scoresheet with standout performances.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/23022242/AFP__20260222__AA_22022026_2666516__v1__Mockup__GaziantepFkVTrabzonsporTurkishSuperL-1024x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Adebayor slams Arokodare over penalty miss",
    "desc": "Emmanuel Adebayor criticizes Tolu Arokodare's penalty miss in Wolves' 1-0 defeat to Crystal Palace, questioning the striker's confidence.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/23021838/AFP__20260219__fletcher-wolverha260218_npRtv__v1__Mockup__WolverhamptonWanderersVArs-1024x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "EdTech Mondays to Explore Certification and Regulation for Ethiopian Schools",
    "desc": "The February 2026 edition of EdTech Mondays Ethiopia examines how regulation, certification, and licensing can bridge policy intent and classroom impact. Tune in to Fana FM 98.1 at 8:10 p.m. EAT.",
    "image": "https://shegastrpool.blob.core.windows.net/media-prod/media-prod/large_image_5_65361bfb3f.jpg",
    "source": "Shega"
  },
  {
    "title": "Live music to be stopped at Torbay waterfront bar",
    "desc": "The committee ordered Molly's on Paignton harbourside bar owner to stop the music.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1711/live/46aa04b0-0e86-11f1-a091-35d1a11c7bd2.png",
    "source": "BBC"
  },
  {
    "title": "Entries open for Fulbright Specialist Program (Kosovo)",
    "desc": "Deadline: 31-May-2026 The USKEB invites Kosovan host institutions to apply for the Fulbright Specialist Program, bringing U.S. scholars and professionals to Kosovo for short-term, outcome-driven projects. The program strengthens institutional capacity, promotes collaboration, and advances priority areas such as STEM, economic development, governance, and cultural heritage. Overview The Fulbright Specialist Program is a short-term academic",
    "image": "https://fundsforngosmedia.s3.amazonaws.com/wp-content/uploads/2023/12/19141120/icon.png",
    "source": "fundsforNGOs"
  },
  {
    "title": "A New Era in HIV Prevention with Long-Acting Injections",
    "desc": "Zimbabwe rolls out Lenacapavir, a new HIV prevention injection.",
    "image": "https://gumlet.assettype.com/downtoearth%2F2026-02-23%2Fh4wwz14h%2FZimbabwe-HIV.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Down To Earth"
  },
  {
    "title": "Farrell hopes England rout gets fans on board again",
    "desc": "Andy Farrell says he hadn't paid much attention to the negativity that surrounded his Ireland team but hopes the win over England gets some fans \"back on board\".",
    "image": "https://www.rte.ie/images/0023ef16-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Retro gaming revival: one man’s quest to recreate the golden age of arcades",
    "desc": "Economics lecturer Or turned nostalgia into a meticulously curated gaming sanctuary, preserving arcade-era authenticity while exploring the emotional and financial logic of collecting in a digital world",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/23/SJXmQuF00Zg/SJXmQuF00Zg_0_0_1920_1080_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Power land young duo as SSP signings",
    "desc": "The Power have signed Balyn O'Brien and Mitch Zadow",
    "image": "https://resources.afl.com.au/afl/photo/2026/02/23/68eefa4f-447f-47cb-9ba0-44a8ba0e2477/BalynOBrien.jpg",
    "source": "afl.com.au"
  },
  {
    "title": "Government launches PM’s Electric Bike and Rickshaw Scheme 2026",
    "desc": "The government has launched the Prime Minister’s Electric Bike and Rickshaw Scheme 2026 under the PAVE programme to promote affordable and environmentally friendly",
    "image": "https://www.nation.com.pk/digital_images/large/2026-02-23/government-launches-pm-s-electric-bike-rickshaw-scheme-2026-1771828524-3901.jpg",
    "source": "The Nation (Pakistan )"
  }
]