[
  {
    "title": "High Court sets strict hearing dates in Albert Ojwang' murder case",
    "desc": "The High Court in Kibera has scheduled strict hearing dates in the murder case of teacher Albert Ojwang, as part of efforts to conclude the matter before",
    "image": "https://www.radio47.fm/wp-content/uploads/2026/01/New-Project-2026-01-27T113558.181-1.jpg",
    "source": "radio47.fm"
  },
  {
    "title": "India Offers EU Auto Quota Six Times Larger Than UK Deal",
    "desc": "India has agreed to give European automakers a quota more than six times larger than any it has offered before, slashing tariffs under a trade pact with the European Union and granting far greater access to its tightly protected car market.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/igMT0.MPr6pI/v1/1200x800.jpg",
    "source": "Bloomberg"
  },
  {
    "title": "Vivo T4x 5G 2026 Launched with Powerful Processor, Smart Features and Solid Build Quality",
    "desc": "The Vivo T4x 5G has a solid design. It feels strong when you hold it. The frame is flat which makes it easier to grip. You will not drop it easily even during",
    "image": "https://mycampusstore.in/wp-content/uploads/2026/01/faisal-q-23.jpg",
    "source": "Mycampus Store -"
  },
  {
    "title": "[PHOTOS] UHC workers take to the streets over pay delays",
    "desc": "The workers are pressing for better working conditions and timely payment of salaries",
    "image": "https://cdn.radioafrica.digital/image/2026/01/42bf4f05-1f09-4f99-b8a9-0553cebe896d.jpg?1769510076511",
    "source": "the-star.co.ke"
  },
  {
    "title": "Aerial images capture properties hanging off cliffside after landslide in Italy",
    "desc": "More than 1500 people have been forced to evacuate after a 4 kilometre-long landside in an idyllic Italian ...",
    "image": "https://imageresizer.static9.net.au/iZFd6BsZ3TqdAAKgcazcsv4u5Zk=/0x0:1160x652/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fc9500a5b-3311-453e-a199-b11ccaf8194e",
    "source": "9News.com.au"
  },
  {
    "title": "30 Years After Ecclesia in Africa, Church’s Family of God Vision Remains “strikingly relevant”: SECAM President",
    "desc": "The vision of the Church as the “Family of God,” articulated 30 years ago in Ecclesia in Africa, remains “relevant” for the Church in Central Africa amid conflict, insecurity, and social fragmentation, the President of the Symposium of Episcopal Conferences of Africa and Madagascar (SECAM) has said.",
    "image": "https://www.aciafrica.org/images/aci-africa-photo-edit-2026-01-27t070321_1769502828.jpg?w=1200&format=jpeg",
    "source": "aciafrica.org"
  },
  {
    "title": "BTA Parliament member wants Maguindanao del Sur renamed as province of Buayan",
    "desc": "DAVAO CITY – A member of the Bangsamoro Transition Authority (BTA) Parliament in the Bangsamoro Autonomous Region in Muslim Mindanao (BARMM) urged Congress...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/27/74688.webp",
    "source": "mb.com.ph"
  },
  {
    "title": "Sri Lanka v England: third men’s cricket one-day international - live",
    "desc": "Over-by-over report: After pulling level, will England claim the series with victory in the decider? Join our writers",
    "image": "https://i.guim.co.uk/img/media/b738c459a5a0df8d4827ab2bbf45d65dbdc0aa4e/322_121_3066_2453/master/3066.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=37092c923a52389e2814e54809dba146",
    "source": "The Guardian"
  },
  {
    "title": "Nandom Hospital to receive 3 dialysis machines",
    "desc": "The St. Theresa’s Hospital in Nandom in the Upper West Region is set to receive a major boost in specialised healthcare delivery following plans by a Non-Governmental Organisation (NGO) to donate three dialysis machines to the facility.",
    "image": "https://ghanaiantimes.com.gh/wp-content/uploads/2026/01/image-42.png",
    "source": "Ghanaian Times"
  },
  {
    "title": "Dominic Michael McDermott, Ballyhillion, Malin Head, formerly of Manchester, UK",
    "desc": "The death has occurred of Dominic Michael McDermott surrounded by his family at Letterkenny University Hospital on 26th January 2026 and late of Ballyhillion, Malin Head F93 KF25, co-owner of Caffe Banba, Carndonagh and formerly of Manchester, UK. Predeceased by his Infant Son Evan. Beloved husband of Andrea and devoted father of Caragh, Áine, […]",
    "image": "https://highlandradio.com/wp-content/uploads/2026/01/Obit-Template-63.png",
    "source": "highlandradio.com"
  }
]