[
  {
    "title": "Astronomers stunned by unprecedented short and hot flares emitted by a supermassive black hole",
    "desc": "The discovery challenges existing theories of how matter close to supermassive black holes behaves.",
    "image": "https://d3hedi16gruj5j.cloudfront.net/791998/uploads/fd7316d0-0d57-11f1-b622-153e30b9e559_1200_630.jpeg",
    "source": "starlust.org"
  },
  {
    "title": "Contaminated formula milk left my baby hospitalised, says Wirral mum",
    "desc": "Amy Sutton says she thought her daughter was suffering norovirus when she began projectile vomiting.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/f2d8/live/65318650-0ce3-11f1-9aaa-bdef89911abe.jpg",
    "source": "BBC"
  },
  {
    "title": "Popular K-Pop Male Singer Confirmed To Having A Child From Previous Relationship",
    "desc": "It was recently reported that popular K-pop male singer 'A' confirmed that he had a child with his former partner four years ago.",
    "image": "https://image.koreaboo.com/2026/02/post5-2026-02-19T153257.469.jpg",
    "source": "Koreaboo"
  },
  {
    "title": "Prime minister Ngurare vows tough action on non-performing contractors",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% Prime minister Elijah Ngurare has warned contractors and service providers that failure to meet agreed timelines or the abandonment of government projects will no longer be tolerated, signalling a tougher approach to accountability in public service delivery.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-19-at-8.02.10-AM-1024x682.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "Oregon Republicans boycott floor session, delaying action on transportation tax referendum move",
    "desc": "The incident marks the first caucus-wide boycott by Oregon Republicans since 2023.",
    "image": "https://www.oregonlive.com/resizer/v2/Z7SVVH5LOZC77PH2KUL357CP7I.jpg?auth=4ec3351516d78def9b196dfcba2ca15f215d68187034c82900ae35dc91908a96&width=1280&smart=true&quality=90",
    "source": "OregonLive.com"
  },
  {
    "title": "Gideon Sa'ar responds to Yvette Cooper’s criticism at UN",
    "desc": "Gideon Sa'ar sharply responded to Yvette Cooper's criticism of Israel's land policies at the UN, referencing the Balfour Declaration and historical British support for a Jewish homeland.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/675672",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Britain's Got Talent dancer Kerri-Anne Donaldson found dead at home had been accused of 'child sex offence', inquest hears",
    "desc": "The 38-year-old, who reached the semi-final of Britain's Got Talent as part of a dance group, was found dead at her home in Farnborough, Hampshire, the morning after being released from hospital.",
    "image": "https://e3.365dm.com/26/02/1600x900/skynews-kerri-anne-donaldson_7168158.jpg?20260218173300",
    "source": "Sky News"
  },
  {
    "title": "Sri Lanka vs Zimbabwe T20 World Cup: Pitch report and R Premadasa Colombo Stadium stats",
    "desc": "Cricket News: NEW DELHI: Surprise packages Zimbabwe and Sri Lanka will battle for top spot in Group B when they face off in a crucial T20 World Cup 2026 clash on Th.",
    "image": "https://static.toiimg.com/thumb/msid-128543230,width-1280,height-720,imgsize-216182,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Second-tier promotion tussle has championship edge",
    "desc": "The promotion race in the second tier has proven unexpectedly competitive this year and the frontunners collide in Páirc Uí Rinn this weekend, writes Lee Keegan",
    "image": "https://www.rte.ie/images/001d39b4-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Brit Awards art trail turns Manchester into open air gallery",
    "desc": "Curated by artist Stanley Chow a city-wide trail showcases the work of 21 local artists.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/3e51/live/9e6af3a0-0cd6-11f1-b054-335fa224f76a.jpg",
    "source": "BBC"
  }
]