[
  {
    "title": "F1 testing begins in Bahrain as Verstappen, Piastri and Cadillac take to track",
    "desc": "Formula 1 pre-season testing for the 2026 campaign has commenced at the Bahrain International Circuit, with Max Verstappen, Oscar Piastri and Cadillac drawing significant attention.",
    "image": "https://img.mathrubhumi.com/view/acePublic/alias/contentid/1p40pvf2afrsgyr8r4z/0/f1-jpg.jpeg?f=16%3A9&w=1200&q=0.75",
    "source": "Mathrubhumi English"
  },
  {
    "title": "Azam Baki to send letter of demand to Bloomberg over RM800,000 shares report",
    "desc": "PUTRAJAYA: Tan Sri Azam Baki has instructed his lawyers to issue a letter of demand to Bloomberg over what he described as a \"misleading\" and \"defamatory\" report concerning his past share transactions in Velocity Capital Partner Bhd.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/11/3765552.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Channel Nine says Warren Tredrea has now paid costs over long",
    "desc": "Channel Nine has confirmed it has received legal costs from former AFL player and sports presenter Warren Tredrea, who was ordered to pay $149,000 to his ex-employer.",
    "image": "https://live-production.wcms.abc-cdn.net.au/7d626af3707763ad9423e49d12e073ce?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Dead possum found in Roxburgh reservoir triggers boil water notice for area",
    "desc": "The Central Otago District Council said the possum was found during an unrelated inspection on Wednesday, and it's not known how long it's been in the water.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--Es3qSgzL--/t_tohu-badge-facebook/v1644470958/4M70LZU_copyright_image_269884?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "MP Amisi vows to challenge removal from ODM NEC",
    "desc": "He says the move is irregular and procedurally flawed",
    "image": "https://cdn.radioafrica.digital/image/2026/02/48d47c1c-ab4e-4659-827e-e0e7c6135c30.jpeg?1770801030854",
    "source": "the-star.co.ke"
  },
  {
    "title": "New plan to fix 'ageing and fragile' schools exposed by Raac crisis",
    "desc": "Education Secretary Bridget Phillipson says the government's 10-year strategy is a \"turning point\" for schools.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ea12/live/08ec0040-06a9-11f1-8222-ad34ef3f6330.jpg",
    "source": "BBC"
  },
  {
    "title": "Morocco Benefits from Scaled",
    "desc": "On 11 February, Agence Française de Développement (AFD) and the World Bank will convene in Morocco to highlight “The Power of Co-financing,” a collaborative model designed to expand as international aid becomes scarcer while development needs continue to grow. With financing requirements rising across sectors such as roads, transport, energy, and climate action, partner countries",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Software maker Dassault Systèmes shares fall after Q4 earnings",
    "desc": "Shares of the software giant plummeted after the company posted its fourth-quarter earnings.",
    "image": "https://image.cnbcfm.com/api/v1/image/108176265-1753356509305-gettyimages-2156822652-2024_Dassault_Systemes_Automotive_and_Transportation_Industry_Su.jpeg?v=1770798797&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Foote names exciting SA U20 squad for Georgia tour",
    "desc": "Junior Springbok head coach Kevin Foote has named an exciting 31-man squad to travel to Tbilisi for a three-match tour of Georgia later this month, with four members from last year’s Junior Springbok squad selected for the trip.",
    "image": "https://saru-umbraco.azurewebsites.net//media/bs2ajf3r/260211-junior-boks-squad-announcement-georgia-tour.jpg?anchor=center&mode=crop&width=945&height=472&rnd=134152700533700000",
    "source": "SA Rugby"
  },
  {
    "title": "All Blacks breakout player of the year ruled out for Super Rugby season",
    "desc": "Big lock Fabian Holland requires surgery on his dislocated shoulder and will likely also miss the three Nations Championship Tests in July.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/highlanders-lock-fabian-holland-pictured-at-the-recent-super-GZY5DPIBUJEA5BCOWKZ63H55JI.jpg?auth=cc4c6305b1006445d50a605a88216ae3c41fc6dc25ae57e3ee1c56e04ccba509&quality=70&width=600&height=315&focal=1200%2C760",
    "source": "1News"
  }
]