[
  {
    "title": "Ashes of Creation future uncertain following mass layoffs and resignation",
    "desc": "The future of Ashes of Creation appears uncertain after its founder resigned and the studio began mass layoffs.The massively multiplayer online role-playing game was first announced in 2016 and...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-01/1390582_101408_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "Rassie Erasmus reveals true inspiration behind Andre Esterhuizen's Springboks hybrid role",
    "desc": "Springboks boss Rassie Erasmus says that he gets too much \"credit\" for turning Andre Esterhuizen into a hybrid player.",
    "image": "https://d3gbf3ykm8gp5c.cloudfront.net/content/uploads/2026/01/31101521/Springboks-centre-Andre-Esterhuizen-with-an-inset-of-head-coach-Rassie-Erasmus-1.jpg",
    "source": "planetrugby.com"
  },
  {
    "title": "Preparing for Orbital Conflict With AI Enemies",
    "desc": "This post is also available in: עברית (Hebrew)As military activity expands beyond the atmosphere, one problem is becoming increasingly clear: preparing for conflict in orbit is fundamentally different from training for air or naval warfare. Satellites move fast, operate at extreme distances, and can maneuver in ways that are difficult to predict. Traditional training tools, […]",
    "image": "https://i-hls.com/wp-content/uploads/2026/01/nasa-CpHNKNRwXps-unsplash-scaled.jpg",
    "source": "i-hls.com"
  },
  {
    "title": "Finance Minister Nirmala Sitharaman Speech Live, New Income Tax Regime, Old Regime",
    "desc": "Union Budget 2026 Live Updates: India's economy is projected to grow 7.4 per cent in financial year 2026 (FY26), according to the Economic Survey.",
    "image": "https://c.ndtvimg.com/2026-02/3nr9n1m4_nirmala-sitharam-meets-droupadi-murmu_625x300_01_February_26.jpg?im=FitAndFill,algorithm=dnn,width=1200,height=738",
    "source": "NDTV"
  },
  {
    "title": "Bigger susbsidies: Sandro Marcos says House bent on strengthening 4Ps law",
    "desc": "House Majority Leader Ilocos Norte 1st district Rep. Sandro Marcos is eyeing the passage of an amendatory measure that would significantly increase monthly...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/01/75920.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Weight of paralysis",
    "desc": "Carrying decades of geopolitical controversy and lacking rehabilitation, polio survivors shoulder an invisible burden",
    "image": "https://i.tribune.com.pk/media/images/spread-title1769865685-7/spread-title1769865685-7.jpg",
    "source": "The Express Tribune"
  },
  {
    "title": "Democrat Taylor Rehmet flips a Texas state Senate seat Trump won by 17 points, CNN projects",
    "desc": "Democrats notched another victory Saturday in special elections during President Donald Trump’s second term, flipping a seat in the Texas Senate that Trump won by 17 points in 2024.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/c-h-16427520.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Council call gardai to lodge complaint against civilian team rescuing people amid Storm Chandra flooding",
    "desc": "The Chairman of Slaney Search and Rescue told the Irish Mirror the local council complained to gardai about its activities – because it felt the organisation should not be there",
    "image": "https://i2-prod.irishmirror.ie/article36644502.ece/ALTERNATES/s1200/0_JS394407216.jpg",
    "source": "Irish Mirror"
  },
  {
    "title": "BREAKING: ‘Vintage’ Volk makes UFC history in latest ‘GOAT’ statement",
    "desc": "BREAKING: ‘Vintage’ Volk makes UFC history in latest ‘GOAT’ statement",
    "image": "https://content.api.news/v3/images/bin/7c456e6e06ea5b37a86a805941422f04",
    "source": "fox sports"
  },
  {
    "title": "‘SNL’ Star Returns to Brutally Roast Moron ICE Agents",
    "desc": "“SNL”’s Tom Homan was baffled by how dumb his agents are.",
    "image": "https://www.thedailybeast.com/resizer/v2/2SZBT6DY2ZAVJNB6OHZQDKQIFE.png?smart=true&auth=d3e929548a74979bc6bb190114f337679422ae7a47241b83c42caf34aeaaf469&width=1200&height=630",
    "source": "The Daily Beast"
  }
]