[
  {
    "title": "Melania Trump Documentary Box Office: Will It Work?",
    "desc": "The Melania Trump movie is hoping to score the biggest opening for a documentary in a decade with a $5 million domestic launch.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2026/01/Melania_2026_003_CREDIT__Amazon_MGM_Studios-H-2026.jpg?w=1296&h=730&crop=1",
    "source": "hollywoodreporter.com"
  },
  {
    "title": "David Faustino says he and former costar Christina Applegate speak often",
    "desc": "Former 'Married... With Children' star David Faustino says he and Christina Applegate, who played his older sister on the Fox sitcom, speak often.",
    "image": "https://ew.com/thmb/QRX9jcp4q01YPJYEL762opL1W4I=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/David-Faustino--Christina-Applegate-married-with-children287-012726-fd7c7bbf488640d2a18c090f88f716a7.jpg",
    "source": "Entertainment Weekly"
  },
  {
    "title": "Silver soars Rs 21,400, nears Rs 4 lakh mark; gold jumps Rs 4,800 to fresh record high. Is it too late to buy?",
    "desc": "Gold and silver futures opened higher on Wednesday, January 28, 2026, hitting fresh lifetime highs on the MCX amid strong safe-haven demand and rising geopolitical tensions. Investors now await the US Federal Reserves policy decision, with any signal of a rate pause or easing likely to boost market sentiment and support further gains in precious metals.",
    "image": "https://img.etimg.com/thumb/msid-127675292,width-1200,height-630,imgsize-88148,overlay-etmarkets/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "A common parasite in the brain is far more active than we thought",
    "desc": "A common parasite long thought to lie dormant is actually much more active and complex. Researchers found that Toxoplasma gondii cysts contain multiple parasite subtypes, not just one sleeping form. Some are primed to reactivate and cause disease, which helps explain why infections are so hard to treat. The discovery could reshape efforts to develop drugs that finally eliminate the parasite for good.",
    "image": "https://www.sciencedaily.com/images/1920/brain-virus-infection.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Man jailed after fatal PMD fire in New Upper Changi Rd flat",
    "desc": "A man was jailed seven months for a negligent act causing a fatal PMD fire, highlighting critical e-scooter safety concerns and legal repercussions. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/a1f5d2b4b675f79af85e700a1be26057f972641fa3a9e23785ddd9feb0bbabd7",
    "source": "The Straits Times"
  },
  {
    "title": "Major boost for Zii Jia as he gets past opener at Thailand Masters",
    "desc": "The national singles shuttler beat Belgian player Julien Carraggi in straight games to enter the second round.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/01/d8f34dc9-lee-zii-jia-epa-images-pic-070125-2.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Roads closed, traffic rerouted in Lower Hutt as $1.5b works continue",
    "desc": "The works include flood protection and river restoration work, improvements to public transport links and walking and cycling routes as well as upgrading the Melling interchange.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--WL5nEP5C--/t_tohu-badge-facebook/v1769572426/4JU36IG_LowerHuttTraffic_5_jfif?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Inefficient and causes traffic jams - Loke wants end to JPJ roadblocks now that ANPR technology is here",
    "desc": "PUTRAJAYA, Jan 28 — Transport Minister Anthony Loke has called for a shift away from traditional, congestion-causing physical roadblocks, saying the Road Transport Department...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/01/28/322447.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "First topical CRISPR gene therapy corrects disease-causing mutations in human skin",
    "desc": "Gene-editing tools like CRISPR have unlocked new treatments for previously uncurable diseases. Now, researchers at the University of British Columbia are extending those possibilities to the skin for the first time.",
    "image": "https://www.news-medical.net/images/tags/TagImage-456-45847033825775462152-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "After bomb threat, several Chandigarh schools evacuated",
    "desc": "At least five schools received the threat via emails.",
    "image": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTU0MThjNzEwLWZjMTgtMTFmMC1hMDFiLTY5ODE4NmI1ZTViMy5qcGc=",
    "source": "Tribune India"
  }
]