[
  {
    "title": "World Bank to Approve $500m Nigeria Loan for Agriculture",
    "desc": "The World Bank is set to approve a $500m loan to Nigeria to boost agricultural productivity, strengthen value chains, and create new jobs.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2023/12/17135844/World-Bank.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Unlocking Heavy Rare Earths: Cleaner Chemistry, Stronger Strategy",
    "desc": "Ion-adsorption rare earth ores supply most heavy REEs, but extraction faces chemical, geotechnical & environmental challenges demanding greener methods.",
    "image": "https://rareearthexchanges.com/wp-admin/admin-ajax.php?action=rank_math_overlay_thumb&id=91330&type=rare-earth-exchanges&hash=9e9898a3a7c4eb04f44850dd0ac1792b",
    "source": "Rare Earth Exchanges"
  },
  {
    "title": "Blade slices over Sellier's eye in Olympic speedskating 1500",
    "desc": "Kamila Sellier of Poland was stretchered off after a blade sliced over her left eye during an accident at the women's 1,500 meters Friday, but Polish officials said her eye was OK.",
    "image": "https://a4.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0220%2Fr1617820_1296x729_16%2D9.jpg",
    "source": "ESPN"
  },
  {
    "title": "How Trump plans to continue his trade war with Canada without IEEPA",
    "desc": "U.S. President has vowed to ramp up use of sector-based duties after Supreme Court ruled against swath of existing tariffs",
    "image": "https://www.theglobeandmail.com/resizer/v2/W6X4FW6QVBEADFVTH7SHN236SM.JPG?auth=4caac36f65386871b63849dae3715d047c1fa822e8689cb2dc46ba29b0b18161&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "Validation of the French Versions of the PHQ-4 Anxiety and Depression Scale and the PC-PTSD-5 Post-Traumatic Stress Disorder Screening Scale: Mental Health Diseases and Conditions – Anxiety Disorders",
    "desc": "2026 FEB 20-- By a News Reporter-Staff News Editor at Health Policy and Law Daily-- Staff editors report on the newly launched clinical trial, NCT07396623, which has the following summary description:“ Mental illness is a major public health issue. It affects one in five people, represents the largest expense for health insurance, is the leading cause of years lived...",
    "image": "https://insurancenewsnet.com/wp-content/uploads/2022/02/inn-social-default.jpg",
    "source": "InsuranceNewsNet"
  },
  {
    "title": "‘Face/Off’ Sequel Loses Director Adam Wingard",
    "desc": "Face/Off 2, the planned sequel to Paramount's 1997 John Travolta-Nicolas Cage action movie from John Woo, has lost Adam Wingard and seeks a director.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2026/02/MSDFAOF_EC038.jpg?w=1296&h=730&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "‘HERO OF JUSTICE’ PACK AVAILABLE NOW FOR NINTENDO SWITCH AND NINTENDO SWITCH 2 \"",
    "desc": "Press releases and assets from across the games industry - screenshots, videos, logos, packshots, artwork, PR contacts, release dates",
    "image": "https://www.gamespress.com/Content/Themes/Games Press/img/favicon.ico",
    "source": "Games Press"
  },
  {
    "title": "Venom Animated Movie in the Works at Sony",
    "desc": "Venom is going animated, with Tom Hardy said to be invovled in some capacity in a new movie.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2026/02/MCDVENO_EC007-H-2026.jpg?w=1296&h=730&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "Olympic viewing guide: What to watch on the last full day",
    "desc": "CBC Sports' daily Olympics newsletter takes you through the key events for Canada on Saturday, including two curling medal games and lots more podium chances.",
    "image": "https://i.cbc.ca/ais/8fdee3b3-b1b7-419a-a477-b70db4e56d4d,1771632458475/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C197%2C3789%2C2131%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "5 Zodiac Signs Have Powerful Horoscopes On February 21, 2026",
    "desc": "Five zodiac signs are having powerful horoscopes on February 21, 2026. They are: Aquarius, Leo, Scorpio, Taurus, and Cancer.",
    "image": "https://www.yourtango.com/sites/default/files/image_blog/2026-02/zodiac-signs-powerful-horoscopes-february-21-2026_0.png",
    "source": "YourTango"
  }
]