[
  {
    "title": "Charge laid after allegedly stolen vehicle crashes into Geelong school bus, officer opens fire",
    "desc": "A 43-year-old woman has been charged with handling stolen goods after a dramatic incident that saw police open fire at a vehicle that allegedly drove at officers after crashing into a bus on Thursday afternoon.",
    "image": "https://live-production.wcms.abc-cdn.net.au/700b8063a101c2be79cb01c3cf25c938?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "CON holds Class of 2028 Capping, Pinning, and Candle Lighting Ceremony",
    "desc": "By Elaisha L. Pomida, BA Comm-4, The Centralian Link Intern   On January 27, 2026, the Central Philippine University College of Nursing Class of 2028 held its annual Capping, Pinning, and Candle Lighting Ceremony at the Rose Memorial Auditorium. The ceremony honoring CPU Batch Luminara began with a prelude led by Theda B. Cabra, a […]",
    "image": "https://cpu.edu.ph/wp-content/uploads/2018/04/cropped-fav-icon.fw_-32x32.png",
    "source": "Central Philippine University"
  },
  {
    "title": "Freed captive Sasha Troufanov reveals sexual harassment during Gaza captivity",
    "desc": "In BBC interview, ex-hostage recalls being captured by terrorists on Oct. 7 and shot in the legs while trying to flee, says Palestinian civilians beat him after he was abducted into Gaza",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/01/Screenshot-2026-01-30-at-04.16.35-e1769739754267.jpeg",
    "source": "timesofisrael.com"
  },
  {
    "title": "Penn Badgley On 'You Deserve Each Other' Body Transformation",
    "desc": "Although Penn Badgley is getting back to his romantic-comedy roots with 'You Deserve Each Other', he's going for a more superhero physique on screen.",
    "image": "https://deadline.com/wp-content/uploads/2026/01/P10L5BL-e1769740541897.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Woman fatally struck by cube van in Brampton",
    "desc": "A 29-year-old woman is dead after being struck by a cube van in Brampton on Thursday night. Police say the driver remained at the scene.",
    "image": "https://www.cp24.com/resizer/v2/LVJZJEDBZBETXAXJWSWMPQMBRA.png?smart=true&auth=f92678e265eef0d576ecc7648d55819eb3152dd0f2b1828008da0051504bdae0&width=1200&height=630",
    "source": "cp24.com"
  },
  {
    "title": "Melania Trump's doco premieres in US ahead of global release",
    "desc": "\"Everyone wants to know. So here it is,\" she said in the trailer for the nearly two-hour film.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/melania-will-premiere-today-at-the-kennedy-centre-where-the-HVOSIHECUVGZJP6VDIIW7UEMNA.jpg?auth=e20c93ab4f8789c95c8335008b9735434d083a786ffccdd9ebc6fb96626f6798&quality=70&width=600&height=315&focal=461%2C232",
    "source": "1News"
  },
  {
    "title": "UNSW demands enhanced UV testing for TOPCon solar cells",
    "desc": "In an interview with PV Tech Premium, two UNSW researchers emphasise the need for enhanced UV testing for TOPCon solar cells.",
    "image": "https://www.pv-tech.org/wp-content/uploads/2025/09/Agata-Bogucka-NREL.jpg",
    "source": "PV Tech"
  },
  {
    "title": "What to know about the Nipah virus",
    "desc": "The World Health Organization reported two cases of a rare virus in an eastern Indian state on Thursday.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/c-2024-07-20t000000z-273274256-rc26z8akmznl-rtrmadp-3-india-virus.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "\"Are they made of gold?\"",
    "desc": "Recent reports revealed that the government is upgrading 26 sets of toilets at the Kota Kinabalu International Airport (KKIA) in stages, at a total cost of",
    "image": "https://worldofbuzz.com/wp-content/uploads/2026/01/My-Post-1-2026-01-30T102841.815.jpg",
    "source": "world of buzz"
  },
  {
    "title": "Sandiganbayan junks graft charges vs. HDMF officials for violation of right to speedy disposition of cases",
    "desc": "It took the Office of the Ombudsman more than seven years from 2018 to resolve the graft complaints and file them in court against 12 officials of the Home...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/30/75349.webp",
    "source": "mb.com.ph"
  }
]