[
  {
    "title": "Apple Scales Back AI Health Coach Plans",
    "desc": "Apple is scaling back plans for an AI-based health coach, which underscores the difficulty of turning health tracking into a paid service.",
    "image": "https://www.pymnts.com/wp-content/uploads/2021/10/Paceline-Credit-Card-Apple-Watch-health-and-wellness-exercise.jpg",
    "source": "PYMNTS.com"
  },
  {
    "title": "Jhon Duran: Ex-Aston Villa striker set for sixth club aged just 22",
    "desc": "Former Aston Villa striker Jhon Duran is set to join the sixth club of his career at the age of just 22.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/9fb8/live/de829690-033b-11f1-9d05-c7b737bbaef1.jpg",
    "source": "BBC"
  },
  {
    "title": "Supermarket giant Morrisons explores £1bn property deal",
    "desc": "The UK's fifth-biggest grocery chain has hired real estate advisors from CBRE to assess options for releasing up to £1bn of value from its large freehold store portfolio, Sky News learns.",
    "image": "https://e3.365dm.com/22/06/1600x900/skynews-morrisons-supermarket_5806327.jpg?20220616100955",
    "source": "Sky News"
  },
  {
    "title": "31 killed in blast at mosque in Pakistan capital, official says",
    "desc": "Dozens of people have also been injured after an explosion in Islamabad during Friday prayers.",
    "image": "https://static.files.bbci.co.uk/core/website/assets/static/news/images/metadata/poster-1024x576.5f404a8b8b.png",
    "source": "BBC"
  },
  {
    "title": "Triple negative breast cancer cells use new strategy to boost metastatic ability",
    "desc": "Researchers at Baylor College of Medicine have uncovered a strategy that triple negative breast cancer (TNBC) cells use to boost their ability to metastasize, or spread to other organs.",
    "image": "https://www.news-medical.net/images/tags/TagImage-1039-45840826385648151818-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Barcelona reach 'agreement' over Marcus Rashford Man United transfer amid Hansi Flick 'claim'",
    "desc": "Marcus Rashford has scored 10 goals for Barcelona since joining from Man United during the summer transfer window and is keen to remain at the Camp Nou next season",
    "image": "https://i2-prod.mirror.co.uk/article36680073.ece/ALTERNATES/s1200/0_Chelsea-v-Barcelona-UEFA-Champions-League-Group-Stage-Football-Stamford-Bridge-London-UK-25-N.jpg",
    "source": "The Mirror"
  },
  {
    "title": "MediaTek Expands Its Dimensity Portfolio at Tech Day 2026",
    "desc": "MediaTek marked its Tech Day in New Delhi by reinforcing its growing presence in India’s premium smartphone market, highlighting the market momentum of the",
    "image": "https://www.electronicsforyou.biz/wp-content/uploads/2026/02/MediaTek-India_Picture-2-880x587.jpg",
    "source": "Electronics For You BUSINESS"
  },
  {
    "title": "Samia to reopen Kariakoo market after post-fire reconstruction",
    "desc": "President Samia Suluhu Hassan is set to officially reopen the iconic Kariakoo Main Market on February 8, 2026, following years of reconstruction after the market was gutted by a major fire in...",
    "image": "https://www.thecitizen.co.tz/resource/image/5350456/landscape_ratio3x2/1200/800/70965371e65a3f84f968584c99dd5f06/NP/samia-kariakoo-pic.png",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Private 'abandoned' island off coast of Gwynedd on sale for price of a semi",
    "desc": "The island near Portmeirion was gifted by a queen and is home to a farmhouse that has been empty for decades",
    "image": "https://i2-prod.dailypost.co.uk/article33375582.ece/ALTERNATES/s1200/0_dpw060226cart_02jpeg.jpg",
    "source": "North Wales Live"
  },
  {
    "title": "Karnataka CM chair row: Siddaramaiah’s son Yathindra says no leadership change likely; Shivakumar reacts",
    "desc": "India News: NEW DELHI: Congress MLC Yathindra Siddaramaiah on Friday said he believed there would be no change in Karnataka’s leadership and that his father Sidda.",
    "image": "https://static.toiimg.com/thumb/msid-127988352,width-1280,height-720,imgsize-34050,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  }
]