[
  {
    "title": "How can we bridge the digital divide?",
    "desc": "Ours is an increasingly digital world.  If we need a financial loan, we use the web to research the best deals.  If we want to check some medical symptoms, the internet is usually the first place we turn to.  Need some food in a hurry?  A couple of clicks and it will be on your […]",
    "image": "https://media.alj.com/app/uploads/2026/01/ALJ-DigitalDivide-scaled.jpg",
    "source": "Abdul Latif Jameel"
  },
  {
    "title": "Aston Martin set to run on Thursday and Friday at Barcelona Shakedown",
    "desc": "Aston Martin have confirmed that they will join the Barcelona Shakedown later in the week, with the squad intending to run on Thursday and Friday.",
    "image": "https://media.formula1.com/image/upload/t_16by9Centre/c_lfill,w_2048/q_auto/v1740000000/fom-website/2026/Aston%20Martin/GettyImages-2233995642.webp",
    "source": "Formula 1"
  },
  {
    "title": "Kenyan cult leader faces charges over 52 further deaths",
    "desc": "Paul Mackenzie will be charged over a further 52 deaths at another village, prosecutors say.",
    "image": "https://cdn.radioafrica.digital/image/2026/01/24c255b0-73b7-45b5-b4eb-946e15a696f0.jpg?1769516931376",
    "source": "the-star.co.ke"
  },
  {
    "title": "Stigma, Not Medicine, Nigeria’s Biggest Barrier to Ending Leprosy - LTR",
    "desc": "Stigma rather than medical limitations remains the biggest obstacle to eliminating leprosy in Nigeria, the Leprosy and Tuberculosis Relief Initiative Nigeria (LTR) has said, as the world marks World Leprosy Day 2026.",
    "image": "https://mmo.aiircdn.com/370/5ec7c74371120.png",
    "source": "nigeriainfo.fm"
  },
  {
    "title": "Anatomy of a cheating scandal: How snark and tea-spilling communities are calling out influencers",
    "desc": "An alleged cheating scandal puts a little-known community in the spotlight. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/97d73140bae28a636ada02f39d6448d9b840ac7654b21220b34e31327fa24ad5",
    "source": "The Straits Times"
  },
  {
    "title": "Ghana donates engineering equipment to support Jamaica's recovery efforts",
    "desc": "President John Dramani Mahama has provided engineering equipment and supplies to the Jamaican Defence Force to aid ongoing recovery and reconstruction following Hurricane Melissa.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/01/1-62.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "How Trump’s Threats to Greenland Made Him a Liability for Europe’s Far Right",
    "desc": "Europe’s nationalist leaders once saw President Trump as an ideological ally. Now, as he threatens European sovereignty, they are seeking distance — at least for the moment.",
    "image": "https://static01.nyt.com/images/2026/01/27/multimedia/27int-europe-trump-right-top-kqvg/27int-europe-trump-right-top-kqvg-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Ken Agyapong's supporters will disappoint him - Prophet Emmanuel Worlasi",
    "desc": "The Head Pastor of the Kumasi Branch of Conquerors Chapel International, Prophet Emmanuel Worlasi, has predicted a huge disappointment for New Patriotic Party (NPP) flagbearer hopeful, Kennedy Agyapong, claiming that his perceived grassroots support...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/609/60911630.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Azerbaijan arrests three people over planned embassy attack in Baku",
    "desc": "Authorities accuse the suspects of conspiring with members of the ISKP armed group.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/01/AP19149424583078-1-1769509751.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Get to know Fonz, the content creator with a hilarious twist",
    "desc": "If you are in need of some comic relief, content creator Fonz is here to deliver with his funny and relatable TikTok content.\nWith 1.5 million followers, he has consistently showcased a versatile humor that shines through even in the simplest moments of life in his quirky skits.\nFrom his series about being a commuter, a crowd favorite, and even a “holdapper,” Fonz continues to win people's hearts with his witty twists and unexpected storylines.\nNow, he is set to blossom not only in content creation but also in acting as he prepares to star in the upcoming GMA Afternoon Prime series Apoy",
    "image": "https://aphrodite.gmanetwork.com/entertainment/gallery/1200_675_main_27-01-2026-1829_-20260127182945.jpg",
    "source": "GMA Network"
  }
]