[
  {
    "title": "Advocacy groups sue Trump administration over endangerment finding’s repeal",
    "desc": "The US Environmental Protection Agency rescinded the climate change finding as part of a push to slash regulation.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/ap_6996656cade77-1771464044.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Four injured, one critically, in gang-related shooting at Chch home",
    "desc": "Four people were injured, one critically, following a shooting at a home on Hoani St in Northcote, Christchurch last night.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/home-invasion-christchurch-northcote-O7C2SYPZVBHEXNIJKMJ6SJX2S4.jpg?auth=aba1e4f8d89e721136059f704ebc64d88574cea12f4248c643628b75d43fcbfc&quality=70&width=600&height=315&focal=960%2C540",
    "source": "1News"
  },
  {
    "title": "Varsity union loses bid to scrap officials' term limits",
    "desc": "Appeal judges agree with registrar's decision to cancel Uasu's amendments to its constitution.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/391a25b8-4812-4cd5-898d-875f9e11dd00.png?1771474586568",
    "source": "the-star.co.ke"
  },
  {
    "title": "Ex-NBA big man, Nikola Jokic teammate officially joins Pinoy basketball team",
    "desc": "Bol Bol has officially landed in the Philippines. The former NBA big man is ready to go in anchoring the TNT Tropang 5G’s upcoming Commissioner's Cup ...",
    "image": "https://basketnews.com/image-387510-any1200x1200.jpg",
    "source": "BasketNews.com"
  },
  {
    "title": "The Metrobank Travel Fair returns this February with travel deals you can't miss",
    "desc": "If seeing more of the world is in your 2026 vision board, consider this your sign to book that trip. The Metrobank Travel Fair is back from February 20-22, 2026...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/19/80267.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Morocco and Senegal Move to Modernize 33-Year-Old Film Co-Production Agreement",
    "desc": "Senegal, Morocco resume talks on film co-production pact\nCountries seek revised agreement on training, distribution\nPartnership produced two",
    "image": "https://www.ecofinagency.com/media/k2/items/cache/ea0d97fc3e7c698c96766882affefa99_S.jpg",
    "source": "Ecofin Agency"
  },
  {
    "title": "Sam Kerr is back to captain Australia for her fifth Women's Asian Cup",
    "desc": "Sam Kerr will captain Australia in her fifth Women’s Asian Cup and Matildas coach Joe Montemurro has decided to take a chance on Mary Fowler’s fitness by naming her in his squad for the Australia-hosted regional soccer tournament beginning in 10 days",
    "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RUGLRTKULZB6XPESJMXXJVLTDI.jpeg&w=1440",
    "source": "The Washington Post"
  },
  {
    "title": "Catholic bishops condemn police use of excessive force",
    "desc": "They expressed alarm over “the shrinking civic and democratic space” in the country.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/bb00f799-c320-401d-8320-5671fedfa897.jpg?1771468802718",
    "source": "the-star.co.ke"
  },
  {
    "title": "Three taken to hospital, including one with burn injuries, after fire in Singapore condo",
    "desc": "SINGAPORE: Six people were rescued and three were taken to hospital after a fire broke out in a condominium in Kovan in the early hours of Thursday (Feb 19).",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/19/3776158.jpg",
    "source": "The Star"
  },
  {
    "title": "Breakout stocks to buy or sell: Sumeet Bagadia recommends five shares to buy today - 19 February 2026",
    "desc": "Breakout stocks to buy or sell: Sumeet Bagadia recommends five shares to buy today — Senores Pharmaceuticals, ELGI Equipments, Lumax AutoTechnologies, Acutaas Chemicals, and Azad Engineering.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/19/1600x900/logo/Buy_or_sell_stock_Sumeet_Bagadia_1682145563109_1771465499753.jpg",
    "source": "Mint"
  }
]