[
  {
    "title": "‘Incredibly resilient’ nylon film makes electricity under pressure",
    "desc": "RMIT University researchers have developed a flexible nylon-film device that generates electricity from compression. Read more.",
    "image": "https://esdnews.com.au/wp-content/uploads/2026/02/nylon-film.jpg",
    "source": "Energy Source & Distribution"
  },
  {
    "title": "Uganda: Christians advised to observe Lent with spiritual reflection",
    "desc": "The Bishop of Kasese Diocese, Rt. Rev. Francis Aquirinus Kibira has urged Christians to meditate deeply on their inner attitude during the Lenten season, so",
    "image": "https://i3.wp.com/www.africa-newsroom.com/files/large/53455a04d1c1f3e?ssl=1",
    "source": "Africa.com"
  },
  {
    "title": "Microsoft Fixes Critical High-Severity Windows Admin Center Flaw That Enables Full Domain Compromise",
    "desc": "Microsoft has disclosed and addressed a high-severity security vulnerability in its Windows Admin Center platform that could allow attackers to escalate privileges across enterprise environments, potentially leading to widespread system compromise. The flaw, tracked as CVE-2026-26119, affects Window",
    "image": "https://media.licdn.com/dms/image/v2/D4E12AQEYkhy-_vbLYw/article-cover_image-shrink_720_1280/B4EZx3ZJ2iJYAI-/0/1771529615710?e=2147483647&v=beta&t=1Of6KWCZR0K1N9YcZ1PfMRkJNs88_iY5OTrFKexOPQU",
    "source": "LinkedIn"
  },
  {
    "title": "How police foiled terror plot targeting Nairobi",
    "desc": "The disrupted attack targeted social facilities, and was to coincide with the start of the holy month of Ramadan.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/xdGfm8CxeW0E1TQEdPlEYXFOwvGkP79AONgk5KYN.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "Action galore as Nairobi Region holds Term One championships",
    "desc": "Action-packed weekend in the city as teams battle for tickets to Nairobi Region Term One games.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/O1z2ITEPp35vgr2lghSw6JmjcpM8pNTxMms42r1M.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "Moroccan court sentences 19 fans to jail for AFCON hooliganism",
    "desc": "A Moroccan court Thursday sentenced 19 soccer fans to up to a year in prison on charges of hooliganism stemming from a chaotic Africa Cup of Nations final between Morocco and Senegal that saw supporters try to storm the field.",
    "image": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0219%2Fr1617421_1024x576_16%2D9.jpg",
    "source": "ESPN"
  },
  {
    "title": "CDC vaccine panel meeting postponed amid RFK Jr bid to reshape policy",
    "desc": "Postponement of ACIP meeting this month comes as US pediatricians challenge committee’s legitimacy in court",
    "image": "https://i.guim.co.uk/img/media/6adb6f45c8abe8fcf8138377713d59537a18e404/425_0_3334_2667/master/3334.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a9286ea9edec482649adb334e2f140a0",
    "source": "The Guardian"
  },
  {
    "title": "Team USA's Hilary Knight sets all-time U.S. hockey goal-scoring record",
    "desc": "U.S. hockey star Hilary Knight became the all-time leading scorer in U.S. women's hockey history at the Olympics in the most dramatic way possible when she scored her 15th career goal late in the gold medal game of the Milan Cortina Olympics.",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-02/260219-Hilary-Knight-ch-1538-45777f.jpg",
    "source": "NBC News"
  },
  {
    "title": "'I'm mentally exhausted' - Philippe Coutinho confirms departure from boyhood club Vasco da Gama",
    "desc": "Philippe Coutinho has departed boyhood club Vasco da Gama in Brazil, just six months after signing permanently after an initial loan spell. The 33-year-old former Liverpool and Barcelona star returned to his homeland after departing Aston Villa, but has decided to have his contract terminated at the club after he was reportedly booed by his own fans during a match against Volta Redonda last week.",
    "image": "https://assets.goal.com/images/v3/getty-2244709160/crop/MM5DINBSGI5DENBYG45G433XMU5DAORSGMYA====/GettyImages-2244709160.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Lil Poppa dead: Rapper dies aged 25 as tributes pour in for 'one of the best'",
    "desc": "Rapper Lil Poppa, real name Janarious Mykel Wheeler, has died at the age of 25 and fans of his music rushed to social media to pay their respects",
    "image": "https://i2-prod.mirror.co.uk/article36751677.ece/ALTERNATES/s1200/0_GettyImages-2182239077.jpg",
    "source": "The Mirror"
  }
]