[
  {
    "title": "Indonesia deports American after 11 years in Bali ‘suitcase murder’ case",
    "desc": "JAKARTA: Indonesia freed and deported an American man Tuesday after he spent 11 years in prison for the premeditated murder of his then-girlfriend’s mother on the tourist island of Bali.",
    "image": "https://www.arabnews.pk/sites/default/files/styles/660x371_watermarkpakistan/public/main-image/2026/02/25/4688415-1488576446.jpg?itok=bbReRu03",
    "source": "Arab News PK"
  },
  {
    "title": "Payments made easy, love made sweeter with PalmPay #LoveWithPalmPay Couples",
    "desc": "Love is found in the little things, a quick transfer for lunch, a shared savings goal for something special, or that last-minute bill payment that saves",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/PalmPay-winners-.png",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Mandelson's lawyers say he was arrested over 'baseless' claim he was a flight risk",
    "desc": "The peer's lawyers say there is no truth in the suggestion he was planning to leave the UK.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/343b/live/b9dd85d0-1212-11f1-b048-c9424b2cf5fd.jpg",
    "source": "BBC"
  },
  {
    "title": "Makueni launches mass registration for universal health coverage",
    "desc": "The county government has allocated Sh90 million to fund the programme, giving Sh3 million to each of the 30 wards.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/b611e8d6-b8c9-4cda-aae3-9c84b1e65aee.jpg?1772012136830",
    "source": "the-star.co.ke"
  },
  {
    "title": "Stars goalie Jake Oettinger skips Team USA’s White House, State of the Union appearances",
    "desc": "Stars goalie Jake Oettinger skips Team USA's White House visit.",
    "image": "https://dmn-dallas-news-prod.cdn.arcpublishing.com/resizer/v2/BDO5OT2HXZE4PLQE2UBCWFUFHU.jpg?auth=d0d1845aa455b7403f88f266189a7699b86698dd45cfafcc7f23f6d6968dd4f2&quality=80&width=1200&height=630&smart=true",
    "source": "Dallas News"
  },
  {
    "title": "Bridge linking K-P, Punjab closed after suicide attack at Bhakkar checkpost",
    "desc": "Closure leaves commuters, transporters stranded, affects those travelling during Ramazan",
    "image": "https://i.tribune.com.pk/media/images/untitled-design-2026-02-25t132723-0671772008049-0/untitled-design-2026-02-25t132723-0671772008049-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Ignore fake traffic fine messages, police caution public",
    "desc": "The Ghana Police Service has warned the public about a viral electronic notice falsely claiming to be an official message on traffic offences and fines.",
    "image": "https://www.graphic.com.gh/images/2026/Feb/25/policebadge.jpg",
    "source": "Graphic Online"
  },
  {
    "title": "34 schools around Cavite unite for LYCESGO Youth Summit",
    "desc": "Student leaders from 34 schools across the province gathered at the Lyceum of the Philippines University–Cavite for the annual Youth Summit organized by the...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/25/81863.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Jail was like a hotel - Wanlov recalls U.S. lockup experience",
    "desc": "Ghanaian singer Emmanuel Owusu-Bonsu, popularly known as Wanlov, has revealed that, after completing his secondary school education in Ghana, he moved to Texas to study Business and Computer Science at the University of Mary Hardin-Baylor.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/420/42022586.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "AI vibe coding to replace frontend developers by 2028",
    "desc": "The role of frontend engineers will vanish by 2028 as \"vibe coding\" empowers designers to build products directly, experts from MyOp, Pic-Time, and Bezalel Academy told The Jerusalem Post.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/696103",
    "source": "The Jerusalem Post"
  }
]