[
  {
    "title": "From windstorm to resilience: How Wa school is growing climate protection",
    "desc": "In an era where climate risks such as windstorms and erratic rainfall are intensifying across northern Ghana, one school in the Wa Municipality offers compelling evidence that simple, community-led interventions can deliver long-term climate resilience.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Wa-school.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Berlin Film Festival Award Winners (Updating Live)",
    "desc": "Jury president Wim Wenders will present the Golden Bear for best film in the Berlin Film Festival's main competition, as winners are announced live.",
    "image": "https://variety.com/wp-content/uploads/2020/02/golden-bear-berlin.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Sacramento Republic sign MLS veteran midfielder Memo Rodriguez to free agent deal",
    "desc": "USL Championship side Sacramento Republic have signed former Houston Dynamo and Sporting Kansas City midfielder Memo Rodriguez, sources told GOAL. The Texan midfielder will pen a two year deal with the USL giants, who finished second in the Western Conference last season. It continues a busy winter for Sacramento, following the signing of Canada's Mark-Anthony Kaye.",
    "image": "https://assets.goal.com/images/v3/blt07015d8768e4d537/GOAL%20-%20Blank%20WEB%20-%20Facebook%20-%202026-02-20T181937.996.png",
    "source": "Goal.com"
  },
  {
    "title": "Lil Jon's Son DJ Young Slade Laid to Rest on First Day of Ramadan",
    "desc": "DJ Young Slade -- Lil Jon's son -- was laid to rest this week after his father confirmed his death earlier this month.",
    "image": "https://imagez.tmz.com/image/4e/16by9/2026/02/21/4e36f3d35c7348368b8dad5663b85ad6_xl.png",
    "source": "TMZ"
  },
  {
    "title": "Chelsea player ratings vs Burnley: Wesley Fofana, that is CRAZY! Frenchman's stupid red card costs Blues dearly as James Ward-Prowse proves he's still a set-piece king",
    "desc": "GOAL rates Chelsea's players from their 1-1 draw with Burnley in the Premier League.",
    "image": "https://assets.goal.com/images/v3/blt8e275ab7447ce732/GOAL%20-%20Multiple%20Images%20-%203%20Stacked%20-%20Facebook%20(1)%20(1).jpg",
    "source": "Goal.com"
  },
  {
    "title": "Ubisoft Montpellier evacuated after bomb threat prompts police response",
    "desc": "Nearly 800 people evacuated from Ubisoft Montpellier following bomb threat in Castelnau-le-Lez",
    "image": "https://i.tribune.com.pk/media/images/ubisoft1764112514-0/ubisoft1764112514-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Pakistan-New Zealand Super Eights opener abandoned at T20 World Cup",
    "desc": "Persistent rain in Colombo forces abandonment of Pakistan’s game with New Zealand, which was to open Super Eights stage.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/AFP__20260221__98GB7FN__v1__MidRes__CricketIccMensT20Wc2026PakNzl-1771690096.jpg?resize=1200%2C630",
    "source": "Al Jazeera"
  },
  {
    "title": "Indian influencer claims he and his wife were detained by immigration in South Korea and China in viral video",
    "desc": "Trending News: Sachin Awasthi, an Indian content creator says he was detained by immigration authorities in both South Korea and China while traveling with his wife..",
    "image": "https://static.toiimg.com/thumb/msid-128650134,width-1280,height-720,imgsize-748456,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "‘Immensely heartened’: Sally Rooney hails Palestine Action high court ruling as victory for UK civil liberties",
    "desc": "Exclusive: Irish author, who feared her books being withdrawn from UK, says proscription had been ‘extreme assault’ on rights and freedoms",
    "image": "https://i.guim.co.uk/img/media/dc0871aecd0538c73bd0a8b8760d545210b916c6/560_0_5600_4480/master/5600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=922891e429f1f055563e95574e2590a0",
    "source": "The Guardian"
  },
  {
    "title": "Aotearoa NZ Festival of the Arts in Wellington runs from February 24 - March 15",
    "desc": "On its 40th anniversary, Aotearoa New Zealand Festival of the Arts is set to be a bold, multi-disciplinary celebration of creativity, remembrance, and...",
    "image": "https://www.nzherald.co.nz/resizer/v2/54EZM4KKERD2LEY3N7PBZQATUE.jpg?auth=179b068056550f718ce8308c9583a612c0b1e9125b86774847c15028a21529cc&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  }
]