[
  {
    "title": "Women legislators launch art exhibition for a cause",
    "desc": "The Association of Women Legislators Foundation, Inc. (AWLFI) recently marked National Arts Month this February with the launch of an art exhibition dubbed...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/10/78280.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "High Court sets April hearings for Gachagua’s compensation claim",
    "desc": "Former Deputy President to present his case from April 14, with the State responding on April 15",
    "image": "https://cdn.radioafrica.digital/image/2026/02/3f770147-4ad0-4591-adc9-072a27824c6c.jpeg?1770736883543",
    "source": "the-star.co.ke"
  },
  {
    "title": "Day monitor giveaway for local students",
    "desc": "Acer Africa has announced a new student-focused campaign, the 26 Days Monitor Giveaway, for those starting the 2026 academic year.",
    "image": "https://htxt.co.za/wp-content/uploads/2026/02/acer-monitor-giveaway-header.jpg",
    "source": "htxt.co.za"
  },
  {
    "title": "Ethiopia’s Foreign Minister Holds Talks with Zambian Counterpart",
    "desc": "Addis Ababa, February 9, 2026 (ENA)—Ethiopia’s Minister of Foreign Affairs, Gedion Timothewos, this afternoon, held bilateral talks with his Zambian counterpart, Mulambo Haimbe, who is in Addis Ababa to attend the 48th Ordinary Session of the Executive Council of the African Union and the 39th Ordinary Session of the African Union Assembly of Heads of State and Government.\nDuring the meeting, Minister Gedion described the relationship between Ethiopia and Zambia as historic and robust, underscoring the need to translate the longstanding political ties into stronger economic cooperation.\nHe highlighted opportunities for expanding trade relations, noting in particular the potential for Ethiopian textile and apparel products to access the Zambian market.\nFor his part, Zambian Foreign Minister Mulambo Haimbe emphasized the importance of further strengthening bilateral trade and economic relations, stressing the mutual benefits of enhanced commercial engagement between the two countries.\nThe two ministers agreed to convene a joint political consultation mechanism aimed at deepening bilateral cooperation across various sectors.\nThey also exchanged views on regional and international issues of mutual interest, reaffirming their commitment to continued collaboration within continental and multilateral frameworks.",
    "image": "https://www.ena.et/documents/42142/0/629011945_1210600407891787_403195481124697999_n.jpg/e53e1ad4-b66d-9b0d-d8be-2639966fc969?version=1.0&t=1770730868013&download=true",
    "source": "ENA English"
  },
  {
    "title": "Man Utd can lure Vinicius Junior away from Real Madrid if Michael Carrick gets permanent manager job, claims Louis Saha",
    "desc": "Manchester United are capable of luring Vinicius Junior away from Real Madrid, claims Luis Saha, with Michael Carrick restoring positivity and optimism to Old Trafford. It remains to be seen who will be calling the shots when another transfer window swings open, but the Red Devils are expected to enjoy a busy summer in 2026 and may line up a raid on Santiago Bernabeu.",
    "image": "https://assets.goal.com/images/v3/blt5983f6ca988386d1/GOAL%20-%20Blank%20WEB%20-%20Facebook%20-%202026-02-10T131602.938.png",
    "source": "Goal.com"
  },
  {
    "title": "City St George’s University of London Global STEM Leadership Masters Scholarship 2026 for International Students in the UK",
    "desc": "You can apply and may be eligible for the City St George’s University of London Global STEM Leadership Scholarship Programme.",
    "image": "https://www.afterschoolafrica.com/wp-content/uploads/2026/02/george.jpg",
    "source": "After School Africa"
  },
  {
    "title": "US figure skater Amber Glenn resolves Winter Olympics music dispute with Canadian artist",
    "desc": "The US figure skater Amber Glenn said Tuesday that she has resolved copyright concerns with the Canadian recording artist Seb McKinnon",
    "image": "https://i.guim.co.uk/img/media/3e57bd7e40aeae82e19c71b8720cea029cee83a6/655_0_6548_5239/master/6548.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3b8fb1b66cdd1a30ec9b53ff23776ed2",
    "source": "The Guardian"
  },
  {
    "title": "Nelson Mandela’s release from prison: 36 years on",
    "desc": "This year marks 36 years since the release of Nelson Mandela from prison. On 11 February 1990, Madiba walked free after 27 years of incarceration, an event that marked a",
    "image": "https://www.nelsonmandela.org/uploads/files/_600xAUTO_crop_center-center_none/Mandela_2026-02-10-133245_woti.webp",
    "source": "Nelson Mandela Foundation"
  },
  {
    "title": "Man Utd can lure Vinicius Junior away from Real Madrid if Michael Carrick gets permanent manager job, claims Louis Saha",
    "desc": "Manchester United are capable of luring Vinicius Junior away from Real Madrid, claims Luis Saha, with Michael Carrick restoring positivity and optimism to Old Trafford. It remains to be seen who will be calling the shots when another transfer window swings open, but the Red Devils are expected to enjoy a busy summer in 2026 and may line up a raid on Santiago Bernabeu.",
    "image": "https://assets.goal.com/images/v3/blt5983f6ca988386d1/GOAL%20-%20Blank%20WEB%20-%20Facebook%20-%202026-02-10T131602.938.png",
    "source": "Goal.com"
  },
  {
    "title": "Tanzania notes success in management of inputs,data systems",
    "desc": "NAIROBI: THE Deputy Minister for Agriculture, David Silinde has represented Tanzania at the Private Sector Engagement Summit on Sustainable Food Trade and Investment in Africa, held in Nairobi, Kenya. The summit jointly organised by the OECD and the government of Kenya and opened by Kenya’s Cabinet Secretary for Information, Communication and Digital Economy, William Kabogo",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/TANZANIA-YASHIRIKI-MKUTANO-WA-KUHAMASISHA-UWEKEZAJI-KATIKA-SEKTA-YA-KILIMO-NA-CHAKULA-BARANI-AFR.jpg",
    "source": "dailynews.co.tz"
  }
]