[
  {
    "title": "Late Night Finds Trump Out of Place at Prayer Breakfast",
    "desc": "The annual National Prayer Breakfast “is supposed to be a normal, nonpartisan event,” Seth Meyers said, “but, of course, Donald Trump is incapable of being normal.”",
    "image": "https://static01.nyt.com/images/2026/02/06/arts/06latenight/06latenight-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Dennis Gicheru appointed acting FKF CEO amid Kandanda House power struggle",
    "desc": "The former Wazito FC CEO, who currently serves as FKF’s Head of Legal and Integrity departments, takes over the role with immediate effect, according to an offi...",
    "image": "https://publish.eastleighvoice.co.ke/mugera_lock/uploads/2026/02/619331959_26118855784388181_1141248180796423189_n-1.jpg",
    "source": "eastleighvoice.co.ke"
  },
  {
    "title": "Minister: We’re not subdividing Isalalo forest land for human use",
    "desc": "DODOMA: THE government has said it has no plans to excise any part of the Isalalo Forest Reserve in Songwe Region for human settlement, stressing that the protected area must remain intact to safeguard water sources and the ecosystem. Deputy Minister for Natural Resources and Tourism, Hamad Chande, made the clarification in the National Assembly",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/IsaloNationalPark-Tapia_7024.webp",
    "source": "dailynews.co.tz"
  },
  {
    "title": "12 fresh charges for woman who harassed nurse during pandemic, created ruckus at lion dance event in Singapore",
    "desc": "SINGAPORE: A woman who was fined S$4,000 in 2022 after harassing her neighbour, a nurse, amid the Covid-19 outbreak now faces 12 charges for unrelated offences, including multiple counts of assault.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/06/3757569.jpg",
    "source": "The Star"
  },
  {
    "title": "KPK Uncovers Rp 7 Billion Monthly Bribe Scheme Involving Customs Officials",
    "desc": "The payments were made on a monthly basis in exchange for clearing illegal imports ranging from shoes to other counterfeit products.",
    "image": "https://img2.beritasatu.com/cache/jakartaglobe/960x620-w/2026/01/1768306936-5052x3361.webp",
    "source": "Jakarta Globe"
  },
  {
    "title": "Patriarch of Jerusalem held a series of meetings",
    "desc": "On Wednesday, February 4, 2026, Patriarch Theophilos III of Jerusalem received the following visitors: A. The President of the Parliament of Romania, Sorin Grindeanu, accompanied by the President of the Jewish Community in Romania, the Representative of the Romanian Patriarchate in Jerusalem, Archimandrite Ioannis Meïou, and a delegation of his…",
    "image": "https://orthodoxtimes.com/wp-content/uploads/2026/02/front-5.jpg",
    "source": "Orthodox Times"
  },
  {
    "title": "Government accelerates digital connectivity",
    "desc": "DODOMA: THE government has given new energy to the nation’s digital transformation agenda, with significant progress reported in the first 100 days of President Samia Suluhu Hassan’s renewed mandate. The Ministry of Information, Communication and Information Technology highlighted key achievements in expanding digital connectivity across the country, aiming to ensure more citizens and businesses can",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/connectivity.webp",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Man jailed 20 years for defiling 12-year-old girl",
    "desc": "The court also convicted him on an alternative charge of committing an indecent act with a child.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/e9175d0b-b606-4f5f-a97f-ac48dfe0684e.png?1770362587272",
    "source": "the-star.co.ke"
  },
  {
    "title": "The Culture 5 - your cultural highlights for the next seven days",
    "desc": "Hear The Culture 5 every Friday on Aedín in the Afternoon on RTÉ lyric fm, from 1 pm",
    "image": "https://www.rte.ie/images/0023d907-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Allahabad High Court orders release of Wiztown director in Noida techie death case",
    "desc": "The Greater Noida Police arrested the director after an FIR was registered over the death of a 27-year-old software engineer.",
    "image": "https://media.assettype.com/barandbench%2F2024-10-13%2Fjk1engmq%2FAllahabadHC.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Bar and Bench"
  }
]