[
  {
    "title": "Man City player ratings vs Newcastle: Erling Haaland turns provider as Nico O'Reilly takes centre-stage to pile pressure on Arsenal in title race",
    "desc": "Rating the Manchester City players from their 2-1 win over Newcastle in the Premier League",
    "image": "https://assets.goal.com/images/v3/bltf427903f97bc628f/Goal%20HIC%20-%20LinkedIn%20(2).jpg",
    "source": "Goal.com"
  },
  {
    "title": "Every Shining Game, Ranked",
    "desc": "A light in the darkness - The Shining series may well be best known for its line of tactics RPGs, most notably the Shining Force sub-series, but the 35-year-...",
    "image": "https://images.timeextension.com/9829386330bcd/large.jpg",
    "source": "Time Extension"
  },
  {
    "title": "South Africa: Measles, rubella and diphtheria updates",
    "desc": "Measles",
    "image": "https://substackcdn.com/image/fetch/$s_!fdj7!,w_1200,h_675,c_fill,f_jpg,q_auto:good,fl_progressive:steep,g_auto/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Faa424c68-31fd-4a64-804b-87772d130fb5_753x556.png",
    "source": "Outbreak News Today"
  },
  {
    "title": "Ethiopia to commercially cultivate GMO maize",
    "desc": "A genetically modified (GM) variety of maize is set to be commercially grown in Ethiopia for the first time this year. The government has approved a 10-year permit for the crop, starting with a trial batch of about 80 kilograms of seed supplied by Bayer, the German chemical giant. The move follows field trials conducted between 2023 and 2024 in Wondogenet, Melkassa, and Bako, which, according to the Ethiopian Environmental Protection Authority, showed the GM maize outperformed traditional varieties. The decision represents a major policy shift in Ethiopia’s agricultural sector, even amid ongoing concerns about the potential health and environmental…",
    "image": "https://ethiopiaobserver.com/wp-content/uploads/2018/01/favicon.jpg",
    "source": "Ethiopia Observer"
  },
  {
    "title": "Man City close in on Arsenal after nervy Newcastle win",
    "desc": "Nico O'Reilly scored twice in the first half as Manchester City cut Arsenal's Premier League lead to two points with a nervy 2-1 win over Newcastle.",
    "image": "https://www.rte.ie/images/0023eedf-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Businesses in Obuasi and its environs urged to support the police to provide security",
    "desc": "By Samuel Ofori Boateng Bekwai (Ash), Feb. 21, GNA – Business operators and businesses in Obuasi and its surrounding communities, have been urged to support the police with…",
    "image": "https://gna.org.gh/web/wp-content/uploads/2026/02/ksi-Social-Donation-Police-1.jpg",
    "source": "Ghana News Agency"
  },
  {
    "title": "Ghana's Last Big Oil Gamble Heads Underground",
    "desc": "Ghana is preparing to drill its first onshore exploration well in more than five decades, a moment that could either open a new chapter for the country's declining petroleum industry or confirm that its most promising frontier remains frustratingly out of reach. Explorco, the exploration subsidiary of the Ghana National…",
    "image": "https://www.newsghana.com.gh/wp-content/uploads/2024/08/logo-newsghana.png",
    "source": "News Ghana"
  },
  {
    "title": "What happens next after the Supreme Court slapped down Trump's tariffs",
    "desc": "The ruling is a striking blow to Trump, who has said the tariffs are 'vital' negotiating tools to reach deals on foreign policy and trade.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/president-donald-trump-arrives-to-speak-with-reporters-in-th-66L7HKVARNABZBXFHNRRFAQNKM.jpg?auth=5c1f03da5edfa0de2059392ad1aa3cf3f59b90237e949218c8f67cc187eb8e95&quality=70&width=600&height=315&focal=2850%2C562",
    "source": "1News"
  },
  {
    "title": "1 Newcastle (Feb 21, 2026) Game Analysis",
    "desc": "Expert recap and game analysis of the Manchester City vs. Newcastle United English Premier League game from February 21, 2026 on ESPN.",
    "image": "https://a.espncdn.com/combiner/i?img=/i/espn/misc_logos/500/soccer.png",
    "source": "ESPN"
  },
  {
    "title": "Iran’s Students Hold Anti-Regime Protests as Universities Reopen",
    "desc": "Students helped grow initial protests into a national movement crushed by the government. As the new semester began, they chanted and marched again.",
    "image": "https://static01.nyt.com/images/2026/02/21/multimedia/21int-iran-protests-gqhb/21int-iran-protests-gqhb-facebookJumbo.jpg",
    "source": "The New York Times"
  }
]