[
  {
    "title": "Trump administration eyes US Pacific territories as it moves towards deep",
    "desc": "A Trump administration push to begin deep-sea mining is gathering momentum — and stirring alarm in United States Pacific territories.",
    "image": "https://live-production.wcms.abc-cdn.net.au/934e9f8ce0764d5ffce6ae265d3a5e2e?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=257&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "China urges citizens to avoid travel to Asia's safest country after $2.7M street robbery",
    "desc": "The Chinese Embassy in Tokyo on Jan. 30 renewed a safety advisory recommending that Chinese nationals reconsider travel to Japan following a major street cash robbery in the capital. - VnExpress International",
    "image": "https://vcdn1-english.vnecdn.net/2026/01/31/tixung1017563670515526175637-1-1114-2263-1769846969.jpg?w=680&h=0&q=100&dpr=1&fit=crop&s=WVWu4hQc75MuzP8hDsEMtA",
    "source": "VnExpress International"
  },
  {
    "title": "Strategic Tree Planting Brings Meaningful Carbon Reductions",
    "desc": "A new study finds that Canada could remove at least five times its annual carbon emissions with strategic planting of more than six million hectares of trees along the northern edge of the boreal forest. Researchers at the University of Waterloo factored in satellite data, fire probabilities, loss of vegetation, and climate variables to estimate...",
    "image": "https://www.eurasiareview.com/wp-content/uploads/2020/06/a-3.jpg",
    "source": "Eurasia Review"
  },
  {
    "title": "McElhinney wins 3,000m at Boston University Classic",
    "desc": "Ireland's Darragh McElhinney won the 3,000m race at the Boston University John Thomas Terrier Classic on Saturday, coming home in in a time of 7:38.96.",
    "image": "https://www.rte.ie/images/0023d4a2-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Nico Antic, 12yo shark attack victim, honoured with paddle",
    "desc": "Hundreds of paddle boarders and others journey into the waves of North Bondi to pay tribute to 12-year-old shark victim Nico Antic.",
    "image": "https://live-production.wcms.abc-cdn.net.au/311404ea9e54b83fa5caca66a61edecd?impolicy=wcms_watermark_news&cropH=2515&cropW=4471&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "This Artificial Intelligence (AI) Stock Could Make Investors Richer by the End of 2026",
    "desc": "Accelerating investment in AI infrastructure will remain a strong tailwind for chip stocks -- and not just the GPU specialists.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F852221%2Fmicron-technology-sign-with-micron-logo-in-front-of-building-with-micron-logo_micron.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "WWE Royal Rumble 2026 LIVE RESULTS: Roman Reigns WINS, heartbreak for Gunther after Randy Orton elimination - reaction",
    "desc": "ROMAN REIGNS has won the WWE Royal Rumble in Riyadh. The men’s main event saw 30 superstars like Cody Rhodes, Logan Paul and Brock Lesnar battle it out for the right to fight at Wrestlemania …",
    "image": "https://www.thesun.co.uk/wp-content/uploads/2026/01/crop-15871403.webp?w=1920&h=1080&crop=1",
    "source": "The Sun"
  },
  {
    "title": "Naval Officer Yerima, Known For Confronting FCT Minister Wike, Allegedly Bypasses Airport Screening With Pistol, Slams ValueJet For “Disrespect” After Interception",
    "desc": "A Nigerian Navy officer, Lieutenant Adam Muhammad Yerima, has been accused of breaching aviation security protocols after allegedly bypassing mandatory passenger screening and attempting to board a commercial flight with a pistol.",
    "image": "https://saharareporters.com/themes/custom/octavia_sahara/favicon.ico",
    "source": "Sahara Reporters"
  },
  {
    "title": "'Applicable to all': BCB targets journalists, imposes sudden restrictions after T20 World Cup snub",
    "desc": "Cricket News: NEW DELHI: The Bangladesh Cricket Board (BCB) has announced new restrictions for journalists entering the Sher-e-Bangla National Cricket Stadium in Dh.",
    "image": "https://static.toiimg.com/thumb/msid-127824500,width-1280,height-720,imgsize-107352,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Clawdbot users are snapping up the Mac Mini - buy right now for under $550 at Amazon",
    "desc": "The M4 Mac Mini is on sale at Amazon for $549, down from the normal price of $599.",
    "image": "https://helios-i.mashable.com/imagery/articles/06kBGComO6QjR2zO1BHYxX1/hero-image.fill.size_1200x675.v1769858500.jpg",
    "source": "Mashable"
  }
]