[
  {
    "title": "Congo-Kinshasa: Bisimwa Condemns 'Indifference' of Mediators Amid Kinshasa's Attacks",
    "desc": "AFC/M23 movement deputy coordinator, Bertrand Bisimwa has condemned what he describes as the \"indifference\" of peace mediators amid large-scale attacks on civilians in Minembwe and other areas of South Kivu province.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Enoch Burke removed from High Court during hearing",
    "desc": "Enoch Burke has been removed from the High Court, with a judge in his case against a disciplinary body directing gardaí to return him to Mountjoy Prison, where the proceedings are due to resume via videolink.",
    "image": "https://www.rte.ie/images/0023650f-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Latvia's greenhouses busy despite cold",
    "desc": "While January and February brought real winter frosts to Latvia, work continued unabated in the greenhouses. Young people from Bulduri Technical School are now planting spring flowers, while cucumbers...",
    "image": "https://static.lsm.lv/media/2026/02/large/1/src7.jpg",
    "source": "LSM"
  },
  {
    "title": "2026 Phillip Island WorldSBK: Friday Practice Results",
    "desc": "Full results from Friday practice for the 2026 Australian World Superbike season-opener at Phillip Island.",
    "image": "https://cdn.crash.net/2026-02/gng_1291047_hires.jpg?width=1600&aspect_ratio=16:9",
    "source": "crash.net"
  },
  {
    "title": "Kimbap Heaven Simulator Brings a Korean Neighborhood Diner Experience to Steam Next Fest - Public Demo Arrives March 23",
    "desc": "Press releases and assets from across the games industry - screenshots, videos, logos, packshots, artwork, PR contacts, release dates",
    "image": "https://www.gamespress.com/Content/Themes/Games Press/img/favicon.ico",
    "source": "Games Press"
  },
  {
    "title": "Tanzania: Optician Urges Routine Eye Screening",
    "desc": "LACK of regular medical checkups and environmental pollution have been cited as major factors contributing to the increase in eye problems facing most Tanzanians.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Ghana retains top spot in GSMA’s 2025 mobile money regulatory index",
    "desc": "Ghana has maintained its position as the world’s leading country in mobile money regulation, according to the Global System for Mobile Communications Association (GSMA) Mobile Money Regulatory Index (MMRI) 2025.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/MoMo-Interoperability.webp",
    "source": "MyJoyOnline"
  },
  {
    "title": "Botswana targets drug manufacturing in health emergency recovery",
    "desc": "The country is in talks with producers of generic drugs to develop local production.",
    "image": "https://img.semafor.com/3bd5915b13890f6655c68f5536f2b67a2500ebc2-5424x3616.jpg?rect=0,384,5424,2848&w=1200&h=630&q=75&auto=format",
    "source": "Semafor"
  },
  {
    "title": "UK Athletics pleads guilty to corporate manslaughter after death of Paralympian",
    "desc": "UK Athletics is facing a seven-figure fine after pleading guilty to corporate manslaughter following the death of a Paralympian who was hit on the head by a metal pole while preparing the London World Para Athletics Championships in 2017",
    "image": "https://i.guim.co.uk/img/media/0f67bac05f6f4cec133befb8567859aaa1307683/484_1619_2488_1990/master/2488.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=10f1c9fb81b88194d2c42fc0b6a0b58b",
    "source": "The Guardian"
  },
  {
    "title": "'So young, so much life to live' - Teens found dead in holiday park lodge at half term pictured for first time",
    "desc": "Ethan and Cherish died at Little Eden Holiday Park during half-term",
    "image": "https://i2-prod.manchestereveningnews.co.uk/article33459398.ece/ALTERNATES/s1200/0_ethanJPG.jpg",
    "source": "Manchester Evening News"
  }
]