[
  {
    "title": "Man sentenced to 35 years for killing reveller after bar dispute in Nanyuki",
    "desc": "The Court in Nanyuki has sentenced a suspect to 35 years over murder charges, after finding him guilty of killing a man following a disagreement at a bar in 2017.",
    "image": "https://assets.citizen.digital/153373/conversions/odpp-og_image.webp",
    "source": "Citizen Digital"
  },
  {
    "title": "Independent Labour Dispute Commission to be Established",
    "desc": "By: Annakleta Haikera   Namibia is taking steps to establish an independent Commission for Alternative Dispute Resolution (CADR) aimed at improving the speed, fairness, and professionalism of labour dispute handling.",
    "image": "https://www.thevillager.com.na/wp-content/uploads/2026/02/Demonstration-with-posters.jpg",
    "source": "The Villager Newspaper"
  },
  {
    "title": "Lobbying firm co-founded by Mandelson goes into administration",
    "desc": "Global Counsel's clients cut ties with the firm over Lord Mandelson's links with sex offender Jeffrey Epstein.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/da97/live/fc073c10-0daa-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  },
  {
    "title": "Blueprint for safe, standardised traditional medicine in Tanzania",
    "desc": "Experts caution that cultural trust, while important, cannot substitute scientific validation",
    "image": "https://www.thecitizen.co.tz/resource/image/5366550/landscape_ratio3x2/1200/800/e457261c9d322d8e32119b68725d9ffa/RT/medpic.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Nicky Byrne to return for 100th episode of DWTS",
    "desc": "Dancing with the Stars will celebrate its 100th episode with the return of former presenter and Westlife star Nicky Byrne for one night only this Sunday on RTÉ One and the RTÉ Player.",
    "image": "https://www.rte.ie/images/0009ff76-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "UK bank announces sale of Botswana subsidiary as top African banks bid for takeover",
    "desc": "Standard Chartered plans to sell its Botswana business, attracting interest from South Africa’s big banks as regional lenders expand and global players scale back in Africa. | Business Insider Africa",
    "image": "https://ocdn.eu/pulscms-transforms/1/yE5ktkpTURBXy9mMjY5OWFmNjdmOGVhMjM4YzUxMDcxOGYxZTI5MmQyYi5qcGeSlQMAAM0XcM0NL5MFzQSwzQJ2",
    "source": "Business Insider Africa"
  },
  {
    "title": "Winter Olympics 2026: Gus Kenworthy took death threats over ICE post 'with grain of salt'",
    "desc": "Team GB's Gus Kenworthy says he took the death threats he received after he posted a graphic message about the United States' ICE organisation with a pinch of salt.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4a98/live/2964d8c0-0e55-11f1-9d6e-2b202385ad19.jpg",
    "source": "BBC"
  },
  {
    "title": "'No point' giving SNA review completion date",
    "desc": "There is \"no point\" in announcing a target completion for a review of special needs assistant allocations, Minister of State for Special Education Michael Moynihan has said.",
    "image": "https://www.rte.ie/images/00060579-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Gardaí yet to identify man attacked in Temple Bar area",
    "desc": "Gardaí have yet to identify the man left in a critical condition after an assault in Dublin's Temple Bar in the early hours of Wednesday morning.",
    "image": "https://www.rte.ie/images/0023ebeb-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Tanzanian justice nominated for ICC bench",
    "desc": "A Tanzanian justuce has been shortlisted for election to the bench of the International Criminal Court (ICC) as the court elects six judges this year.",
    "image": "https://www.thecitizen.co.tz/resource/image/5366538/landscape_ratio3x2/1200/800/642b6a794132c93df62425895cd56b3d/Fk/attorney-pic.jpg",
    "source": "thecitizen.co.tz"
  }
]