[
  {
    "title": "New backdoor found in Android tablets targeting users in Russia, Germany and Japan",
    "desc": "In a report released this week, Russian cybersecurity firm Kaspersky said it uncovered a previously undocumented backdoor dubbed Keenadu that is built directly into a device’s core software, allowing it to load into every application launched on the tablet.",
    "image": "https://cms.therecord.media/uploads/format_webp/dima_pechurin_J_Ubj_Y_Fv_Cv00_unsplash_d6cfd67cd3.jpg",
    "source": "The Record from Recorded Future News"
  },
  {
    "title": "Miguel Escueta drops grittier remake of OPM classic",
    "desc": "Miguel Escueta kicks off the year with a rockin’ start with the release of his latest single — an edgier, rock-tinged remake of the OPM classic, Bakit Ba...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/18/80249.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Arbitrator settles flight attendant wages at Air Canada",
    "desc": "An arbitrator reviewing wages for flight attendants at Air Canada has finalized rates at the airline, bringing an end to the labour dispute that saw travel disrupted for thousands of people last summer.",
    "image": "https://www.castanet.net/content/2026/2/e25b843992165b9cfb7f49bf4954d9fa12e30ab374c47dae524687d0533371c5.jpg",
    "source": "Castanet"
  },
  {
    "title": "Penang PH ramps up preparations for GE16",
    "desc": "Penang Pakatan Harapan chairman Chow Kon Yeow says 2026 is pivotal for the coalition to consolidate and improve governance.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2025/02/cbe66dc1-chow-kon-yeow-fmt-resize-230225-1.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Uber comedy-drama about Palestinian, Israeli premieres at Berlinale",
    "desc": "Sell-out crowd for Where To?' from director Assaf Machnes, which is competing for Best Debut Film Award in Berlin film festival",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/02/1472528_whereto_26386.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Vinicius Junior: Benfica claim 'defamation campaign' against Gianluca Prestianni after racism allegation",
    "desc": "Benfica claim there is a \"defamation campaign\" against Gianluca Prestianni as Uefa launch an investigation into claims he racially abused Real Madrid's Vinicius Jr.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/06d9/live/64670730-0cdf-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  },
  {
    "title": "They may have rare diseases, but they're 'not rare people'",
    "desc": "Atlantic Canadians with rare diseases often struggle to be heard, get a diagnosis and get treatment because their conditions are so unknown",
    "image": "https://smartcdn.gprod.postmedia.digital/saltwire/wp-content/uploads/2026/02/0225-cb-rare-disease-3_301524565.jpg",
    "source": "PNI Atlantic News"
  },
  {
    "title": "Foo Fighters support gig ‘mind blowing’",
    "desc": "Members of a Dunedin secondary school band say they are \"mind blown\" to be supporting the Foo Fighters in Christchurch next year. SEEK HELP!, from...",
    "image": "https://www.odt.co.nz/sites/default/files/styles/odt_story_opengraph_1200w/public/story/2026/02/seek_help_band_18022026.jpg?itok=wgYiHIxR",
    "source": "Otago Daily Times"
  },
  {
    "title": "Kraken acquires token manager Magna as crypto exchange prepares for IPO",
    "desc": "Over the past year, Kraken has struck deals for five other companies, including a blockbuster $1.5 billion deal for futures platform NinjaTrader.",
    "image": "https://fortune.com/img-assets/wp-content/uploads/2026/02/GettyImages-2238249927-1-e1771426034607.jpg?resize=1200,600",
    "source": "Fortune"
  },
  {
    "title": "Prince Harry's ex Cressida Bonas breaks silence on personal loss after major life setback",
    "desc": "Cressida Bonas, Prince Harry's ex-girlfriend, opened up about her grief after major life setback.The 37-year-old has spoken in details for the first time about her heartbreak over watching her 'miracle' sister die from cancer,...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-18/l_651628_083140_updates.jpg",
    "source": "Geo News"
  }
]