[
  {
    "title": "Global Iranian protesters see Reza Pahlavi as chosen leader",
    "desc": "MIDDLE EAST AFFAIRS: Munich alone saw 250,000 attendees, with one attendee stating, “We had all come for our beloved Prince Reza Pahlavi, and for the people inside Iran.\"",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/707416",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Australia tournament player ratings, vs Oman scorecard, Cameron Green, Matthew Renshaw, video, highlights",
    "desc": "Seven fails in Aussie WC disaster as selection gambles backfire: Player Ratings",
    "image": "https://content.api.news/v3/images/bin/cebc1c730a2c20667da362f18b24c992",
    "source": "fox sports"
  },
  {
    "title": "Declan Rice gives telling message to Arsenal squad in 'firm' post-Wolves debrief",
    "desc": "Declan Rice has issued a battlecry to his Arsenal colleagues after they held a firm meeting in the aftermath of their Wolves draw - which has seen the pressure ramp up at the top",
    "image": "https://i2-prod.mirror.co.uk/article36758269.ece/ALTERNATES/s1200/0_DRMP776340664_45796Arsenal.jpg",
    "source": "The Mirror"
  },
  {
    "title": "F1 pre-season testing: Who are winners and losers?",
    "desc": "As pre-season testing reaches its conclusion, which teams look best - and worst - placed ahead of the Australian Grand Prix?",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/90a1/live/9b3a1a90-0e8d-11f1-9120-a910fc22c6ac.png",
    "source": "BBC"
  },
  {
    "title": "Apple's iOS 26.4 arrives in public beta with AI music playlists, video podcasts, and more",
    "desc": "iOS 26.4 introduces several updates, including an AI-powered playlist generation feature in Apple Music, support for video content in the Podcasts app, end-to-end encryption (E2EE) for RCS messages, and more.",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/apple-ios-26-beta.jpg?resize=1200,691",
    "source": "TechCrunch"
  },
  {
    "title": "Terrestrial Analogs To Titan For Geophysical Research",
    "desc": "Welcome to Astrobiology.com",
    "image": "https://astrobiology.com/wp-content/uploads/2026/02/Terrestrial-Analogs-To-Titan-1.png",
    "source": "astrobiology.com"
  },
  {
    "title": "Chelsea end sponsorless run with AI company IFS",
    "desc": "Chelsea agree a deal with IFS, an AI technology company, to be their shirt sponsor until the end of the season.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/bd21/live/fb5e1d30-0e8e-11f1-a4e4-ddad1524d202.jpg",
    "source": "BBC"
  },
  {
    "title": "Lakers Center Suddenly Leaves Team as Surprise Exit Confirmed",
    "desc": "Lakers center Kylor Kelley leaves South Bay after a buyout, signing overseas following a strong defensive run in the G League.",
    "image": "https://heavy.com/wp-content/uploads/2026/01/GettyImages-2177643842-e1767799813852.jpg?quality=65&strip=all",
    "source": "heavy.com"
  },
  {
    "title": "The chart on this generator stock signals more gains ahead, says Carter Worth",
    "desc": "Carter Worth breaks down the technicals on this generator maker.",
    "image": "https://image.cnbcfm.com/api/v1/image/108044118-1728312212823-gettyimages-1529890216-Outages.jpeg?v=1771616082&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "New Myelin Maps Boost Insight Into Nerve Disorders",
    "desc": "Johns Hopkins scientists say they have used 3D imaging, special microscopes and artificial intelligence (AI) programs to construct new maps of mouse",
    "image": "https://www.hopkinsmedicine.org/-/media/som/vanessa-feb-20-380-oligodentrocytes.jpg",
    "source": "Mirage News"
  }
]