[
  {
    "title": "Gov't airs concerns of AI's emerging threat in online sexual abuse of children",
    "desc": "The government expressed concerns over the emerging threats spawned by artificial intelligence (AI) in the online sexual abuse of children.During a press...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/10/78114.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "The Shared Watch event in ARC Raiders focuses on the robot menace and rewards friendship",
    "desc": "Discover what the Shared Watch event is all about in ARC Raiders.",
    "image": "https://d1lss44hh2trtw.cloudfront.net/assets/article/2026/02/09/arc-raiders-shared-watch-friendship_feature.jpg",
    "source": "Shacknews"
  },
  {
    "title": "State Solution for Israel–Palestine",
    "desc": "Indonesia to host D-8 forum to push a two-state solution, sustain Gaza ceasefire, and secure humanitarian aid access.",
    "image": "https://img2.beritasatu.com/cache/jakartaglobe/960x620-w/2026/02/1770706228-960x639.webp",
    "source": "Jakarta Globe"
  },
  {
    "title": "Company’s shareholders okay N15b capital raise",
    "desc": "The Nation Newspaper Company’s shareholders okay N15b capital raise",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2025/12/23014038/Universal-Insurance-Plc.png",
    "source": "The Nation Newspaper"
  },
  {
    "title": "When will Nigeria’s endless pain end?",
    "desc": "The Nation Newspaper When will Nigeria’s endless pain end?",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/02/10060946/Nigeria-flag-ss.jpeg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "Australians bearing the brunt of ‘second-best’ climate plans",
    "desc": "One of the nation’s leading economists says Australians are paying the price for a political class that is “far from brave” when it comes to climate policy.",
    "image": "https://static.ffx.io/images/$zoom_0.2347%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/q_86%2Cf_auto/121c085413de59bd2d10bd6e68efdc9019cb04f8",
    "source": "The Age"
  },
  {
    "title": "Sebastian Korda earns 150th ATP win in Dallas, avenges Australian Open defeat to Michael Zheng",
    "desc": "Three weeks after losing to his countryman at the Australian Open, Sebastian Korda defeated Michael Zheng in Dallas to earn his 150th tour-level win.",
    "image": "https://www.atptour.com/-/media/images/news/2026/02/10/05/08/korda-dallas-2026-monday.jpg",
    "source": "ATP Tour"
  },
  {
    "title": "Open Call: Civil Society Project Proposals under the ReLOaD3 Programme in Bileća (Bosnia and Herzegovina)",
    "desc": "Deadline: 04-Mar-2026 The Municipality of Bileća, in partnership with UNDP, has launched a public call under the EU-funded ReLOaD3 Programme to support civil society projects aligned with local development priorities.The call funds initiatives in social inclusion, youth, culture, environment, education, health, rural development, and civic participation.Eligible civil society organisations in Bosnia and Herzegovina can apply",
    "image": "https://fundsforngosmedia.s3.amazonaws.com/wp-content/uploads/2023/12/19141120/icon.png",
    "source": "fundsforNGOs"
  },
  {
    "title": "'Trying to ban India, others ... ': Russia’s Lavrov hits out at US over oil curbs; slams 'war' against tankers",
    "desc": "International Business News: Russian foreign minister Sergei Lavrov has accused the United States of trying to prevent India and other countries from buying Russian oil, describin.",
    "image": "https://static.toiimg.com/thumb/msid-128143364,width-1280,height-720,imgsize-818342,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Adani Enterprises says it is in talks with US Office of Foreign Assets over WSJ allegations",
    "desc": "Adani Enterprises is in discussions with the US Office of Foreign Assets following a report alleging Gautam Adani sought to influence the Trump administration regarding bribery charges. The company confirmed receiving a Request for Information but stated it contained no findings of non-compliance. Shares dipped following the disclosure.",
    "image": "https://img.etimg.com/thumb/msid-128143281,width-1200,height-630,imgsize-28922,overlay-economictimes/articleshow.jpg",
    "source": "The Economic Times"
  }
]