[
  {
    "title": "2 injured after birthday balloons burst into flames in Mumbai lift",
    "desc": "Two people suffered burns after a fiery explosion occurred in the lift of a residential building in Mumbai, India, on Monday (Feb 2).According to Times of India, the blast originated from a bag of gas-filled balloons which were brought into the elevator. They were intended for a birthday celebration, the report added.The CCTV footage of the incident shows a woman...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/balloons-explode-mumbai.jpg?itok=KVFymGcw",
    "source": "AsiaOne"
  },
  {
    "title": "Kwakye Ofosu lists reasons why NDC has the best economic record in the 4th Republic",
    "desc": "The Minister of Government Communications and Member of Parliament for Abura-Asebu-Kwamankese, Felix Kwakye Ofosu, has outlined why the National Democratic Congress (NDC) holds the strongest economic record in Ghana’s Fourth Republic.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/864/86453029.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "MP: CM Mohan Yadav practices Yoga with Swami Ramdev, urges people to make it part of daily routine",
    "desc": "Madhya Pradesh Chief Minister Mohan Yadav on Thursday participated in a yoga session with Yoga guru Swami Ramdev at Patanjali Yogpeeth in Haridwar and highlighted the importance of yoga in daily life for physical and mental well-being.",
    "image": "https://d3lzcn6mbbadaf.cloudfront.net/media/details/ANI-20260205075049.jpg",
    "source": "ANI News"
  },
  {
    "title": "Drug war reforms prioritize accountability, transparency - Nartatez",
    "desc": "PNP chief Gen. Jose Melencio Nartatez Jr. disputes international rights groups’ claims of weak accountability in the drug war, saying police investigations and reforms are actively enforced under the Marcos administration.",
    "image": "https://media.assettype.com/tribune%2F2026-02-02%2Fjjt8ychz%2Fviberimage2026-02-0211-36-25-064grey-gigapixel-standard-scale-200x.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Daily Tribune"
  },
  {
    "title": "Beit Shemesh yeshiva student who spied for Iran sentenced to three years in prison",
    "desc": "Prosecutors said Elimelech Stern, 21, was in contact on Telegram with an account run by Iranian intelligence and agreed to carry out various tasks in return for payment in cryptocurrency",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/05/HknSuqTbw11e/HknSuqTbw11e_0_133_1280_721_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Canon brings back the spotlight on compact cameras with 30th anniversary PowerShot G7 X",
    "desc": "Canon's limited-edition compact camera honours the PowerShot lineup’s long journey from early digital cameras to modern creator tools.",
    "image": "https://images.indianexpress.com/2026/02/IE-2026-02-05T130552.905.jpg",
    "source": "The Indian Express"
  },
  {
    "title": "Trump refuses to choose between Vance, Rubio for 2028 successor debate",
    "desc": "President Donald Trump has effectively maintained a dual strategy in the debate over whether his vice president JD Vance, or Secretary of State, Macro Rubio is his most likely successor for the 2028...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-05/1391127_124943_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "38.9m children vaccinated in first three days of polio drive",
    "desc": "More than 38.9 million children have been vaccinated during the first three days of Pakistan’s first nationwide polio eradication campaign of 2026, according to",
    "image": "https://www.nation.com.pk/digital_images/large/2026-02-05/train-services-quetta-restored-five-day-suspension-1770277753-4896.jpg",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "Today's Front pages: Thursday, February 5, 2026",
    "desc": "Myjoyonline.com brings you the front pages of the various newspapers across the country.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/image-429.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Life sentence sought for ‘Luffy’ crime ring member",
    "desc": "The case involves Toshiya Fujita, a senior member of a crime ring behind a series of robbery and fraud cases across the country.",
    "image": "https://www.japantimes.co.jp/japantimes/uploads/images/2026/02/05/521637.jpg?v=3.1",
    "source": "The Japan Times"
  }
]