[
  {
    "title": "K-P launches Dengue Action Plan 2026 ahead of peak season",
    "desc": "District response units being established across province, private hospitals to be included in reporting system",
    "image": "https://i.tribune.com.pk/media/images/8026-dengue-1316414763/8026-dengue-1316414763-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Scientists compared dinosaurs to mammals for decades but missed this key difference",
    "desc": "Baby dinosaurs weren’t coddled like lion cubs or elephant calves—they were more like prehistoric latchkey kids. New research suggests that young dinosaurs quickly struck out on their own, forming kid-only groups and surviving without much parental help, while their massive parents lived entirely different lives. Because juveniles and adults ate different foods, faced different predators, and moved through different parts of the landscape, they may have functioned almost like separate species within the same ecosystem.",
    "image": "https://www.sciencedaily.com/images/1920/gigantic-herbivorous-dinosaur-brachiosaurus.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Kenya faces dual threat of floods and drought, official says",
    "desc": "The Kenya Red Cross has urged Kenyans to take drought and flood advisories seriously, warning that ignoring early warnings is worsening humanitarian crises.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/fj0OQe5IV3E38wpDELh7FFvhtuNzkQCzNtaKsGql.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "Soft chiral superstructure enabled dynamic polychromatic holography",
    "desc": "oea.2026.250177.\nLight, as a core carrier of information, possesses multiple dimensions such as wavelength, polarization, and phase. These dimensions act",
    "image": "https://img.einnews.com/facebook/1061000/oea7777777777777777777777777777.png",
    "source": "EIN Presswire"
  },
  {
    "title": "Meatco demands halt to ‘illegal’ sale of 900 cattle",
    "desc": "The Meat Corporation of Namibia (Meatco) has instructed a company owned by businessman David van der Linden to immediately cease the sale of 900 of its […]",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/8-4.jpg",
    "source": "The Namibian -"
  },
  {
    "title": "Patricia Osei Boateng Explains How She Hustles to Make Money in Old Video Amid Legal Woes",
    "desc": "Kumawood actress Patricia Osei Boateng surrendered to police amid carjacking syndicate links. An old hustling video resurfaced, sparking ironic reactions online.",
    "image": "https://cdn.yen.com.gh/images/1200x675/0cc003ec3bce9ce0.jpeg?v=1",
    "source": "Yen News"
  },
  {
    "title": "Taking collagen keeps skin more elastic but won't stop wrinkles, say scientists",
    "desc": "Taking daily collagen supplements can rejuvenate the skin by boosting elasticity and hydration or moisture - but it won't stop wrinkles, says a new scientific review.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/image-2443.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Africans go online daily but lack digital safety awareness - Afrobarometer",
    "desc": "Most adults in seven African countries are frequent internet users, yet awareness and consistent use of digital safety tools remain low.",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2026/01/Digital-banking-1.png",
    "source": "Businessday NG"
  },
  {
    "title": "Man accused of entering Manchester Central Mosque with axe, knife and hammer to appear in court",
    "desc": "Darren Connor will appear before magistrates",
    "image": "https://i2-prod.manchestereveningnews.co.uk/article33491911.ece/ALTERNATES/s1200/2_250226centralmosque3.jpg",
    "source": "Manchester Evening News"
  },
  {
    "title": "City Hall mounts strong defence to end health workers’ strike",
    "desc": "The county assured the health workers that no officer would face victimisation for participating in the industrial action.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/9e372d36-c25e-4891-9793-e95931655427.jpeg?1772188229309",
    "source": "the-star.co.ke"
  }
]