[
  {
    "title": "Tom Noonan Dies: ‘Manhunter’ Villain and Sundance",
    "desc": "Tom Noonan, the distinctive character actor, playwright and filmmaker best known for his haunting turn in “Manhunter” and his Sundance-winning indie “What…",
    "image": "https://thephrasemaker.com/wp-content/uploads/2026/02/tom-noonan.jpg",
    "source": "Phrasemaker"
  },
  {
    "title": "AA23 Theme Hits 1 Million Reels Before Shoot, Unseen Allu Arjun-Lokesh Kanagaraj Selfie Revealed",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/02/aa23.webp",
    "source": "123telugu.com"
  },
  {
    "title": "Country diary: Persistence and confusion - this is how magpies build their nest",
    "desc": "Hitchin, Hertfordshire: It’s not quick, it’s not graceful, but these early nesters are hard at work in preparation for egg-laying in a few weeks",
    "image": "https://i.guim.co.uk/img/media/f6afc8db186c6b466303750d47a3779e7e5e20ab/347_0_4600_3681/master/4600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c9ac74b43cd8706a1dfbc195654d78a8",
    "source": "The Guardian"
  },
  {
    "title": "Birmingham sex pest told mum and kids 'I want to rape with a white girl' in city centre horror",
    "desc": "Quinton Brown, aged 52, also attacked a group of young females and a woman in a wheelchair",
    "image": "https://i2-prod.birminghammail.co.uk/article27849988.ece/ALTERNATES/s1200/0_JS313170069.jpg",
    "source": "Birmingham Live"
  },
  {
    "title": "India’s Champions Trophy, World Cup hosting in jeopardy as ICC explores Australia switch after Pakistan chaos: Report",
    "desc": "India reportledy risk losing hosting rights for the 2029 and 2031 ICC events following the political turbulence that unfolded during the ongoing T20 World Cup | Cricket",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/18/550x309/PTI02-17-2026-000476A-0_1771390057474_1771390073055.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Infosys' $400 billion AI dream fails to arrest stock slide, but target prices go up to Rs 2,050",
    "desc": "Infosys' AI roadmap, targeting a $300-400 billion market, failed to impress investors, causing shares to tumble despite a bullish outlook from brokerages. While the company highlighted AI as a structural tailwind, market concerns persist over the immediate deflationary impact on legacy revenues versus the long-term benefits.",
    "image": "https://img.etimg.com/thumb/msid-128493193,width-1200,height-630,imgsize-22860,overlay-etmarkets/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Slavery Act as Australian companies are allegedly linked to forced labour",
    "desc": "Check out this page via the Business and Human Rights Centre",
    "image": "https://media.business-humanrights.org/media/images/1280px-Flag_of_Australia_converte.2e16d0ba.fill-1200x630.png",
    "source": "Business and Human Rights Centre"
  },
  {
    "title": "NCDA urges review of ‘no outside food’ rules after autism incident",
    "desc": "NCDA calls for review of “no outside food” policies after a reported autism-related incident in Pampanga, citing disability rights and reasonable accommodation laws.",
    "image": "https://media.assettype.com/tribune%2F2025-11-27%2F845aidps%2FNationalCouncilonDisabilityAffairsNCDA-Philippines.svg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Daily Tribune"
  },
  {
    "title": "Can WHOOP Bands & Oura Rings Really Save Your Sleep? We Put Them to the Test",
    "desc": "Inside the big business of slumber.",
    "image": "https://esquiresg.s3.ap-southeast-2.amazonaws.com/wp-content/uploads/2026/02/sleep-698b691934bfd-1.jpg",
    "source": "Esquire Singapore"
  },
  {
    "title": "Climate change is accelerating but nature is slowing down",
    "desc": "As the planet warms, many expected ecosystems to change faster and faster. Instead, a massive global study shows that species turnover has slowed by about one-third since the 1970s. Nature’s constant reshuffling appears to be driven more by internal ecological dynamics than by climate alone. The slowdown may signal something alarming: ecosystems losing the biodiversity needed to keep their engines running.",
    "image": "https://www.sciencedaily.com/images/1920/climate-change-tree-landscape.webp",
    "source": "ScienceDaily"
  }
]