[
  {
    "title": "Galaxy Buds 4 may lack a feature people were hoping to see",
    "desc": "A new leak about Samsung's upcoming Galaxy Buds 4 and the Galaxy Buds 4 Pro shows the earbuds, their charging case, and in-box contents. - SamMobile",
    "image": "https://www.sammobile.com/wp-content/uploads/2025/04/Galaxy-Buds-3-Pro-1-1200x674.jpg",
    "source": "SamMobile"
  },
  {
    "title": "At least 8 killed as huge explosion rips through fireworks shop in China ahead of Lunar New Year",
    "desc": "AT least eight people have been killed in a horror fireworks blast just days before Chinese New Year.\nA huge explosion ripped through a...",
    "image": "https://www.the-sun.com/wp-content/uploads/sites/6/2026/02/newspress-collage-5h877wrbt-1771229298837.jpg?quality=90&strip=all&1771212257&w=1920&h=1080&crop=1",
    "source": "the-sun.com"
  },
  {
    "title": "Princesses Beatrice and Eugenie grapple with fallout from parents’ Epstein scandals",
    "desc": "Princesses Beatrice and Eugenie have been swept into the maelstrom that has engulfed their parents, Andrew Mountbatten-Windsor and Sarah Ferguson, forcing them to grapple with renewed scrutiny swirling around the British monarchy.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/01jshg17xbgnr6mr4gc6df80dj.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "EPF tipped to declare 6.3 to 6.5pc dividend for 2025 on strong nine-month gains",
    "desc": "KUALA LUMPUR, Feb 16 —The Employees Provident Fund (EPF) is expected to deliver a dividend rate of between 6.3 per cent and 6.5 per cent for 2025, said Bank Muamalat Malaysia...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/16/325846.JPG",
    "source": "Malay Mail"
  },
  {
    "title": "Singapore man dies after car skids near Bukit Batok HDB block",
    "desc": "SINGAPORE, Feb 16 — A 58-year-old man has died after a car he was driving was found to have skidded near a Housing Board block in the early hours of February 16.According to The...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/16/325850.png",
    "source": "Malay Mail"
  },
  {
    "title": "Cash and land titles",
    "desc": "Gloria Bugie receives flowers, cash, and land titles as Valentine's Day gifts from fans. Netizens question the authenticity of the gifts.",
    "image": "https://mbu.ug/wp-content/uploads/2026/02/HBN44HSWAAAoEeN-edited.jpeg",
    "source": "mbu.ug"
  },
  {
    "title": "yamaha speculative speakers move diaphragm like a sail on strings",
    "desc": "yamaha's design laboratory in japan envisions prototypes for experimental speakers based on new structural approaches.",
    "image": "https://www.designboom.com/twitterimages/dbsub/449252/2026-02-05/experimental-upward-firing-speakers-that-rethink-sound-and-form-1-69845298471f7.jpg",
    "source": "Designboom"
  },
  {
    "title": "Dubious gold companies implicated in $17 million scandal",
    "desc": "The Herald, has obtained details of the petition submitted to the Police Criminal Investigations Department (CID) by a partner of Tayvest FZCO, the Turkish company which paid more than $17 million to a Ghanaian company for the purchase of gold, but...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/902/90208098.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "PPP 'signals reconciliation' with MQM-P",
    "desc": "The Pakistan People's Party (PPP) is reportedly ready to pursue reconciliation with Muttahida Qaumi Movement-Pakistan..",
    "image": "https://static.arynews.tv/zip-archives/wp-content/uploads/2022/12/ppp-mqm-p-logos.jpg?imageMogr2/format/jpg",
    "source": "ARY News"
  },
  {
    "title": "Missy Elliot reveals how she 'completely manages' her Grave's Disease",
    "desc": "Missy Elliott has been a phenomenon of hip-hop for more than a decade.However, Missy went on a break for quite a while and back in 2011 she revealed the reason was that she had been silently...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-16/1392461_011249_updates.jpg",
    "source": "The News International"
  }
]