[
  {
    "title": "Parliamentary select committee endorses AG-PP separation bill",
    "desc": "Chairman William Leong, however, says the accountability aspect of the bill should be further refined.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2024/05/5d8b4b73-william-leong-fmt-resize-170524.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Bolivia's Chikungunya East/Central/South African Genotype Outbreak Highlights Vaccination Options",
    "desc": "Bolivia is currently experiencing a significant rise in chikungunya cases, mainly driven by intense transmission in the Santa Cruz department. This increase is part of a broader resurgence of the mosquito-borne virus across various regions of the Americas, as noted in an epidemiological alert issued by the Pan American Health Organization (PAHO) on February 26, 2026. The outbreak in Bolivia has been linked to the identification of the East/Central/South African genotype of the virus.",
    "image": "https://www.vax-before-travel.com/sites/default/files/styles/article_metadata/public/Screenshot%202026-02-26%205.15.52%20AM.png",
    "source": "Vax-Before-Travel"
  },
  {
    "title": "After 70-hr work call, Narayana Murthy has an AI warning for youngsters in India",
    "desc": "Amid rising fears that AI could disrupt white-collar jobs in India, Infosys founder Narayana Murthy has urged youngsters not to panic. Here is everything he said about this in a recent interview.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/narayana-murthy-work-life-balance-18531383-16x9.jpg?VersionId=BO1CNVsyZCWEvzv4TnYZrx1yZKNYl9WJ",
    "source": "India Today"
  },
  {
    "title": "Roy Keane still expecting Tottenham to overcome West Ham United in relegation battle",
    "desc": "Roy Keane still expects Tottenham to stay in the Premier League ahead of relegation rivals West Ham United and Nottingham Forest.",
    "image": "https://cdn1.hammers.news/uploads/25/2026/02/GettyImages-2246551688-scaled.jpg",
    "source": "Hammers News"
  },
  {
    "title": "Transdev loses €1.75bn Luas contract after running Dublin tram service for 22 years",
    "desc": "French-British joint venture between Keolis and Amey believed to have been selected as preferred bidder for light rail service",
    "image": "https://www.irishtimes.com/resizer/v2/DG7OJ37NELLNBVNVX2D7KBXEUY.jpg?smart=true&auth=15e0b4aac2db032c3d405faca260da1d3d3c50a9babf0832d0f9fac86a0aeb3c&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Neonatal mortality trends over five years in Kenya: 2020-2024",
    "desc": "In 2020, the country recorded 10,800 neonatal deaths, a figure that climbed to 11,070 in 2021.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/c8cdc10b-479c-4e92-ab77-680c220851de.jpeg?1772134497242",
    "source": "Star newspaper"
  },
  {
    "title": "Why climate change demands a global response",
    "desc": "OSLO, NORWAY: The world is currently facing the challenge of environmental degradation and climate change that has not been witnessed in the past several decades. These changes are mostly attributed to industrial development, especially in developed countries such as United States, United Kingdom, China and Norway, and human activities that are said to be contributing",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/Klimahuset-the-national-climate-focused-museum-in-Oslo-Norway.jpeg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "'Get Paid to Throw' - Unofficial Marvel Rivals Bounty Website Faces Backlash as Players Ask NetEase to Intervene",
    "desc": "Marvel Rivals players are asking NetEase to take action after the emergence of an unofficial bounty website triggered fears that it could harm the community it’s supposedly trying to protect.",
    "image": "https://assets-prd.ignimgs.com/2025/01/27/marvel-rivals-galacta-2-1737989148806.png?width=1280&format=jpg&auto=webp&quality=80",
    "source": "IGN"
  },
  {
    "title": "North East paedophile couple who committed sex offences against two children locked up",
    "desc": "Kieron Lewis, 33, and Rebecca Bowey, 25, were sentenced at Newcastle Crown Court",
    "image": "https://i2-prod.chroniclelive.co.uk/article33493808.ece/ALTERNATES/s1200/0_imagemaker-12.jpg",
    "source": "Chronicle Live"
  },
  {
    "title": "Nigeria to hold inquest into death of author's toddler",
    "desc": "The internationally acclaimed writer has accused Nigerian hospital Euracare of negligence, which it denies.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/ea23/live/d211c560-12fa-11f1-b048-c9424b2cf5fd.jpg",
    "source": "BBC"
  }
]