[
  {
    "title": "Researcher Working On Samoan Medicinal Knowledge And Virology",
    "desc": "An Auckland University researcher is bringing Samoan medicinal knowledge into virology.",
    "image": "http://img.scoop.co.nz/stories/images/1908/scoop_image.jpg",
    "source": "Scoop - New Zealand News"
  },
  {
    "title": "England Starting XI and Squad Projection for the 2026 World Cup",
    "desc": "Despite some of the best players in football history suiting up for England, an international title has been out of the national team's grasp since a World Cup win in 1966.",
    "image": "https://gsp-image-cdn.wmsports.io/cms/prod/bleacher-report/getty_images/2026-02/2248441286_large_cropped.jpg?w=3800&h=2000",
    "source": "Bleacher Report"
  },
  {
    "title": "T20 World Cup: Oman opts to bowl against Ireland",
    "desc": "ICC Twenty20 World Cup 2026: Oman vs Ireland T20 World Cup match in Colombo on February 14 2026",
    "image": "https://th-i.thgim.com/public/incoming/rv7go6/article70631414.ece/alternates/LANDSCAPE_1200/Ireland_Oman_T20_WCup_Cricket_36405.jpg",
    "source": "The Hindu"
  },
  {
    "title": "Astronomers watch a massive star collapse into a black hole without a supernova",
    "desc": "A massive star 2.5 million light-years away simply vanished — and astronomers now know why. Instead of exploding in a supernova, it quietly collapsed into a black hole, shedding its outer layers in a slow-motion cosmic fade-out. The leftover debris continues to glow in infrared light, offering a long-lasting signal of the black hole’s birth. The finding reshapes our understanding of how some of the universe’s biggest stars meet their end.",
    "image": "https://www.sciencedaily.com/images/1920/star-collapse-black-hole.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Comparative habits and habitat in extant and extinct nautiloid cephalopods from acoustic telemetry and stable oxygen isotope analyses",
    "desc": "Information about behavior and habitat depths of Nautilus and Allonautilus species, the last remaining nautiloid cephalopod genera, is relevant both to paleobiologists trying to interpret the lives of extinct chambered cephalopods as well as to ecologists seeking to better understand the food webs of the Mesophotic Zone (200–800 m), fore-reef slope communities of the tropical Indopacific where these archaic animals live. One long-standing question is whether the extant nautiloid species live in deeper water than the many extinct species; a second is whether there are habitation depth differences of adult nautiloids compared to juveniles - either now or in the past. Using shell-mounted acoustic transmitters on seven different species in the two extant genera, and oxygen isotope shell thermometry on these same species as well as from fossils of 18 extinct fossil nautiloid species, we found regular, diurnal migration in only one species of each extant genus. Mature individuals in all tracked species of both genera were found to inhabit significantly shallower (and warmer) depths (~ 200 m) than the immature nautiluses and allonautiluses of the same populations (~ 350–400 m). Extinct nautiloid genera showed significantly warmer shell growth temperatures, with the single exception of Eocene through Miocene-aged species of the ammonoid-like genus Aturia, although diagenesis from not only ancient, but modern carbonates cannot be ruled out.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "NRL pre-season: Warriors v Manly Sea Eagles",
    "desc": "Warriors go down to Manly 33-18 in Napier.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--OSLdJwox--/t_tohu-badge-facebook/v1771042450/4JT7SAW_260214WarriorsSeaEagles_005_JPG?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Rubio says United States and Europe 'belong together'",
    "desc": "US Secretary of State Marco Rubio has sought to reassure a nervous Europe, saying that the United States wanted to \"revitalise\" the transatlantic alliance so that a strong Europe could help the US on its mission of global \"renewal\".",
    "image": "https://www.rte.ie/images/0023e48c-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Cameron Waters leads Supercars stars to Bathurst 12 Hour pole",
    "desc": "Supercars trio Cameron Waters, Chaz Mostert and Thomas Randle will start the Meguiar’s Bathurst 12 Hour from pole position. - Australia's #1 motorsport news website - Speedcafe.com",
    "image": "https://speedcafe.com/wp-content/uploads/2026/02/IGTC126_021309241812960JB_JB.jpg",
    "source": "Speedcafe.com"
  },
  {
    "title": "T20 World Cup, Oman win toss and choose to field against Ireland",
    "desc": "Oman captain Jatinder Singh revealed that their strategy was also motivated by their struggles with the bat in their last two matches......",
    "image": "https://minutemirror.com.pk/wp-content/uploads/og-cache/ba751b6932dec8fe60975c07428daa9b.jpg",
    "source": "Minute Mirror"
  },
  {
    "title": "Everything Tom Izzo said after Michigan State lost to Wisconsin",
    "desc": "Spartans give up 15 3-pointers in 92-71 road loss",
    "image": "https://s3media.247sports.com/Uploads/Assets/680/607/13607680.jpg?width=1200&height=628&crop=1.91:1&fit=cover",
    "source": "247Sports"
  }
]