[
  {
    "title": "Molecular signatures of oocyte viability identified by follicular fluid proteomics",
    "desc": "Women are born with thousands of ovarian follicles, yet less than 1% will ovulate a mature oocyte. What distinguishes the 99% of follicles destined for demise from the rare 1% that succeed? Here, we leveraged a unique clinical opportunity, paired follicular fluid samples from small antral follicles containing either a viable or an atretic oocyte within the same patients, to uncover the proteomic determinants governing oocyte fate. Our analysis identified nearly 1,500 proteins. Follicular fluid from healthy follicles was enriched with proteins crucial for energy metabolism, antioxidative defense, structural integrity, and robust intercellular signaling networks, supporting oocyte survival and maturation. In contrast, follicular fluid from atretic oocytes exhibited a distinct inflammatory signature characterized by acute-phase and immune activation proteins, indicative of active degeneration. These novel proteomic insights deepen our understanding of human follicle biology and open new avenues for biomarker development, optimization of assisted reproductive technologies, and targeted therapeutic strategies to preserve and enhance female fertility.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Zaroa NZ salami products recalled after concerns over food safety controls",
    "desc": "Three Zaroa NZ-branded products are being recalled after being produced without the required food safety control and oversight.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--HdSWybhm--/t_tohu-badge-facebook/v1695353085/4L2A72V_20230922_UPFS0006_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Child puberty blocker trial paused after watchdog concerns",
    "desc": "Scheme open to those as young as eight faces growing backlash",
    "image": "https://www.telegraph.co.uk/content/dam/news/2026/02/20/TELEMMGLPICT000465016068_17716165535880_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQf0Rf_Wk3V23H2268P_XkPxc.jpeg?impolicy=OG-Standard",
    "source": "The Telegraph"
  },
  {
    "title": "OpenAI may sell a smart speaker with facial recognition camera",
    "desc": "OpenAI is working on a smart speaker with facial recognition, according to a major new report. Meta and Apple are working faster.",
    "image": "https://helios-i.mashable.com/imagery/articles/02lZ9BwO928ZlGCguL8k0Y7/hero-image.fill.size_1200x675.v1771624177.jpg",
    "source": "Mashable"
  },
  {
    "title": "Actor 'so proud' as Belfast film wins Ifta award",
    "desc": "Nostalgie, based in Belfast, took the Best Short Film prize in the live action category at the Iftas.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/106d/live/6b0fbfb0-0e9b-11f1-ac45-93afc20cd669.jpg",
    "source": "BBC"
  },
  {
    "title": "RCMP charge Hay River 15-year-old, seize guns after ‘threatening post’",
    "desc": "Police in Hay River say a 15-year-old faces charges after a social media post with a \"threatening caption relating to an upcoming school sporting event.\"",
    "image": "https://cabinradio.ca/wp-content/uploads/2023/03/Ollie-Hay-River-20230316-Pic-808.jpg",
    "source": "Cabin Radio"
  },
  {
    "title": "New Chicago Bears stadium unlikely in Chicago",
    "desc": "Illinois Gov. JB Pritzker said, \"I think we're down to the question of whether they’re going to build in Arlington Heights or they’re going to build something in the state of Indiana.\"",
    "image": "https://www.chicagotribune.com/wp-content/uploads/2026/02/ctc-l-pritzker-budget-address91_259641086.jpg?w=1024&h=691",
    "source": "Chicago Tribune"
  },
  {
    "title": "Trump adminstration rolls back mercury rules for coal-fired power plants",
    "desc": "The rule for mercury emissions from coal-fired power plants will be rolled back to a 2012 standard. Mercury is a neurotoxin.",
    "image": "https://www.alleghenyfront.org/wp-content/uploads/2019/07/coalplant-e1605215054230.jpg",
    "source": "The Allegheny Front"
  },
  {
    "title": "Flares rain down on new Oriel Park pitch as Drogheda secure late draw with Dundalk",
    "desc": "Tense Louth derby ends 1-1 after Conor Keeley’s 88th-minute goal cancels out Danny Mullen opener.",
    "image": "https://img2.thejournal.ie/article/6963013/river/?height=400&version=6963499",
    "source": "The 42"
  },
  {
    "title": "Ireland under-20s produce stunning display to oust England in Six Nations",
    "desc": "Deserved bonus-point victory for Andrew Browne’s side in Bath",
    "image": "https://www.irishtimes.com/resizer/v2/NJWKLGV5FU3BVYJY5MSRZFRV4M.jpg?smart=true&auth=a3e7731ee051aab87b8b184f5059c9e87c281ac1c58b04387dd1b7c7e234cecd&width=1200&height=630",
    "source": "The Irish Times"
  }
]