[
  {
    "title": "Tehran warns of regional conflict if US attacks Iran",
    "desc": "DUBAI, Feb 1 (Reuters) - Iran's ‌Supreme Leader Ayatollah Ali Khamenei said that if the U.S. ‌attacked Iran it would become a regional conflict, state media ‌reported on Sunday, amid heightened tensions between Washington and Tehran.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/01/3748904.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Police identify suspect in viral convenience store brawl",
    "desc": "KUALA LUMPUR: Police have identified the suspect involved in a convenience store brawl in a clip that went viral on social media on Saturday (Jan 31).",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/01/3748918.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Jurrasic era animals were so big they would eat baby dinosaurs like fast food",
    "desc": "A new study reveals that massive long-necked dinosaurs left their young to fend for themselves in a brutal ecosystem. These baby sauropods became the primary food source for giant dinosaurs.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/small--defenceless-sauropod-hatchlings-had-to-navigate-a-landscape-filled-with-sharp-toothed-predato-010406851-16x9_0.jpg?VersionId=9UT7tRqS8P63jseCUtsDamBr0eKk9fhY",
    "source": "India Today"
  },
  {
    "title": "Judiciary to Pilot Saturday Court Hearings at Kibera Law Courts",
    "desc": "There have been concerns from Kenyans about suspicious arrests on Friday to deliberately keep them in remand until courts reopen on Monday.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/milimani-law-courts.jpeg?itok=mfMcmoCV",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "Meet the millionaire Cornish dentists 'laughing all the way to the bank' after Omaze paid them £4.4m to raffle off their home - nearly TWICE its market value",
    "desc": "Even in this uber wealthy pocket of Cornwall, the £4.4million Omaze paid to secure the house last August has raised a few eyebrows.",
    "image": "https://i.dailymail.co.uk/1s/2026/01/23/13/105766653-0-image-a-14_1769173398416.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Iran-US tensions live updates: Trump's patience on Iran won't last, says envoy; Khamenei warns ‘all options on table’",
    "desc": "Iran-US tensions live updates: US President Donald Trump is allowing Iran some time to withdraw from possible confrontation, but will not remain patient indefinitely, Washington’s ambassador to NATO said. Meanwhile, Iran's Supreme Leader Khamenei said “all options are on the table”. | World News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/01/550x309/trump_khamenei_1769943426400_1769943434463.png",
    "source": "Hindustan Times"
  },
  {
    "title": "Watch Australian Open final 2026: FREE streams, preview for Alcaraz vs Djokovic",
    "desc": "All the ways to watch Australian Open final 2026 live streams for free, as Alcaraz vs Djokovic decides the Norman Brookes Challenge Cup at Rod Laver Arena.",
    "image": "https://cdn.mos.cms.futurecdn.net/8n2iDhQXuGTDUK36yw5QjR-1920-80.jpg",
    "source": "Tom's Guide"
  },
  {
    "title": "Budget makes dual allocations for MGNREGA, VB-G RAM G schemes",
    "desc": "The budget for 2026-27 has earmarked ₹95,692 crore for VB-G RAM G, and has set aside ₹30,000 crore for the outgoing MGNREGA.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/01/1600x900/logo/2-0-122627325-NREGA-4C-0_1681900805091_1769937967829.jpg",
    "source": "Mint"
  },
  {
    "title": "Tehran warns of regional conflict if US attacks Iran",
    "desc": "Iran's Supreme Leader Ayatollah Ali Khamenei said that if the US attacked Iran it would become a regional conflict, state media has reported, amid heightened tensions between Washington and Tehran.",
    "image": "https://www.rte.ie/images/0023d4b1-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "PM Anwar checks out the ETS with a ride to Johor Baru",
    "desc": "JOHOR BARU: Passengers on the Electric Train Service (ETS) from Kuala Lumpur to Johor Baru on Sunday (Feb 1) got a surprise with Prime Minister Datuk Seri Anwar Ibrahim taking the ride with them.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/01/3748887.jpg",
    "source": "thestar.com.my"
  }
]