[
  {
    "title": "After agency chiefs, PM tells local council heads to do their jobs well or go",
    "desc": "GOMBAK, Jan 30 — Prime Minister Datuk Seri Anwar Ibrahim today extended his warning about enforcement failures to local councils, saying that weaknesses at the municipal level...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/01/30/322864.JPG",
    "source": "Malay Mail"
  },
  {
    "title": "Pharrell, Brandy and Kirk Franklin honoured by Black Music Collective",
    "desc": "Pharrell, Kirk Franklin and Brandy were honoured at the Recording Academy 2025 Black Music Collective Honors event Thursday night in Los Angeles.",
    "image": "https://images.euronews.com/articles/stories/09/63/23/37/1024x538_cmsv2_3ed513b2-f995-58e3-a12f-1064516bc031-9632337.jpg",
    "source": "africanews.com"
  },
  {
    "title": "Xiaomi 17T camera and battery details leak",
    "desc": "It's probably very early in its development cycle, but this information is already out. Xiaomi launched the 15T and 15T Pro last September, and now it...",
    "image": "https://fdn.gsmarena.com/imgroot/news/26/01/xiaomi-17t-details-leak/-952x498w6/gsmarena_000.jpg",
    "source": "GSMArena.com"
  },
  {
    "title": "Tanzania’s Universal Health Insurance enters historic implementation phase",
    "desc": "DAR ES SALAAM: AS Tanzania advances steadily toward the full realisation of Universal Health Insurance (UHI), the country is entering a transformative phase in its pursuit of equitable, affordable and quality healthcare for all citizens. At the heart of this national effort is the Tanzania Insurance Regulatory Authority (TIRA), which continues to play a central",
    "image": "https://dailynews.co.tz/wp-content/uploads/2022/07/favicon.ico",
    "source": "dailynews.co.tz"
  },
  {
    "title": "'Choose work and family over church' - Prophet ElBernard tells members",
    "desc": "The General Overseer of Spiritlife Revival Ministries, Prophet Bernard ElBernard Nelson-Eshun, has made a statement that has set social media abuzz.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/352/35220977.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Juror dismissed at Auckland property developer Andrew Montgomerie’s wounding trial",
    "desc": "Several officers who responded to a ritzy waterfront Westmere mansion five years ago following initial reports of “stabbing”, told jurors today that it had...",
    "image": "https://www.nzherald.co.nz/resizer/v2/EOLHDFS2EBGENBCJ6EJMDKTFQM.jpg?auth=2ca0aaa08a150c8e6c28f3fac6bb6cc365852db9033d1b6406ae150f9ad50ee9&width=1200&height=675&quality=70&focal=967%2C353&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Parliament approves budget framework as debt growth raises scrutiny",
    "desc": "Kampala, Uganda | THE INDEPENDENT | Parliament on Thursday approved the National Budget Framework Paper (NBFP) for FY 2026/27–2030/31, clearing the way for preparation of detailed budget estimates, even as lawmakers and analysts raised concerns over debt sustainability, growth assumptions, and compliance with fiscal rules. The framework sets the fiscal andmonetary policy direction for the …",
    "image": "https://www.independent.co.ug/wp-content/uploads/2026/01/Remigio-Achia-Deputy-Chairperson-Parliamentary-Committee-on-Budget.jpg",
    "source": "independent.co.ug"
  },
  {
    "title": "Italian officials go on trial over shipwreck that killed Pakistanis among 94 migrants",
    "desc": "ROME: Six members of Italy’s police and coast guard go on trial Friday over a 2023 shipwreck that killed at least 94 migrants, accused of failing to intervene on time. The disaster off the southern Calabrian coast was Italy’s worst in a decade and set off a firestorm of criticism against far-right Prime Minister Giorgia Meloni’s tough stance on the thousands of migrants who",
    "image": "https://www.arabnews.pk/sites/default/files/styles/660x371_watermarkpakistan/public/main-image/2026/01/30/4680290-1875692744.jpg?itok=NmC2oNdO",
    "source": "Arab News PK"
  },
  {
    "title": "Recent study of NASA's Galileo mission points to Ammonia on Europa's surface",
    "desc": "NASA on Thursday said that new analysis of decades-old data has turned up a significant result- the first discovery of ammonia-bearing compounds on the surface of Jupiter's moon Europa. \"Ammonia is a nitrogen-bearing molecule, and nitrogen -- like carbon, hydrogen, and oxygen -- is key to life as we know it. As the first such detection at Europa, the finding has important implications for the geology and potential habitability of this icy world and its vast subsurface ocean\", the statement said. It highlighted that between 1995 and 2003, NASA's Galileo spacecraft studied the Jupiter system, and a recent paper by researcher Al Emran of the agency's Jet Propulsion Laboratory in Southern California re-examined data from the mission's Near-Infrared Mapping Spectrometer. \"Hidden in the data were faint signals of ammonia near fractures on the moon's frozen surface, through which liquid water containing dissolved ammonia compounds would be expected to rise. The compounds may have reached the surface through geologically recent cryo-volcanism\", the statement said. \"That's because ammonia significantly lowers the freezing point of water, acting as a sort of antifreeze. Ammonia also has a short lifespan in the space environment. These qualities, combined with the detection appearing near large fractures and pits on Europa's surface, suggest active placement of ammonia-bearing compounds there, from either the moon's subsurface ocean or its shallow subsurface\", it further noted. As per the statement, the finding underscored the ongoing value of legacy datasets collected by previous space missions, which researchers can mine for new discoveries using modern analysis techniques. It also provided a tantalising target for follow-up by the Europa Clipper mission, which arrives at the Jupiter system in April 2030, the statement by NASA's Science Editorial Team said on Thursday. (ANI)",
    "image": "https://image.chitra.live/api/v1/wps/aaba9c6/f9062eed-8188-40de-8c83-4ae2cefb9665/0/ANI-20260130102419-600x315.jpg",
    "source": "malaysiasun.com"
  },
  {
    "title": "Flash estimate: GDP up 1 percent in Q4 2025",
    "desc": "Gross domestic product (GDP) rose by 1 percent in the fourth quarter of 2025 (Q4 2025), year-on-year according to a Statistics Estonia flash estimate.",
    "image": "https://s.err.ee/photo/crop/2026/01/30/3171389hcbcbt24.jpg",
    "source": "ERR"
  }
]