[
  {
    "title": "Jupiter is Smaller and More ‘Squashed’ than Previously Believed, New Juno Data Reveal",
    "desc": "Using high-precision radio-occultation measurements from NASA’s Juno mission and incorporating the effects of zonal winds, planetary scientists derived Jupiter’s shape with an order-of-magnitude reduction in uncertainty, finding polar, equatorial and mean radii smaller than previous estimates made with NASA’s Pioneer and Voyager missions.",
    "image": "https://cdn.sci.news/images/2021/05/image_9648f-Jupiter.jpg",
    "source": "Sci.News"
  },
  {
    "title": "10 Olympians who competed in a different college sport before landing on Team USA",
    "desc": "The following athletes competed in different sports in college than in the Olympics: Brittany Bowe, Kelly Curtis, Anna Gibson, Deedra Irwin, Kaysha Love, Elana Meyers",
    "image": "https://images.sidearmdev.com/fit?url=https%3a%2f%2fdbukjj6eu5tsf.cloudfront.net%2fncaa.org%2fimages%2f2026%2f2%2f4%2fMICO_Meet10NCAAAthletes_16x9.jpg&height=450&width=800&type=jpeg",
    "source": "NCAA.org"
  },
  {
    "title": "TSMC CEO flags 3-nanometre chip production in Japan, investment reported at $17 billion",
    "desc": "TSMC plans to mass produce advanced 3-nanometre chips in Kumamoto in southern Japan, TSMC CEO C.C. Wei said on Thursday, an investment local media reported was worth $17 ​billion as the Taiwanese firm seeks to meet soaring demand for AI chips. TSMC, the world’s ‌largest contract chipmaker and a key supplier of AI chips to companies such as Nvidia, currently produces its most advanced chips in ‌Taiwan. Previous plans for Japan had focused on less advanced technologies.",
    "image": "https://s.yimg.com/os/en/reuters-finance.com/56d1d7ccb626abd41b7ca182b83b98fc",
    "source": "Yahoo Finance"
  },
  {
    "title": "Manchester City: Pep Guardiola calls for EFL Cup rule change so Marc Guehi can play in Wembley final",
    "desc": "Manchester City boss Pep Guardiola wants the English Football League to change their rules to allow Marc Guehi to play in the Carabao Cup final against Arsenal.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/f9ee/live/3ba90e20-0220-11f1-9ef6-b11151d89c8d.jpg",
    "source": "BBC"
  },
  {
    "title": "Blues’ double injury setback revealed; young Swan ruled out for SIX months — AFL Daily",
    "desc": "Blues’ double injury setback revealed; young Swan ruled out for SIX months — AFL Daily",
    "image": "https://content.api.news/v3/images/bin/2110f8b30e69892a6d2641867884bab3",
    "source": "fox sports"
  },
  {
    "title": "Coronation Merchant Bank Aims for African Prominence at 10",
    "desc": "Celebrating its 10th anniversary, Coronation Merchant Bank outlines its strategy to become a leading African bank, leveraging its resilience and growth.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2022/03/17032519/Coronation-Merchant-Bank.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Fans race to learn Spanish before Bad Bunny's Super Bowl half-time show",
    "desc": "The Puerto Rican singer’s highly anticipated Super Bowl half-time show has inspired non-Spanish speakers to study Puerto Rican dialect and slang",
    "image": "https://i.guim.co.uk/img/media/0334284616796daa92d5f35f1e4e792714ca02eb/623_214_2643_2115/master/2643.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=450159ee8bba9906d4bb135891faf2d5",
    "source": "The Guardian"
  },
  {
    "title": "Toronto-area average home price dips under $1-million for first time since 2021",
    "desc": "Current average of $973,289 is down 6.5% compared with January, 2025, TRREB statistics show",
    "image": "https://www.theglobeandmail.com/resizer/v2/G4BET2YIOBFLJO2HICC2FY3JLI.JPG?auth=1576812ffe8d5e189f1d99ac6a7997a99a478d7ee99daaccd4dbd3112c9179f2&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "Tumour-brain crosstalk restrains cancer immunity via a sensory-sympathetic axis",
    "desc": "Body–brain communication has emerged as a key regulator of tissue homeostasis1–5. Solid tumours are innervated by different branches of the peripheral nervous system and increased tumour innervation is associated with poor cancer outcomes6–8. However, it remains unclear how the brain senses and responds to tumours in peripheral organs, and how tumour–brain communication influences cancer immunity. Here we identify a tumour–brain axis that promotes oncogenesis by establishing an immune-suppressive tumour microenvironment. Combining genetically engineered mouse models with neural tracing, tissue imaging and single-cell transcriptomics, we demonstrate that lung adenocarcinoma induces innervation and functional engagement of vagal sensory neurons, a major interoceptive system connecting visceral organs to the brain. Mechanistically, Npy2r-expressing vagal sensory nerves transmit signals from lung tumours to brainstem nuclei, driving elevated sympathetic efferent activity in the tumour microenvironment. This, in turn, suppresses anti-tumour immunity via β2 adrenergic signalling in alveolar macrophages. Disruption of this sensory-to-sympathetic pathway through genetic, pharmacological or chemogenetic approaches significantly inhibited lung tumour growth by enhancing immune responses against cancer. Collectively, these results reveal a bidirectional tumour–brain communication involving vagal sensory input and sympathetic output that cooperatively regulate anti-cancer immunity; targeting this tumour–brain circuit may provide new treatments for visceral organ cancers. Mouse models demonstrate that vagal sensory neurons transmit signals from lung adenocarcinoma to the brain, increasing sympathetic efferent activity in the tumour microenvironment and thereby creating a immunologically permissive environment for tumour growth.",
    "image": "https://media.springernature.com/m685/springer-static/image/art%3A10.1038%2Fs41586-025-10028-8/MediaObjects/41586_2025_10028_Fig1_HTML.png",
    "source": "Nature"
  },
  {
    "title": "Phylisa Wisdom to lead Mamdani's Office to Combat Antisemitism",
    "desc": "Mayor Zohran Mamdani has appointed Phylisa Wisdom, a progressive Jewish leader, to lead the Office to Combat Antisemitism.",
    "image": "https://forward.com/wp-content/uploads/2026/02/MixCollage-04-Feb-2026-04-30-PM-4850.jpg?_t=1770248329",
    "source": "The Forward"
  }
]