[
  {
    "title": "School buys van to transport chronically absent students to curb lagging attendance",
    "desc": "With most schools back in action, student attendance rates are once again in the spotlight.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--Qvzrc0Rf--/t_tohu-badge-facebook/v1644539490/4LZIMNU_copyright_image_282972?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "Free cancer screening camp at NIMS Hyderabad on February 4",
    "desc": "Join the free cancer screening camp at NIMS Hyderabad on February 4, 2026, for essential health checks.",
    "image": "https://th-i.thgim.com/public/incoming/b8ebl0/article70584570.ece/alternates/LANDSCAPE_1200/nims_4.jpg",
    "source": "The Hindu"
  },
  {
    "title": "New coach Yeoh Kay Bin: Malaysia can’t delay - badminton men’s singles rebuild must start immediately",
    "desc": "KUALA LUMPUR, Feb 3 — Newly hired national coach Yeoh Kay Bin has stressed that efforts to rebuild the country’s men’s singles squad must start immediately to close the gap...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/03/323592.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "growth budget plan unveiled",
    "desc": "DODOMA: THE government plans to increase spending by 9.75 per cent in the coming fiscal year to boost growth and safeguard hard-won macroeconomic gains achieved over the last decade. Expenditure for the 2026/27 year is projected at 61.9tri/-, up from 56.4tri/-, Finance Minister Ambassador Khamis Mussa Omar told lawmakers in Parliament yesterday as he unveiled",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/SnapInsta.to_625852253_18078318542591832_7838908660426772208_n.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Pastor Edwin Dadson, Spikenard Music International donate GH¢50,000 to Little Hearts Foundation",
    "desc": "Gospel minister Edwin Dadson, in partnership with Spikenard Music International, has donated GH¢50,000 to Little Hearts Foundation, a pediatric cardiac medical centre near Burna Camp, to support children living with congenital heart conditions.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/image-214-1024x682.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "NPLs: Publish names of loan defaulters to improve recovery - Analyst",
    "desc": "Finance and tax analyst Nelson Cudjoe Kuagbedzi is proposing that banks and other financial institutions publish names of loan defaulters as a strategy to",
    "image": "https://citinewsroom.com/wp-content/uploads/2025/07/Merban-Capital-Finance-Head.png",
    "source": "CitiNewsroom.com"
  },
  {
    "title": "59 cases of large-scale cross-border vape smuggling detected in 2025 with help of foreign intelligence",
    "desc": "Around 230,000 vapes and related products were seized in total, while over 10,000 online advertisements, including those found on messaging platforms, were removed in the last two years.",
    "image": "https://dam.mediacorp.sg/image/upload/s--VXmRVeO1--/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/25/vapes_5.jpg?itok=DHw1LA2y",
    "source": "CNA"
  },
  {
    "title": "Namibia's Call For Increased 4G Device Adoption Amid Infrastructure Expansion",
    "desc": "The Namibian telecommunications regulator expressed concern over the slow adoption of 4G-enabled devices in the country, suggesting that tax incentives",
    "image": "https://news.broadcastmediaafrica.com/wp-content/uploads/2024/01/4G-1-1.jpg",
    "source": "Broadcast Media Africa"
  },
  {
    "title": "IIHM's Young Chef Olympiad 2026 Opens in Bengaluru with Spectacle, Soul, and a Shared Heart for Food",
    "desc": "An arena of nations, a shared oath, and a single language—food—as YCO 2026 begins its global journey in India. BENGALURU, India, Feb. 2, 2026 /PRNewswire/ -- The 12th IIHM International Young Chef Olympiad (YCO) 2026 opened in Bengaluru with the...",
    "image": "https://www.tribuneindia.com/sortd-service/imaginary/v22-01/jpg/large/high?url=dGhldHJpYnVuZS1zb3J0ZC1wcm8tcHJvZC1zb3J0ZC9tZWRpYTc4OWIxODIwLTAwY2EtMTFmMS05ZTU3LWE1YjYwZTQ0ZTg4ZS5qcGc=",
    "source": "Tribune India"
  },
  {
    "title": "Oxford patient 'relieved' by ultrasound alternative to surgery",
    "desc": "A woman says she is relieved to be offered an innovative treatment for uterine fibroids.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/4cec/live/3512b2e0-0069-11f1-9653-b9d6c7314345.jpg",
    "source": "BBC"
  }
]