[
  {
    "title": "'The dancing is disgusting': Trump blasts Bad Bunny’s Super Bowl performance",
    "desc": "US News: US President Donald Trump has launched a scathing attack on the Super Bowl LX halftime show, calling it “absolutely terrible” and one of the worst in .",
    "image": "https://static.toiimg.com/thumb/msid-128095091,width-1280,height-720,imgsize-1271082,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Lamborghini Crash in Kanpur Market: Tobacco Tycoon's Son Behind the Wheel",
    "desc": "A high-speed Lamborghini, driven by tobacco tycoon KK Mishra's son, causes chaos in Kanpur, crashing into multiple vehicles and injuring a pedestrian. Police have taken action and registered an FIR.",
    "image": "https://static.toiimg.com/thumb/msid-128091804,width-1280,height-720,imgsize-2102938,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "The Artemis missions sees a new class of astronauts venture to the moon",
    "desc": "Now more than 53 years since humans last went to the moon, NASA will be going back with the Artemis missions.",
    "image": "https://brockpress.com/wp-content/uploads/2024/01/cropped-TBP-poster-2-32x32.png",
    "source": "The Brock Press"
  },
  {
    "title": "Liam Ramos Was Not in Bad Bunny's Super Bowl Halftime Show",
    "desc": "The Hollywood Reporter can confirm that Liam Ramos, a five-year-old boy who was detained by ICE, was not in Bad Bunny's Super Bowl halftime show.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2026/02/GettyImages-2260606840.jpg?w=1296&h=730&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "PenCom Accredits First Agent for Personal Pension Plan",
    "desc": "PenCom has accredited Awabah as the first agent for the Personal Pension Plan, aiming to boost pension enrolment for self-employed and informal workers.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2024/01/30153323/n.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Yemi Kale to Headline Ecobank Nigeria’s Customer Forum",
    "desc": "Ecobank Nigeria hosts its customer forum featuring Dr. Yemi Kale discussing economic transformation, regional integration, and the AfCFTA's future.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2017/06/03003731/kale.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Large Swedish study finds COVID-19 vaccination unrelated to fertility or childbirth rates",
    "desc": "A Swedish registry-based cohort study evaluated whether COVID-19 vaccination affected childbirth rates among women aged 18 to 45 years during the pandemic period. No statistically significant association was found between vaccination, childbirth, or recorded miscarriage rates, suggesting demographic and socioeconomic factors likely explain observed fertility trends.",
    "image": "https://www.news-medical.net/images/news/ImageForNews_829948_17706065341932896.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Russia Facilitates Travel And Tourism For Africans - OpEd",
    "desc": "Russian Foreign Minister, Sergey Lavrov, has reiterated the official statement on expanding visa-free travel between Russia and Africa, signaling Kremlin's earlier position on facilitating people-to-people movement and raising cultural interaction. The question of 'visa-free' travel and tourism dominated discussions during the first and second Russia-Africa summits, as a step to embrace new bilateral relations and...",
    "image": "https://www.eurasiareview.com/wp-content/uploads/2022/03/b-44.png",
    "source": "Eurasia Review"
  },
  {
    "title": "Jewish astronaut bringing daughter's stuffed animal to space station",
    "desc": "Jessica Meir, 48, says she plans to send photos of herself and toy rabbit to family from International Space Station",
    "image": "https://static-cdn.toi-media.com/www/uploads/2020/06/49784307192_fdd5aa9a12_o.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Winter Olympics 2026: From Torino to Milano Cortina, how Andrea Bocelli has defined Italy’s Olympic era",
    "desc": "The world-renowned tenor has performed at both the 2006 and 2026 Olympic Games, with each moment uniquely etched into his nation’s history.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/gecrgubcn2exluwk52cm",
    "source": "Milano Cortina 2026"
  }
]