[
  {
    "title": "NFWF Announces $3 Million in Grants through the Southeast Aquatics Fund",
    "desc": "Eight projects will benefit freshwater species by improving water quality",
    "image": "https://www.manilatimes.net/theme_manilatimes/images/TMT_1920x1008.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "Hunt for 'disgusting' pervert who carried out sex act in front of teen girl on Newcastle bus",
    "desc": "A teenage girl has been left scared to go out after her horrific ordeal on the number 39 bus while travelling home from Newcastle city centre",
    "image": "https://i2-prod.chroniclelive.co.uk/article33412426.ece/ALTERNATES/s1200/1_IBP_NEC_120226bus_01JPG.jpg",
    "source": "Chronicle Live"
  },
  {
    "title": "Gene activity pattern links childhood abuse to depression",
    "desc": "Scientists have identified a pattern of gene activity present in some female survivors of childhood abuse that is associated with an elevated risk of depression.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/depression-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Morocco at the helm of Africa’s peace architecture",
    "desc": "What distinguishes Morocco’s role is not only diplomatic influence, but consistency.",
    "image": "http://thearabweekly.com/sites/default/files/styles/article_image_800x450_/public/2026-02/2026-02-12_15-37-23_209191.jpg?itok=vrFlYhs2",
    "source": "The Arab Weekly"
  },
  {
    "title": "High Court Declares “Creating Disturbance” Law Unconstitutional in Landmark Freedom of Expression Ruling",
    "desc": "Previously, the offence carried a maximum penalty of six months’ imprisonment. - Kenya breaking news | Kenya news today | Capitalfm.co.ke",
    "image": "https://www.capitalfm.co.ke/news/files/2025/12/MILIMANI-LAW-COURTS-SIGNAGE.jpeg",
    "source": "Capitalfm.co.ke"
  },
  {
    "title": "Presidents' Day sales 2026: The best tech deals to shop this week from Apple, Sony, Samsung and others",
    "desc": "Save up to 50 percent on everything from affordable streaming devices and accessories to high-end wearables, wireless headphones and more.",
    "image": "https://s.yimg.com/ny/api/res/1.2/6I3noB6OZfzsfea8Wdpz0g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDA-/https://s.yimg.com/os/creatr-uploaded-images/2025-11/c760e800-bb50-11f0-be9b-28e8af3ff9d5",
    "source": "Engadget"
  },
  {
    "title": "Google Maps prepping car icon and color picker for Android Auto",
    "desc": "The new Google Maps custom car icons have been available for a year, and more recently, the existence of custom...",
    "image": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2025/05/Android-Auto-Maps-and-Music-playback-3.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "source": "9to5Google"
  },
  {
    "title": "Author of Viral AI Essay Says AI Helped Write It",
    "desc": "Matt Shumer said he wrote his viral essay for people like his dad who are skeptical of AI or just trying to avoid it entirely.",
    "image": "https://i.insider.com/698d2a83d3c7faef0ece2063?width=1200&format=jpeg",
    "source": "Business Insider"
  },
  {
    "title": "Parliament session day 12 highlights: No inflation crisis in India today, Sitharaman says in Rajya Sabha",
    "desc": "Parliament Budget Session Day 12 highlights: The Finance Minister said inflation has never been lower than what it is today, and also compared the unspent amount during a ten-year period for the UPA and NDA governments.| India News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/12/550x309/ANI-20260212471-0_1770910570405_1770910581050.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Yao Guang Honkai Star Rail release date and timings for all regions",
    "desc": "Esports News: The release date for the latest 4.0 update of Honkai Star Rail is on the horizon, and is about to mark the debut of Yao Guang. The character will appe.",
    "image": "https://static.toiimg.com/thumb/msid-128265813,width-1280,height-720,imgsize-2032217,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  }
]