[
  {
    "title": "Gurgaon Rape & Murder News: 3.5-year-old raped, strangled to death by neighbour",
    "desc": "GURGAON: A 3.5-year-old girl was raped and strangled to death after being lured away from her neighbourhood in the area falling under the jurisdiction.",
    "image": "https://static.toiimg.com/thumb/msid-128597495,width-1280,height-720,imgsize-23916,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Medical tourist fights for compensation, claims surgery destroyed her stomach",
    "desc": "By Jimmy Ellingham of RNZ A Manawatū woman is days away from a full stomach reconstruction five months after a weight-loss operation in Turkey went wrong....",
    "image": "https://www.nzherald.co.nz/resizer/v2/PXFRMIPBTVEXRDSNRJONKRQ6ZM.png?auth=a1e0b323f0fa4a83ce330c0c9f19898343e2521a7f6afe6d5a9bf2bcc61b7a3d&width=1200&height=675&quality=70&focal=799%2C345&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Winnie Odinga Recalls Day Dad’s Convoy Arrived in US University, Students Named Her African Princess",
    "desc": "A TBT video of Winnie Odinga has emerged where she recalled the day her dad, Raila, still a prime minister, visited her university in the US, making her popular.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/32538282f65106ba.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "Medicover Hospital Introduces Advanced Urodynamic Study Services",
    "desc": "Medicover Hospital has launched Urodynamic Study (UDS) services to improve the diagnosis and management of bladder and urinary tract disorders. Through this advanced diagnostic facility, doctors can now accurately assess […]",
    "image": "https://theindianpractitioner.com/wp-content/uploads/2026/02/Medicover-Hospital-Introduces-Advanced-Urodynamic-Study-Services.jpg",
    "source": "The Indian Practitioner"
  },
  {
    "title": "GREDA urges reduction of building materials prices as cedi gains strength",
    "desc": "The Ghana Real Estate Developers Association (GREDA) has raised concerns over the persistent high cost of building materials, despite the recent appreciation of the Ghanaian cedi against the US dollar.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/1-26.jpeg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Residents' disgust as 'fountain of raw sewage' explodes from toilets",
    "desc": "The Miramar resident said the incident occurred while Wellington Water staff were working on his street.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/particles-of-poop-could-be-seen-coating-the-toilet-and-bathr-EKZE7DIJQ5AE7FX3JMSQW2I4HU.jpg?auth=67f4335ee644af7ad1c4d7e2f313a6e67dc4788e6d0b55ca922f9f49e0b7eff4&quality=70&width=600&height=315&focal=493%2C309",
    "source": "1News"
  },
  {
    "title": "Notepad is reportedly getting image support, and I'm wondering what Notepad's niche is now",
    "desc": "It's not WordPad, but it's WordPad.",
    "image": "https://static0.xdaimages.com/wordpress/wp-content/uploads/wm/2026/02/notepad-windows-11.jpg?w=1600&h=900&fit=crop",
    "source": "XDA"
  },
  {
    "title": "Tullow announces Refinancing Transaction and Lock-Up Agreement with c.66% of its Noteholders and Glencore",
    "desc": "Tullow Oil plc ( “Tullow” or the “Company”) is pleased to announce that it has entered into a binding Lock-Up Agreement to implement a refinancing transaction (the “Refinancing Transaction”) with holders of c.66% of its $1,285,245,000 10.25% senior secured notes due May 2026 (the “Senior Secured Notes”, and the holders thereof, the “Noteholders”) and with Glencore Energy UK Limited (“Glencore”).",
    "image": "https://www.tullowoil.com/application/files/4215/8584/3642/Home_page_thumb_1067-x-600.jpg",
    "source": "tullowoil.com"
  },
  {
    "title": "How to Turn Off Personalised Ads on Android",
    "desc": "Learn how to delete your Android advertising ID, disable ad personalisation, and improve privacy while still using your device normally.",
    "image": "https://www.brandsynario.com/wp-content/uploads/2026/02/android-advertising-feature.jpg",
    "source": "Brandsynario"
  },
  {
    "title": "Bobby Deol and Anurag Kashyap’s Bandar locks theatrical release on May 22, 2026",
    "desc": "Bobby Deol and Anurag Kashyap’s Bandar locks theatrical release on May 22, 2026. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood News Hindi, Hindi Bollywood News at Bollywood Hungama.com.",
    "image": "https://stat4.bollywoodhungama.in/wp-content/uploads/2026/02/Bandar-release-date.jpeg",
    "source": "Bollywood Hungama"
  }
]