[
  {
    "title": "57-year-old man kills wife, dies by suicide in Kuresoi, Nakuru county",
    "desc": "The body of Richard Simotwa was found hanging from a roof truss with a rope around the neck",
    "image": "https://cdn.radioafrica.digital/image/2026/02/cc5368ee-38b6-4829-a541-a70f4a2c1d94.jpg?1771053194891",
    "source": "the-star.co.ke"
  },
  {
    "title": "Two warning signs of dementia that could appear at night",
    "desc": "If someone is experiencing symptoms of dementia, you should speak to a GP.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/11/1200x630/6735849.jpg",
    "source": "Daily Express"
  },
  {
    "title": "How AI Is changing China’s Spring Festival in surprising ways",
    "desc": "This year, China’s Spring Festival celebrations feel different. Alongside the traditional family reunions, fireworks, and red envelopes, artificial intelligence is stealing the show",
    "image": "https://minutemirror.com.pk/wp-content/uploads/og-cache/fb794d340f880c8daf52336aac481b48.jpg",
    "source": "Minute Mirror"
  },
  {
    "title": "From wards to worship: Diana Hamilton reveals how nursing school shaped her destiny",
    "desc": "Multi-award-winning Ghanaian gospel musician Diana Hamilton has opened up about her formative years in the health profession, describing her time in nursing school as the pivotal era where her personal and professional lives converged.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Hamilton.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Senior police officer handed life sentence for murder of unarmed man",
    "desc": "High Court in Mombasa convicts former Likoni OCS over fatal 2018 shooting",
    "image": "https://cdn.radioafrica.digital/image/2026/02/dd831121-f7cc-45e4-9992-ca2be2660f98.jpg?1771051153145",
    "source": "the-star.co.ke"
  },
  {
    "title": "Presidential Declaration on Advancing Local Manufacturing of Health Products in Africa",
    "desc": "On the margins of the 39th Ordinary Session of the Assembly of the African Union We, the Heads of State and Government, Ministers of Health of AU member states High-Level Representatives, and Partners We hereby declare our commitment to: Adopted on 14 February 2026 in Addis Ababa, Ethiopia on the margins of the 39th AU […]",
    "image": "https://africacdc.org/wp-content/uploads/2025/09/African-Union-Press-header-02.jpg",
    "source": "Africa CDC"
  },
  {
    "title": "Uncertainty surrounds Imran Khan's next move amid deal speculation",
    "desc": "Imran has been denied meetings with family and lawyers.PTI unsure what tone he'd adopt if allowed to speak again.Past messages relayed through visitors triggered restrictions.ISLAMABAD: Some relief for...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-14/l_650763_104817_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Armed gang member jailed 9 years for robbery at funeral parlour",
    "desc": "A BULAWAYO man, who was part of a gang, has been sentenced to an effective nine-year prison term for orchestrating an armed robbery at a funeral parlour in the city. Clifford Desmond Nare (34) of Cowdray Park, Bulawayo, appeared at Tredgold Magistrates Court facing a count of robbery and was convicted after full trial. The […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2019/02/06125625/jail-e1675980742403.jpg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "CS Ogamba Issues Update on Payment of Exam Markers",
    "desc": "Ogamba assured that payments would be made despite the delay.",
    "image": "https://nairobileo.co.ke/storage/uploads/2026/01/IMG-20260102-WA0010-1767367513-1767370138.jpg",
    "source": "Nairobi Leo"
  },
  {
    "title": "Two passengers killed after being tossed off truck, crash onto tarmac",
    "desc": "TWO passengers aboard an Isuzu KB300 truck that veered off the road died after crushing onto the tarmac having been thrown out of the loading box. The fatal accident occurred along the Ngundu-Tanganda road Thursday. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul Nyathi confirmed the incident. “The ZRP confirms a fatal road traffic accident […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/12/31184346/Accident4.jpg",
    "source": "NewZimbabwe.com"
  }
]