[
  {
    "title": "At a broken Kennedy Center, the National Symphony begins a new journey",
    "desc": "The NSO is losing its home — after becoming a world-class orchestra.",
    "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3LMNMZZ3F5LIIJOBWZLBY53QZI_size-normalized.jpg&w=1440",
    "source": "The Washington Post"
  },
  {
    "title": "Ex-NFL LB Darron Lee charged with murder in girlfriend's death",
    "desc": "Former NFL linebacker Darron Lee, the Jets' first-round pick in 2016, was arrested and charged with first-degree murder in the death of his girlfriend, the Hamilton County (Tennessee) Sheriff's Office announced Friday.",
    "image": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0207%2Fr1611578_1296x729_16%2D9.jpg",
    "source": "ESPN"
  },
  {
    "title": "F&B scams in Singapore: More fake restaurant websites take bookings, online orders",
    "desc": "Discover how F&B scams involving fake restaurant websites and online orders are impacting businesses and consumers this festive season. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/accaf7bda32ffb84b2a3bb3bc3ab1beacfd826cb8b2e40227bf629c262bfdf10",
    "source": "The Straits Times"
  },
  {
    "title": "Cricket legend Brett Lee quits Australia for new country",
    "desc": "Brett Lee and wife Lana have celebrated their new life in Dubai with an outrageous hole in one of the golf course.",
    "image": "https://content.api.news/v3/images/bin/f541c49d422bfa0f42ad5324740ecde4",
    "source": "News.com.au"
  },
  {
    "title": "Team India Form Guide: How ready are defending champions India for T20 World Cup title defence at home?",
    "desc": "Cricket News: Defending champions and co-hosts India walk into the ICC Men’s T20 World Cup 2026 as overwhelming favourites, beginning their title defence against th.",
    "image": "https://static.toiimg.com/thumb/msid-128003423,width-1280,height-720,imgsize-64394,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Red-hot India out to redefine history, launch ‘monopoly’ era as T20 World Cup back on home turf after 10 years",
    "desc": "T20 World Cup 2026: Anyone who discounts India’s chances will clearly do so at the risk of being asked to have their heads checked.  | Cricket",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/07/550x309/HAZW2JcagAArkTX_1770430670597_1770430676439.jfif",
    "source": "Hindustan Times"
  },
  {
    "title": "Caleb Landry Jones, Christoph Waltz New Movie",
    "desc": "With Christoph Waltz, Zoë Bleu, and Ewens Abid, Luc Besson's \"Dracula\" brings style over substance to a new film for the Bram Stoker classic. Review.",
    "image": "https://www.indiewire.com/wp-content/uploads/2026/02/7Y7A3050_3d2967.jpg?w=650",
    "source": "IndieWire"
  },
  {
    "title": "10 essential tips to protect your kidneys and stay healthy",
    "desc": "Discover 10 expert-backed ways to protect your kidneys. Learn how to manage blood pressure, blood sugar, and avoid toxins to prevent chronic kidney disease",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/06215828/drinking-water.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "99 arrested in islandwide anti-drug raids, over $38k worth of drugs seized",
    "desc": "The Central Narcotics Bureau conducted an islandwide anti-drug operation from Feb 2 to 6. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/99518a0722149cf76afbe76d27723252b8b9d2194e51c0e0c96f9620e35af315",
    "source": "The Straits Times"
  },
  {
    "title": "In Talks, Trump Won’t Allow Iran to Have Any Enriched Uranium",
    "desc": "Can the two sides get past Iran’s claim that it has a “right” to enrich uranium?",
    "image": "https://static01.nyt.com/images/2026/02/06/multimedia/06dc-iran-uranium-mgpk/06dc-iran-uranium-mgpk-facebookJumbo.jpg",
    "source": "The New York Times"
  }
]