[
  {
    "title": "Netflix Renews Danish Undercover Agent Drama 'The Asset' For Season 2",
    "desc": "Netflix has renewed Danish crime series 'The Asset' for a second season.",
    "image": "https://deadline.com/wp-content/uploads/2026/01/The_Asset_00_26_35_14_Jonas-Berlin_Netflix.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "‘A very Italian problem’: inside the fight against the mafia and corruption at the Winter Olympics",
    "desc": "Construction works for Milano Cortina have been a lightning rod for suspected infiltration by organised crime, but anti-mafia groups have adopted an approach that will help future hosts",
    "image": "https://i.guim.co.uk/img/media/1c04a21616a46d675f09bb6698b8b5ed2349b1cc/126_0_3780_3024/master/3780.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3ca32f666fd3b66fdf672f3976b5d920",
    "source": "The Guardian"
  },
  {
    "title": "OpenSilver 3.3 brings native Blazor into XAML apps",
    "desc": "OpenSilver 3.3 lets developers embed native Blazor components in XAML apps, uniting WPF-style UI with the Blazor ecosystem.",
    "image": "https://itbrief.co.nz/uploads/story/2026/01/30/compatible_developer_dual_monitors_xaml_desktop_and_blazor_web_integration_art.jpg",
    "source": "IT Brief New Zealand"
  },
  {
    "title": "‘Abuse of power’: Strata giant faces landmark lawsuit over charges",
    "desc": "The legal action is being fought on behalf of lot owners in dozens of Melbourne buildings who have received misleading fee notices.",
    "image": "https://static.ffx.io/images/$zoom_0.1292724609375%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_73/t_crop_custom/q_86%2Cf_auto/0dabfe1587ca1af1c8049832a6b5669e3c439648",
    "source": "theage.com.au"
  },
  {
    "title": "5 nabbed over alleged bribes from massage parlour chain",
    "desc": "The company is suspected to have paid RM2.7 million a year to several officers from multiple enforcement agencies, including local councils.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/01/f6840deb-rasuah-pusat-urut-emel-pic-300126.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Systemic Trade-Offs and Institutional Constraints in the Jordan Valley",
    "desc": "This research moves beyond conventional water accounting to provide a systemic diagnostic framework for the Jordan Valley, identifying the “Structural Misalignment” between economic incentives and resource sustainability. The primary contribution of this study is the development and validation of a Decision Support System (DSS) powered by two novel composite indices: the Nexus Efficiency Index (NEI) and the Composite Operational Deficit (OD). Unlike traditional reports, this analysis uncovers a critical “Governance Gap” driven by a price-incentive decoupling: a 5.7% agricultural inflation (APPI) occurring simultaneously with a 0.69% national deflation (PPI) in late 2025. By quantifying this divergence, the study provides empirical evidence of Jevons’ Paradox in the Jordan Valley, where technical efficiencies (82% billing) are systematically eroded by the near-zero marginal cost of independent solar-powered pumping. The research’s strategic breakthrough lies in its “Policy Localization” roadmap, designed to mitigate the 83% reduction in international technical support (USAID). Through the integration of Predictive AI (SVM) and Satellite-based Monitoring (IPADT), the study demonstrates how “Focus Metering” can capture 80% of management benefits with minimal infrastructure investment. This work transforms the Water-Energy-Food-Environment (WEFE) Nexus from a theoretical concept into an actionable, digital governance lever, providing a blueprint for achieving systemic resilience and safeguarding Jordan’s “Hydrological Commons” amidst the global energy and fiscal shifts of 2026.",
    "image": "https://file.scirp.org/image/ojmh2016063017194430.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "A Comparative Study of Survival Strategies between Li Baoli in Thousands of Arrows Piercing the Heart and Antonia in Antonia’s Line",
    "desc": "Taking feminist theory as the core framework, this study adopts text analysis, parallel comparison and cross-cultural comparative research methods to conduct a qualitative investigation of two female figures: Li Baoli from the Chinese film Thousands of Arrows Piercing the Heart and Antonia from the Dutch film Antonia’s Line. Focusing on the dual dimensions of “coping with suffering” and “constructing subjectivity”, this paper analyzes the “confrontational survival” and “constructive survival” strategies adopted by the two women respectively in the family field dominated by patriarchal discourse in China in the 1990s and the tolerant social context of the Netherlands after World War II, revealing the differences in paths for women to realize self-worth in different social structures. Drawing on Simone de Beauvoir’s concept of “otherness” and feminist utopian theory, the study finds that Li Baoli’s confrontation falls into a cycle of “individual breakthrough-external suppression” due to the lack of systematic support, as her subjectivity is perpetually confined by the “othering” of family ethics and patriarchal order. In contrast, Antonia transforms individual suffering into collective strength by establishing a women-led family community—an embodiment of feminist utopian practice—realizing the intergenerational transmission and utopian construction of subjectivity. The differences between them not only reflect the shaping of women’s living space by Chinese and Western social cultures (while acknowledging intra-cultural diversity) but also provide a cross-cultural reference for understanding the diverse paths to women’s subjectivity.",
    "image": "https://file.scirp.org/image/oalibj2016030109584288.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Apple to prioritise premium iPhone launches in 2026 amid memory crunch: Report",
    "desc": "Apple will also delay the roll-out of its standard model. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/e29c89ac7f75e7e6073c1c2fbe7bed30c559b7d80c10681f4486bc74b309ae11",
    "source": "The Straits Times"
  },
  {
    "title": "Ebonyi traders reject protest over Onitsha market closure",
    "desc": "Ebonyi traders in Anambra State reject protests over the Onitsha market closure, backing Governor Soludo's directive to end Monday sit-at-home actions.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/01/30091318/Onitsha-Main-Market.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Premier League: 10 things to look out for this weekend",
    "desc": "Nico O’Reilly gives Manchester City options, Sunderland miss Granit Xhaka’s grit and West Ham find a way",
    "image": "https://i.guim.co.uk/img/media/0b9fe4732c7538245bd86a478278f65451b76c04/0_0_5000_4000/master/5000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5d716a5aef20864dcd39001b1be2296e",
    "source": "The Guardian"
  }
]