[
  {
    "title": "Latvian citizen sentenced to six years in prison for espionage",
    "desc": "The Rīgas pilsētas tiesa on Wednesday approved an agreement between the prosecutor and a Latvian citizen who was detained last summer on suspicion of espionage. Under the plea agreement, the defendant was sentenced to six years’ imprisonment with two years of probation supervision, the court informed. Taking into account the time already spent in pre-trial […]",
    "image": "https://bnn-news.com/wp-content/uploads/2026/02/selective-focus-shelves-full-with-evidence-files.jpg",
    "source": "Baltic News Network"
  },
  {
    "title": "Driven by Dhoni, Pakistan's X-factor tweaker Tariq targets India",
    "desc": "Pakistan's Usman Tariq left his cricket ambitions back home to start a salesman's job in Dubai, before a biopic about India great Mahendra Singh Dhoni changed his life.",
    "image": "https://s.france24.com/media/display/d7372e86-08cd-11f1-8a06-005056a90284/w:1280/p:16x9/087f68f6898bdfa8986e427e2cbb0b995b109cb3.jpg",
    "source": "France 24"
  },
  {
    "title": "Gold prices in Pakistan today",
    "desc": "In the international market, price of gold eased by $86 per ounce to $4,972, reversing some of this week’s gains",
    "image": "https://i.tribune.com.pk/media/images/untitled-design-2026-02-02t120505-4501770015906-0/untitled-design-2026-02-02t120505-4501770015906-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Astronauts in awe at 'utterly unique, fragile' Earth as they blast off to ISS",
    "desc": "The crew will replace a team that evacuated the space station due to a medical emergency in January.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0728/live/b5542120-08d2-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  },
  {
    "title": "Embark on an Incredible Journey as ATLUS and Sandfall Interactive Announce Metaphor: ReFantazio™ and Clair Obscur: Expedition 33 Steam Bundle",
    "desc": "Press releases and assets from across the games industry - screenshots, videos, logos, packshots, artwork, PR contacts, release dates",
    "image": "https://www.gamespress.com/Content/Themes/Games Press/img/favicon.ico",
    "source": "Games Press"
  },
  {
    "title": "Beyond the Capital City: Rethinking Jakarta’s Urban Future",
    "desc": "INDONESIA STUDIES PROGRAMME About the Webinar Jakarta is entering a critical moment in its urban history. With the passing of the Special Region of Jakarta (DKJ) law and the planned relocation of Indonesia’s administrative capital to Nusantara, the city is being redefined from being the political centre of the country into a metropolitan region expected […]",
    "image": "https://iseas.edu.sg/wp-content/uploads/2026/02/Events-Template-Facebook-260313-1.jpg",
    "source": "ISEAS-Yusof Ishak"
  },
  {
    "title": "Prabowo Warns Entrepreneurs Against Gaming Rules for Profit",
    "desc": "President Prabowo criticized businesses that exploit regulations and vowed to root out corruption, urging investors to support job creation.",
    "image": "https://img2.beritasatu.com/cache/jakartaglobe/960x620-w/2026/02/1770981519-5000x3334.webp",
    "source": "Jakarta Globe"
  },
  {
    "title": "NCAA men’s volleyball: Letran makes quick work of JRU to return to win column",
    "desc": "Colegio de San Juan de Letran bounced back with a straight-sets victory over Jose Rizal University, 25-18, 25-19, 25-11, in the NCAA Season 101 men’s volleyball tournament on Friday at the San Andres Sports Complex.",
    "image": "https://images.gmanews.tv/webpics/2026/02/IMG_0193_2026_02_13_19_12_44.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Elena Rybakina sends statement to rivals after losing first event after Australian Open",
    "desc": "Elena Rybakina's winning run came to an end less than two weeks after her Australian Open triumph.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/72/1200x630/6740121.jpg",
    "source": "Daily Express"
  },
  {
    "title": "Palash Muchhal gets relief from Bombay HC in Rs 10 crore defamation case against Vidnyan Mane after allegations of cheating on Smriti Mandhana",
    "desc": "Singer and composer Palash Muchhal had filed a defamation suit against Vidnyan Mane after he alleged that he was found red handed in bed with another .",
    "image": "https://static.toiimg.com/thumb/msid-128303436,width-1280,height-720,imgsize-29964,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  }
]