[
  {
    "title": "Manly rocked by multimillion-dollar lawsuit over Keith Titmuss’ tragic death after training",
    "desc": "Manly rocked by multimillion-dollar lawsuit over Keith Titmuss’ tragic death after training",
    "image": "https://content.api.news/v3/images/bin/5c3c7762417da1bd64ed7f9b22746b6d",
    "source": "fox sports"
  },
  {
    "title": "Punjab amends child marriage law",
    "desc": "New amendment draws mixed reaction",
    "image": "https://i.tribune.com.pk/media/images/26598-childmarriagei_1736174005/26598-childmarriagei_1736174005-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "4 Penn State wrestling takeaways from the Lions' 36-5 win over Ohio State: On Mirasola's win, the Buckeyes' lineup, and more",
    "desc": "Penn State wrestling won nine of 10 matches en route to a dominating 36-5 win over Ohio State. Here are our top takeaways.",
    "image": "https://on3static.com/uploads/dev/assets/cms/2026/02/13204634/penn-state-wrestling-cole-mirasola.jpg",
    "source": "On3"
  },
  {
    "title": "'Teen driving at 160 kmph': How speeding SUV triggered chain collision on Bengaluru; 6 students among 7 dead",
    "desc": "What was meant to be an early-morning joyride turned into a tragedy of unimaginable proportions when a “speeding” SUV was reduced to a mangled heap of metal and shattered glass, snuffing out seven lives — six students, five of them minors, and a bike rider — near Kambalipura Gate in Hoskote taluk of Bengaluru Rural district on Friday.\nAfter hitting a bike, the SUV rear-ended a moving truck. In a matter of moments, the Dobbaspet-Hoskote Satellite Town Ring Road (STRR) was transformed into a chilling scene of devastation. Police said the accident occurred between 4.15am and 4.30am.\nA senior police officer told TOI the SUV was mangled beyond recognition, with all its six occupants found dead inside the vehicle. The deceased were identified as Ahram Sharif, 16; Ashvin Nayar, Eethan George, Ayan Ali, Bharath – all 17 years old; Mohammed Farhan Shaik, 18; and Gagan, 26. While Gagan was riding a bike, the other six were travelling in an XUV 700. Balasubramaniam, 32, the driver of the truck, was injured.\nAbout 15 minutes after the multi-vehicle crash, a Brezza headed towards Bengaluru airport rammed into the truck’s detached axle and wheel housing still lying on road. The car was damaged and its two occupants suffered minor injuries. Naresh, who was driving the Brezza, alerted police. Police said the six students were heading towards Devanahalli from Hoskote when, near Kambalipura Gate, Ayan — who was reportedly driving the XUV 700 at 150-160kmph — lost control while speeding and rammed into the bike ridden by Gagan, flinging him into the air. He died on the spot.",
    "image": "https://static.toiimg.com/thumb/msid-128333705,width-1280,height-720,imgsize-63156,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Actor James Van Der Beek’s family thanks fans for donations",
    "desc": "James Van Der Beek’s family have thanked fans for their recent show of support. The Dawson’s Creek star died on Wednesday, February 11, aged 48, and his...",
    "image": "https://www.nzherald.co.nz/resizer/v2/BG47DNGVYVFQ3LOTHTRA4DPVFQ.jpg?auth=2979d443ae8fd195f5833e88fd4e9a2d97ebb64d63749bd49595ccf6c7ddf979&width=1200&height=675&quality=70&focal=939%2C607&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Valentine's Day goal? Married skeleton duo compete for separate nations at Milan Cortina Winter Olympics",
    "desc": "International Sports News: Valentine’s Day is in the air, but it will look different for Kim Meylemans and Nicole Rocha Silveira. Instead of dinner plans, the married couple wil.",
    "image": "https://static.toiimg.com/thumb/msid-128332205,width-1280,height-720,imgsize-27478,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Bea Alonzo forgives Cristy Fermin, cyber libel case withdrawal up for consideration",
    "desc": "Bea Alonzo has agreed to continue mediations with entertainment journalist Cristy Fermin and two of her colleagues.",
    "image": "https://media.philstar.com/photos/2025/08/01/bea-alonzo-cristy-fermin_2025-08-01_13-23-30.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Antibody feedback reshapes B cell selection during immune response",
    "desc": "A collaborative study published in Immunity from the Batista Lab and Liu Lab at the Ragon Institute, together with the Schief Lab at Scripps Research Institute, has uncovered a previously unrecognized mechanism that shapes how immune cells are selected during an immune response.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/Antibody-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Trump: Regime change in Iran ‘would be the best thing that could happen’",
    "desc": "US president confirms sending second aircraft carrier to Middle East in case 'difficult' Islamic Republic doesn't make a deal, says 'fear' is only thing that will get Tehran to sign agreement",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/02/AP26044750497866-e1771018232795.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Recall issued for Milo snack bars after hazardous ‘black rubber’ found inside food",
    "desc": "‘Consumers should not eat this product.’",
    "image": "https://images.7news.com.au/publication/C-21635563/792ccb26ac8c50e4130fb398590fb3851b4df280-16x9-x0y0w1280h720.png?imwidth=1200",
    "source": "7NEWS"
  }
]