[
  {
    "title": "Former South Korea leader Yoon Suk Yeol faces insurrection verdict over martial law declaration",
    "desc": "South Korean prosecutors have called for the former president to be sentenced to death.",
    "image": "https://dam.mediacorp.sg/image/upload/s--X-7LbMg0--/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2026-01-22T015658Z_1_LYNXMPEM0L03B_RTROPTP_3_SOUTHKOREA-POLITICS-YOON.JPG?itok=5wSuYiBr",
    "source": "CNA"
  },
  {
    "title": "AI Summit: India has central role in shaping AI’s future, Anthropic CEO Dario Amodei says",
    "desc": "At the AI Impact Summit in New Delhi, Anthropic CEO Dario Amodei emphasized that India holds a crucial position in guiding artificial intelligence's future. The company is expanding its presence in India, opening an office in Bengaluru and forming partnerships. India's leadership is vital for navigating AI's economic, societal, and security challenges, as well as its immense potential.",
    "image": "https://img.etimg.com/thumb/msid-128539023,width-1200,height-630,imgsize-177622,overlay-economictimes/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Miss Universe Philippines introduces new fan voting system for 2026 competition",
    "desc": "Miss Universe Philippines is introducing a new fan voting system for its 2026 competition, allowing the public to cast daily votes for their favorite candidates.",
    "image": "https://images.gmanews.tv/webpics/2026/02/muph_2026_02_19_12_32_19.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Imran Khan doesn't want to become Nawaz Sharif, says PTI leader",
    "desc": "One has to give concessions in such talks: Barrister Umair Niazi.Nawaz paid a price, leave practical politics, go into exile, he adds.KP CM's aide Shafiullah Jan says party's planning something else.With Pakistan Tehreek-e-Insaf founder...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-19/l_651687_092902_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "VIDEO Club Brugge vs Atlético Madrid: Champions League Playoff goals",
    "desc": "Watch all the goals from Club Brugge vs Atlético Madrid in the first leg of the Champions League Playoffs.",
    "image": "https://prod-media.beinsports.com/image/Juli%C3%A1n%20%C3%81lvarez%20Atl%C3%A9tico.1080.jpg",
    "source": "beIN SPORTS"
  },
  {
    "title": "Man Utd news: Concerns emerge over loan star as club are pitted against Barcelona again",
    "desc": "While Manchester United wait to make a decision on their permanent manager, there have been developments when it comes to the current squad and potential targets",
    "image": "https://i2-prod.mirror.co.uk/article36743652.ece/ALTERNATES/s1200/0_West-Ham-United-v-Manchester-United-Premier-League.jpg",
    "source": "The Mirror"
  },
  {
    "title": "Observers warn of early goonism, institutional rot as political temperatures rise",
    "desc": "Concern as seeds of discord are sown through early, illegal campaign activities",
    "image": "https://cdn.radioafrica.digital/image/2026/02/bb58e3dd-387f-4ef9-a117-6a5f75279585.jpg?1771488171201",
    "source": "the-star.co.ke"
  },
  {
    "title": "An avalanche in Northern California was the worst in the US for 40 years. Here's how it unfolded",
    "desc": "An avalanche in California has left eight back-country skiers dead and one missing. Here's how it unfolded.",
    "image": "https://live-production.wcms.abc-cdn.net.au/8b5f0088f2ad9eb05f8e125dfcddf973?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Andrew to take big decision about future as police pressure grows",
    "desc": "Andrew Mountbatten-Windsor is reportedly thinking about his next big step as pressure around him continues to grow in the UK.A fourth police force, Essex Police, has confirmed it is reviewing...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-19/1392823_093746_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "UAE Space Agency extends its Mars mission until 2028",
    "desc": "The UAE Space Agency has announced the extension of the Emirates Mars Mission, the Hope Probe, until 2028, adding three more years to its operations. The decision comes in light of the mission's strong scientific achievements and the continued high performance",
    "image": "https://news.cgtn.com/news/2026-02-19/UAE-Space-Agency-extends-its-Mars-mission-until-2028-1KSUot7Z648/img/825707ee93cf415287340066d80135ac/825707ee93cf415287340066d80135ac-750.png",
    "source": "news.cgtn.com"
  }
]