[
  {
    "title": "Kerry flex muscle at Croke Park as All-Ireland champions cruise past hapless Dublin",
    "desc": "Tony Brosnan’s 57th-minute goal the killer score as Kingdom keep league title hopes alive.",
    "image": "https://img2.thejournal.ie/article/6964229/river/?height=400&version=6964240",
    "source": "The 42"
  },
  {
    "title": "Sidney Crosby skates at practice, will be game-time decision for Olympic gold-medal final",
    "desc": "Sidney Crosby took part in Canada's practice Saturday and remains an option for the country's gold-medal matchup with the United States at the Milan Cortina Olympics. Head coach Jon Cooper said following an on-ice session closed to media that his captain will be a game-time decision Sunday.",
    "image": "https://i.cbc.ca/ais/35474ea0-a264-4191-a330-0d3f2abae36f,1771701123288/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C331%2C6295%2C3540%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "U2’s new release reveals bond with family of mother shot dead by ICE",
    "desc": "Bono describes Days of Ash as a riposte to injustice and the EP features a previously unseen photo of Renee Good",
    "image": "https://www.thetimes.com/imageserver/image/%2Fb2e484b6-4108-47ee-8303-35664420fe88.jpg?crop=1600%2C900%2C0%2C0&resize=1200",
    "source": "The Times"
  },
  {
    "title": "New passport rules from Wednesday affect 1.2m Brits and include £589 charge",
    "desc": "The new rules begin on February 25, 2026, and many people could need to take action to avoid problems at the border",
    "image": "https://cdn.images.express.co.uk/img/dynamic/25/1200x630/6749803.jpg",
    "source": "Daily Express"
  },
  {
    "title": "Canada's Ivanie Blondin repeats as Olympic silver medallist in speed skating mass start",
    "desc": "Ivanie Blondin of Ottawa matched her 2022 Olympic result in mass start, claiming a silver medal in the women's speed skating event on Saturday in Milan.",
    "image": "https://i.cbc.ca/ais/2f7d45a1-0e1d-43ac-ae89-0896eefdea18,1771698239926/full/max/0/default.jpg?im=Crop%2Crect%3D%2820%2C0%2C1139%2C640%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Report: IRGC running Hezbollah, preparing it for war with Israel if US strikes Iran",
    "desc": "Israel said to see Hezbollah preparing rocket-fire capabilities, recent IDF strikes said aimed at degrading them; anti-Hezbollah outlet quotes 'political sources' saying Beirut must declare neutrality",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/02/AFP__20260126__942R6G6__v2__HighRes__LebanonIranUsProtest-e1771705364425.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "2 Mining Stocks to Buy in February",
    "desc": "Copper and lithium are both commodities tied to powerful economic trends like electrification, renewable energy, and data center investment, and these stocks are the best way to invest in them.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F853777%2Fgettyimages-166128841-1200x800-5b2df79.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Winter Olympics 2026: Germany’s Laura Nolte and Deborah Levi defend Olympic title in two-woman bobsleigh with dominant runs",
    "desc": "Germany also wins Olympic silver courtesy of Lisa Buckwitz and Neele Schuten while Kaillie Armbruster Humphries and Jasmine Jones secure bronze.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/rju4fefdsiylkogkbhak",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Govt to introduce additional buses to improve public transport",
    "desc": "The Sindh government has decided to introduce additional buses in the near future to improve public transport in Karachi. A high-level meeting of the Transport and Mass Transit Department was held in Karachi under the chairmanship of Sindh Senior Minister Sharjeel Inam Memon. The meeting took important decisions related to ongoing projects including Red Line […]",
    "image": "https://dailytimes.com.pk/assets/uploads/2026/02/21/Govt-to-introduce-additional-buses-to-improve-public-transport.jpg",
    "source": "Daily Times"
  },
  {
    "title": "Phil Parkinson talks up Wrexham's character after extraordinary win vs. Ipswich",
    "desc": "Phil Parkinson lavished praise on the character of his Wrexham team after their remarkable 5-3 win over Ipswich but was furious they were not awarded a penalty.",
    "image": "https://a.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0221%2Fr1618171_1296x729_16%2D9.jpg",
    "source": "ESPN Singapore"
  }
]