[
  {
    "title": "conner & perry reworks 'lautner’s castle' on los angeles hillside",
    "desc": "conner & perry renovates 'lautner’s castle' with restored timber and stone surfaces and a new hillside deck beneath the original cantilever.",
    "image": "https://www.designboom.com/twitterimages/uploads/2026/02/lautners-castle-renovation-conner-perry-renovation-los-angeles-california-designboom-FB.jpg",
    "source": "Designboom"
  },
  {
    "title": "Tracey Emin, Britain’s greatest female artist: ‘Against death, illness or pain, art wins’",
    "desc": "Raped at 13, written off by critics, in remission from cancer – Tracey Emin is art’s great survivor, and her new major Tate retrospective, set to be one of the year’s blockbuster shows, is the ultimate accolade. She talks to Geordie Greig about painting, pain and showing Madonna around Margate",
    "image": "https://static.the-independent.com/2026/02/18/12/38/Self-Portrait-June-2024--Courtesy-Tracey-Emin-(1).jpg?trim=0,0,0,0&width=1200&height=800&crop=1200:800",
    "source": "The Independent"
  },
  {
    "title": "Speaker rejects motion to debate Azam’s shareholding allegations",
    "desc": "Johari Abdul says a probe by a special committee makes the motion inadmissible for now.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/b50db956-johari-abdul-ss-yt-230226.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Drugged, gang-raped at Bengaluru villa party: Teen accuses Instagram friend",
    "desc": "The complaint was filed after the survivor said continued trauma compelled her to seek medical help and inform her family. Police have since booked the two men named in her statement.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/bengaluru-student-allegedly-gang-raped-after-being-drugged-at-private-villa-234506652-16x9_0.jpg?VersionId=hXlm2ejcHJq5Se7k_apAUGgim15jJenn",
    "source": "India Today"
  },
  {
    "title": "Herd Tasks: Your weekly farming checklist",
    "desc": "Your weekly reminder of the things that should be at the top of your farm to-do list. Published every Monday on the Irish Examiner digital Farming hub.",
    "image": "https://www.irishexaminer.com/cms_media/module_img/9956/4978487_6_seoimageog_iStock-153068534.jpg",
    "source": "Irish Examiner"
  },
  {
    "title": "Diabetes - a growing health crisis in Pakistan",
    "desc": "Type 2 diabetes, commonly known as “sugar” in Pakistan, has quietly become one of the most serious public health...",
    "image": "https://i.brecorder.com/large/2026/02/231241151296a73.webp",
    "source": "Business Recorder"
  },
  {
    "title": "The QICDRC Practice Direction On The Use Of Artificial Intelligence",
    "desc": "A judge in a recent US case wrote, \"the practice of law is not just a job, it is a profession;\na profession with standards and ethical responsibilities.\"",
    "image": "http://www.mondaq.com/images/MondaqThumb.png",
    "source": "Mondaq"
  },
  {
    "title": "Beatrice Nyamari: A leader turning strategy into measurable impact",
    "desc": "In today’s fast-evolving corporate landscape, where high-stakes decisions redefine industries and data drives every strategic move, Beatrice Nyamari distinguishes herself not merely by vision...",
    "image": "https://www.thecitizen.co.tz/resource/image/5368668/landscape_ratio3x2/1200/800/59986a0615151953d648763a9423999c/Eq/beatrice-nyamari-pic.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Iconic International Holdings Solidifies Position As Africa’s Premier Recognition Platform Following Landmark Summit in Harare",
    "desc": "By Halima Bello The Iconic International Holdings (Pty) Ltd, has moved to bridge the gap between African excellence and global visibility, following the record-breaking success of the 2026 Iconic Africa Summit & Honors, held last weekend in Harare, Zimbabwe. The organisation, during the event, brought together over 30 distinguished speakers and over 1,000 delegates from […]",
    "image": "https://d1jcea4y7xhp7l.cloudfront.net/wp-content/uploads/2026/02/IMG-20260223-WA0000.jpg",
    "source": "The Sun Nigeria"
  },
  {
    "title": "Doctor Amir Khan says people should keep 1 item in loo to 'aid bowel movement'",
    "desc": "Every now and then people struggle to go to the loo, but ITV's Doctor Amir Khan shared a simple method to help them aid bowel movement. You just need to keep a key item in the toilet",
    "image": "https://i2-prod.mirror.co.uk/article33919832.ece/ALTERNATES/s1200/1_ITVs-Doctor-Amir-Khan.jpg",
    "source": "The Mirror"
  }
]