[
  {
    "title": "Pakistan's Additional Foreign Secretary calls on Ghana's Deputy Foreign Affairs Minister",
    "desc": "As part of efforts to strengthen bilateral relations between the Republic of Ghana and the Islamic Republic of Pakistan, the inaugural session of Political Consultations between the two countries was held on Monday, January 26, in Accra.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/01/IMG_8339.jpeg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Asenso Boakye urges NPP delegates to vote Bawumia in Saturday’s presidential primaries",
    "desc": "Member of Parliament for Bantama and former Minister for Roads and Highways, Francis Asenso Boakye, has called on delegates of the New Patriotic Party (NPP) to vote massively for former Vice President Dr Mahamudu Bawumia in Saturday’s presidential primaries, saying it reflects the will of the party’s grassroots. Addressing delegates and party members in Bantama on Monday, Mr Asenso Boakye said his engagements across the country show that a majority of NPP supporters want Dr Bawumia to lead the party into the 2028 general elections.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/01/ed-1024x683.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Gynaecologist shares 5 important things every woman should know about cervical cancer: 'Symptoms appear late...'",
    "desc": "With the help of preventive steps, from vaccinations, screenings to modifying lifestyle, risks of cervical cancer go down.  | Health",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/01/27/550x309/cancer_1769516146874_1769516147040.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "The 5 key things everyone should know about their health - but probably don't",
    "desc": "A doctor has shared the five pieces of information everybody needs to know about themselves to protect their health and wellbeing.",
    "image": "https://metro.co.uk/wp-content/uploads/2026/01/GettyImages-2183708450_1769517883.jpg?quality=90&strip=all&w=1200&h=630&crop=1",
    "source": "Metro.co.uk"
  },
  {
    "title": "Families Plead for Mercy as Nine Youths Remain in Custody on Treason Charges",
    "desc": "Hundreds of youths detained after post-election unrest in Tanzania have been freed. Now, the families of nine young men still facing treason charges are making a desperate plea to President Samia for their release, too.",
    "image": "https://thechanzo.com/wp-content/uploads/2026/01/vlcsnap-2026-01-27-15h39m42s249.jpg",
    "source": "The Chanzo"
  },
  {
    "title": "Opening Night 'a lot of fun to record'",
    "desc": "Drummer Matt Helders tells BBC Radio 1 teaming up to make a charity track showed \"they could still do it\".",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5d71/live/428a3c70-fb70-11f0-b7fd-f5e7f9ed0815.jpg",
    "source": "BBC"
  },
  {
    "title": "Adherence to Self-Care and Associated Factors among Patients with Type",
    "desc": "We hypothesize that socioeconomic factors, particularly income and education level, will be significantly associated with higher adherence to self-care behavior",
    "image": "https://www.dovepress.com/assets/img/addon/og_logo.png",
    "source": "Dove Medical Press"
  },
  {
    "title": "Changes coming to three new Dublin Bus routes in two weeks' time to improve reliability",
    "desc": "From Sunday, February 8, the National Transport Authority (NTA), in partnership with Dublin Bus, will implement a series of amendments to Routes 80, 23 and 24",
    "image": "https://i2-prod.dublinlive.ie/article33059822.ece/ALTERNATES/s1200/1_Dublin-Bus.jpg",
    "source": "dublinlive.ie"
  },
  {
    "title": "Trump sacks border chief after fatal ICE shootings",
    "desc": "Gregory Bovino removed from role leading immigration crackdown after second protester killed in Minneapolis",
    "image": "https://www.telegraph.co.uk/content/dam/briefs/2026/01/27/TELEMMGLPICT000456235393_17694982512390_trans_NvBQzQNjv4Bq5yQLQqeH37t50SCyM4-zeGcv5yZLmao6LolmWYJrXns.jpeg?impolicy=OG-Standard",
    "source": "The Telegraph"
  },
  {
    "title": "Is it resistant hypertension or a case of primary aldosteronism?",
    "desc": "Clinical pharmacists Linda Bryant and Leanne Te Karu discuss primary aldosteronism, which causes multisystem harm beyond hypertension but is often missed",
    "image": "https://s3.ap-southeast-2.amazonaws.com/nzdoctor.files/production/public/2026-01/Pharmacotherapy_Blood%20Pressure%201_CR_Yaroslav%20Shuraev%20on%20Pexels.jpg",
    "source": "NZDoctor"
  }
]