[
  {
    "title": "Simret Party Secures Court Injunction On NEBE District Decision",
    "desc": "The Federal High Court has ordered an injunction on a decision by the National Election Board of Ethiopia (NEBE) to suspend regional elections in five",
    "image": "https://www.thereporterethiopia.com/wp-content/uploads/2026/02/20260226_122821-640x360.jpg",
    "source": "The Reporter Ethiopia"
  },
  {
    "title": "How Daniel Koussou’s success secrets inspire young entrepreneurs",
    "desc": "The Nation Newspaper How Daniel Koussou’s success secrets inspire young entrepreneurs",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/02/26102805/Daniel-Koussou.jpeg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "RA closes rain-damaged routes in ||Kharas region",
    "desc": "The Roads Authority (RA) on Tuesday announced that several roads in the ||Kharas region have been temporarily closed following heavy rainfall. RA urged road users to […]",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-26-at-10.22.43-AM-1.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "Notion unveils Custom Agents to automate team workflows",
    "desc": "Notion rolls out Custom Agents, AI teammates that automate recurring workflows for Business and Enterprise users in a public beta launch.",
    "image": "https://itbrief.com.au/uploads/story/2026/02/26/compatible_office-it-manager-configuring-ai-workflow-automated-team-processes.jpg",
    "source": "IT Brief Australia"
  },
  {
    "title": "700 security personnel deployed for Tan-ok ni Ilocano Festival",
    "desc": "LAOAG CITY – Around 700 security and safety personnel have been deployed to ensure a peaceful, orderly, and joyful celebration for the Tan-ok ni Ilocano...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/26/82149.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Matatu crew arrested after passenger falls to death from moving vehicle in Athi River",
    "desc": "The family of Joseph Mureithi alleged that moments after he was ejected, the same vehicle ran over him before speeding off.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/762fa15d-d53c-46ce-8e6c-61ce8e0989c9.jpg?1772107990446",
    "source": "the-star.co.ke"
  },
  {
    "title": "Auqib Nabi sends bold India selection message to Ajit Agarkar; removes KL Rahul, Karun Nair, strikes thrice in 23 balls",
    "desc": "The electrifying spell set social media abuzz, with many rallying behind Auqib Nabi for an India call-up | Cricket",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/26/550x309/PTI02-26-2026-000146B-0_1772097599431_1772097614029.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "'I beat men for a living' - Woman starts professional 'man-beater' service",
    "desc": "Leti Crystal, a Ugandan travel enthusiast, recently discussed her unique business, a professional vigilante service that helps survivors of abuse, on the TUBTS podcast.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/575/57583691.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "'I'm hungry, lonely, broke’, Gospel singer, Busola Oke cries out",
    "desc": "The Nation Newspaper 'I'm hungry, lonely, broke’, Gospel singer, Busola Oke cries out",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/02/26102308/Busola-Oke.jpg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "IGAD to Convene Regional Forum on Scaling Climate Smart Agriculture in Addis Ababa",
    "desc": "February 26, 2026 (ADDIS ABABA, Ethiopia): The Intergovernmental Authority on Development through its Food Systems Resilience Program will convene a...",
    "image": "https://igad.int/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-22-at-15.42.12.jpeg",
    "source": "IGAD"
  }
]