[
  {
    "title": "Rubio says US and Europe 'belong together' but attacks migration policies and UN",
    "desc": "US Secretary of State Marco Rubio says the UN has played \"no role\" in resolving conflicts at the Munich Security Conference.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/9f10/live/d39e3220-0980-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  },
  {
    "title": "Car overturns in River Valley, SCDF deploys hydraulic equipment to free trapped passenger",
    "desc": "Four persons were taken to hospital after an accident in River Valley on Saturday (Feb 14) afternoon.The accident happened at about 12pm along Martin Road, after the junction of Martin Road and Kim Yan Road — outside the Singapore Buddhist Lodge. A video posted on social media by user Gillian shows two Singapore Civil Defence Force (SCDF) fire engines at...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/River-Valley-Martin-Place-Accident-Car-Turns-Turtle.png?itok=X4SD41Wa",
    "source": "AsiaOne"
  },
  {
    "title": "'F*cking hell!' - Pep Guardiola hilariously invites reporter to become his assistant after being stunned by question in Man City press conference",
    "desc": "Manchester City manager Pep Guardiola had a hilarious response after being grilled on tactics during a press conference ahead of his team's FA Cup fourth round tie against League Two side Salford City on Saturday. Guardiola, who is known for his tactical innovations, was left stunned by a reporter's insightful question and jokingly invited him to become part of his staff.",
    "image": "https://assets.goal.com/images/v3/getty-2248196746/crop/MM5DKMBQGQ5DEOBRGU5G433XMU5DAORSGYYQ====/GettyImages-2248196746.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Cheering or insulting women over body shape could attract legal action",
    "desc": "Cheering, jeering or insulting women with large buttocks in public places such as markets and bus terminals has been described as an indecent assault and a criminal offence, with police urging...",
    "image": "https://www.thecitizen.co.tz/resource/image/5358476/landscape_ratio3x2/1200/800/34caa5f01b7e016895e50cf8527b8e95/yI/tako-pic.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "‘Cruel’ twist as ‘heartbroken’ Aussie gold medal hope Laura Peel withdraws from Olympics",
    "desc": "‘Cruel’ twist as ‘heartbroken’ Aussie gold medal hope withdraws from Olympics",
    "image": "https://content.api.news/v3/images/bin/774d14833459d068cc89751831ad212d",
    "source": "fox sports"
  },
  {
    "title": "Lidl employee sacked for drinking 17p water he didn't buy",
    "desc": "A Lidl employee was dismissed for drinking a 17p bottle of water he hadn't paid for because he felt dehydrated while working at the checkout, tribunal heard",
    "image": "https://cdn.images.express.co.uk/img/dynamic/1/1200x630/6741807.jpg",
    "source": "Daily Express"
  },
  {
    "title": "2) within the Secretariat of the International Plant Protection Convention (IPPC): Apply!",
    "desc": "Food and Agriculture Organization of the United Nations – Programme Officer (P-2), IPPC",
    "image": "https://i0.wp.com/www.globalsouthopportunities.com/wp-content/uploads/2026/02/632581527_1370512585117758_6798792055344143848_n.jpg",
    "source": "Global South Opportunities"
  },
  {
    "title": "Daily Post Nigeria",
    "desc": "Nigerian singer, Rema's debut album 'Rave & Roses' has ended its record as the longest-charting African album on Billboard World Albums Chart, hitting",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/Rema.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Prince Harry's latest UK plans exposed: A big pressure point for King Charles",
    "desc": "Prince Harry has sped up his efforts to win back Britons with frequent visit to his home country, fighting for foolfroof security as he wants to bring his family back to his homeland.However, the Duke of Sussex's UK...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-14/l_650774_013842_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "AP Budget 2026-27: Here’s All You Need to Know!",
    "desc": "The finance minister of Andhra Pradesh Payyavula Keshav announced the much expected 2026-27 budget in the assembly today and here’s a look into the",
    "image": "https://cdn.gulte.com/wp-content/uploads/2026/02/ap-Budget-2026-.jpg",
    "source": "Gulte"
  }
]