[
  {
    "title": "Scientists just made living blood vessels on a chip that act like real ones",
    "desc": "Blood vessels twist, branch, narrow, and balloon in ways that dramatically affect how blood flows — but most lab models have long treated them like straight pipes. Researchers at Texas A&M have now built a new kind of “vessel-chip” that mirrors the real complexity of human blood vessels, from aneurysms to dangerous constrictions.",
    "image": "https://www.sciencedaily.com/images/1920/jennifer-lee-holding-blood-vessel-chip.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "K-pop group Twice's Dahyun to go on hiatus after ankle fracture",
    "desc": "Dahyun of K-pop girl group Twice will go on a hiatus due to an ankle fracture.",
    "image": "https://dam.mediacorp.sg/image/upload/s--lprE-rkP--/c_crop,h_607,w_1080,x_0,y_382/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/11/dahyun_ankle_fracture.jpg?itok=_TUd0TTW",
    "source": "CNA Lifestyle"
  },
  {
    "title": "Mahindra & Mahindra Q3 Results: Net profit rises 33% to ₹3,931 crore, revenue climbs 26%",
    "desc": "Mahindra & Mahindra Q3 Results: Revenue from operations climbed 26.12% to ₹38,516.81 crore in the October-December quarter of FY26, compared to ₹30,538.23 crore in the year-ago quarter.",
    "image": "https://assets.upstox.com/content/assets/images/news/mahindra-and-mahindra-q3-results-profit-revenue-2026-share-price.webp",
    "source": "Upstox"
  },
  {
    "title": "Julie Helen: Taking part in TV show reminded me how lucky I am to have such a supportive family",
    "desc": "Julie Helen and her family will appear in an episode of Ear to the Ground this week as Julie's mum, Katherine, shares her story of her experience of ...",
    "image": "https://www.echolive.ie/cms_media/module_img/9927/4963784_2_seoimageog_iStock-1564211341.jpg",
    "source": "echo live"
  },
  {
    "title": "Winter Olympics 2026: How to watch day 6 live - full schedule and medal events on Thursday 12 February",
    "desc": "Sofia Goggia, Chloe Kim and Arianna Fontana are among the superstar athletes in action with nine gold medals on offer on Thursday.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/v1770713430/primary/w6d5jmpb6jzwcx3t7gy3",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "President Mahama receives UGMC Transition Committee’s report",
    "desc": "President John Dramani Mahama has received the Transition Committee’s report on the transfer of the University of Ghana Medical Centre (UGMC) from the Ministry of Health to the University of Ghana.",
    "image": "https://www.ghanabusinessnews.com/wp-content/uploads/2025/10/UGMC3-scaled.jpg",
    "source": "Ghana Business News"
  },
  {
    "title": "Bugti slams PPL over gas shortage, scholarship and jobs delays in Sui",
    "desc": "CM Bugti criticizes PPL over gas shortage in Sui, delays in scholarships and jobs, warns no new deals without compliance, directs immediate local recruitment",
    "image": "https://img.dunyanews.tv/news/2026/February/02-11-26/news_big_images/934739_95990817.jpg",
    "source": "Dunya News"
  },
  {
    "title": "When Sight Fades, Love Stays: A Valentine’s Episode on i-Listen with Kara David podcast",
    "desc": "This Valentine’s season, our latest podcast episode reminds us that love is not measured by what the eyes can see—but by what the heart chooses to stay for.",
    "image": "https://images.gmanews.tv/webpics/2026/02/image_(5)_2026_02_10_14_44_14.png",
    "source": "GMA Network"
  },
  {
    "title": "Kiwi shopper finds live insects in Peppermayo order, triggering biosecurity probe",
    "desc": "A New Zealand woman was shocked when she was asked to return a “disgusting” online package riddled with live bugs in order to receive a full refund. Jayd...",
    "image": "https://www.nzherald.co.nz/resizer/v2/OFSBIGRAKJGZJAIH4ORXYPU44A.png?auth=6704577756bdd3acd171c78957fa42e3424cd4a13d428448c47e38fd8486a8a1&width=1200&height=675&quality=70&focal=270%2C124&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Journalist drags CHRAJ to court to investigate Ahiafor, Randy Abbey, James Agalga, others",
    "desc": "Ghanaian journalist, Wilberforce Asare, has filed a mandamus application at the General Jurisdiction Division of the High Court, seeking to compel the Commission on Human Rights and Administrative Justice (CHRAJ) to investigate several public...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/239/23948432.jpg",
    "source": "GhanaWeb"
  }
]