[
  {
    "title": "STAMICO hands SA’s Plantcor a deal to explore the gold deposit in Geita",
    "desc": "GEITA: The State Mining Corporation (STAMICO) has signed an agreement with Plantcor Mining and Plant Hire (Pty) Ltd of South Africa to implement a gold exploration and mining project in the Kigosi area, Bukombe District, Geita Region. The signing ceremony was attended by Deputy Minister of Minerals, Dr. Steven Kiruswa, who said the project is",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/DKT.-KIRUSWA-ASHUHUDIA-UTIAJI-SAINI-MKATABA-KATI-YA-STAMICO-NA-PLANTCORDKT.-Biteko-awataka-wana.webp",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Sanju Samson close to re-entering India’s Playing XI as India hint at ‘changes’ for must-win Zimbabwe Super 8 clash",
    "desc": "India’s batting coach hinted at potential changes to the batting lineup, mentioning Sanju Samson as a key option. | Cricket",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/25/550x309/PTI02-24-2026-000441B-0_1772017523580_1772017548566.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Businessman refuses to pull down mega-garage he built without permission",
    "desc": "Daniel Toma erected a massive garage with electric gates and fencing besides his end-terrace home in Hertfordshire without planning permission.",
    "image": "https://metro.co.uk/wp-content/uploads/2026/02/SEI_282610817-46ce_1772028567.jpg?quality=90&strip=all&w=1200&h=630&crop=1",
    "source": "Metro.co.uk"
  },
  {
    "title": "Karnataka toil as J&K extend batting marathon",
    "desc": "Karnataka struck twice in the first hour, but sustained resistance from Dogra and Wadhawan, followed by a late stand from Lotra, pushed Jammu & Kashmir past 500 in Hubballi",
    "image": "https://static.cricbuzz.com/a/img/v1/540x303/i1/c871596/abdul-samad-was-one-of-six-jk-batters-to-cross-fifty.jpg",
    "source": "Cricbuzz.com"
  },
  {
    "title": "This local production presents a reimagination of 'Lord of the Flies'",
    "desc": "William Golding’s “Lord of the Flies” serves as the inspiration for Far Eastern University Theater Guild's (FTG) upcoming show “Bangaw.” Opening on...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/25/81910.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "India Playing XI puzzle vs Zimbabwe: Sanju Samson a strong contender, Axar Patel likely to return",
    "desc": "Cricket News: TimesofIndia.com in Chennai: The stakes are high. The remaining Super Eight matches are must-win games, contingent on South Africa's results going in .",
    "image": "https://static.toiimg.com/thumb/msid-128779899,width-1280,height-720,imgsize-62404,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "'Salim Khan is out of danger,' says Salman Khan's co-star Daisy Shah as she gives update on the veteran screenwriter's health",
    "desc": "Well-wishers of veteran screenwriter Salim Khan offered prayers for his recovery after he was admitted to Lilavati Hospital in Mumbai. Doctors informe.",
    "image": "https://static.toiimg.com/thumb/msid-128780104,width-1280,height-720,imgsize-46412,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "‘Anti-Palestinian repression’: Legal experts document hundreds of UK cases",
    "desc": "Group says its new public database, including examples of students and activists, reveals extent of broad crackdown.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/2025-09-09T083856Z_1736748670_RC27OGA77CD8_RTRMADP_3_BRITAIN-DEFENCE-PROTEST-1771951738.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "Iran ‘ready to spill American blood - even at a huge cost’",
    "desc": "Ayatollah Khamenei has learnt lessons from the brief war with Israel last year and experts deem him unlikely to concede to Trump’s nuclear demands",
    "image": "https://www.thetimes.com/imageserver/image/%2F1904b6ff-c89a-4962-b3ba-7d00e40b445e.jpg?crop=7360%2C4140%2C0%2C386&resize=1200",
    "source": "The Times"
  },
  {
    "title": "Zimbabwe has taken the immediate decision to shut down the export of all its raw materials",
    "desc": "Allegations of government malpractice and leakages have led to the immediate suspension of raw material exports in Zimbabwe. | Business Insider Africa",
    "image": "https://ocdn.eu/pulscms-transforms/1/4AKktkpTURBXy83ZjY3YTVmNDQ4ZTBmOTZkMTk2YzhjZmM4ZDNkNjE3Mi5qcGeSlQMAEc0CG80BL5MFzQSwzQJ2",
    "source": "Business Insider Africa"
  }
]