[
  {
    "title": "The Surprising Age When Shoveling Snow Turns Risky for Your Heart",
    "desc": "Hidden heart disease and other risk factors cause a spike in heart attacks when it snows, especially for people of a certain age.",
    "image": "https://s.yimg.com/ny/api/res/1.2/TUMDYH0v0wWjLUp9WQap8w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://media.zenfs.com/en/aol_good_housekeeping_154/f5a65fd68f2c3849db8cfb599c1f8d57",
    "source": "AOL.com"
  },
  {
    "title": "Thalassemia treatment costs RM3mil per patient, Parliament heard",
    "desc": "KUALA LUMPUR: It costs around RM3mil to treat a thalassemia patient from infancy up to the age of 40, says Datuk Seri Dr Dzulkefly Ahmad.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/23/3781992.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "UPL share price tanks 14% following the company's reorganisation plan; finer details and what analysts said",
    "desc": "UPL share price in focus: The scheme will create two listed entities: i) UPL, an existing listed company, as a diversified agriculture and speciality chemicals platform, and ii) UPL Global as a dedicated crop protection platform.",
    "image": "https://assets.upstox.com/content/assets/images/news/upl-share-price-feb-23.webp",
    "source": "Upstox"
  },
  {
    "title": "CTCI Earns Top-1% Ranking in S&P Global's Sustainability Yearbook for the Fourth Consecutive Year, Leading the Global Construction & Engineering Sector",
    "desc": "/PRNewswire/ -- CTCI Group announced that two Group companies, CTCI Corporation and ECOVE Environment Corporation, have been included as members of the...",
    "image": "https://mma.prnewswire.com/media/2917990/2026________1________________89.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "Smartphone makers Vivo, Oppo among new contenders targeting DJI’s Pocket 3",
    "desc": "Margin pressure in the smartphone market is one factor behind the move, but not the only one.",
    "image": "https://console.kr-asia.com/wp-content/uploads/2026/02/DJI-Osmo-Pocket-3-Alt.jpg",
    "source": "KrASIA"
  },
  {
    "title": "Ex-soldier, pastor jailed for death of man over alleged fake GH¢50 claims",
    "desc": "A retired Military Officer, Joseph Abusah, and a Pastor, Benjamin Kofi Agbetiafah, have been convicted by the High Court in Accra for manslaughter over a misunderstanding of GH¢50 alleged fake money leading to the death of one Solomon Dapaah.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/981/98136823.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "DOE orders utilities to match investments to grid needs",
    "desc": "The Department of Energy (DOE) has rolled out a new policy requiring power producers and utilities to align investments and procurement with system needs to sec",
    "image": "https://media.assettype.com/tribune%2F2025-07-11%2F2vppzsz8%2FDoE?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Daily Tribune"
  },
  {
    "title": "How the Ola empire is fueling Bhavish’s personal AI business, Krutrim",
    "desc": "Bhavish Aggarwal's AI venture, Krutrim, heavily relies on revenue from Ola companies, raising governance concerns. With 90% of its ₹101.7 crore revenue sourced from and costs shared with related entities, experts urge transparency and flag director responsibilities to minority shareholders.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/22/1600x900/logo/Ola_Electric_raids_shutdown_show_cause_news_1741584789337_1771759774954.JPG",
    "source": "Mint"
  },
  {
    "title": "Experimental Cholesterol Lowering Treatment Offers Hope for Millions",
    "desc": "Study could lead to new options for people at risk for heart attacks and strokes.",
    "image": "https://www.goodnet.org/photos/620x0/45451_hd.jpg",
    "source": "Goodnet | Gateway to doing good"
  },
  {
    "title": "BAFTAs 2026 full winners list: One Battle After Another triumphs, Robert Aramayo upsets heavy hitters",
    "desc": "Timothee Chalamet, Leonardo DiCaprio and Ethan Hawke all lost out to a British actor who looked as shocked as anyone else when his name was read out as the winner.",
    "image": "https://images.thenightly.com.au/publication/C-21724655/032f3d042da7c09d9e4b8df3dc20d3798e6d34de-16x9-x0y112w3416h1922.jpg?imwidth=1200",
    "source": "The Nightly"
  }
]