[
  {
    "title": "N3B Nivea promo sparks fresh wave of instant millionaires",
    "desc": "NIVEA has reaffirmed that its historic N3 Billion National Consumer Promotion is fully alive and gathering momentum, as the latest weekly",
    "image": "https://cdn.guardian.ng/wp-content/uploads/2019/07/Dark-skinned-woman-applying-moisturiser.-Photo-Nivea-e1563707100869.jpg",
    "source": "The Guardian Nigeria News"
  },
  {
    "title": "Ilia Malinin's fall opens door for Mikhail Shaidorov's gold at 2026 Winter Olympics",
    "desc": "Ilia Malinin crashed out of the Olympic figure skating podium after a disastrous free skate and Mikhail Shaidorov of Kazakhstan takes a shocking gold medal.",
    "image": "https://dims.apnews.com/dims4/default/9029646/2147483647/strip/true/crop/3175x2116+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F07%2Fc7%2Fe41ebd204046be2c324804856297%2Fap26044798291224.jpg",
    "source": "AP News"
  },
  {
    "title": "UK to replace paper visas with eVisas from February 25",
    "desc": "The Nation Newspaper UK to replace paper visas with eVisas from February 25",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2021/10/12140214/cropped-nation-cropped-l-32x32.jpg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "Badua orders crackdown on illegal use of PNP uniform in Mimaropa",
    "desc": "Police Brig. Gen. Jovencio S. Badua, Jr., director of the Police Regional Office- 4B, warned tailoring shops and other businesses engaged in the manufacture and...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/14/79282.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Ethiopia’s Meat Exports Recover - But Structural Problems Still Bite",
    "desc": "Ethiopia’s meat export sector is showing early signs of recovery after a prolonged period of stagnation, with export earnings and volumes gradually improving",
    "image": "https://birrmetrics.com/wp-content/uploads/2026/02/FB_IMG_1771007790061.jpg",
    "source": "Birr Metrics"
  },
  {
    "title": "World Aquatics rules to govern Taliss-IST Invitational Swimming Championships",
    "desc": "Beyond competition, the championships aim to promote learning, connection and inspiration among swimmers, coaches and officials",
    "image": "https://www.thecitizen.co.tz/resource/image/5358980/landscape_ratio3x2/1200/800/2d2d9421dbd7e55be781c666f185d7df/wM/taliss-swim-2.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Customs officials in France make surprising discovery among potatoes destined for Ireland",
    "desc": "The lorry carrying the cigarettes was inspected at Cherbourg Ferry Port as it prepared to embark on a ferry to Ireland",
    "image": "https://i2-prod.irishmirror.ie/article36719251.ece/ALTERNATES/s1200/0_8-tonnes-de-tabac.jpg",
    "source": "Irish Mirror"
  },
  {
    "title": "Bella Ramsey shines in heart-touching film that mixes tears with laughter",
    "desc": "When we hear the word “cancer,” we usually think of sadness, fear, and heavy emotions",
    "image": "https://minutemirror.com.pk/wp-content/uploads/og-cache/8645cf511584efb50d3e94943ea4cc71.jpg",
    "source": "Minute Mirror"
  },
  {
    "title": "2025/26 Ghana Premier League: Week 22 Match Preview - Dreams FC vs. Karela United",
    "desc": "Dreams FC return to league action on Sunday, February 15, 2026, when they host Karela United at the Tuba Astro Turf in what promises to be a tightly contested mid-table clash.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/592/59255700.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "A major HIV breakthrough is being tested in Cape Town | Here’s why it matters",
    "desc": "In a monumental stride towards combating one of the continent’s most pressing health crises, South Africa has launched the BRILLIANT 011...",
    "image": "https://businessghana.com/site/img/../../cms/img/news/2026-02-13-160941002.jpg",
    "source": "BusinessGhana"
  }
]