[
  {
    "title": "Obesity's role in shared genetic risks of chronic diseases",
    "desc": "The study uncovers obesity's genetic links to chronic diseases, offering insights into multimorbidity and the potential for targeted health interventions.",
    "image": "https://www.news-medical.net/images/news/ImageForNews_829969_1770635422031663.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Three legal experts who have challenged the reduction of Agradaa's sentence",
    "desc": "The recent legal developments surrounding the case of evangelist Patricia Asiedua, popularly known as Agradaa, have generated intense public debate, particularly following the reduction of her sentence.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/187/18775435.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "AfriGO Cards Now Available for Request on the PalmPay App",
    "desc": "AfriGO cards are now available on PalmPay, enabling Nigerians to request the national domestic card directly through the PalmPay mobile app. This",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/AfriGO-Cards.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "ReeXploration Commences Exploration Drilling at Eureka Uranium Target",
    "desc": "First drill testing of a large-scale Rossing-style uranium target, along trend of Namibia's giant uranium depositsReeXploration Inc. is pleased to announce the launch of a fully funded uranium drilling program at the Eureka Project in central Namibia. This campaign marks the Company's first drill testing of a large-scale uranium target, 6.5 x 3.5 km in extent, defined through integrated geophysical, geochemical, and ...",
    "image": "https://investingnews.com/media-library/image.png?id=62152768&width=1200&height=600&coordinates=0%2C43%2C0%2C44",
    "source": "Investing News Network"
  },
  {
    "title": "Latgale arts centre manager still waiting to be told why she was sacked",
    "desc": "At the end of last year, Diāna Zirniņa, manager of the Rēzekne 'GORS' arts centre for 12 years since the day it opened was dismissed from her job.",
    "image": "https://static.lsm.lv/media/2023/04/large/1/kqmo.jpg",
    "source": "LSM"
  },
  {
    "title": "Lenovo offers vouchers in Chinese New Year promo",
    "desc": "The Lenovo Chinese New Year Promo 2026 is available through participating authorized Lenovo resellers nationwide. | Back End News",
    "image": "https://backendnews.net/wp-content/uploads/2026/02/Lenovo-CNY-Promo-2026.jpg",
    "source": "Back End News"
  },
  {
    "title": "Public-private collaboration key to tackling climate change: Aurangzeb",
    "desc": "Finance Minister Muhammad Aurangzeb has stressed the need for strong collaboration between the public and private sectors to effectively address the challenges posed by",
    "image": "https://www.nation.com.pk/digital_images/large/2026-02-09/public-private-collaboration-key-tackling-climate-change-aurangzeb-1770636109-1343.png",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "Two new accused in court on Namcor charges",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% Two women arrested over the weekend in connection with alleged fraud and corruption linked to the National Petroleum Corporation of Namibia (Namcor) made a first appearance in the Windhoek Magistrate's Court on Monday.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-09-at-12.55.28-PM-1024x800.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "PTA Assures Clarity on Spectrum Auction Pricing Following Operator Concerns",
    "desc": "PTA assures operators of clearer spectrum auction pricing rules after concerns over ambiguities in clock-stage and assignment mechanisms.",
    "image": "https://www.phoneworld.com.pk/wp-content/uploads/2026/02/PTA-connectivity.png",
    "source": "PhoneWorld"
  },
  {
    "title": "53 dead or missing after migrant boat capsizes in Mediterranean",
    "desc": "Only two survivors rescued in tragedy off Libyan coast, UN migration agency says",
    "image": "https://i.guim.co.uk/img/media/fb10025c3947816c6e5c2aaee63823c79d245c48/375_0_3197_2557/master/3197.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f378d3393ead2856f38f8ba9f4981c07",
    "source": "The Guardian"
  }
]