[
  {
    "title": "MLB teams with the most at stake in 2026",
    "desc": "The Yankees and Giants will open the 2026 MLB season on March 25. We’ll be counting down to that date with our annual preview series, with each story looking ahead to the coming season by breaking down a particular topic, division by division.\nPreviously: The must-watch player in each division.",
    "image": "https://img.mlbstatic.com/mlb-images/image/upload/t_2x1/t_w1536/mlb/jnhpgykz5ozyrbysxyob.jpg",
    "source": "MLB.com"
  },
  {
    "title": "Vivo X300 Max to launch alongside X300 Ultra, here’s what to expect",
    "desc": "Vivo X300 Max launch details leak alongside X300 Ultra, revealing model numbers, display, camera setup, chipset, battery size, and expected China and global launch timelines.",
    "image": "https://www.gizmochina.com/wp-content/uploads/2025/12/Vivo-X200-Ultra.jpg",
    "source": "Gizmochina"
  },
  {
    "title": "Kelly Clarkson shares bombshell statement after reaching 'difficult decision'",
    "desc": "Kelly Clarkson, who has won three Grammy Awards including two for Best Pop Vocal Album, has disappointed fans with what she admitted was an extremely tough decision",
    "image": "https://i2-prod.mirror.co.uk/article36659686.ece/ALTERNATES/s1200/1_Kelly-Clarksons-very-painful-personal-issues-may-force-her-to-leave-hit-TV-show-She-knows-her-l.jpg",
    "source": "The Mirror"
  },
  {
    "title": "KTC and Anantara Riverside Introduce “Sala Lakorn,” A Riverside Theatre Restaurant Reframing the Experience Economy",
    "desc": "Mitihoon - Krungthai Card Public Company Limited (KTC), in collaboration with Anantara Riverside Bangkok Resort, has launched “Sala Lakorn”, a new theater",
    "image": "https://www.mitihoon.com/wp-content/uploads/2026/02/13-2.jpg",
    "source": "มิติหุ้น"
  },
  {
    "title": "Manila LGU appeals to residents after garbage found in Barangay 94 river",
    "desc": "The local government of Manila has called on residents to actively participate in maintaining a clean environment to help prevent flooding and protect public...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/03/76300.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Breaking: RBA interest rates decision",
    "desc": "Rolling coverage of the RBA's cash rates announcement. Stay tuned for the announcement as it happens plus insights from economists and industry experts.",
    "image": "https://www.realestate.com.au/news/wp-content/uploads/2026/02/gettyimages-2228970326__2__720.jpg",
    "source": "realestate.com.au"
  },
  {
    "title": "Australia raises rates for first time since late 2023 as inflation hits six-quarter high",
    "desc": "This comes as the country sees its highest level of inflation in six quarters.",
    "image": "https://image.cnbcfm.com/api/v1/image/108147147-1747619694455-gettyimages-2207407403-AUSTRALIA_RBA.jpeg?v=1747619751&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Heavy haze gives way to showers as temperatures drop across Israel",
    "desc": "After heavy haze and toxic air cleared overnight, rain and thunderstorms sweep Israel Tuesday, likely the season’s last for weeks; sharp drop in temperatures will give way to another heatwave by Thursday, as 2026’s erratic winter continues",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/01/13/HyycQ07BWx/HyycQ07BWx_0_0_1200_676_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "International companies cut off business in the U.S. because of ICE",
    "desc": "French multinational Capgemini moved to distance itself “immediately” from ICE after criticism from French officials; a Canadian company has also canceled a sale to the agency.",
    "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/6RS5MYXDDVZMM77WJBFNEGGFUY.JPG&w=1440",
    "source": "The Washington Post"
  },
  {
    "title": "Migrant accused of child rape claimed he believed 12-year-old was 23",
    "desc": "Ahmad Mulakhil denies child abduction and rape charges while Mohammad Kabir denies strangulation and other offences at Warwick Crown Court trial",
    "image": "https://cdn.images.express.co.uk/img/dynamic/1/1200x630/6716348.jpg",
    "source": "Daily Express"
  }
]