[
  {
    "title": "Trump Mobile T1 not made in US; only 'limited' final assembly to happen domestically, says report",
    "desc": "International Business News: The Trump Mobile T1 smartphone, earlier marketed around a “Made in the United States” pitch, will instead be produced largely overseas, with only limi.",
    "image": "https://static.toiimg.com/thumb/msid-128066523,width-1280,height-720,imgsize-559727,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Can AI Prevent Your Next Herpes Breakout? Israeli Researchers Have the Answer",
    "desc": "A Groundbreaking Study by Scientists at Bar-Ilan University Has Identified Genetic Control Switches That Transfer Viruses From a Dormant to an Active State – Switches That Also Exist in Cancer-causing Viruses. The Findings Could Lead to the Development of Targeted Treatments for Herpes Diseases and Related Types of Cancer",
    "image": "https://img.haarets.co.il/bs/0000019c-2971-d6dd-a3bc-7d797ef80000/b6/c9/e4a0d5e24d67914e1e36810a476d/whatsapp-image-2026-02-01-at-12-42-10.jpeg?precrop=1210,704,x0,y43&width=1200&height=630&cmsprod",
    "source": "Haaretz"
  },
  {
    "title": "Ugandans express unease over 'militaristic' boys boot camp program",
    "desc": "The Boys Mentorship program, which targets boys aged 7 to 17, describes itself on its website as a Christian-founded initiative aimed at teaching “biblical principles of manhood” to boys in need of guidance. Read more.",
    "image": "https://sportal365images.com/process/smp-images-production/pulse.ug/08022026/f372027e-a2b6-494a-ad85-3efbf6110111.jpg?operations=autocrop(1200:630)",
    "source": "Pulse Uganda"
  },
  {
    "title": "Minister of State to meet homeowners impacted by flooding",
    "desc": "Minister of State with responsibility for flood relief Kevin Boxer Moran will visit Passage East in Co Waterford this morning to meet homeowners impacted by recent flooding.",
    "image": "https://www.rte.ie/images/0023cef0-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Russia says man suspected of shooting general detained in Dubai",
    "desc": "Man in his 60s ‘arrested and handed over to Russia’ after fleeing to UAE, according to media reports",
    "image": "https://i.guim.co.uk/img/media/81efa57caecb89a490d735bb90786075c5c451e7/0_0_4248_3397/master/4248.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=2e7fef4525ffc4cbeb5fa4f39b63828d",
    "source": "The Guardian"
  },
  {
    "title": "Applications for Tunku Abdul Rahman scholarship opens Feb 8",
    "desc": "KUALA LUMPUR: Applications for the Tunku Abdul Rahman Scholarship (BTAR) are officially open from Sunday (Feb 8) in conjunction with the birthday of Malaysia's first prime minister, Tunku Abdul Rahman Putra Al-Haj.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/08/3760447.jpeg",
    "source": "The Star"
  },
  {
    "title": "Greenland crisis boosted Danish apps designed to identify and help boycott US goods",
    "desc": "The makers of mobile apps designed to help shoppers identify and boycott U.S. goods say they saw a surge of interest in Denmark and beyond after the recent flare-up in tensions over Greenland",
    "image": "https://i.abcnewsfe.com/a/e41df286-75c5-4e16-85af-e5480041261c/wirestory_93071df9a5b8aec8116c37730d175a46_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Saba Faisal Celebrates Her Birthday In Style",
    "desc": "Saba Faisal is a star who has really moved with times. She started her career as a newscaster and she is now one of the most sought after drama actresses of",
    "image": "https://reviewit.pk/wp-content/uploads/2026/02/saba-faisal.jpg",
    "source": "Reviewit.pk"
  },
  {
    "title": "4 illegal firearms in Baringo amid disarmament campaign",
    "desc": "The National Police Service recovers four illegal firearms in Baringo County as part of ongoing disarmament efforts to curb banditry and enhance security. Community cooperation is encouraged.",
    "image": "https://www.capitalfm.co.ke/news/files/2026/02/BARINGO-ILLEGAL-FIREARMS.jpg",
    "source": "Capitalfm.co.ke"
  },
  {
    "title": "Armed gardaí deployed to arrest axe-wielding man roaming Wexford beauty spot",
    "desc": "Gardaí from the Armed Support Unit were required following an incident of a man who had caused panic at a peaceful Wexford beauty spot on Saturday evening, wandering around armed with an axe and causing damage to four cars.",
    "image": "https://focus.independent.ie/thumbor/3wuBdpS-yv4UmWRORo9bLf4PQhs=/629x460/smart/prod-mh-ireland/6312808a-4993-4412-83c3-f30a3181f39b/ae8ce15f-4800-4ee3-9117-015dd2e62023/6312808a-4993-4412-83c3-f30a3181f39b.jpg",
    "source": "The Irish Independent"
  }
]