[
  {
    "title": "Mhona commissions Skyline Asphalt Plant, Harare Drive section",
    "desc": "TRANSPORT and Infrastructure Development Minister, Felix Mhona Monday commissioned a section of Harare Drive Road and Skyline Asphalt Plant. The high Asphalt facility can produce 120 tons of asphalt per hour, intended to accelerate road rehabilitation and pothole patching across the capital under the Emergency Road Rehabilitation Programme (ERRP2). Asphalt is a versatile composite material […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/02/23182529/whatsapp-image-2026-02-23-at-16-28-31-1.jpeg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "Police identify Katherine Sanowski as woman found dead at Bellbird Park house as they launch murder investigation",
    "desc": "A 34-year-old found nearby, known to the victim, is receiving a medical assessment and is yet to speak to police.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ab0d9d9e0d4ba9707d4be624093cf0ce?impolicy=wcms_watermark_news&cropH=2268&cropW=4032&xPos=0&yPos=531&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Antifungal Activity of Endophytic Yeasts against Grape Phytopathogens",
    "desc": "In this study, the antifungal activity of endophytic yeast strains isolated from the generative parts of plants in Uzbekistan against five important phytopathogenic fungi—Fusarium oxysporum, Aspergillus niger, Aspergillus flavus, Penicillium sp1, and Penicillium sp2, was evaluated using the agar diffusion method. The results showed that strain 01 (particularly against Penicillium sp1) and strain 3 (against Fusarium oxysporum and Penicillium sp1) formed the largest inhibition zones, demonstrating broad-spectrum antifungal potential. Penicillium sp1 was the most sensitive pathogen, while Aspergillus niger proved to be the most resistant. Considering the significant growth in Uzbekistan’s fruit and vegetable exports during 2023-2025, these endophytic yeasts are promising as commercial biocontrol agents. They offer a sustainable alternative to chemical fungicides and can help reduce post-harvest losses (up to 30%).",
    "image": "https://file.scirp.org/image/ajps2024051313523682.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Mobikwik gets BSE nod for stock broking business. Details here",
    "desc": "MobiKwik reported a net profit of ₹4 crore for the quarter, marking a turnaround from a net loss of ₹55.2 crore in the corresponding period last year.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/24/1600x900/logo/Mobikwik_1771902322174_1771902322284.jpg",
    "source": "Mint"
  },
  {
    "title": "Election Board Weighs in on Disputed Districts - The Reporter",
    "desc": "Governance CornerElection 2026 Election Board Weighs in on Disputed Districts By Ashenafi Endale February 23, 2026 Five districts located in areas disputed by the Amhara and Tigray regional adminis…",
    "image": "https://ethiopanorama.com/wp-content/uploads/2026/02/image-153.png",
    "source": "ethiopanorama.com"
  },
  {
    "title": "Emma Raducanu leaves Nike for Uniqlo in tennis fashion sponsorship switch",
    "desc": "Nike signed Raducanu in 2018, three years before her breakthrough at the U.S. Open.",
    "image": "https://static01.nyt.com/athletic/uploads/wp/2025/12/16083227/Tennis-Emma-Raducanu-Uniqlo-Nike-scaled.jpg?width=1200&height=630&fit=cover",
    "source": "The New York Times"
  },
  {
    "title": "Five sessions a day TMS approach may reduce depression symptoms in one week",
    "desc": "For the many patients with depression who haven't found relief through medication, transcranial magnetic stimulation (TMS) - a noninvasive therapy that uses magnetic pulses to stimulate specific areas of the brain - has become an increasingly important treatment option.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/depression-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Ministry of Foreign Affairs shuts premium passport centres in Accra and Kumasi",
    "desc": "The Ministry of Foreign Affairs and Regional Integration has closed its Premium Passport Application Centres in Accra and Kumasi, instructing applicants to use regional passport offices for their services.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/269/26988499.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "BetKing Marks Eight Years of Innovation, Eyes Expansion",
    "desc": "BetKing celebrates its eighth anniversary, highlighting a journey of innovation and growth. Learn about their expansion plans and customer rewards.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2024/01/15121115/BetKing-Guide.webp",
    "source": "Punch Newspapers"
  },
  {
    "title": "Shoppers turn on Coles and Woolworths as BREAD becomes an 'extravagant' luxury in Australia's deepening cost-of-living crisis",
    "desc": "Shoppers have taken aim at Coles and Woolworths amid claims of price gouging, as grocery staples like bread and fresh fruit become a luxury for many households.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/24/03/106625391-0-image-a-44_1771902135899.jpg",
    "source": "Daily Mail"
  }
]