[
  {
    "title": "Takiyuddin: PAS has candidate ready to lead PN",
    "desc": "KOTA BHARU: PAS Secretary-General Datuk Seri Takiyuddin Hassan confirmed that the party already has a candidate to be appointed Perikatan Nasional chairman.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/06/3757079.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "‘Akekoromowei focused on Falconets duty’",
    "desc": "NWFL MVP Janet Akekoromowei remains focused on the Falconets' World Cup qualifiers despite rumors of her passport being withheld amid European interest.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/06022910/Janet-Akekoromowei.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Planet Bottling Reaffirms Quality and Affordability",
    "desc": "Planet Bottling Company reaffirms its commitment to providing top-quality, affordable beverages in Nigeria while celebrating its distributors' role in its",
    "image": "https://cdn.punchng.com/wp-content/uploads/2025/11/18032535/1-1200x630.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Crypto market loses $2 trillion: Why Bitcoin just saw its biggest one-day fall since 2024 | Explained",
    "desc": "According to CoinGlass data, nearly $1 billion worth of bitcoin positions were liquidated in just 24 hours as leveraged traders were forced out when prices fell sharply.",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260206013643_bitcoin.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "No sign of Dezi Freeman as latest search ends in Mount Buffalo National Park",
    "desc": "Detectives say they will not give up on finding Victorian fugitive Dezi Freeman, accused of killing two police officers and injuring a third.",
    "image": "https://live-production.wcms.abc-cdn.net.au/3d064353f0eb5da2d64c3c0d636bf8b5?impolicy=wcms_watermark_news&cropH=678&cropW=1206&xPos=0&yPos=609&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "DA MP answers to serious corruption allegations before Parly committee",
    "desc": "In her affidavit, Kohler Barnard told the committee that information regarding the purchase of the Pretoria North property was already in the news.",
    "image": "https://media-cache.primedia-service.com/media/gxffoik0/whatsapp-image-2026-02-05-at-122412-1.jpeg?width=1200&height=630",
    "source": "EWN"
  },
  {
    "title": "India, Malaysia set to discuss free trade agreement review this weekend as Modi meets Anwar",
    "desc": "NEW DELHI, Feb 6 — India and Malaysia will discuss a review of their bilateral free trade agreement, among a host of issues, during Prime Minister Narendra Modi’s visit to...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/06/324063.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "Israel, Amnesty International: No to the return of the death penalty",
    "desc": "Amnesty International has called on Knesset members to vote against a series of bills containing controversial amendments that would allow Israeli courts",
    "image": "https://www.pressenza.com/wp-content/uploads/2018/10/no-to-death-penalty-santegidio.jpg",
    "source": "Pressenza - International Press Agency"
  },
  {
    "title": "Greg Sankey asks for courts to uphold the NCAA eligibility rules in Charles Bediako case",
    "desc": "SEC Commissioner Greg Sankey has asked four courts to uphold the NCAA eligibility rules in the Charles Bediako case.",
    "image": "https://on3static.com/uploads/dev/assets/cms/2026/01/21203702/CharlesBediakoMIZ.png",
    "source": "On3"
  },
  {
    "title": "Rights group criticizes UK Labour government's human rights record",
    "desc": "Human Rights Watch (HRW) on Tuesday criticized the UK government's human rights record over the past year, pinpointing issues such as its immigration policies, protest crackdowns, and inadequate respo...",
    "image": "https://www.jurist.org/news/wp-content/uploads/sites/4/2026/02/Palace_of_Westminster_from_the_dome_on_Methodist_Central_Hall.jpg",
    "source": "Jurist.org"
  }
]