[
  {
    "title": "Norway’s wealth fund raises exposure to Malaysian bonds, increases holdings in fewer stocks",
    "desc": "KUALA LUMPUR (Jan 30): Norway’s sovereign wealth fund has sharply boosted its exposure to Malaysian government bonds in the second half of 2025, according to its latest disclosure.",
    "image": "https://assets.theedgemarkets.com/424061413-Bursa-Malaysia-stock-market-prices-px-SamsulSaid-APP_Bloomberg_6.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "E-hailing licence fees more flexible starting today, says Transport Ministry",
    "desc": "KUALA LUMPUR: Starting today, e-hailing service vehicles benefit from more flexible Motor Vehicle Licence (LKM) fee structures following recent adjustments by the Transport Ministry (MOT) and Road Transport Department (JPJ).",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/30/3746018.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "Police confirm arrest in double murder of minors, investigate separate child death and drowning",
    "desc": "The investigations into all three incidents are ongoing.",
    "image": "https://3-mob.com/wp-content/uploads/2024/02/pexels-photo-923681.jpeg",
    "source": "3-mob.com"
  },
  {
    "title": "Terror attacks claim 44 lives daily in West Africa - Ablakwa",
    "desc": "Terrorism is claiming an average of about 44 lives every day in West Africa and the Sahel, with the growing scale and intensity of violent extremist attacks, Mr Samuel Okudzeto Ablakwa, Minister for Foreign Affairs, has revealed.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/01/Screenshot-2026-01-30-at-5.46.31-AM.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "More than $370 million now allocated for Victorian bushfire recovery support",
    "desc": "The state and federal governments will substantially increase financial support for 23 Victorian local government areas devastated by bushfires this month.",
    "image": "https://live-production.wcms.abc-cdn.net.au/bddd250cee14a11a87f3478043f0a095?impolicy=wcms_watermark_news&cropH=912&cropW=1621&xPos=56&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "interest banking to start soon – Governor Asiama",
    "desc": "Dr Johnson Pandit Asiama, the Governor of the Bank of Ghana (BoG), said the sector regulator will soon grant licences to financial institutions to start non-interest banking (Islamic banking) operations in the country.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/01/Screenshot-2026-01-30-at-5.44.43-AM.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "PS Oluga urges dental sector to tackle gaps in access, equity and trust",
    "desc": "Principal Secretary for Medical Services, Dr. Ouma Oluga has called on the dental profession to urgently address long-standing gaps in access, equity, and public trust in oral healthcare.",
    "image": "https://www.kbc.co.ke/wp-content/uploads/2026/01/KDAOluga.jpg",
    "source": "KBC Digital"
  },
  {
    "title": "China to expand support for Namibians in 2026 exchange year",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% Chinese ambassador to Namibia Zhao Weiping says the country will be supporting local people during the 2026 China-Africa activities celebration under the theme ‘Year of People-to-People Exchanges’.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/01/WhatsApp-Image-2026-01-30-at-8.16.29-AM-1024x768.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "CTD Mianwali operation: 6 terrorists killed, weapons seized",
    "desc": "CTD kills 6 terrorists during a raid near Chapri Dam; weapons and explosives recovered while 8 others escape. Security operations continue.",
    "image": "https://www.samaa.tv/images/ctd-mianwali.jpg",
    "source": "Samaa TV"
  },
  {
    "title": "How a TV series sparked Timea Hillender’s conservation career",
    "desc": "Located at Sokoine University of Agriculture in Morogoro, it is known for training African giant rats that have been deployed around the world, from detecting landmines and explosives in Cambodia...",
    "image": "https://www.thecitizen.co.tz/resource/image/5342808/landscape_ratio3x2/1200/800/5c75dce2bdeec2b39b056e4dd8446cf7/aR/timea-pic.jpg",
    "source": "thecitizen.co.tz"
  }
]