[
  {
    "title": "Tanzania calls for private investment to boost Ngorongoro tourism",
    "desc": "Tanzania has urged the Ngorongoro Conservation Area Authority to deepen private sector engagement to expand accommodation, transport and tourism products as visitor numbers rise.",
    "image": "https://atta.travel/assets/img/favicon/favicon-96.png",
    "source": "Atta Travel"
  },
  {
    "title": "New federal grocery rebate will cost $12.4 billion, PBO estimates",
    "desc": "The parliamentary budget officer announced Monday that the Canada Groceries and Essentials Benefit will cost an estimated $12.4 billion.",
    "image": "https://i.cbc.ca/ais/f80c2611-f576-4c4a-ace6-041046ca0975,1770043073558/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C456%2C7766%2C4368%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "I jumped from 13ft window to stop torment of OCD… I was paralysed but it’s not stopped me from having amazing sex life",
    "desc": "ON the surface, Anya Darlow seemed like a typical teenager, navigating the same pressures as most people her age - school, dating, and the trials...",
    "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2026/02/anya-darlow-27-year-old-1054504476.jpg?quality=90&strip=all&w=1080&h=1080&crop=1",
    "source": "The Irish Sun"
  },
  {
    "title": "\"High-pitched scream' on night Noah Donohoe disappeared",
    "desc": "A woman has told the Noah Donohoe inquest that she heard a \"high-pitched scream\" on the night the schoolboy disappeared.",
    "image": "https://www.rte.ie/images/00159aa1-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Mercedes blasts rivals over F1 engine loophole claims",
    "desc": "Mercedes Formula One boss Toto Wolff blasted rivals for casting doubt on the legality of his team's new engine through secret meetings and letters.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--OSgl7E2e--/t_tohu-badge-facebook/v1644387447/4MG5810_copyright_image_253899?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "A smiling Cher laughs at her Grammys flubs in a good-natured, chaotic appearance",
    "desc": "Cher may have wanted to turn back time on her rather chaotic Grammys presenting experience",
    "image": "https://i.abcnewsfe.com/a/dd15d3fb-f57a-4f36-a852-5211794da5ce/wirestory_a94637a3bd436f106ae52f1d958f0de3_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Frank Cushnahan found not guilty in Belfast NAMA trial",
    "desc": "A Co Down businessman has been found not guilty of fraud connected to the sale of NAMA's Northern Ireland loan book.",
    "image": "https://www.rte.ie/images/0023d675-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Presidency defends journalist Beukes' removal from State House",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% The Presidency has defended the removal of journalist Jemima Beukes from State House on Monday, citing protocol violations, while a media union has condemned the incident as state-sponsored intimidation.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/626299718_1310776277758030_3636235052679673573_n-1024x683.jpg",
    "source": "The Namibian -"
  },
  {
    "title": "Nvidia: The Story Behind the Most Watched Company on Earth",
    "desc": "The chip giant's path to success is worth knowing.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F854133%2Fvideo-game-getty.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Battling Waterford go top with win in Kerry",
    "desc": "Bríd McMaugh struck 1-04 as Waterford made it two wins on the bounce after a deserved four-point win against reigning champions Kerry in this second round Lidl Ladies Division 1 encounter at Fitzgerald Stadium.",
    "image": "https://www.rte.ie/images/0023d665-1600.jpg",
    "source": "RTE.ie"
  }
]