[
  {
    "title": "Colorful japonica rice varieties show unique health-promoting lipids",
    "desc": "Rice feeds more than half of the world's population, yet we still only partly understand the nutrients it contains.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/Blood_glucose-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Trump says he is frustrated with Iran, but mediator sees 'breakthrough'",
    "desc": "Iran has agreed not to stockpile uranium and to degrade its current stockpiles into fuel, says Oman, describing the move as \"a very important breakthrough\".",
    "image": "https://dam.mediacorp.sg/image/upload/s---iXVzqPv--/c_crop,h_449,w_799,x_1,y_1/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2026-02-27T175558Z_1_LYNXMPEM1Q14I_RTROPTP_3_USA-TRUMP.JPG?itok=u99Tpxym",
    "source": "CNA"
  },
  {
    "title": "Gut Microbiome Imbalances Linked to Immune Deficiency in People Living with HIV Across Diverse Populations",
    "desc": "An international team of researchers has identified a s […]",
    "image": "https://www.geneonline.com/wp-content/uploads/EN_NEWSFLASH_5-1.png",
    "source": "geneonline.com"
  },
  {
    "title": "Drunk driver illegally accessed criminal database while using officer’s phone at North Shore Policing Centre",
    "desc": "A drunk driver who had been taken into a police station asked if he could use an officer’s phone to call a lawyer. Alone in an interview room, Michael Mackey...",
    "image": "https://www.nzherald.co.nz/resizer/v2/EQ3RRZTVJNHXDALUMGJCPBO4WA.jpg?auth=29fde4e98044d4c10210fe085550f5c55c98b25dd4901fd695028c595768d5d5&width=1200&height=675&quality=70&smart=true",
    "source": "NZ Herald"
  },
  {
    "title": "EPF declares 6.15% dividend for conventional savings for 2025",
    "desc": "SHAH ALAM: The Employees Provident Fund (EPF) has declared a dividend rate of 6.15% for conventional savings for 2025, with the total payout amounting to RM67.1bil.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/28/3791437.jpg",
    "source": "The Star"
  },
  {
    "title": "Lionel Messi's Inter Miami reportedly set to visit White House to commemorate 2025 MLS Cup win",
    "desc": "Inter Miami will reportedly visit the White House to commemorate the team's 2025 MLS Cup win.",
    "image": "https://assets.goal.com/images/v3/getty-2250415764/crop/MM5DIMBTGQ5DEMRWHE5G433XMU5DAORSGEYA====/GettyImages-2250415764.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Are password managers safe? Not as much as you think, research shows",
    "desc": "Keeping track of password requirements such as a mix of upper and lower case letters, numbers, special characters and more – not only to be remembered but to be changed every few months – is a tall order, not least as platforms urge users to ensure each password is unique.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/26/3788346.jpeg",
    "source": "The Star"
  },
  {
    "title": "Student, migrant worker and percussionist performing in Chingay 2026 share wishes for Singapore",
    "desc": "The two-day Chingay Parade kicked off on Friday (Feb 27) evening, featuring a circular multi-tier stage for the first time.This year's theme, Wish, brings together over 3,000 performers in a 90-minute show.Half of the eight-act performance is inspired by ethnic festivals of Chinese New Year, Christmas, Deepavali and Hari Raya, highlighting the common values and celebratory spirit that unite racial...",
    "image": "https://media.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/280226_chingayparade2026_asiaone_dennispalit.jpg?itok=OyXRhNbs",
    "source": "AsiaOne"
  },
  {
    "title": "Thief nabbed in Manila for selling stolen camera on social media",
    "desc": "A 23-year-old man was arrested by the Manila Police District (MPD) for robbing a 19-year-old student of his digital camera and selling it on social media in...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/28/82554.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Lionel Messi's Inter Miami reportedly set to visit White House to commemorate 2025 MLS Cup win",
    "desc": "Inter Miami will reportedly visit the White House to commemorate the team's 2025 MLS Cup win.",
    "image": "https://assets.goal.com/images/v3/getty-2250415764/crop/MM5DIMBTGQ5DEMRWHE5G433XMU5DAORSGEYA====/GettyImages-2250415764.jpg",
    "source": "Goal.com"
  }
]