[
  {
    "title": "Expert: October 7 trauma shaping Israeli West Bank policy",
    "desc": "Israeli leaders are choosing to prioritize physical security, even if it means “taking the risk of being a pariah nation,” foreign policy expert Harley Lippman said.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/698001",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Super Eagles head coach Chelle changes agent",
    "desc": "Super Eagles head coach Éric Chelle has signed with a new management agency, DAILY POST reports. Chelle recently ended his relationship with agent Abraham",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/Eric-chelle.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Couple living on small pension told they don't qualify for grant to help son move home",
    "desc": "Christian Herridge has spent more than 16 months in hospital, but is determined to move back home to his parents’ house in Mahone Bay, N.S.",
    "image": "https://i.cbc.ca/ais/e21ce5f6-3589-4b82-9ddf-2e4ade680729,1771445140856/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C0%2C1920%2C1080%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Fire crews called to blaze at Grade II-listed Dalton Mills",
    "desc": "A fire at Dalton Mills in Keighley is put out by fire crews after several previous arson attacks.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/853b/live/3b48eeb0-d1fa-11f0-9900-656de002e153.jpg",
    "source": "BBC"
  },
  {
    "title": "Tanzania: Analysts Optimistic About Tz's 2029 UN Security Council Seat",
    "desc": "ANALYSTS have expressed confidence in Tanzania's projected non-permanent membership on the United Nations (UN) Security Council in 2029, saying the move will enhance the country's diplomatic clout and reinforce national and regional security.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Lando Norris leads Max Verstappen and George Russell on second morning of final Bahrain test",
    "desc": "Lando Norris posted the fastest time as pre-season testing continued at the Bahrain International Circuit on Thursday, leading the way from Max Verstappen and George Russell.",
    "image": "https://media.formula1.com/image/upload/t_16by9North/c_lfill,w_2048/q_auto/v1740000000/trackside-images/2026/Formula_1_Testing_in_Bahrain___Day_2/2262419298.webp",
    "source": "Formula 1"
  },
  {
    "title": "Digital agriculture units key to Africa’s farm growth, says new report",
    "desc": "Digital agriculture could add $500bn annually to farm economies, but scaling adoption depends on stronger government delivery capacity, a new report finds...",
    "image": "https://biz-file.com/c/2602/803602-1200x624.jpg?2",
    "source": "Bizcommunity"
  },
  {
    "title": "Kenya's National Infrastructure Fund Plan in Turmoil",
    "desc": "THE economic situation in Kenya is less stable than it was in the past, as the country prepares for the 2027 elections. This scenario is predicated on a comprehensive examination and detailed analysis of the repercussions of decisions, which, from an economic standpoint, indicate that the situation on the ground is precarious, particularly with respect to the implementation of the envisaged critical strategic projects.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Mahnoor Rahim alleges misconduct by Hania Aamir’s close friend",
    "desc": "Mahnoor Rahim has accused Hum TV producer Umer Mukhtar, who is known to be close friends with actress Hania Aamir, of inappropriate behavior",
    "image": "https://minutemirror.com.pk/wp-content/uploads/og-cache/6d09d3120c6930bc50b6a606734e2083.jpg",
    "source": "Minute Mirror"
  },
  {
    "title": "The Internet Is Pining for the Simpler Days of Old Technology",
    "desc": "Gen Z and millennials are finding comfort in analog technology as AI disillusionment grows.",
    "image": "https://i.insider.com/6995df04f8731049f3af500f?width=1200&format=jpeg",
    "source": "Business Insider"
  }
]