[
  {
    "title": "SUPER BOWL SPECIAL: When Formula 1 meets the NFL",
    "desc": "To build up to tonight’s Super Bowl between the New England Patriots and the Seattle Seahawks, let’s unpack all the crossovers between F1 and American Football.",
    "image": "https://media.formula1.com/image/upload/c_lfill,w_2048/q_auto/v1740000000/fom-website/2026/Lifestyle/ADHOC/Super%20Bowl/Super-Bowl-Hero.webp",
    "source": "Formula 1"
  },
  {
    "title": "Night Transport Will Return to Riga and It Will Be Three Times More!",
    "desc": "In the spring of last year, ahead of the upcoming municipal elections, the capital's leadership showed an unusual sensitivity to the people and restored night public transport in Riga after a five-year hiatus. This raised suspicions that the deputies",
    "image": "https://news.inbox.eu/w/img/5c/86/5c86389b7fb6a16016.webp",
    "source": "Inbox.lv"
  },
  {
    "title": "See the areas that will be affected by ECG's planned maintenance between February 8-13",
    "desc": "See the areas that will be affected by ECG's planned maintenance between February 8-13",
    "image": "https://www.graphic.com.gh/images/2024/feb/19/ECG.jpg",
    "source": "Graphic Online"
  },
  {
    "title": "TEAM PREVIEW: McLaren - All you need to know about the team ahead of the 2026 F1 season",
    "desc": "Off the back of the team winning both championships in 2025, here is everything you need to know about McLaren ahead of the 2026 season.",
    "image": "https://media.formula1.com/image/upload/t_16by9Centre/c_lfill,w_2048/q_auto/v1740000000/fom-website/2026/McLaren/TEAM%20PREVIEWSHALF%20TERM%20REPORTS%20McLaren.webp",
    "source": "Formula 1"
  },
  {
    "title": "Mahira Khan & Sheheryar Munawar Dance At Asim Raza's Daughter's Wedding",
    "desc": "Mahira Khan is enjoying a big fat wedding in Karachi and it has been one star-studded event. Director Asim Raza's daughter Maryam Raza just tied the knot and",
    "image": "https://reviewit.pk/wp-content/uploads/2026/02/mahira-sherry.jpg",
    "source": "Reviewit.pk"
  },
  {
    "title": "Lacson backs removal of Marcoleta's remarks on Kalayaan from Senate record",
    "desc": "Senator Panfilo Lacson on Sunday expressed willingness to have the remarks of Senator Rodante Marcoleta—who allegedly suggested that it may be easier to let go of the Kalayaan Group of Islands (KIG) amid tensions with China—removed from the Senate record.",
    "image": "https://images.gmanews.tv/webpics/2025/09/Lacson_Marcoleta_2025_09_23_09_21_03.jpg",
    "source": "GMA Network"
  },
  {
    "title": "based Nigerian footballer Saburi Adeniji dies from injury",
    "desc": "Saburi Adeniji, a Nigerian footballer for Kings Park Rangers, has died after battling a severe brain stem injury, his UK-based club confirmed.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/08084544/Screenshot-2026-02-08-084453.png",
    "source": "Punch Newspapers"
  },
  {
    "title": "EXCLUSIVE: EFCC Suspends Top Prosecutor, Samuel Chime Over Alleged Bribery To Sabotage Cases",
    "desc": "EXCLUSIVE: EFCC Suspends Top Prosecutor, Samuel Chime Over Alleged Bribery To Sabotage Cases",
    "image": "https://saharareporters.com/themes/custom/octavia_sahara/favicon.ico",
    "source": "Sahara Reporters"
  },
  {
    "title": "Ayesha Omar shares rare look into her childhood home on Basant",
    "desc": "Ayesha Omar gives fans a rare glimpse into her childhood home while celebrating Basant with nostalgic vibes.",
    "image": "https://24newshd.tv/digital_images/large/2026-02-08/ayesha-omar-shares-rare-look-childhood-home-basant-1770537925-2470.png",
    "source": "24NewsHD"
  },
  {
    "title": "“I’m still learning to trust myself”",
    "desc": "The slopestyle Olympic and world champion tells Olympics.com ahead of Milano Cortina 2026 how skiing has become her developmental tool",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/rzx50a6qtmywc5pyihvf",
    "source": "Milano Cortina 2026"
  }
]