[
  {
    "title": "Min Hee Jin Addresses Lawsuits And Makes Proposal To HYBE At Press Conference",
    "desc": "Min Hee Jin proposed that HYBE bring all cases to an end in exchange for her giving up the 25.6 billion won she is supposed to receive through her put",
    "image": "https://0.soompi.io/wp-content/uploads/2026/02/25010907/min-hee-jin-xpn-1.jpg",
    "source": "Soompi"
  },
  {
    "title": "Governor Waiguru unveils land mapping for Kirinyaga towns",
    "desc": "Kirinyaga Governor Anne Waiguru has rolled out a comprehensive digital land mapping and geo-referencing exercise aimed at restoring order in urban centres, resolving historical land allocation disputes.",
    "image": "https://www.kbc.co.ke/wp-content/uploads/2026/02/Screenshot_20260225_122503_Gallery.jpg",
    "source": "KBC Digital"
  },
  {
    "title": "JOOTRH gets state funding to complete cancer centre",
    "desc": "Once operational, the facility is expected to reduce the number of patients forced to travel to Nairobi or Eldoret",
    "image": "https://cdn.radioafrica.digital/image/2026/02/aadb97ae-b6f6-4fcf-97c1-98cec4d0b6bc.png?1772052324480",
    "source": "the-star.co.ke"
  },
  {
    "title": "winning musical announces NZ tour dates",
    "desc": "A critically acclaimed and award-winning production of one of the greatest musicals ever made is playing across Aotearoa New Zealand later this year. Jesus...",
    "image": "https://www.nzherald.co.nz/resizer/v2/WGR5WY6CXVHJ3PNQ6LPQ4N3K6I.jpg?auth=131728c19caecf7618d7b774e3c0af3542d1015aacd6e48454e4187393b052f9&width=1200&height=675&quality=70&focal=936%2C543&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Economist warns of oil effect on fiscal policy",
    "desc": "%%title%% %%sep%% %%primary_category%% %%sep%% %%sitename%% %%sep%% Economist Robin Sherbourne warns that Namibia’s financial policy is at a crossroads with potential oil revenues looming over the government’s finances.",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-25-at-11.19.53-1024x768.jpeg",
    "source": "The Namibian -"
  },
  {
    "title": "World Cup 2026: US cities' security concerns over funding freeze",
    "desc": "US government officials are warned that there could be \"catastrophic\" security consequences if cities hosting World Cup matches do not receive funding that has been frozen.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/8f0e/live/af40b660-1230-11f1-8a75-7b501e33d8b5.jpg",
    "source": "BBC"
  },
  {
    "title": "wide infrastructure standard plan",
    "desc": "Punjab Chief Minister Maryam Nawaz has approved a province-wide infrastructure and design standardisation plan to ensure uniform development and stronger urban discipline. The decision followed a high-level meeting where officials presented detailed proposals on roads, public spaces, and building layouts. Moreover, the government aims to create a consistent identity for cities and towns across the province through structured planning.",
    "image": "https://dailytimes.com.pk/assets/uploads/2026/02/25/CM-Maryam-Nawaz-1.jpg",
    "source": "Daily Times"
  },
  {
    "title": "PBB Collab 2.0: Vice Ganda, Gladys Reyes, and all the celebrity house guests of the season",
    "desc": "Before \"Pinoy Big Brother: Celebrity Collab Edition 2.0\" ends, let's look back at the long list of stars who entered Bahay ni Kuya as celebrity house guests.",
    "image": "https://images.gmanews.tv/webpics/2026/02/pbb_2026_02_25_17_24_00.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Ethiopia Seizes Contraband Goods Worth 624.6 Million Birr in Week",
    "desc": "Ethiopia Seizes Contraband Goods Worth 624.6 Million Birr in Week-Long Crackdown",
    "image": "https://birrmetrics.com/wp-content/uploads/2026/02/FB_IMG_1772007482528.jpg",
    "source": "Birr Metrics"
  },
  {
    "title": "DR Congo envoys seek to enhance ties with Tanzania in trade, investment sectors",
    "desc": "DAR ES SALAAM: A delegation from Maniema Province, Democratic Republic of Congo (DRC) met with stakeholders from the Tanzania Private Sector Foundation (TPSF) and the Tanzania National Chamber of Commerce (TNCC) to discuss trade and investment opportunities between Tanzania and the DRC. Speaking at the opening of the meeting held in Dar es Salaam, Tanzania’s",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/Tanzania-na-DRC-kukuza-biashara-kupitia-na-TPSF-na-TNCCUjumbe-kutoka-Maniema-Jamhuri-ya-Kidemok.jpg",
    "source": "dailynews.co.tz"
  }
]