[
  {
    "title": "MAKUENI TO PILOT COMPOUND SEMICONDUCTOR RENEWABLE ENERGY FOR HEALTH AND WATER SYSTEM.",
    "desc": "Makueni County will pilot compound semiconductor–enabled renewable energy technology to power its health and water infrastructure, a move expected to cut electricity costs by up to 30 percent. The plan announced Wednesday during a consultative meeting between county officials and the University of Nairobi (UoN), will be carried out under the Compound Semiconductor–Enabled Renewable Energy […]",
    "image": "https://makueni.go.ke/sandbox/site/files/2026/02/MAKUENI-TO-PILOT-COMPOUND-SEMICONDUCTOR-RENEWABLE-ENERGY-FOR-HEALTH-AND-WATER-SYSTEM.4.jpg",
    "source": "Government of Makueni County"
  },
  {
    "title": "How to watch Lindsey Vonn live at Winter Olympics Milano Cortina 2026",
    "desc": "The 41-year-old Alpine skiing legend hopes to cap her Olympic career in style, despite suffering a serious knee injury just a week before the start of her fifth Games.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/anke7ngz8l2tayoswe3c",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Pakistan Captain Salman Ali Agha Reignites Bangladesh-ICC Controversy Ahead Of T20 World Cup",
    "desc": "Pakistan cricket team skipper Salman Ali Agha reignited the ICC-Bangladesh controversy at theT20 World Cup 2026 captains day press conference in Colombo.",
    "image": "https://c.ndtvimg.com/2025-09/6qtf4t38_salman-ali-agha_625x300_18_September_25.jpg?im=FeatureCrop,algorithm=dnn,width=1200,height=738",
    "source": "NDTV Sports"
  },
  {
    "title": "Vivo V70 and Vivo V70 Elite to launch in India on February 19: Camera and key features revealed",
    "desc": "Vivo V70 and Vivo V70 Elite camera-centric smartphones are launching in India on February 19. Here’s everything we know so far. | Technology News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/05/550x309/Vivo_V70_Elite_1770279211237_1770279211386.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Billionaire Owners Seen Posing Challenge for New OCBC Chief Tan",
    "desc": "As Tan Teck Long takes the helm of Oversea-Chinese Banking Corp., one of his main challenges may be winning over the billionaire sitting across the boardroom table.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/iDOj210.RROU/v1/1200x800.jpg",
    "source": "Bloomberg"
  },
  {
    "title": "Hedge Funds Face Showdown on Aussie as Gold, RBA Risks Collide",
    "desc": "The Australian dollar’s outlook is increasingly at risk as a slide in precious metals works against optimism driven by expectations for higher interest rates.",
    "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/ipMEly9qhBlE/v0/1200x800.jpg",
    "source": "Bloomberg"
  },
  {
    "title": "US creators get paid, Ghanaian creators only get views - Juliet Ibrahim",
    "desc": "Conversations about content creators in Africa, particularly in Ghana, have intensified, focusing on the need for fair compensation, effective monetisation of digital platforms, and strategies to safeguard local intellectual property.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/570/57099267.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Global investors betting on 'rising star' Malaysia as foreign cash piles in",
    "desc": "Malaysian assets are drawing global investors as a soft US dollar and rising geopolitical tensions spur diversification and the country's stability and growth are seen as an attractive alternative to stuttering regional rivals.",
    "image": "https://assets.theedgemarkets.com/20240805 bursa SY_20240806091800_theedgemalaysia_10.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "AI disrupts Indian IT: Why TCS & Infosys face pain while niche players surge",
    "desc": "India's top IT companies are not leading the AI revolution. Market expert Sudip Bandyopadhyay warns of restructuring and margin pressure for giants like TCS and Infosys. Newer, specialized IT firms are succeeding by focusing on high-growth areas like travel and electric vehicles. Investors should look to these niche players for future growth opportunities.",
    "image": "https://img.etimg.com/thumb/msid-127927779,width-1200,height-630,imgsize-21126,overlay-etmarkets/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Real Estate Simulator 2: Early Access Keys Now Available for Content Creators",
    "desc": "Press releases and assets from across the games industry - screenshots, videos, logos, packshots, artwork, PR contacts, release dates",
    "image": "https://imgeucdn.gamespress.com/cdn/files/Games%20Press/2026/02/041504-4661825e/RE_GamesPress_Thumbnail.png?w=360&mode=max&otf=y&quality=90&format=png&bgcolor=transparent&sky=1c69de253345eece687edf364fbabb44fe97628f5a61038f56d81d64376adcda",
    "source": "Games Press"
  }
]