[
  {
    "title": "Lessons from Israel's Decline in the Global Corruption Index",
    "desc": "The Israel Democracy Institute (IDI) is an independent, nonpartisan, center of research and action dedicated to strengthening the foundations of Israeli democracy.",
    "image": "https://www.idi.org.il/media/30349/f250806avs02-copy.jpg",
    "source": "The Israel Democracy Institute"
  },
  {
    "title": "Igniting young minds for smart investment, innovation",
    "desc": "DAR ES SALAAM: IN every nation’s journey toward prosperity, there comes a defining moment when it must decide where to place its greatest investment. For Tanzania, that investment is unmistakably its youth. As the country advances toward the aspirations of Vision 2050, young people are no longer seen merely as beneficiaries of development. They are",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/Screenshot-2026-02-18-112306.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Divinity Returns: Larian’s Next Epic Could Be a Soft",
    "desc": "Larian’s new Divinity is coming. Sequel or reboot? We break down the trailer, lore clues, and what it means for Rivellon’s future.",
    "image": "https://www.nag.co.za/wp-content/uploads/2026/02/cw-06-1.jpg",
    "source": "nag.co.za"
  },
  {
    "title": "Peter Obi Condemns Dispersal of Protesters, Demands Electoral Transparency",
    "desc": "Former presidential candidate Peter Obi on Tuesday condemned the reported tear gassing of peaceful demonstrators, saying the incident reinforces concerns about Nigeria’s democratic direction.",
    "image": "https://mmo.aiircdn.com/370/5ec7c74371120.png",
    "source": "Nigeria Info FM"
  },
  {
    "title": "I couldn’t eat or drink anything - 2018 GMB winner on first pregnancy",
    "desc": "When Naomi Abena Obeng discovered she was pregnant for the first time, excitement was quickly overshadowed by a body that refused almost everything.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/163/16373809.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "LG unveils UltraGear evo, redefines 5K gaming with AI Upscaling",
    "desc": "LG has officially introduced the new UltraGear evo series, a new lineup of displays set to redefine 5K gaming with AI Upscaling.",
    "image": "https://www.gadgetmatch.com/wp-content/uploads/2026/02/lg-ultragear-evo-ai-upscaling-ces-2026-gaming-displays-20260218-1000x600.jpg",
    "source": "GadgetMatch"
  },
  {
    "title": "One more suspect arrested over killing of Police officer at Zebilla",
    "desc": "The Ghana Police Service has arrested another suspect in connection with the murder of a police officer at Zebilla in the Upper East Region.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Zebilla-1-e1771403348457.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Healthcare workers shortage: 56% of students don't make it to the workforce",
    "desc": "The shortage of healthcare workers in the Philippines is no longer an abstract policy debate. It is visible in overcrowded emergency rooms, months-long wait for...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/18/80154.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Elbit Systems Awarded $277 Million Contracts for 30mm Turrets and Munitions by an International Customer",
    "desc": "/PRNewswire/ -- Elbit Systems Ltd. (NASDAQ: ESLT) (TASE: ESLT) (\"Elbit Systems\" or the \"Company\") announced today that it has been awarded contracts in an...",
    "image": "https://mma.prnewswire.com/media/2017806/Elbit_Systems_Logo.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "Trump lauds Japan’s pledge to invest $36 billion in U.S. megaprojects",
    "desc": "The commitment represents the first tranche of investments by Japan following a landmark trade deal between the two countries.",
    "image": "https://image.cnbcfm.com/api/v1/image/108266616-1771401074830-gettyimages-2243738157-ah702329_8i2ufjny.jpeg?v=1771401144&w=1920&h=1080",
    "source": "CNBC"
  }
]