[
  {
    "title": "The Your Party committee election was chaos. Why break the habit of a lifetime?",
    "desc": "As the results livestream was delayed, voters lamented: ‘Is it too much to ask for competence as well as democracy?’",
    "image": "https://i.guim.co.uk/img/media/6fd89def8291c5182ebaa7ab0b38e6145f395e98/640_0_4549_3640/master/4549.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=740d44881c3ba1b851177da88a747ab5",
    "source": "The Guardian"
  },
  {
    "title": "‘He’s doing all he can’: England back Buttler to end miserable run of form",
    "desc": "England will give Jos Buttler the chance to turn around his miserable form at the T20 World Cup, believing a return to his usual high standard is imminent",
    "image": "https://i.guim.co.uk/img/media/10e54927186c833d777e84239a46daece149e79d/390_0_3900_3120/master/3900.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=23c9572de77b2e25090c329a14fe0d91",
    "source": "The Guardian"
  },
  {
    "title": "Danish PM calls an early election seeking ‘Greenland bounce’",
    "desc": "Mette Frederiksen hopes to profit from her stand against Donald Trump’s attempt to claim the Arctic territory",
    "image": "https://i.guim.co.uk/img/media/6d749a5000eeb56c939134bb4fe239c15d691f9e/585_0_5890_4712/master/5890.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=72a5031cb1242aa393f0edc0ee05118c",
    "source": "The Guardian"
  },
  {
    "title": "50 Shades Of Green Energy: Reimagining The Nation’s Power Mix For A Sustainable Decade Ahead",
    "desc": "As Malaysia charts its course towards the ambitious targets set out in its National Energy Transition Roadmap (NETR), a powerful new reality is compelling a fundamental rethink of what it means to be “green.” The explosive growth of data centres and Artificial Intelligence is creating unprecedented energy demand, while the…",
    "image": "https://www.businesstoday.com.my/wp-content/uploads/2026/02/image-4.jpeg",
    "source": "BusinessToday Malaysia"
  },
  {
    "title": "Foundry Releases Nuke 17.0 with Native Gaussian Splat Support",
    "desc": "Foundry has released Nuke 17.0, introducing native Gaussian Splats support, a USD-based 3D system, annotation tools and machine learning.",
    "image": "https://content-technology.com/wp-content/uploads/2026/02/Nuke-17.0-Hero-Asset-with-Logo.jpg",
    "source": "Content + Technology"
  },
  {
    "title": "Vancouver Mayor Ken Sim made unsubstantiated claims about councillor distributing drugs",
    "desc": "It has emerged that Vancouver Mayor Ken Sim accused a political opponent of distributing illegal drugs without evidence — days before a fellow councillor made similar claims that he later retracted.",
    "image": "https://i.cbc.ca/ais/1.7506341,1744237631000/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C324%2C5000%2C2812%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Apple's rumored 'cheap' MacBook makes me worried for Windows laptops and Chromebooks",
    "desc": "The rumored $599 MacBook distracts from the incremental upgrades of its core laptops while taking a bite out of the budget PC market.",
    "image": "https://www.zdnet.com/a/img/resize/6ad1205bfab7e00ae7baeb02642f9935616db901/2025/10/21/babf9ef4-7e86-4d0a-8470-a72fb9a39eb7/dsc08387.jpg?auto=webp&fit=crop&height=675&width=1200",
    "source": "ZDNET"
  },
  {
    "title": "A Prospective Study in a City in Northern Cameroon",
    "desc": "Introduction: High blood pressure (hypertension) is a major public health problem. Its prevalence has doubled over the years and it affects 10 to 15% of adults in sub-Saharan Africa, with the particularity of being the leading cause of chronic kidney disease (CKD). In Cameroon, CKD remains a concern in the face of exacerbated risk factors, delayed diagnosis, heavy economic burden, and significant morbidity. The aim was to determine the prevalence and markers of kidney damage in hypertensive patients followed at the Garoua Regional Hospital (HRG) in the northern region of Cameroon. Methods: This was a prospective study including adults over 18 years of age, known hypertensive patients followed at HRG. Variables of interest were collected, and an assessment of renal impairment including a urine dipstick and serum creatinine test was performed in all participants at baseline and at 3 months. Markers of kidney damage were proteinuria, hematuria, and elevated serum creatinine. CKD was defined as the persistence of renal failure, proteinuria, or hematuria for more than three months. The data collected were analyzed using SPSS version 25 software. The significance threshold was Results: A total of 356 participants were collected with a sex ratio of 0.86, a mean age of 55.57 ± 12.13 years, and a mean duration of hypertension of 60 ± 21 months. Diabetes mellitus (31.17%), obesity (30.33%), dyslipidemia (27.52%), and hyperuricemia (23.59%) were the main risk factors for kidney disease. The overall prevalence of chronic kidney disease was estimated at 28.37% (n = 101), represented by renal failure (69.3%), proteinuria (52.47%), and hematuria (25%). An age > 59 years, the duration of hypertension evolution greater than 5 years, obesity, diabetes, and hyperuricemia were associated with the presence of a marker of CKD. Conclusion: High blood pressure is a significant vector of kidney disease, especially since there are other risk factors for chronic kidney disease.",
    "image": "https://file.scirp.org/image/ojneph2024061816572426.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Teachers’ Strategies, Learners’ Perspectives, and the Potential of Drama-Based Instruction",
    "desc": "This study evaluates the effectiveness of English as a Foreign Language (EFL) speaking pedagogy in Goma’s secondary schools, focusing on teachers’ instructional strategies, learners’ perceptions, and the potential of drama-based instruction to enhance communicative competence. Using a mixed-methods design that integrates surveys, interviews, focus groups, and classroom observations, the research uncovers a persistent gap between teachers’ stated use of communicative methods and learners’ limited opportunities for authentic oral interaction. While teachers acknowledge the value of speaking skills, classroom practices remain shaped by grammar-oriented curricula, exam-driven instruction, and resource constraints. Learners, despite high motivation, face affective barriers such as fear of mistakes and peer mockery. Findings highlight that drama-based instruction, through activities like role-play, improvisation, and storytelling, fosters engagement, confidence, and interaction, making it a promising learner-centered alternative to traditional approaches. The study concludes that integrating drama meaningfully into EFL pedagogy can bridge the gap between curriculum goals and communicative realities, transforming classrooms into spaces of participation and linguistic empowerment.",
    "image": "https://file.scirp.org/image/ojml2016070117283323.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Tarlac athletes honored for medal wins at SEA Games, Batang Pinoy",
    "desc": "Tarlac athletes who won medals at the 2025 SEA Games and Batang Pinoy were recognized by the provincial government and awarded cash incentives.",
    "image": "https://media.assettype.com/tribune%2F2026-02-27%2Fr4v827c7%2FScreenshot20260227093855.jpg?w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Daily Tribune"
  }
]