[
  {
    "title": "Astronomers puzzle over 'inside out' planetary system",
    "desc": "WASHINGTON, Feb 14 : Astronomers have observed a planetary system that challenges current planet formation theories, with a rocky planet that formed beyond the orbits of its gaseous neighbors, possibly after much of the planet-forming material had been used up.The system, observed using the European Space Age",
    "image": "https://dam.mediacorp.sg/image/upload/s--iPLAmYpb--/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2026-02-14T111603Z_2_LYNXMPEM1D05L_RTROPTP_3_SPACE-EXOPLANETS.JPG?itok=-sIkEoCK",
    "source": "CNA"
  },
  {
    "title": "Victoria, David Beckham melt hearts with Valentine's Day tributes",
    "desc": "David and Victoria Beckham continue to prove they're the ultimate power couple even after more than two decades of marriage.On Valentine's Day, David took to Instagram to pour his love for his wife.The romantic post...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-14/l_650825_041333_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "Australia’s Jakara Anthony wins gold in dual moguls",
    "desc": "Jakara Anthony is now Australia’s first-ever dual Winter Olympic gold medallist, and the first Olympic champion in the brand-new dual moguls event: two pieces of history that can never be erased.",
    "image": "https://static.ffx.io/images/$zoom_0.5516%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_35/t_crop_custom/q_86%2Cf_auto/59915d93d5b1e9bcaa0562601df73b1233ba57e1a6af89ca36ff04361f70b80c",
    "source": "The Age"
  },
  {
    "title": "Australia’s Jakara Anthony wins gold in dual moguls",
    "desc": "Jakara Anthony is now Australia’s first-ever dual Winter Olympic gold medallist, and the first Olympic champion in the brand-new dual moguls event: two pieces of history that can never be erased.",
    "image": "https://static.ffx.io/images/$zoom_0.5516%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_35/t_crop_custom/q_86%2Cf_auto/59915d93d5b1e9bcaa0562601df73b1233ba57e1a6af89ca36ff04361f70b80c",
    "source": "SMH.com.au"
  },
  {
    "title": "Lunar Eclipse To Dazzle North America And Asia",
    "desc": "A deep-red Moon is on the way. A total lunar eclipse will unfold slowly across the night, safe to watch with the naked eye, and it will favor pre-dawn",
    "image": "https://www.findarticles.com/wp-content/uploads/2026/02/featured_edited_1771067342.png",
    "source": "findarticles.com"
  },
  {
    "title": "Detectives appealing for information after shots fired at Derry property",
    "desc": "Detectives are appealing for information following the report of shots being fired at a residential property in Derry. It was reported to officers at around 10:00pm yesterday evening that gunshots had been fired through the living room window of a property in the St. Brecan’s Park area of the city. This is believed to have […]",
    "image": "https://highlandradio.com/wp-content/uploads/2024/07/128899416_policepacemaker.jpg",
    "source": "Highland Radio"
  },
  {
    "title": "Ruto: 50,000 vulnerable adolescent mothers now under SHA cover",
    "desc": "President says the programme guarantees antenatal, delivery and post-natal care",
    "image": "https://cdn.radioafrica.digital/image/2026/02/a3141814-c194-42f5-ad13-3e112058ca1f.jpg?1771076150340",
    "source": "the-star.co.ke"
  },
  {
    "title": "GCB Bank set to introduce non-interest banking window",
    "desc": "GCB Bank PLC is preparing to introduce a dedicated Islamic banking window after high-level discussions with the International Islamic Financial Market (IIFM).",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/655/65561551.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Supreme Court of Canada annuls single-vote win in Terrebonne riding",
    "desc": "Bloc candidate Nathalie Sinclair-Desgagné has won her appeal of the single-vote loss.",
    "image": "https://smartcdn.gprod.postmedia.digital/montrealgazette/wp-content/uploads/2025/10/liberal-bloc-terrebonne.jpg",
    "source": "Montreal Gazette"
  },
  {
    "title": "'I don't care at all' - Man Utd star Matheus Cunha takes aim at the United Strand over haircut stunt in stark 'pressure' admission",
    "desc": "Manchester United star Matheus Cunhas has taken aim at supporter Frank Ilett, also know as The United Strand, and his viral haircut challenge. Ilett has vowed not to cut his hair until the Red Devils win five games in a row and is still waiting to book in a trip to the barber's. Michael Carrick's side had won four on the bounce before heading to West Ham last time out but could not get over the line as they slumped to a 1-1 draw.",
    "image": "https://assets.goal.com/images/v3/bltd21d9c36dad3a1f5/GOAL%20-%20Multiple%20Images%20-%202%20Split%20-%20Facebook(38).jpg",
    "source": "Goal.com"
  }
]