[
  {
    "title": "Girl, 6, given weeks to live after 'arm sprain' turns out to be cancer",
    "desc": "A little girl whose arm pain was dismissed as a sprain has been given just weeks to live after her symptoms turned out to be a rare form of cancer.",
    "image": "https://www.nwemail.co.uk/resources/images/20488950.jpg?type=og-image",
    "source": "NW Mail"
  },
  {
    "title": "O'Neill may not attend White House for St Patrick's Day",
    "desc": "Northern Ireland First Minister Michelle O'Neill has said that she may not attend St Patrick's Day events in the White House again this year.",
    "image": "https://www.rte.ie/images/0023d4c8-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Where Winds Meet 1.3 ‘Spring’s Bliss’ update: Release date, events & more",
    "desc": "Check out the release date for Where Winds Meet 1.3 ‘Spring’s Bliss’ update, full roadmap for this month and more details.",
    "image": "https://assets.khelnow.com/news/uploads/2025/11/lead_pic_sma.jpg",
    "source": "Khel Now"
  },
  {
    "title": "Moody’s raises Israel’s credit outlook",
    "desc": "The international credit ratings agency has noted the improvement in the geopolitical security situation but has kept Israel’s credit rating itself unchanged.",
    "image": "https://res.cloudinary.com/globes/image/upload/t_800X392/v1678220851/direct/shutterstock_1390371902_zqk3nr.jpg",
    "source": "Globes - Israel Business News"
  },
  {
    "title": "Saturday Night Live Marks 1000th Episode Tonight",
    "desc": "The frigid grip of winter has settled across much of the United States, but for fans of live television and comedy, there’s a reason to stay in and keep warm: tonight,…",
    "image": "https://thumbor.evrimagaci.org/atFaz6ED4IN6KTAnkYuI9vgc28I=/1200x0/filters:format(webp):quality(85):sharpen(0.5,0.5,true)/tpg%2Fsources%2F8ade8939-9445-43f9-8990-f9a30128e364.jpeg",
    "source": "Evrim Ağacı"
  },
  {
    "title": "Meet Justice Maame Agyemang, the Ghanaian who rose to Chief Justice in two countries",
    "desc": "Justice Mabel Maame Agyemang, a Ghana-trained lawyer born and bred in Kumasi, has carved an extraordinary judicial career that has seen her rise to the highest judicial office in two different countries.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/290/29045406.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Be measured in your statements - Suhuyini cautions Fifi Kwetey",
    "desc": "A member of the communication team of the National Democratic Congress (NDC), Hamza Suhuyini, has expressed deep concern over recent public comments made by the party’s General Secretary, Fifi Fiavi Kwetey.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/433/43399359.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Mwigulu urges private sector to boost Tanzania’s global tourism",
    "desc": "She highlighted that films such as The Royal Tour and Amazing Tanzania have significantly increased Tanzania’s global visibility.",
    "image": "https://www.thecitizen.co.tz/resource/image/5344834/landscape_ratio3x2/1200/800/94912fd6590d433f0d4b43890ff71a2c/eg/mwigulu-2.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "[PHOTOS] Ruto at PEFA Gospel Church Gikomba for Sunday service",
    "desc": "Ruto was received by Kamukunji Member of Parliament Yusuf Hassan.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/dc896d6c-35b7-4dea-a22d-a3c21ec5267d.jpeg?1769948075538",
    "source": "the-star.co.ke"
  },
  {
    "title": "A Doctor Who Studies Metabolism Made 3 Changes to His Daily Routine",
    "desc": "Dr. Adam Perlman prioritizes strength training, sleep, and a low-sugar diet to boost his metabolic health.",
    "image": "https://i.insider.com/697a516ee1ba468a96aadf7e?width=1200&format=jpeg",
    "source": "Business Insider"
  }
]