[
  {
    "title": "VP Opoku-Agyemang, Hanna Tetteh, Martha Pobee named among 2025 100 Most Influential African Women",
    "desc": "Vice President H.E. Naana Jane Opoku-Agyemang has been ranked among the 2025 100 Most Influential African Women by Avance Media.\nThe annual...",
    "image": "https://www.businessghana.com/site/img/../../cms/img/news/2026-02-02-150240003.jpg",
    "source": "BusinessGhana"
  },
  {
    "title": "Jessica Chastain, Chris Pine to Lead MeToo Drama 'This Is Pleasure'",
    "desc": "Adapted from Mary Gaitskill's novella and launching at the EFM, 'This Is Pleasure' is being directed by Shari Springer Berman and Robert Pulcini.",
    "image": "https://variety.com/wp-content/uploads/2026/02/chastain-pine.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "New genetic tools offer more accurate breast cancer prediction for women of African ancestry",
    "desc": "Researchers at the University of Chicago Medicine have developed a set of polygenic risk score (PRS) models that significantly improved the ability to predict breast cancer risk in women of African ancestry. Using genetic data from more than 36,000 women, the team created the most comprehensive breast cancer prediction tool for this historically underserved population.",
    "image": "https://www.newswise.com/android-icon-192x192.png",
    "source": "Newswise"
  },
  {
    "title": "The 'cruel' serial killer who hated women",
    "desc": "Steve Wright's admission that he murdered Victoria Hall confirms he killed six women over a seven-year period.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/a913/live/e6e902c0-effd-11f0-b5f7-49f0357294ff.jpg",
    "source": "BBC"
  },
  {
    "title": "Green hydrogen production at Nordex Electrolyzers made more reliable with VEGA measurement technology",
    "desc": "HazardEx - for safety, health and hazardous area professionals.",
    "image": "https://www.hazardexonthenet.net/global/showimage.ashx?Type=Article&ID=236662&Min=200",
    "source": "HazardEx"
  },
  {
    "title": "Galaxy Z TriFold quickly sells out in the United States, surprising no one",
    "desc": "Samsung's Galaxy Z TriFold has quickly sold out in the United States after launch, which was to be expected. - SamMobile",
    "image": "https://www.sammobile.com/wp-content/uploads/2025/12/Galaxy-Z-TriFold-Samsung-apps-1200x676.jpg",
    "source": "SamMobile"
  },
  {
    "title": "The Fall of Sir Douglas Weatherford review - Peter Mullan gives weight to quirky Scottish dramedy",
    "desc": "The formidable Mullan delivers a tender performance in Sean Robert Dunn’s first feature, playing a cranky local historian obsessed with his obscure, unscrupulous ancestor",
    "image": "https://i.guim.co.uk/img/media/27b37b55df4f9443f9c8088c06810c5d3aaddd34/1_0_1800_1440/master/1800.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTMucG5n&enable=upscale&s=4c06e50b7181e76ca3f53bdcd7836ca0",
    "source": "The Guardian"
  },
  {
    "title": "Urgent HSE holiday warning as highly infectious virus spreads across Europe",
    "desc": "The HSE has issued urgent advice for Irish holidaymakers as health officials monitor a fast spreading infection across Europe.",
    "image": "https://i2-prod.irishmirror.ie/article35287916.ece/ALTERNATES/s1200/4_dublin-airport-departures-stock.jpg",
    "source": "Irish Mirror"
  },
  {
    "title": "EvolveHQ earns ACTD accreditation, aligning its Tech & AI Training with international standards",
    "desc": "EvolveHQ, a Nigeria-based leading EdTech academy focused on developing globally competitive tech talent, has earned accreditation from the American Council of Training and Development (ACTD), a U.S.-based professional body that sets standards for workforce training and professional development.",
    "image": "https://c76c7bbc41.mjedge.net/wp-content/uploads/tc/2026/02/image-1.jpeg",
    "source": "TechCabal"
  },
  {
    "title": "Everything about Honkai Star Rail 4.0: Release date, timings, and more",
    "desc": "Esports News: Honkai Star Rail is all charged up for its much-anticipated 4.0 version, as it is about to finally make its arrival. The developers have announced via.",
    "image": "https://static.toiimg.com/thumb/msid-127865932,width-1280,height-720,imgsize-2341986,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  }
]