[
  {
    "title": "Ogun govt moves to transform printing corporation, enhance service delivery",
    "desc": "The Ogun State Government has announced plans to revamp its state-owned Printing Corporation to enhance the distribution of",
    "image": "https://cdn.guardian.ng/wp-content/uploads/2026/01/Governor-Dapo-Abiodun.webp",
    "source": "The Guardian Nigeria News"
  },
  {
    "title": "Colorectal cancer is increasing among young people, as James Van Der Beek’s death reminds us - cancer experts explain ways to decrease your risk",
    "desc": "Learn about the rising colorectal cancer rates in young people and discover ways to reduce your risk.",
    "image": "https://th-i.thgim.com/public/incoming/qtt0os/article70634958.ece/alternates/LANDSCAPE_1200/AFP_974C663.jpg",
    "source": "The Hindu"
  },
  {
    "title": "Cesc Fabregas tells Alvaro Morata to 'change careers' after Chelsea flop sent off for Como",
    "desc": "Cesc Fabregas launched a stunning rant towards Como striker Alvaro Morata on Saturday after the Spaniard picked up two yellow cards in two minutes to see his marching orders in his side's 2-1 defeat to Fiorentina. Morata had been introduced as a second-half substitute but lost his cool to pick up two rapid bookings as his side searched for an equaliser, leading to harsh criticism from Fabregas, who suggested the striker should \"change careers\".",
    "image": "https://assets.goal.com/images/v3/getty-2261620959/crop/MM5DEOJZGI5DCNRYGM5G433XMU5DAORQ/GettyImages-2261620959.jpg",
    "source": "Goal.com"
  },
  {
    "title": "How affordability is reshaping retirement plans in Ontario",
    "desc": "For decades, Dave Scott thought he had done everything right.\nAt age 69, Scott and his wife — are both retired and living in Peterborough Ont.",
    "image": "https://www.cp24.com/resizer/v2/62EJYGDESZFO5EZCWCI7QUK2TQ.jpg?smart=true&auth=ab530dbc980e2f85925200d3d2942ede60c2ad8203de1b85752045df27b19ac1&width=1200&height=630",
    "source": "CP24"
  },
  {
    "title": "Startup Nation Central laying off most employees",
    "desc": "SNC interim CEO Aviva Steinberger: By sharpening our focus and aligning resources with today’s most strategic needs, we will continue to serve the ecosystem in meaningful and impactful ways.",
    "image": "https://res.cloudinary.com/globes/image/upload/t_800X392/v1641154729/direct/shutterstock_735900559_qohbsb.jpg",
    "source": "Globes"
  },
  {
    "title": "Tabora concrete poles project 95pc complete, set to boost power network",
    "desc": "The national electricity utility’s managing director, Mr Lazaro Twange, said the project is progressing well and, once completed, will have the capacity to produce 120 poles per day, enabling...",
    "image": "https://www.thecitizen.co.tz/resource/image/5360144/landscape_ratio3x2/1200/800/2aa0db81426198a02068d314f9c9124a/SA/tabora-1.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "China's humanoid robot Robotera L7 performs stunning sword dance",
    "desc": "Chinaese rnbot maker Robotera's L7 humanoid robot has just showcased its advanced control sytems by performing a traditional sword dance.",
    "image": "https://cms.interestingengineering.com/wp-content/uploads/2026/02/Robotera-L7.jpg",
    "source": "Interesting Engineering"
  },
  {
    "title": "Fulguris Browser Sessions Outshine Chrome On Android",
    "desc": "A lesser‑known Android browser is turning heads for a deceptively simple advantage that power users will appreciate every single day. Fulguris, an",
    "image": "https://www.findarticles.com/wp-content/uploads/2026/02/fulguris_edited_1771153515.png",
    "source": "findarticles.com"
  },
  {
    "title": "Your next phone needs this new tech to stop it ruining your sunset photos",
    "desc": "Today's best camera phones come sporting LOFIC image sensors, but what is it, and how does it actually improve your pictures?",
    "image": "https://www.androidauthority.com/wp-content/uploads/2025/12/realme-GT8-Pro-with-square-camera-bump.jpg",
    "source": "Android Authority"
  },
  {
    "title": "AMH and AFC Do Not Predict Embryo Euploidy",
    "desc": "Find out more abut how AMH and AFC levels do not independently predict embryo euploidy in patients undergoing IVF.",
    "image": "https://www.emjreviews.com/wp-content/uploads/2026/02/9am-repro.jpg",
    "source": "European Medical Journal"
  }
]