[
  {
    "title": "Why Mercedes now looks vulnerable in engine trick row",
    "desc": "Until a week ago, Mercedes was confident its engine compression ratio trick would stand. Now the tide might have turned against it and towards a rule change",
    "image": "https://www.the-race.com/content/images/size/w1200/2026/02/XPB_1394082_HiRes.jpg",
    "source": "The Race"
  },
  {
    "title": "Types of Vegetation in the Mount Kenya Nature Reserve",
    "desc": "The vegetation in Mount Kenya is quite diverse. The lower vegetation belt of Mount Kenya, is composed mainly of mountain rainforests. Above that forest, lines the vegetation belt of the Podocarpus forest, above which, is also located in the Bamboo area. The Hagenia Forest, grows also between the Bamboo area, and also the forest line. Above the forest line, which is located at elevations of around 3400 m ASL, grows in Mount Kenya an Erica shrub-land. The vegetation above that Erica shrub-land, is of an Afro-Alpine moorland, which lines mainly, in elevations of between 3500 m - 4200 m ASL. From elevation of 4200 m ASL upwards, are also located the higher areas in Mount Kenya, where their vegetation is relatively dilute. The peaks of Mount Kenya reach heights of around 5000 m ASL.",
    "image": "https://file.scirp.org/image/oje2016062314400387.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Use Conflicts in the Bamboung Marine Protected Area (Fatick, Senegal)",
    "desc": "Against a backdrop of restrictions on the exploitation of fishery resources in the Bamboung Marine Protected Area (BMPA) established in village territories, this study analyses the characterisation of conflicts between the various stakeholders around this Marine Protected Area (MPA) in Senegal. The methodological approach consisted of semi-structured surveys of specific socio-professional categories and local administrative services, and the surveys were carried out on a sample of 100 people. The surveys focused on the socio-economic structure of the respondents and the relationships that exist between these different groups of players, the players involved in the governance of natural resources in the area, the types of conflicts that exist and the methods used to resolve them around the BMPA. The results showed a predominance of fishermen (35%) and women processors (29%) in the study area. The devastation of food crops (33%) and land conflict (22%) are the most important sources of conflict over natural resources, according to surveys. This devastation of crops is mainly caused by wildlife, and the main wildlife species responsible for the damage are monkeys, granivorous birds, baboons and warthogs. The spatial distribution of these species varied significantly between villages (p-value < 0.001). The study also revealed that 49% of women were completely unaware of the process for selecting members of the management committee, while 51% of men felt that there was no transparency in the process. In addition, 40% of the conflicts surrounding the management committee were linked to noncollegial decision-making, with the chairman often imposing decisions without prior consultation of committee members, and 22% of respondents complained of poor distribution of the resources generated by the management of the Keur Bamboung camp. The dispute resolution body most often called upon was the traditional authority in the villages, demonstrating the effectiveness of this body as a means of regulation. However, conflicts relating to land and wildlife remain unresolved sources of conflict in the area. These results underline the need to strengthen the power of local authorities to deal more effectively with these conflicts surrounding the BMPA.",
    "image": "https://file.scirp.org/image/oje2016062314400387.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "When recurrent fever isn’t malaria, think lupus -Dr Dedeke, rheumatologist",
    "desc": "Lupus, often called “the disease with a thousand faces”, remains one of the most misunderstood illnesses in Nigeria. Dr Ibukun Dedeke,",
    "image": "https://tribuneonlineng.com/wp-content/uploads/2026/02/Dr-Dedeke.jpg",
    "source": "Tribune Online"
  },
  {
    "title": "'Uncle, you are a hero': Man praised for helping US tourist after run-in with rude fruit seller in Chinatown",
    "desc": "A fruit stall seller has come under fire for her rude behaviour, following a viral post made by an American tourist in Singapore.The tourist, who goes by Sophisticated_beauty_868 on Instagram, posted a video on Tuesday (Feb 10), with the caption: \"Among Singapore. Beautiful city, lies a Beast. Welcome to Chinatown. Highly unrecommended.\"It is not clear when the video was taken.The...",
    "image": "https://media.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/fruitsellerchinatown.jpg?itok=6xTjGxdb",
    "source": "AsiaOne"
  },
  {
    "title": "'Being woke is one thing, but ... ':SC flays makers of 'Ghooskhor Pandat'; directs title change",
    "desc": "News News: NEW DELHI: Supreme Court on Thursday reprimanded the makers of the Netflix film \\\"Ghooskhor Pandat\\\" and directed them to change the title, saying it wa.",
    "image": "https://static.toiimg.com/thumb/msid-128244604,width-1280,height-720,imgsize-1301528,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Police investigate suspected arson at Alpha Hour church auditorium",
    "desc": "The Accra Regional Police Command has launched an investigation into a suspected arson incident at the auditorium of Grace Mountain Ministry, led by Alpha Hour convener Pastor Elvis Agyemang.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/669/66914928.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Don't sideline Kumasi by downgrading Suame Interchange - Former MCE to NDC",
    "desc": "With the government’s decision to reduce the Suame Interchange Project from its original four-tier design, former Municipal Chief Executive (MCE) for Suame, Maxwell Ofosu Boakye, has stated that the review cannot be accepted.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/952/95262808.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Crocodile attacks and drags boy (3) into river; mission to locate victim's body underway",
    "desc": "IN a heart-rending incident, a three-year-old boy was attacked and killed by a crocodile while on a riverbank with his mother and siblings, who were fishing. Police confirmed the incident that occurred Tuesday in Jambezi, Matebeleland province. “The ZRP reports a sad incident where a three-year-old boy was attacked and dragged into the Matetsi River […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/08/13165408/crocodile.jpg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "'Maintain NAPO just as Akufo-Addo maintained Bawumia 3 times' - Anti Asamoah",
    "desc": "Chairman Akwasi Anti Asamoah, a former Fomena Constituency Chairman of the New Patriotic Party (NPP), has called on the party’s leadership to retain Dr Matthew Opoku Prempeh as the running mate to Dr Mahamudu Bawumia for the 2028 general elections.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/125/12592932.jpg",
    "source": "GhanaWeb"
  }
]