[
  {
    "title": "BREAKING: Tinubu Removes Scandal-Tainted IGP Kayode Egbetokun Amid Jubilation At Police Headquarters, Tunji Disu To Take Over",
    "desc": "BREAKING: Tinubu Removes Scandal-Tainted IGP Kayode Egbetokun Amid Jubilation At Police Headquarters, Tunji Disu To Take Over",
    "image": "https://saharareporters.com/themes/custom/octavia_sahara/favicon.ico",
    "source": "Sahara Reporters"
  },
  {
    "title": "New York City’s Homeless Population Endures Another Dangerous Storm",
    "desc": "Mayor Zohran Mamdani said on Monday that his administration had taken lessons from the city’s last storm, when at least 20 people died after exposure to the cold.",
    "image": "https://static01.nyt.com/images/2026/02/23/multimedia/23winter-storm-homeless-pchz/23winter-storm-homeless-pchz-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Afghan Education Strengthened Through UNESCO Support to NGOs",
    "desc": "Twenty staff members from education-focused NGOs in Afghanistan have successfully completed advanced training in monitoring, evaluation, and learning (MEL) organized by UNESCO, equipping them to train other education providers across the country. The program addresses a critical gap in Afghanistan’s education sector, where many NGOs struggle to systematically monitor performance, adapt programs based on evidence,",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "Epidemic and emerging disease alerts in the Pacific as of 24 February 2026",
    "desc": "Map in English on World and 12 other countries about Health and Epidemic; published on 24 Feb 2026 by SPC",
    "image": "https://reliefweb.int/sites/default/files/styles/large/public/previews/f0/43/f043930d-15b6-4566-904b-ae9f03c8fd98.png",
    "source": "ReliefWeb"
  },
  {
    "title": "Govt-Owned Firm to Acquire Controlling Stake in Pakistan National Shipping Corporation",
    "desc": "The Pakistan National Shipping Corporation (PSX: PNSC) has disclosed that it has received formal communication regarding a proposed acquisition of its",
    "image": "https://propakistani.pk/wp-content/uploads/2020/02/What-we-know-about-PNSC.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Gold Inches Closer to Rs. 5.5 Lac per Tola After Another Single-Day Increase",
    "desc": "Gold prices in Pakistan increased on Tuesday, as international rates continued to rise even higher than $5,100 per ounce. In the local market, the price",
    "image": "https://propakistani.pk/wp-content/uploads/2025/11/gold-e1764408226993.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "Somali Region Distributes Food Aid to Families in Daawa",
    "desc": "Multi-sectoral team leads ‘Feed Your Brother' initiative across four districts.",
    "image": "https://utfs.io/f/v9D9ylrdiyZgYM8EVO7VcfSm73TO6Fe1xDi204K8vtNakplR",
    "source": "Dawan Africa"
  },
  {
    "title": "Trump said frustrated with limits of military leverage against Iran",
    "desc": "US president reportedly to base strike decision on Witkoff, Kushner’s assessments of Tehran’s intentions after Thursday talks; Iran says protesting students must respect 'red lines'",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/02/AP26054566795512-e1771929060832.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Premier League top five race: State of play for Man Utd, Chelsea, Liverpool and Aston Villa",
    "desc": "The race for the Champions League is getting congested with Manchester United and Liverpool claiming wins in recent days whilst rivals Aston Villa and Chelsea dropped points",
    "image": "https://i2-prod.mirror.co.uk/article36771619.ece/ALTERNATES/s1200/0_JS397677387.jpg",
    "source": "The Mirror"
  },
  {
    "title": "Comedian Russell Brand pleads not guilty to further rape, sex assault charges",
    "desc": "LONDON — British actor and comedian Russell Brand pleaded not guilty in a London court on Tuesday to two additional charges of rape and sexual assault allegedly committed against two women nearly two decades ago",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-02/260224-russell-brand-rs-125c4c.jpg",
    "source": "NBC News"
  }
]