[
  {
    "title": "Google and OpenAI complain about distillation attacks that clone their AI models on the cheap",
    "desc": "Google and OpenAI—companies that trained their models on massive amounts of other people's data—are now complaining about theft. But behind the irony lies a real problem: attackers are systematically cloning billion-dollar AI models without spending a dime on training.",
    "image": "https://the-decoder.com/wp-content/uploads/2026/02/ai_model_distill.jpeg",
    "source": "the-decoder.com"
  },
  {
    "title": "Israel marks history but no major wins in first week at 2026 Winter Olympics",
    "desc": "Skeleton's Jared Firestone ends Olympic run in 22nd place, as country's first-ever cross-country skier crosses the finish line second to last at Milano Cortina Games",
    "image": "https://static-cdn.toi-media.com/www/uploads/2026/02/AFP__20260213__97G868N__v2__HighRes__SkeletonOly2026MilanoCortina.jpg",
    "source": "The Times of Israel"
  },
  {
    "title": "Savannah Guthrie’s Husband Michael Feldman Seen For First Time Since Nancy Guthrie's Disappearance | See Photos",
    "desc": "Michael Feldman, husband of \"Today\" host Savannah Guthrie, was seen at a Florida airport with their two children, marking his first public appearance since his mother-in-law, Nancy Guthrie, vanished two weeks ago. Nancy, 84, disappeared from her Arizona home, believed to be a victim of abduction. , US News, Times Now",
    "image": "https://images.timesnownews.com/thumb/msid-153613584,width-1280,height-720,resizemode-75/153613584.jpg",
    "source": "Times Now"
  },
  {
    "title": "Reducing stigma focus of Saskatchewan Sexual Health Awareness Week",
    "desc": "The Government of Saskatchewan is encouraging residents to have open and regular conversations about sexual and reproductive health as part of Sexual and Reproductive Health Awareness Week, running Feb. 8 to 14. Provincial officials say routine discussions with trusted health-care providers can help people make informed decisions, prevent illness and detect potential concerns early, supporting both physical and mental well-being. Mental Health and Addictions, Seniors and Rural and Remote Health Minister Lori Carr said talking openly with a health professional is an important step in maintaining overall wellness. “When people feel comfortable asking questions, it helps reduce stigma, support prevention, early diagnosis and treatment, and contributes to stronger, healthier communities,” Carr said in a statement. googletag.cmd.push(function() { if($(document).width()<900) { s = googletag.defineSlot('/50748803/wco-all-bigbox', [300, 250], 'div-gpt-1632277500385-bbm1'); s.setTargeting('URL', [window.location.pathname]); s.setTargeting('position', [1632277500385]) s.setTargeting('story_id', 'reducing-stigma-focus-of-saskatchewan-sexual-health-awareness-week'); s.addService(googletag.pubads()); googletag.pubads().refresh([s], {changeCorrelator: false}); } }); Health-care providers can offer guidance on topics including contraception, family planning, fertility, pregnancy, menopause and sexually transmitted and blood-borne infections. Officials say regular check-ins and routine discussions help ensure individuals receive appropriate care and access to recommended screenings and preventive services. Residents are encouraged to seek accurate, evidence-based information from qualified health professionals and to support respectful conversations about sexual and reproductive health within their communities. The province says the awareness week aims to reduce stigma, promote informed decision-making and reinforce that sexual and reproductive health is a key part of overall health. More information about services is available through provincial health resources and by speaking with a health-care provider. googletag.cmd.push(function() { if($(document).width()<900) { s = googletag.defineSlot('/50748803/wco-all-bigbox', [300, 250], 'div-gpt-1632277500385-bbm2'); s.setTargeting('URL', [window.location.pathname]); s.setTargeting('position', [1632277500385]) s.setTargeting('story_id', 'reducing-stigma-focus-of-saskatchewan-sexual-health-awareness-week'); s.addService(googletag.pubads()); googletag.pubads().refresh([s], {changeCorrelator: false}); } });",
    "image": "https://dht7q8fif4gks.cloudfront.net/2025-02/health-care-nurses.jpg",
    "source": "WestCentralOnline"
  },
  {
    "title": "Cuban cigar festival called off as US blockade worsens energy crisis",
    "desc": "The annual aficionados' bonanza has been postponed until further notice as shortages affect international travel.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/26a3/live/9158cec0-09d0-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Norwich 3-1 West Bromwich Albion: Canaries into FA Cup last 16",
    "desc": "Norwich City resist a West Bromwich Albion fightback to secure a place in the FA Cup fifth round.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/dac9/live/c730e140-09c6-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "Bawumia Urges NPP to Focus on National Service Over Personal Celebration",
    "desc": "New Patriotic Party (NPP) flagbearer Dr. Mahamudu Bawumia has called on party members to use ongoing national thanksgiving services as moments for prayer and recommitment to national service rather than personal celebration. Speaking at the Muslim thanksgiving service at the National Mosque on Friday, February 13, 2026, Dr. Bawumia said…",
    "image": "https://www.newsghana.com.gh/wp-content/uploads/2024/08/logo-newsghana.png",
    "source": "News Ghana"
  },
  {
    "title": "Parker sack inevitable after Burnley humiliated yet again ahead of more fan 'temper tantrums'",
    "desc": "The only argument to keep Scott Parker as Burnley head down is his lower-league record, so being knocked out of both cups by League One sides is sub-optimal",
    "image": "https://d2x51gyc4ptf2q.cloudfront.net/content/uploads/2026/02/14175908/Burnley-coach-Scott-Parker1.jpg",
    "source": "Football365"
  },
  {
    "title": "USA vs Germany, Winter Olympics, men's ice hockey: When Auston Matthews and Co play next - schedule & how to watch live in the US",
    "desc": "Find out everything you need to know ahead of Auston Matthews & Co's final Group C match on Sunday (15 February) as they continue their gold medal bid at Milano Cortina 2026.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/v1771058544/primary/vdaidsixx3d0thh64m8n",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "The problem with doorbell cams: Nancy Guthrie case and Ring Super Bowl ad reawaken surveillance fears",
    "desc": "Many people bought the devices thinking they would do little more than protect their delivery packages",
    "image": "https://i.guim.co.uk/img/media/171b02714be5222c73ec4e19e8e07ed12643e592/498_0_5021_4016/master/5021.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=004fadbe7e618f09e43197f45ac00ec4",
    "source": "The Guardian"
  }
]