[
  {
    "title": "Nancy Guthrie's family cleared as suspects in her disappearance",
    "desc": "Nancy Guthrie's family members, including her children and their spouses, have been cleared as possible suspects in her abduction as the case enters its third week.",
    "image": "https://live-production.wcms.abc-cdn.net.au/8e9ac609a046ee66aad5eea4f43a5c24?impolicy=wcms_watermark_news&cropH=320&cropW=568&xPos=0&yPos=37&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Welcoming a double blessing",
    "desc": "PETALING JAYA: Celebrating Chinese New Year this year is special for Prof Datuk Dr Taufiq Yap Yun Hin as the lunar new year coincides with the arrival of Ramadan.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/17/3774172.jpeg",
    "source": "The Star"
  },
  {
    "title": "OLYMPIC TRUCE: ‘A call for states to exercise restraint and facilitate humanitarian access’",
    "desc": "CIVICUS speaks with Hugh Dugan of the Truce Foundation, a civil society organisation inspired by the Olympic Truce that promotes Olympic values of excellence, fair play, respect and unity. The foundation has launched the Truce Compliance Index to transform the Olympic Truce into an accountability mechanism, tracking state behaviour during the Olympic Games.",
    "image": "https://lens.civicus.org/wp-content/uploads/2026/02/hugh-dugan2.jpg",
    "source": "civicus lens"
  },
  {
    "title": "Bennett facing major Souths headache after brutal injury — NRL Trials Team Tips",
    "desc": "Bennett facing major Souths headache after brutal injury — NRL Trials Team Tips",
    "image": "https://content.api.news/v3/images/bin/52af68399aabcd98ba93dc60af107f69",
    "source": "fox sports"
  },
  {
    "title": "Teacher Killed in Crash After Man Fled in Car From ICE, Police Say",
    "desc": "The man, who federal officials said had entered the United States illegally, was arrested and charged with first-degree homicide after the crash in Savannah, Ga., according to the county police.",
    "image": "https://static01.nyt.com/images/2026/02/16/multimedia/16nat-ice-crash-tmjw/16nat-ice-crash-tmjw-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Adidas ‘Tang’ jacket: Why the Chinese New Year collection has gone viral",
    "desc": "It’s not the first time the German sportswear giant has riffed on Chinese aesthetics, but the jacket has dropped at a fascinating intersection of identity, internet culture and even geopolitics.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/705548.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Yiadom nets first league goal for Everton U21 in Premier League 2",
    "desc": "Ghanaian youngster Kingsford Boakye-Yiadom scored his first league goal for Everton U21 in the Premier League 2 during their clash against Burnley U21.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Boakye-1-e1771289102234.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "Shah Rukh Khan single-handedly brought chivalry to Bollywood, says Anubhav Sinha: 'Before him, I never saw a hero...'",
    "desc": "Anubhav Sinha used Shah Rukh Khan as an example to show how cinema and actors can bring about a small but significant change in society. | Bollywood",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/16/550x309/anubhav-sinha-srk_1771240837393_1771240837597.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "Met deploys drones and ebikes to help catch adolescent phone thieves",
    "desc": "London police say criminal gangs are using Snapchat to offer cash rewards of up to £380 for stolen iPhones",
    "image": "https://i.guim.co.uk/img/media/f4b451b00d6aff6077c3f7aa3edf061f45b55007/764_0_5840_4672/master/5840.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f145d665658f53dfdbb6ec44af7d3e8d",
    "source": "The Guardian"
  },
  {
    "title": "Ruffa Gutierrez 'one step closer' to master's degree as she successfully defends thesis proposal",
    "desc": "Ruffa Gutierrez is one step closer to obtaining her master’s degree.",
    "image": "https://images.gmanews.tv/webpics/2026/02/rufa_2026_02_17_08_17_59.jpg",
    "source": "GMA Network"
  }
]