[
  {
    "title": "Trump says US needs to make meaningful deal with Iran, cites good talks",
    "desc": "President Donald Trump said on Thursday that the United States had to make a meaningful deal with Iran, citing good talks with the Middle Eastern country.",
    "image": "https://images.gmanews.tv/webpics/2026/02/2026-02-19T145630Z_1157216346_RC21PJAVT8F7_RTRMADP_3_ISRAEL-PALESTINIANS-GAZA-TRUMP-BOARD_2026_02_19_23_24_00.JPG",
    "source": "GMA Network"
  },
  {
    "title": "Inhibitory effect of the methanol extract of Clerodendrum volubile Linn. on carbon tetrachloride-induced early hepatic fibrogenesis: in silico and in vivo study",
    "desc": "Liver disease remains a significant public health problem, claiming several lives globally every year. All forms of liver disease, irrespective of the cause, lead to liver fibrosis if they persist. Liver fibrosis ends up in liver cirrhosis and creates a microenvironment that enhances the development of hepatocellular carcinoma. Clerodendrum volubile is a food and medicinal plant consumed to manage several diseases, including liver diseases. Liver fibrosis was induced in Wistar rats with carbon tetrachloride (CCl4 Olive oil 1:1) for nine weeks and treated with the extract from weeks 7–9. The activities of liver function markers (ALT, AST, Total and indirect bilirubin), antioxidant enzymes (GSH, SOD, Gpx), level of lipid peroxidation and histopathological lesions were assessed. In silico method was used to investigate the binding affinity of C. volubile-derived phytochemicals to cytochrome 450 2E1. The extract significantly (p < 0.05) reduced CCl4-induced ALT, AST, bilirubin and lipid peroxidation, increased the activity (p < 0.05) of GSH, SOD and Gpx, and ameliorated CCl4-induced hepatic lesions and collagen deposition. In the in silico study, four C. volubile-derived phytochemicals showed significant binding affinity with CYP2E1, with Phytol showing the best and most stable binding. The study thus predicted the potential of C. volubile to inhibit liver fibrogenesis via antioxidative and anti-CYP2E1 effects.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "New study assesses geoengineering marine ecosystem risks, knowledge gaps",
    "desc": "Environmental science and conservation news",
    "image": "https://imgs.mongabay.com/wp-content/uploads/sites/20/2026/02/19044926/7-Image-5-1536x642-1.jpg",
    "source": "news - Mongabay"
  },
  {
    "title": "Afghanistan bow out of T20 World Cup 2026 with thumping win over Canada",
    "desc": "Zadran bags Player of the Match award for blistering half-century",
    "image": "https://www.geosuper.tv/assets/uploads/updates/2026-02-19/l_53621_100536_updates.jpg",
    "source": "Geo Super"
  },
  {
    "title": "Endurance Boosts Driven by Brain Cells Post-Exercise",
    "desc": "When you finish a run, your muscles may feel like they did all the work. But researchers at The Jackson Laboratory (JAX) and the University of",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1573511860302-28c524319d2a%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1170%26amp%3Bq%3D80",
    "source": "Mirage News"
  },
  {
    "title": "Leicester appeal six-point deduction as Premier League push for harsher sanctions",
    "desc": "Leicester City have officially moved to appeal their six-point deduction for breaching Profit and Sustainability Rules. However, the Premier League has launched a counter-appeal, seeking even stricter punishments for the Foxes' financial conduct.",
    "image": "https://assets.goal.com/images/v3/getty-2261641452/crop/MM5DKMBTHE5DEOBTGQ5G433XMU5DAORSGM4Q====/GettyImages-2261641452.jpg",
    "source": "Goal.com"
  },
  {
    "title": "SME Lender at Aceli Africa Uganda Stakeholder Roundtable",
    "desc": "Pearl Bank has been named Best Agri-SME Lender at the Aceli Africa Uganda Stakeholder Roundtable, with the bank’s Supervisor – Agriculture & Partnerships, Julius Akais, earning the Agri-SME Lending Champion award. The recognition celebrates Pearl Bank’s significant contribution to agricultural financing in Uganda. Related Stories Female DJ Duo Mysterious2 Electrify Stanbic Matchplay Party Museveni […]",
    "image": "https://softpower.ug/wp-content/uploads/2026/02/18f28d2e-03bf-465a-bba4-aad7a99c26b8.jpg",
    "source": "SoftPower News"
  },
  {
    "title": "Rwanda: Kivumbi King Admits Hip-Hop Award Controversy 'Understandable'",
    "desc": "Musician Kivumbi King has said he understands -- and partly agrees with -- the criticism from fellow artistes regarding his Hip-Hop Artist of the Year win at the 2025 Isango na Muzika Awards.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Trump repeats claim of 'stopping' India-Pak war with new twist: '11 expensive jets shot down'",
    "desc": "Speaking at his Board of Peace event, Trump once again brought back his claim of warning both countries using trade deals as leverage.| India News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/19/550x309/ISRAEL-PALESTINIANS-GAZA-TRUMP-BOARD-34_1771514398336_1771514425568.JPG",
    "source": "Hindustan Times"
  },
  {
    "title": "Ga Mantse in stable condition after gory Tuesday accident - Palace reveals",
    "desc": "Ga Mantse in stable condition after gory Tuesday accident – Palace reveals",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-19-at-14.05.11-1.jpeg",
    "source": "MyJoyOnline"
  }
]