[
  {
    "title": "'Will Dominate The Sea In 2026': Pahalgam Mastermind Issues 26/11-Type Attack Threat | Exclusive",
    "desc": "Saifullah Kasuri, deputy chief of LeT, accused India of “water terrorism” & threatened that pressure on Kashmir will be met with unrest elsewhere, including in Balochistan",
    "image": "https://images.news18.com/ibnlive/uploads/2026/02/Kasuri-2026-02-a38a396c721ce6b1d76ed86df754c93f-16x9.jpg",
    "source": "News18"
  },
  {
    "title": "Ethio telecom Accelerates Digital Transformation with teleStream and Zero",
    "desc": "Ethio telecom launches teleStream and Zero-Touch Broadband under its NEXT HORIZON 2028 strategy, boosting digital inclusion and fiber connectivity in Ethiopia.",
    "image": "https://www.telecomreviewafrica.com/wp-content/uploads/2026/02/Ethio-telecom-Accelerates-Digital-Transformation-with-teleStream-and-Zero-Touch-Broadband.jpg",
    "source": "Telecom Review Africa"
  },
  {
    "title": "Utah judge declines to disqualify prosecutors in Charlie Kirk killing case",
    "desc": "A judge has decided to keep prosecutors on the case of conservative activist Charlie Kirk's killing in Utah.",
    "image": "https://dims.apnews.com/dims4/default/9e0147c/2147483647/strip/true/crop/3000x1999+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F8f%2F2e%2Fcda0d46d50d1ee17213c6e6c15f5%2F34da74cf57384e32949fce814c0991e2",
    "source": "AP News"
  },
  {
    "title": "Mexican Forces Say They Tracked El Mencho to Cabin by Following His Lover",
    "desc": "Top security officials revealed details of the operation that led to the death of Mexico’s most wanted drug cartel leader.",
    "image": "https://static01.nyt.com/images/2026/02/23/multimedia/23mexico-carteloperation1-ctwj/23mexico-carteloperation1-ctwj-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "5 Nice-To-Have Tools At Home To Upgrade Your Lifestyle",
    "desc": "Proof that not all hype is trash! These 6 viral Shopee & Lazada finds are the real MVPs, making your daily life smoother, cleaner, and way more aesthetic.",
    "image": "https://media.says.com/2026/01/cover-image-7.png",
    "source": "says.com"
  },
  {
    "title": "Federation as Shield: How Eritrea’s Re-Union with Ethiopia Protected It from the United Kingdom’s Partition Scheme",
    "desc": "In the aftermath of World War II, Eritrea found itself at the crossroads of colonial ambitions in the Horn of Africa, with Britain wielding considerable influence over its destiny to advance strategic imperatives that often-undermined local unity. Following the ousting of Italian forces from East…",
    "image": "https://hornreview.org/storage/2026/02/ቪቲንሀንከ-ፔድሪ-ለክርክር-አቅርቧል-የስፖርትሜዳ-የክርክር-መድረክ-2026-02-24T073117.466.png",
    "source": "horn review"
  },
  {
    "title": "KP CM announces Rs200bn Hazara development package",
    "desc": "Khyber Pakhtunkhwa Chief Minister Sohail Afridi has announced a special development package worth Rs200 billion for Hazara Division. The announcement was made during a",
    "image": "https://www.nation.com.pk/digital_images/large/2026-02-24/kp-cm-announces-rs200bn-hazara-development-package-1771918471-3276.png",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "US agreement for assessing rare earth, mineral investments does not affect state revenues — deputy minister",
    "desc": "Clause 5.2.3 of the Malaysia-US trade agreement, which sets up a joint mechanism to assess foreign investments in rare earths and critical minerals, does not directly affect state revenues, including royalties or land premiums.",
    "image": "https://assets.theedgemarkets.com/rare_earth_08082025_reuters_2_1.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "R Ashwin’s explosive warning before England clash: ‘If Pakistan are serious about their campaign’",
    "desc": "Cricket News: NEW DELHI: Veteran off-spinner Ravichandran Ashwin has stirred debate at the ICC T20 World Cup 2026 after urging Pakistan to make a bold selection cal.",
    "image": "https://static.toiimg.com/thumb/msid-128744173,width-1280,height-720,imgsize-213240,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "HBO Max Continues Rollout With 12 Asia Pacific Launches",
    "desc": "HBO Max is continuing its global rollout by debuting in 12 Asia Pacific markets.",
    "image": "https://deadline.com/wp-content/uploads/2026/02/HBO-Max_Brand-Quilt_Credit-HBO-Max.jpg?w=1024",
    "source": "Deadline"
  }
]