[
  {
    "title": "Lee Zii Jia cracks world’s top 80 after ending 10‑month winless streak as Malaysian squad posts multiple rankings gains",
    "desc": "KUALA LUMPUR, Jan 27 — Professional men’s singles shuttler Lee Zii Jia has broken into the world’s top 80, according to the latest Badminton World Federation (BWF) world...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/01/27/322337.JPG",
    "source": "Malay Mail"
  },
  {
    "title": "Palestinian Man Injured in Colonizer Attack in Qusra",
    "desc": "A Palestinian man was injured on Tuesday morning after illegal paramilitary Israeli colonizers assaulted him in the village of Qusra, south of Nablus in the ...",
    "image": "https://imemc.org/wp-content/uploads/2026/01/colonizers-e1768432755219.jpg",
    "source": "imemc.org"
  },
  {
    "title": "AFC Women’s Asian Cup Australia 2026: KPop Demon Hunters star Audrey Nuna to perform in Perth on March 1",
    "desc": "The one-off show will kick-off a celebration of sport, music and culture in WA.",
    "image": "https://images.perthnow.com.au/publication/C-21435702/99e16421ac66a29e9153e02a0ca23721f5e2a05b-16x9-x0y1w1640h923.jpg?imwidth=1200",
    "source": "perthnow.com.au"
  },
  {
    "title": "Brighton pay devastating tribute as women's coach passes away after cancer battle",
    "desc": "BRIGHTON have announced that women and girls' coach Rado Vidosic has passed away at the age of 64.\nRado is also the father of women's first team...",
    "image": "https://www.thesun.co.uk/wp-content/uploads/2026/01/crop-38031821.jpg?quality=90&strip=all&w=1920&h=1080&crop=1",
    "source": "The Sun"
  },
  {
    "title": "Today in History: Ghanaians punished Akufo-Addo for his stance on Anti-Gay Bill - Speaker",
    "desc": "Speaker of Parliament, Rt Hon Kingsford Sumana Alban Bagbin, in January 2025, stated that one of the reasons the New Patriotic Party (NPP) lost the 2024 General Election was due to former President Nana Addo Dankwa Akufo-Addo’s position on the...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/627/62761595.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "No work, no pay? Bato Dela Rosa faces possible salary suspension",
    "desc": "The pay of Sen. Bato Dela Rosa may be withheld following his prolonged absence, according to Senate President Pro Tempore Ping Lacson on Tuesday, January 27.",
    "image": "https://media.philstar.com/photos/2026/01/27/bato-dela-rosa-2_2026-01-27_18-10-34.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "Meatco delivers 62 permanent jobs at Katima abattoir …improved infrastructure, elevated farmers training",
    "desc": "Meatco’s Northern Communal Area (NCA) subsidiary, Meatco NCA, continues to play a strategic role in strengthening livestock value chains and supporting commun",
    "image": "https://neweralive.na/wp-content/uploads/2026/01/Meatco-2.gif",
    "source": "neweralive.na"
  },
  {
    "title": "Domestic economy expected to grow faster in 2026 - EAN",
    "desc": "The domestic economy is expected to grow faster in 2026, but the Economic Association of Namibia (EAN) has cautioned that the improvement may still fall short o",
    "image": "https://neweralive.na/wp-content/uploads/2026/01/Economy.jpg",
    "source": "neweralive.na"
  },
  {
    "title": "AMLA launches data collection exercise to test risk assessment models for the financial sector",
    "desc": "On 26 January 2026, the EU Authority for Anti-Money Laundering and Countering the Financing of Terrorism (AMLA) announced that it was launching a data",
    "image": "https://www.regulationtomorrow.com/wp-content/uploads/sites/12/2024/02/Blog-Network-Meta-Image_1.png",
    "source": "Global Regulation Tomorrow"
  },
  {
    "title": "January Update 1.13.0",
    "desc": "ARC Raiders is a multiplayer extraction adventure, set in a lethal future earth, ravaged by a mysterious mechanized threat known as ARC.",
    "image": "https://storage.googleapis.com/web-arc-raiders-cms-assets/temp/social/arc-raiders-social.png",
    "source": "ARC Raiders"
  }
]