[
  {
    "title": "Comet Wierzchos Vaults Into the March Evening Sky",
    "desc": "It seems that the southern hemisphere gets all the good comets. A bashful binocular comet is about to finally leave its southern perch, and briefly come into view for folks up north. Said comet of the moment is C/2023 E1 Wierzchos. Although the comet just passed perihelion last week, it should put on a fine encore show as it heads north in March at dusk.",
    "image": "https://www.universetoday.com/article_images/917_2024E1_14_02_20260224_192052.jpg",
    "source": "Universe Today"
  },
  {
    "title": "Toronto General Hospital has been ranked second-best in the world",
    "desc": "It has moved up a spot since last year, placing just behind Rochester, Minn.-based Mayo Clinic",
    "image": "https://www.theglobeandmail.com/resizer/v2/QSZMZSQEZFA6VCGOXTZHUQCOBQ.jpg?auth=674e864c0e8aa911ab11b8d8d5db939fa05070cdb1564860971a0e7d50364e3b&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "PSNI created detailed profile of journalist, court told",
    "desc": "The PSNI created a detailed profile of Belfast journalist Vincent Kearney, including details of his wife and mother-in-law, as part of an unlawful campaign of monitoring, a tribunal has been told.",
    "image": "https://www.rte.ie/images/00202af2-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Amelia Kerr makes dream start to New Zealand captaincy era with special all-round show",
    "desc": "NZW vs ZIMW, 1st T20I: Amelia Kerr delivered a stunning all-round performance on Wednesday, smashing a 51-ball century and returning figures of 4-0-14-2 as New Zealand defeated Zimbabwe by 92 runs at Seddon Park in Hamilton.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/amelia-kerr-252201774-16x9_0.jpg?VersionId=6XL7v.R.SSP1kUX8hvAWoAEI.vkn_FP_",
    "source": "India Today"
  },
  {
    "title": "Trump announces new retirement accounts for Americans without 401(k) plans. Here's what to know.",
    "desc": "About 50 million workers lack access to employer-sponsored retirement plans, a hurdle to setting aside money for old age.",
    "image": "https://assets2.cbsnewsstatic.com/hub/i/r/2026/02/25/79b3ffd7-11d8-4894-837f-ad6102c1fc03/thumbnail/1200x630/b4009715bba33458e40dcdc5959463cd/cbsn-fusion-trump-calls-democrats-crazy-in-combative-state-of-the-union-address-thumbnail.jpg",
    "source": "CBS News"
  },
  {
    "title": "Report: Hezbollah Will Not Intervene if U.S. Carries Out 'Limited' Strikes on Iran, Source Says",
    "desc": "Netanyahu: 'Israel Is Stronger Than Ever and India Is Stronger Than Ever'. Indian Prime Minister Narendra Modi Arrives to Address Knesset Plenary. Opposition Will Attend Modi's Speech, Boycott Knesset Speaker",
    "image": "https://img.haarets.co.il/bs/0000019c-92c7-d930-ad9f-f6f7c6c90000/90/a0/0309578e4ec9ac722fb4783a3011/final-desktop.png?precrop=1000,581,x0,y0&width=1200&height=630&cmsprod",
    "source": "Haaretz"
  },
  {
    "title": "Smash Mouth makes surprise appearance at Tel Aviv's Barby",
    "desc": "Smash Mouth made a surprise appearance at Tel Aviv’s Barby club as part of a secret concert series, defying the trend of artists boycotting Israel and drawing an enthusiastic crowd.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/708299",
    "source": "The Jerusalem Post"
  },
  {
    "title": "Gold consolidates as investors weigh US tariffs, Iran talks and Fed outlook",
    "desc": "Gold (XAU/USD) stages a modest rebound on Wednesday, trimming part of the previous day’s losses as fresh uncertainty over US trade policy and lingering geopolitical tensions in the Middle East continue to underpin safe-haven demand.",
    "image": "https://editorial.fxsstatic.com/images/i/gold-march-01_Medium.jpg",
    "source": "FXStreet"
  },
  {
    "title": "Van Cleef & Arpels’s Dance Reflections Festival Returns to New York With Postmodern Classics and Of-the-Moment Imports",
    "desc": "Dance Reflections by Van Cleef & Arpels, a three-week festival taking place across New York, features a feast of work drawn from various places and decades—all part of an expansive vision set forth by Serge Laurent, the jewelry house’s director of dance and culture programs.",
    "image": "https://assets.vogue.com/photos/699da7874aeba6883c282b9b/16:9/w_1280,c_limit/Dancing_with_Bob_traveloguec_Ben_McKeown_courtesy_of_the_American_Dance_Festival-105.png",
    "source": "Vogue"
  },
  {
    "title": "Sensor Tower State of Gaming: Gaming drove $94 Billion in revenue in 2025; downloads reached 52 Billion",
    "desc": "/PRNewswire/ -- Sensor Tower, a leading provider of data on the digital economy, today released its annual State of Gaming report for 2026. The report, which...",
    "image": "https://mma.prnewswire.com/media/2865009/Sensor_Tower_Logo.jpg?p=facebook",
    "source": "PR Newswire"
  }
]