[
  {
    "title": "VIDEO: Miss of the season?! Cole Palmer somehow blazes over from point-blank range in dying moments of Chelsea's draw with Leeds",
    "desc": "Chelsea talisman Cole Palmer somehow managed to miss a golden chance to score a late winner for the Blues against Leeds on Tuesday in the Premier League. The visitors came back from 2-0 down to secure a point against Liam Rosenior's side, but it could have been a different story if Palmer had managed to find the back of the net in stoppage time at Stamford Bridge.",
    "image": "https://assets.goal.com/images/v3/blt1962c363bdcee102/GOAL%20-%20Multiple%20Images%20-%203%20Stacked%20-%20Facebook(15).jpg",
    "source": "Goal.com"
  },
  {
    "title": "​AI slop, begone! The viral musical virtuosos bringing brains and brilliance back to social media",
    "desc": "Whether making microtonal pop or playing Renaissance instruments with sheep bones, a crop of bold artists are making genuinely strange music go mainstream – but are they at the mercy of the algorithm?",
    "image": "https://i.guim.co.uk/img/media/302158e33ddcc9a03e07e92e77895cc5b09ce8f2/1827_177_5750_4602/master/5750.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c2aad400f83ae4139a3903f8daa49433",
    "source": "The Guardian"
  },
  {
    "title": "President Ruto dismisses claims of meeting al Shabaab",
    "desc": "He says his development agenda will not be distracted by politics of division and stereotype.",
    "image": "https://cdn.radioafrica.digital/image/2026/02/de2db5d9-0585-4cd8-bb6b-5b47c0f5c6d9.png?1770809621555",
    "source": "the-star.co.ke"
  },
  {
    "title": "SA Rugby to accelerate women’s coaching pathway",
    "desc": "Nine former Springbok Women’s players were included on a list of 24 elite coaches who will form part of SA Rugby’s new Women Coaches’ Transitioning Workshop, a critical initiative designed to bridge the gender gap in elite coaching.",
    "image": "https://saru-umbraco.azurewebsites.net//media/hrkl4nbp/250412-mathrin-simmers-bok-women-7s.jpg?anchor=center&mode=crop&width=945&height=472&rnd=133892510625500000",
    "source": "SA Rugby"
  },
  {
    "title": "Max Verstappen leads opening morning of first pre",
    "desc": "The first session of 2026 pre-season testing at the Bahrain International Circuit has seen Max Verstappen top the timesheets.",
    "image": "https://media.formula1.com/image/upload/t_16by9Centre/c_lfill,w_2048/q_auto/v1740000000/fom-website/2026/Pre-season%20test%201%20(Bahrain)/16x9%20single%20image%20-%202026-02-11T105611.479.webp",
    "source": "Formula 1"
  },
  {
    "title": "Everton vs Bournemouth Player Ratings: Barry’s missed chances haunt the Blues",
    "desc": "Everton’s five-game unbeaten run came to an end against Bournemouth at Hill Dickinson Stadium.",
    "image": "https://toffeeweb.com//images/uploads/1770805967-everton-v-bournemouth-premier-league31-sm.jpg",
    "source": "ToffeeWeb"
  },
  {
    "title": "Ten dead after shooter opens fire at high school in Canada",
    "desc": "Six people were found dead inside a high school, two more people were found dead at a residence that police believe is connected to the incident and another person died on the way to hospital. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/1cbf2d6495cf6d5ab4c15b18af657108028517cb99ca51f62eb615aa6cee4812",
    "source": "The Straits Times"
  },
  {
    "title": "Market-Oriented Disinformation and the Threat of Agentic Disinformation",
    "desc": "MEDIA, TECHNOLOGY AND SOCIETY PROGRAMME About the Webinar Informational disorder–misinformation, disinformation and malinformation–is not merely a bug or a byproduct that spreads on digital platforms. It is an intended feature that thrives in the current informational system. Recent phenomena such as identity-driven cultural wars, the trust crisis in the post-truth era and the rise of […]",
    "image": "https://iseas.edu.sg/wp-content/uploads/2026/02/Events-Template-Facebook-260302-2.jpg",
    "source": "ISEAS"
  },
  {
    "title": "Earth's core could hold enough hydrogen to fill 45 oceans",
    "desc": "New research suggests that Earth's core may contain nine times the amount of hydrogen found in all of the planet's oceans, potentially making it the largest hydrogen reservoir.",
    "image": "https://i.cdn.newsbytesapp.com/images/l200_8431770796755.jpg",
    "source": "NewsBytes"
  },
  {
    "title": "F1 Bahrain pre-season test: Max Verstappen tops opening morning",
    "desc": "Max Verstappen was fastest on Wednesday morning as all teams covered a substantial amount of laps",
    "image": "https://cdn-1.motorsport.com/images/amp/2GdwRdoY/s6/max-verstappen-red-bull-racing.jpg",
    "source": "Motorsport.com"
  }
]