[
  {
    "title": "Arsenal transfer news: £48m deal could be on after Alvarez admission",
    "desc": "Arsenal are targeting two players before the end of the January transfer window.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/67/1200x630/6706297.jpg",
    "source": "Daily Express"
  },
  {
    "title": "What Mark Harmon is doing now after NCIS: From cameos to new projects",
    "desc": "What Mark Harmon is doing now after NCIS has been a subject of discussion among his fans. Read on to discover his new projects since leaving NCIS.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/f5570202ba89db25.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "Community, police join forces to safeguard children",
    "desc": "DAR ES SALAAM: POLICE gender desks and community policing officers across several regions have launched an intensive safety campaign to protect students from violence, drug abuse, and exploitation. From the busy streets of Dar es Salaam to the wards of Singida and Tabora, the message from the Police Force is clear, safeguarding the nation's children",
    "image": "https://dailynews.co.tz/wp-content/uploads/2022/07/favicon.ico",
    "source": "dailynews.co.tz"
  },
  {
    "title": "'Single's Inferno' 5: Ranking The Cast By Their Red And Green Flags",
    "desc": "We're ranking the 'Single's Inferno' 5 cast based on their green and red flags, analysing all the drama and romantic connections.",
    "image": "https://cassette.sphdigital.com.sg/image/harpersbazaar/66455c825d30afd983ed6b4014b559d1acc1e6e59f1d3914895c346ad932fefc",
    "source": "Harper's Bazaar Singapore"
  },
  {
    "title": "Flatley faked millionaire lifestyle in Monaco, court told",
    "desc": "Lord of the Dance show creator Michael Flatley faked the lifestyle of a millionaire in Monaco using other people's money because he did not have the financial means to do so, a court in Belfast has been told.",
    "image": "https://www.rte.ie/images/0023d070-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "King Charles III's documentary sets out his philosophy for saving the planet",
    "desc": "King Charles III is clearly thinking about his legacy",
    "image": "https://i.abcnewsfe.com/a/ac890fb8-cf2f-48e2-b854-7c07d7deddff/wirestory_38cc5fef32a704175c76e862698e4515_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "GP shortages: State 'treading water' as population increases 9%",
    "desc": "There are currently 4,650 GPs in the State, up from 4,200 in 2019, but Dr Quinlan estimates a need for 6,500 or more GPs in Ireland",
    "image": "https://img.resized.co/breaking-news/eyJkYXRhIjoie1widXJsXCI6XCJodHRwczpcXFwvXFxcL2ltYWdlcy5icmVha2luZ25ld3MuaWVcXFwvcHJvZFxcXC91cGxvYWRzXFxcLzIwMjVcXFwvMTFcXFwvMzAxMDI4MjNcXFwvNzVlMWVkOTYtZjRhZi00MjkxLWFhMjktYzI0ZTllZGUxYWQ3LWUxNzY2NDA1NDM3NDMxLmpwZ1wiLFwid2lkdGhcIjoxMjAwLFwiaGVpZ2h0XCI6NjI3LFwiZGVmYXVsdFwiOlwiaHR0cHM6XFxcL1xcXC93d3cuYnJlYWtpbmduZXdzLmllXFxcL2lcXFwvYm4tbm9pbWFnZS5wbmdcIixcIm9wdGlvbnNcIjpbXX0iLCJoYXNoIjoiM2ExY2QxZGRjOGViYThmZGEyMDlhMTYxZmRiMmY2MTAyNGIyNDczYiJ9/gp-shortages-state-treading-water-as-population-increases-9.jpg",
    "source": "breakingnews.ie"
  },
  {
    "title": "Isles unveil plan to end power outages",
    "desc": "ZANZIBAR: ZANZIBAR has outlined robust plans to strengthen the energy sector and address frequent power outages through the use of alternative energy solutions. Minister for Water, Energy and Minerals, Nadir Abdullatif Al-Wardy, said the government is implementing short-term strategies aimed at ending persistent electricity disruptions and improving service reliability for citizens. He made the remarks",
    "image": "https://dailynews.co.tz/wp-content/uploads/2022/07/favicon.ico",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Public housing towers for the elderly to go in next stage of high",
    "desc": "Seven towers across Melbourne's inner west and south — all designed to house older people — will be redeveloped in the next stage of Victoria's high-rise redevelopment plan.",
    "image": "https://live-production.wcms.abc-cdn.net.au/3855454db16b89d22f6c1c4579b57c97?impolicy=wcms_watermark_news&cropH=1125&cropW=2000&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Apply Now: Latest Arts and Culture Funding Opportunities",
    "desc": "The Department of Cultural Affairs and Sport has launched its annual funding call for organisations and individuals working in the arts and culture sector. Funding is available across multiple categories, including cultural tourism, literature, film, language promotion and preservation, and the performing arts. Detailed criteria, categories, and application forms are accessible online. Western Cape Minister",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  }
]