[
  {
    "title": "F1 testing LIVE: Max Verstappen fastest at lunch as Lewis Hamilton, Williams get on track in Bahrain",
    "desc": "Formula 1's preseason kicks into overdrive with the first of two tests in Bahrain this week, and you can follow all the action live with ESPN.",
    "image": "https://a1.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0211%2Fr1613565_1296x729_16%2D9.jpg",
    "source": "ESPN"
  },
  {
    "title": "Winter Olympics: Sturla Holm Laegreid apologises after confession",
    "desc": "Norwegian medal-winning biathlete Sturla Holm Laegreid apologises again for cheating on his ex-girlfriend.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/7bd9/live/a5630b30-076c-11f1-b7e1-afb6d0884c18.jpg",
    "source": "BBC"
  },
  {
    "title": "Monthly inflation at standstill in Latvia",
    "desc": "The data of the Central Statistical Bureau (CSB), published on 11th February, show that in January 2026, compared to December 2025, the average level of consumer prices remained unchanged.",
    "image": "https://static.lsm.lv/media/2025/12/large/1/sb5q.jpg",
    "source": "LSM"
  },
  {
    "title": "Huawei's smartwatch tech detects diabetes risk",
    "desc": "Diabetes remains one of the most significant public health challenges globally and its impact is particularly acute in the Middle East. According to the 2024 report by the International Diabetes Federation (IDF), 589 million adults (aged 20-79) worldwide are living with diabetes, with 43 per cent of them are undiagnosed. In the Middle East and North Afria, 85 million adults are living with diabetes, a number that is expected to increase by 92 per cent to 163 million by 2050.\nThe UAE reflects this regional trend. IDF data shows that diabetes prevalence among adults (20-79 years) in the country stands at 20.7 per cent, placing it among the highest globally. With lifestyle-related risk factors on the rise and healthcare systems facing increasing long-term disease burdens, early risk identification and prevention have become strategic priorities for national health agendas.",
    "image": "https://media.assettype.com/gulfnews%2F2026-02-11%2Fxis087au%2FUntitled-1.jpg?rect=0%2C200%2C1200%2C630&w=1200&ar=40%3A21&auto=format%2Ccompress&ogImage=true&mode=crop&enlarge=true&overlay=false&overlay_position=bottom&overlay_width=100",
    "source": "Gulf News"
  },
  {
    "title": "Can Life Begin on a Moon Without a Sun?",
    "desc": "Free-Floating Planets, or as they are more commonly known, Rogue Planets, wander interstellar space completely alone. Saying there might be a lot of them is a bit of an understatement. Recent estimates put the number of Rogue Planets at something equivalent to the number of stars in our galaxy. Some of them, undoubtedly, are accompanied by moons - and some of those might even be the size of Earth. A new paper, accepted for publication into the Monthly Notices of the Royal Astronomical Society, and also available in pre-print on arXiv, by David Dahlbüdding of the Ludwig Maximilian University of Munich and his co-authors, describes how some of those rogue exo-moons might even have liquid water on their surfaces.",
    "image": "https://www.universetoday.com/article_images/free-floating-exoplanet-exomoon-water-artist-concept_20260210_144036.png",
    "source": "Universe Today"
  },
  {
    "title": "Botswana: A35 Road Under Construction",
    "desc": "Parliament has been informed that the construction of the A35 Gumare-Sepopa Road is being carried out in half-width sections.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Botswana: BDF Gets P5bn to Settle Pension Matters",
    "desc": "Government has allocated P5 billion for the next financial year to settle outstanding BDF pension transfer values.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Kenya: Task Force Proposes Accountability and Sustainability in Saccos",
    "desc": "President William Ruto has reaffirmed the government's commitment to reforming Savings and Credit Cooperative Organisations (SACCOs) following the submission of a comprehensive review report by an expert task force.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Botswana: Find Alternative Transport for Learners",
    "desc": "Local authorities have been instructed to find alternative modes of transport following government's resolve that donkey carts are unsuitable for ferrying learners. The decision stemmed from concerns that donkey carts exposed learners to safety risks, including road accidents and harsh weather conditions.",
    "image": "https://cdn.allafrica.com/static/images/structure/aa-logo-rgba-no-text-square.png",
    "source": "allAfrica.com"
  },
  {
    "title": "Samsung outs new Valentine’s deals on Vision AI TVs and sound devices",
    "desc": "Samsung Electronics is offering Valentine’s promotions on its Vision AI TVs and sound devices, positioning home entertainment as an option for celebrations",
    "image": "https://walastech.com/wp-content/uploads/2026/02/samsung-valentines-deals-1.jpg",
    "source": "WalasTech"
  }
]