[
  {
    "title": "Leinster misfire in the Welsh rain as they fall to defeat",
    "desc": "Robbie Henshaw makes his return to first-team action.",
    "image": "https://img2.thejournal.ie/article/6970258/river/?height=400&version=6970277",
    "source": "The 42"
  },
  {
    "title": "AI minister says OpenAI still not doing enough in wake of B.C. shooting, will meet CEO Altman",
    "desc": "Artificial Intelligence Minister Evan Solomon says OpenAI's recent commitments to adjust its policies in the wake of the shooting in Tumbler Ridge, B.C., do not go far enough and plans to meet with CEO Sam Altman.",
    "image": "https://i.cbc.ca/ais/7f75e451-7635-4a55-84b9-84dc94228480,1772226658308/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C320%2C8346%2C4694%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "February Picture of the Month: ESA shares beautiful image of a spiral galaxy",
    "desc": "Webb utilized powerful instruments to create a detailed image of galaxy NGC 5134. From this observation, astronomers can understand the life cycle of stars and apply that knowledge to galaxies that appear as small as a dot in images.",
    "image": "https://www.notebookcheck.net/fileadmin/Notebooks/News/_nc5/James_Webb_Space_Telescope_Artist_Conception.jpg",
    "source": "Notebookcheck"
  },
  {
    "title": "Launceston City Council reveals $13 million increase for Princess Theatre, Earl Arts Centre upgrade",
    "desc": "The Launceston City Council has revealed the redevelopment of a historic theatre and arts centre will cost almost 50 per cent more than expected, but the mayor insists it is \"not a cost blowout\".",
    "image": "https://live-production.wcms.abc-cdn.net.au/94615b94376fa0f7051249392e7d0baf?impolicy=wcms_watermark_news&cropH=3942&cropW=7008&xPos=0&yPos=365&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Sophus Technology To Showcase Quantum Solver Delivering Faster Optimization",
    "desc": "Sophus Technology will host a webinar on March 10 to introduce its Quantum Solver, an optimization technology designed for supply chain network design, scenario planning, and decision intelligence. The solver aims to deliver optimization speeds 50–100× faster, enabling more complex and detailed models to be solved within practical timeframes.",
    "image": "https://quantumzeitgeist.com/wp-content/uploads/quantum-solver-webinar-1024x510.png",
    "source": "Quantum Zeitgeist"
  },
  {
    "title": "Judge Approves $345 Million Verdict Against Greenpeace in Dakota Access Pipeline Suit",
    "desc": "Greenpeace has said the verdict could bankrupt it. The lawsuit was over the group’s role in protests against the Dakota Access Pipeline.",
    "image": "https://static01.nyt.com/images/2026/02/25/climate/00cli-greenpeace-01/00cli-greenpeace-01-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "The migrant communities reporting some of the worst mental health",
    "desc": "Middle Eastern, Latin American and African young people are reporting unique challenges.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--4bvnBnDy--/t_tohu-badge-facebook/v1765937707/4JY9O8H_Ethnic_Communities_2_jpg?_a=BACCd2AD",
    "source": "RNZ"
  },
  {
    "title": "About half of the fallen 'Beast' is removed from the Arctic tundra",
    "desc": "Crews are clearing the massive Doyon 26 drilling rig from the North Slope. Concern remains for the spilled diesel and hydraulic fluid. The rig toppled last month.",
    "image": "https://npr.brightspotcdn.com/dims4/default/bef2edd/2147483647/strip/true/crop/1000x525+0+107/resize/1200x630!/quality/90/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2F19%2F22%2F7fbc1bd343fda6b66c958f26ef18%2Fdronerighorizontal.jpeg",
    "source": "Alaska Public Media"
  },
  {
    "title": "Stock Market Today: Dow Hit By Hot Inflation Data",
    "desc": "Stock Market Today: The Dow Jones index drops Friday after hot inflation data. Nvidia partner CoreWeave plunges after its quarterly report.",
    "image": "https://www.investors.com/wp-content/uploads/2017/03/stock-wallstreet2-031317-shutter.jpg",
    "source": "Investor's Business Daily"
  },
  {
    "title": "Trump suggests a ‘friendly takeover’ of Cuba amid US fuel blockade",
    "desc": "The Republican leader, who has sought to expand US influence across Latin America, said of Cuba: ‘They want our help.’",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/ap_69a1f9d241cb5-1772222930.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  }
]