[
  {
    "title": "Wicklow searches resuming in Dullard, Jacob investigation",
    "desc": "A search is resuming at a Co Wicklow quarry as part of the investigation into the disappearance and murders of Deirdre Jacob and Jo Jo Dullard in the 1990s.",
    "image": "https://www.rte.ie/images/0023e858-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Black Volta Gold Project holds 2.8 million ounces potential - Geologist",
    "desc": "The Black Volta Gold Mine, one of Ghana’s most promising undeveloped gold belts, has the potential to yield 2.8 million ounces of gold, according to mineral exploration geologist Elvis Gota.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/458/45881005.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Valve warns of disruptions with Steam Deck OLED availability • Межа",
    "desc": "The Steam Deck OLED may temporarily disappear from sale in certain regions due to a shortage of RAM and storage, Valve has announced.",
    "image": "https://mezha.ua/mezha/favicon/android-icon-36x36.png",
    "source": "Mezha"
  },
  {
    "title": "NASA Eyes Next Wet Dress Rehearsal for Artemis II",
    "desc": "NASA is targeting Thursday, Feb. 19, as the tanking day for the second wet dress rehearsal ahead of the agency’s Artemis II test flight.\nOver the weekend, te",
    "image": "https://www.asdnews.com/NewsImages/b/95950/104012_O.jpg",
    "source": "ASDNews"
  },
  {
    "title": "European Film Market Chief on How the Event Has Evolved",
    "desc": "The European Film Market has adapted to changes in the independent film business, EFM chief Tanja Meissner says.",
    "image": "https://variety.com/wp-content/uploads/2025/02/Tanja-Meissner.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "What changes might England make for Ireland game?",
    "desc": "Following England's defeat by Scotland at Murrayfield, what changes might Steve Borthwick make to face Ireland on Saturday?",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/4082/live/d03680e0-0b53-11f1-b7e1-afb6d0884c18.png",
    "source": "BBC"
  },
  {
    "title": "Oscar-Winning 'No Other Land' Director Hamdan Ballal Denounces Attack",
    "desc": "'No Other Land' co-director Hamdan Ballal has sounded an alarm over a new attack against his family by Israeli settlers in the West Bank.",
    "image": "https://variety.com/wp-content/uploads/2025/07/No-Other-Land_Still_04.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Natural Gas and Oil Forecast: Inventory Surge Caps Oil, NG Coils - Is $60 Oil Next?",
    "desc": "Oil prices face pressure as rising inventories and a 2.4 mb/d supply surge cap gains, while Natural Gas coils below $3.33 resistance amid demand concerns.",
    "image": "https://responsive.fxempire.com/v7/_fxempire_/2026/02/Untitled-design-2-1.jpg?func=cover&q=70&width=700",
    "source": "FXEmpire"
  },
  {
    "title": "Tokayev Presents State Honors to Kazakh Fighters After Dubai SWAT Victory",
    "desc": "Tokayev Presents State Honors to Kazakh Fighters After Dubai SWAT Victory",
    "image": "https://astanatimes.com/wp-content/uploads/2026/02/IMG_1625-scaled.jpeg",
    "source": "The Astana Times"
  },
  {
    "title": "Africa Water Sustainability Year 2026: From Sudanese Diplomacy to Rebuilding the Water Sector (2-2)",
    "desc": "Dr Ammar Abakar Abdallah The declaration of Africa Water Sustainability Year 2026, alongside the World Bank Group’s “Mission Water” initiative, has",
    "image": "https://sudanhorizon.com/wp-content/uploads/2026/02/عمار-أبكر-عبد-الله-1.jpg",
    "source": "Sudan Horizon"
  }
]