[
  {
    "title": "Utilization of Eggshells Waste as an Additive to Improve the Mechanical Properties of Clays",
    "desc": "In this study, we investigated the reuse of eggshell powder waste to improve the mechanical properties of clay bricks as a cement replacement material. The eggshell powder was used as a potential and environmentally friendly and economical solution for strengthening clay structures. Specimens were prepared with eggshell powder content varying from 0%, 5%, 10%, 15% and 20% by dry weight in order to determine the optimal percentage and observe the strength of the bricks to produce a good cementing material using eggshell powder. Chemical and mineralogical characterization by XRF, FTIR, SEM/EDS and Atterberg limits, respectively, was carried out to assess the physicochemical properties of the raw materials and the final product, while compression and flexural tests were performed to determine the mechanical properties. The results showed that adding 10% by weight of ESP resulted in a flexural strength of 1.062 MPa for Tchicky clay. Adding 15% by weight of ESP resulted in a compressive strength of 4.212 MPa for clay 1 (Tchicky).",
    "image": "https://file.scirp.org/image/jmmce2024061316473921.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Flynn repeats as NBA All-Star Celebrity Game MVP, leads Team Giannis to victory",
    "desc": "Rome Flynn earned MVP honors for the second straight year in the NBA All-Star Celebrity Game on Friday night, scoring 17 points to lead a team coached by Giannis Antetokounmpo to a 65-58 victory.",
    "image": "https://www.tsn.ca/resizer/v2/XFHVJDIPA5CDHC2ZCVBFENXTEU.jpg?smart=true&auth=195156cd5a45b4377cee3634e82493d6b07f02d5b15aebde0e87dcffc319d1f2&width=1200&height=630",
    "source": "TSN"
  },
  {
    "title": "Six foreign nationals posing as 'doctors' among 18 detained in raid",
    "desc": "KUALA LUMPUR: A group of foreign nationals posing as doctors and offering unlicensed medical services from behind premises selling daily essentials was busted after the Immigration Department raided nine locations around Jalan Tun Tan Siew Sin in Pudu on Friday (Feb 13) afternoon.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/14/3770292.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "Trump says regime change 'seems' to be 'best thing that could happen' for Iran",
    "desc": "U.S. President Donald Trump on Friday embraced potential regime change in Iran and declared that \"tremendous power\" will soon be in the Middle East, as the Pentagon sent a second aircraft carrier to the region.",
    "image": "https://i.cbc.ca/ais/54f15c0b-fb62-4cee-a9d3-5440239c5e85,1771030684195/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C540%2C6720%2C3780%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Valentine's Day 2026: Celebrate love with 20 unique gift ideas for last minute planners",
    "desc": "Valentine's Day dedicated to love and romance is celebrated on 14 February every year. For those without plans, here are 20 last-minute gift ideas to surprise your partner and loved ones.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/14/1600x900/logo/pexels-photo-6708944_1771035098770_1771035121882.jpeg",
    "source": "Mint"
  },
  {
    "title": "Carney tells Tumbler Ridge residents that Canadians 'will always be with you' following mass shooting",
    "desc": "Canadian Prime Minister Mark Carney told grieving residents of Tumbler Ridge, British Columbia, on Friday (Feb 13) that Canadians \"will always be with you\" at a vigil to mourn victims of one of the country's worst mass shootings.Carney, opposition leaders and provincial officials travelled to the remote town",
    "image": "https://dam.mediacorp.sg/image/upload/s--N4U1CLNK--/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2024-04:reuters_1,w_0.1/f_auto,q_auto/v1/one-cms/core/2026-02-13T223828Z_1_LYNXMPEM1C1EI_RTROPTP_3_CANADA-SHOOTING-CARNEY.JPG?itok=1zN6Ns5n",
    "source": "CNA"
  },
  {
    "title": "Best video highlights from Friday at 2026 Winter Olympics",
    "desc": "It's another action-packed Friday at the 2026 Milan Cortina Winter Olympics, headlined by two-time world champion Ilia Malinin.",
    "image": "https://kubrick.htvapps.com/htv-prod-media.s3.amazonaws.com/images/highlights-698f4b29d9d52.jpg?crop=1.00xw:0.935xh;0,0&resize=1200:*",
    "source": "Gulf Coast News and Weather"
  },
  {
    "title": "Guntas Sandhu is lone Indian to make cut at WAAP",
    "desc": "Guntas Sandhu is lone Indian to make cut at WAAP",
    "image": "https://dailypioneer.com/uploads/2026/story/images/big/guntas-sandhu-is-lone-indian-to-make-cut-at-waap-2026-02-14.jpg",
    "source": "Daily Pioneer"
  },
  {
    "title": "1.7 Million to Flood Soekarno-Hatta Airport for 2026 Chinese New Year",
    "desc": "The Soekarno-Hatta Airport is also introducing a customer experience activation to enliven the Chinese New Year 2026 through a lion dance parade.",
    "image": "https://statik.tempo.co/data/2025/12/23/id_1449381/1449381_720.jpg",
    "source": "Tempo.co"
  },
  {
    "title": "'Open to cooperation with all for peace'",
    "desc": "President Zardari highlights rapid changes facing world",
    "image": "https://i.tribune.com.pk/media/images/AsifAliZardariAFP1714656658-0/AsifAliZardariAFP1714656658-0-640x480.webp",
    "source": "The Express Tribune"
  }
]