[
  {
    "title": "The experience of living with diabetes, hypertension: A journey of resilience",
    "desc": "DAR ES SALAAM: NON-COMMUNICABLE diseases (NCDs), such as hypertension and diabetes, are rising steadily in Tanzania and across the globe. According to the World Health Organisation (WHO), NCDs account for over 70 per cent of deaths worldwide and lifestyle factors play a significant role in their development. “Prevention and early lifestyle interventions are critical in",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/01/prevention-and-screening-istock-1185738340-scaled.webp",
    "source": "dailynews.co.tz"
  },
  {
    "title": "PCB Cancels Kit Launch as Uncertainty Clouds Pakistan's Participation in T20 World Cup",
    "desc": "The Pakistan Cricket Board (PCB) has called off the planned unveiling of Pakistan’s official kit for the ICC Men’s T20 World Cup 2026, with sources",
    "image": "https://propakistani.pk/wp-content/uploads/2026/01/Pakistan-kit.jpg",
    "source": "ProPakistani"
  },
  {
    "title": "EC Judge President Mbenenge cleared of gross misconduct",
    "desc": "Eastern Cape Judge President Selby Mbenenge has been found not guilty of gross misconduct, following an investigation by the Judicial Service Commission tribunal.",
    "image": "https://www.enca.com/sites/default/files/styles/large/public/2025-05/ED_556133.jpg.webp?itok=LOB4jZbq",
    "source": "eNCA"
  },
  {
    "title": "Scottish gossip: Wilson, Adams, Ghedjemis, Naderi, Redzic, Hogh, Danilo",
    "desc": "Scotland Under-21 forward Rory Wilson is reportedly interesting Hoffenheim as Wolverhampton Wanderers are said to be eyeing Che Adams while Celtic and Rangers continue to court a variety of forward options.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/ac16/live/05530370-fe84-11f0-a8b8-bdd2c5f9bcad.png",
    "source": "BBC"
  },
  {
    "title": "Iranian president says Trump, Netanyahu and Europe fueled protest tensions",
    "desc": "President Masoud Pezeshkian accused US, Israeli and European leaders of exploiting Iran’s economic crisis and fueling unrest, as Tehran rejects missile talks and warns it is ready for either negotiations or conflict",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/12/27/SyeGLiamWl/SyeGLiamWl_0_0_850_479_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "Google takes down an invisible network that was secretly using your phone's internet",
    "desc": "Google wipes out IPIDEA botnet that hijacked millions of home routers.",
    "image": "https://cdn.mos.cms.futurecdn.net/WvhWaELsXDFdqwaQk36qTP-1528-80.jpg",
    "source": "Android Central"
  },
  {
    "title": "Epstein files latest: photos appear to show former prince Andrew crouching over woman",
    "desc": "Elon Musk and former UK ambassador to US Peter Mandelson among those named in newly released documents",
    "image": "https://i.guim.co.uk/img/media/653b4bcf8adc9b0285885a2403672c816a891413/0_813_4000_3201/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=f1261b408bf712886ad76f042053cf7b",
    "source": "The Guardian"
  },
  {
    "title": "How to trade on Budget 2026 date? Guide for Nifty, Sensex, gold and silver investors; eight stocks to buy or sell",
    "desc": "Budget 2026 date: The Indian stock market will remain open on Sunday whereas the commodity market will remain open from 9:00 AM to 5:00 PM",
    "image": "https://www.livemint.com/lm-img/img/2026/01/31/1600x900/logo/Budget_2026_Budget_stocks_2026_Nifty_Sensex_today_1769848044675_1769848044883.jpg",
    "source": "Mint"
  },
  {
    "title": "2026 Sepang MotoGP Shakedown Test: Results - Day 3 (FINAL)",
    "desc": "Final lap times on Saturday's third and last day of the 2026 Sepang MotoGP Shakedown test.",
    "image": "https://cdn.crash.net/2026-01/aleix-espargaro.jpg?width=1600&aspect_ratio=16:9",
    "source": "crash.net"
  },
  {
    "title": "Don Lemon charged with civil rights crimes, Greene defends arrest",
    "desc": "Former CNN anchor Don Lemon arrested and charged with civil rights crimes including conspiracy and interfering with religious freedom following anti-ICE protest that disrupted Minnesota church service.",
    "image": "https://static.foxnews.com/foxnews.com/content/uploads/2026/01/mtg-lemon-split.jpg",
    "source": "Fox News"
  }
]