[
  {
    "title": "'Industry's Ken Leung on Eric's episode 6 sacrifice: 'It's his ultimate show of love'",
    "desc": "Season 4, episode 6 of \"Industry\" sees Eric Tao step away from SternTao. Ken Leung breaks down what's on Eric's mind when he does.",
    "image": "https://helios-i.mashable.com/imagery/articles/02Yc05kn1cNWVHbEI63kAW9/hero-image.fill.size_1200x675.v1770923237.jpg",
    "source": "Mashable"
  },
  {
    "title": "Kit Harington and Max Minghella break down 'Industry's NSFW glory hole scene",
    "desc": "\"Industry\" stars Kit Harington and Max Minghella dissect Henry and Whitney's glory hole experience in Season 4, episode 6.",
    "image": "https://helios-i.mashable.com/imagery/articles/03AgTsJUmZaCcP9qxcdvFn1/hero-image.fill.size_1200x675.v1770925245.jpg",
    "source": "Mashable"
  },
  {
    "title": "xAI Rolls Out Dictation for Grok on Android",
    "desc": "xAI has rolled out its new dictation experience for Grok on Android. This update features a dedicated microphone icon inside the chat input field for quick speech-to-text prompts. The feature allows users to tap the mic, speak their prompt, and have it transcribed into text before Grok generates a written reply. However, it is not…",
    "image": "https://i0.wp.com/manilashaker.com/wp-content/uploads/2026/02/image-11.png?fit=1200%2C618&ssl=1",
    "source": "ManilaShaker Philippines"
  },
  {
    "title": "China embassy in Singapore reminds citizens to avoid gambling after MBS casino visitor falls to death",
    "desc": "The Chinese embassy in Singapore has issued a \"solemn\" reminder telling its citizens abroad to avoid gambling, which is banned in mainland China.In a statement on Saturday (Feb 14), the embassy reported that a Chinese national who gambled at the Marina Bay Sands casino recently jumped from height and fell to their death.\"The embassy is currently assisting the family with...",
    "image": "https://www.asiaone.com/sites/default/files/styles/article_top_image/public/original_images/Feb2026/marina-bay-sands-casino.jpg?itok=-_epghVo",
    "source": "AsiaOne"
  },
  {
    "title": "13-year-old Ottawa girl injured in chairlift incident has died",
    "desc": "The 13-year-old Ottawa girl who was injured in a chairlift incident at Centre Vorlage in western Quebec last week has died, according to her family.",
    "image": "https://www.cp24.com/resizer/v2/TSE5HXWS6BE6TJ3XXW47MUW53M.jpeg?smart=true&auth=09b91476ce94d93e1e9bc1a2c5b252eae3d61f5dfa7715274b3fdfb83e19cc2a&width=1200&height=630",
    "source": "CP24"
  },
  {
    "title": "After a shaky start, TikTok's U.S. joint venture lands on its feet",
    "desc": "TikTok's U.S. joint venture seems to have survived a turbulent rollout relatively unscathed, as concerns of a mass user exodus now appear overstated.",
    "image": "https://image.cnbcfm.com/api/v1/image/108264233-1770777086770-gettyimages-2258001547-1539702-fi-tiktok-los-angeles-klb-68.jpeg?v=1771212106&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "Election Commission suspends 7 West Bengal officials over ‘serious misconduct’ linked to SIR",
    "desc": "India News: NEW DELHI: The Election Commission has ordered the immediate suspension of seven West Bengal govt officials at the level of assistant electoral regis.",
    "image": "https://static.toiimg.com/thumb/msid-128403369,width-1280,height-720,imgsize-68362,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Redeem SG Culture Pass for 3 Chinese New Year movies at Golden Village",
    "desc": "SG Culture Pass credits can now be used to watch any of three local titles at Golden Village – 3 Good Guys, Liang Po Po Vs Ah Beng and Luck My Life.",
    "image": "https://dam.mediacorp.sg/image/upload/s--Vfg1IW4h--/c_crop,h_898,w_1596,x_0,y_168/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/16/20260108_013548833.jpg?itok=LHSaALAT",
    "source": "CNA Lifestyle"
  },
  {
    "title": "India's first ‘cow culture’ museum to open in U.P.'s Mathura",
    "desc": "India's first 'cow culture' museum in Mathura will highlight the spiritual and scientific significance of cows and their products.",
    "image": "https://th-i.thgim.com/public/society/article22421295.ece/alternates/LANDSCAPE_1200/12MPDESICOW",
    "source": "The Hindu"
  },
  {
    "title": "Yaytseslav: Boss of Real Estate Lady Linked to Viral Russian Man Speaks",
    "desc": "Yaytseslav Truhov went viral after meeting women in malls and taking them to his home. Serina defended her reputation amid claims of inappropriate advances.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/5f64c6515f26f128.jpeg?v=1",
    "source": "Tuko News"
  }
]