[
  {
    "title": "IND vs PAK: Ahead of Pakistan clash, Harbhajan Singh warns India about one bowler - 'Play him safely'",
    "desc": "Cricket News: NEW DELHI: Former Indian cricketer Harbhajan Singh believes India will beat Pakistan in their T20 World Cup match, but he warned that India must handl.",
    "image": "https://static.toiimg.com/thumb/msid-128331222,width-1280,height-720,imgsize-60138,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Winter Olympics 2026: On a wild, wild evening of figure skating, Kagiyama Yuma, Sato Shun cap two",
    "desc": "Discover how the two boyhood friends are joined on the podium as Japan win two men's singles medals for the third consecutive Games. Kagiyama and Sato also felt for their friendly rival Ilia Malinin, who collapsed like he never has before to finish a shocking eighth place.",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/elzuphybthleierjtwss",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "What’s new in Android's February 2026 Google System Updates [U]",
    "desc": "The monthly “Google System Release Notes” primarily detail what’s new in Play services, Play Store, and Play system update across...",
    "image": "https://i0.wp.com/9to5google.com/wp-content/uploads/sites/4/2025/01/google-play-services-2.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
    "source": "9to5Google"
  },
  {
    "title": "Fox's 'Baywatch' Reboot Casts Stephen Amell to Lead Series",
    "desc": "Stephen Amell has been cast as Hobie Buchannon, a series regular lead role in the highly-anticipated 'Baywatch' reboot.",
    "image": "https://www.hollywoodreporter.com/wp-content/uploads/2026/02/GettyImages-2233930422-e1771030244160.jpg?w=1440&h=810&crop=1",
    "source": "The Hollywood Reporter"
  },
  {
    "title": "Atta saga: Red Notice ends after arrest – OSP official clarifies",
    "desc": "Director of the Strategy, Research, and Communication Division at the Office of the Special Prosecutor (OSP), Samuel Appiah Darko, has provided clarification on the workings of INTERPOL Red Notices, amid ongoing legal developments involving former Finance Minister Ken Ofori-Atta.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/OSP-and-Ofori-Atta.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "WA Coroner finds 'cascade of events' responsible for heart attack death of man arrested at Perth Underground Station",
    "desc": "A coronial inquest into the death of a 24-year-old man at a Perth train station finds the act of restraining him in a face-down position likely contributed to his death.",
    "image": "https://live-production.wcms.abc-cdn.net.au/b87b7f56a91f3095df292acddddff341?impolicy=wcms_watermark_news&cropH=1406&cropW=2500&xPos=0&yPos=288&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "There's one common theme of agony for Team USA at these Olympics",
    "desc": "MILAN — The red, white and blue with disappointment. That has largely been the theme of the United States’ first week of the 2026 Winter Olympics.",
    "image": "https://nypost.com/wp-content/uploads/sites/2/2026/02/newspress-collage-ys2v8kskg-1771033236720.jpg?quality=75&strip=all&1771015272&w=1200",
    "source": "New York Post"
  },
  {
    "title": "Dozens of Australians diagnosed with rare tattoo",
    "desc": "Australian eye doctors have documented 40 cases of a rare tattoo-related eye inflammation that is hard to treat and can lead to vision loss.",
    "image": "https://live-production.wcms.abc-cdn.net.au/38bd3ef0cdf9ab4e736b3ba6e86cb0c9?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=260&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Engineered Listeria boosts innate immunity against cancer",
    "desc": "After nearly 40 years of research on how Listeria bacteria manipulate our cells and battle our immune system to cause listeriosis, Daniel Portnoy and his colleagues have discovered a way to turn the bacteria into a potent booster of the immune system - and a potential weapon against cancer.",
    "image": "https://www.news-medical.net/image-handler/picture/2016/3/bacteria_-_Sebastian_Kaulitzki_46826fb7971649bfaca04a9b4cef3309-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Penn State Dominates Ohio State, 36-5, In Battle of Nation’s Top Two Teams",
    "desc": "No. 1 Penn State dominates No. 2 Ohio State, 36-5, handing the Buckeyes their first loss of the season after a 17-0 start.",
    "image": "https://www.elevenwarriors.com/sites/default/files/styles/904x490/public/c/2026/02/161567_h.jpeg?itok=nnWZXYSx",
    "source": "Eleven Warriors"
  }
]