[
  {
    "title": "Ariana Grande Says ‘Holy S-’ in Response to Vogue Cover of Her With 6 Fingers That Appeared to Be AI-Altered",
    "desc": "Ariana Grande got a digital enhancement on the latest cover of Vogue Japan. The “Wicked” star and pop singer is the cover subject of the magazine’s latest issue. But people quickly spotted a problem with the original Vogue Japan cover photo: Ariana is sporting an uncanny six fingers on her left hand. In response to …",
    "image": "https://s.yimg.com/os/en/variety.com/5cedc6f3cf94a5b5d7c9a991adf2497a",
    "source": "Yahoo News Canada"
  },
  {
    "title": "Instagram might soon let you remove yourself from someone's Close Friends list",
    "desc": "Since the feature's launch in 2018, users haven't been able to remove themselves from someone else's Close Friends list.",
    "image": "https://techcrunch.com/wp-content/uploads/2025/10/instagram-app-icon-GettyImages-1046023150.jpg?resize=1200,801",
    "source": "TechCrunch"
  },
  {
    "title": "Watch the moment Stan Dogbe shoves military officer at GAF graduation",
    "desc": "An incident involving a Deputy Chief of Staff at the Presidency, Stanislav Xose Dogbe, has drawn public attention after he was seen shoving a military officer who was carrying out official media duties during the Ghana Military Academy (GMA)...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/639/63940815.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Canon Fodder: Parasite’s Cake",
    "desc": "Welcome back to ye ol’ Canon Fodder in 2026, a year of rather significant proportions as Halo will be celebrating its twenty-fifth anniversary. A whole quarter of a century—our very own and very first quadranscentennial! Indeed, it has already been over a month since Halo: Edge of Dawn released, and the latest novel from Kelly […]",
    "image": "https://wpassets.halowaypoint.com/wp-content/2026/01/CF167.jpg",
    "source": "Halo Waypoint"
  },
  {
    "title": "New SNAP work requirements set to go into effect on Feb. 1 with millions at risk of losing benefits",
    "desc": "New work requirements for SNAP are set to go into effect on Feb. 1, and it could mean that millions of Americans lose their benefits.",
    "image": "https://i.abcnewsfe.com/a/ef18abfd-368d-40b6-a8c8-42cc99f1d1e3/snap-benefit-1-ap-jef-260130_1769784810984_hpMain_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "West Ham loan offer for Southampton's Taylor Harwood-Bellis rejected",
    "desc": "West Ham have a loan offer for Southampton defender Taylor Harwood‑Bellis rejected.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/c24d/live/2b62bad0-fe1e-11f0-bd36-9d8a84b498ee.jpg",
    "source": "BBC"
  },
  {
    "title": "Teacher admits lying about romantic relationship with former student at fitness-to-teach hearing",
    "desc": "Woman confirmed that she and ex-pupil are in a relationship, approximately six years in length, and that she loves him",
    "image": "https://www.irishtimes.com/resizer/v2/KRWCUWQPGFNP3FD5GOLWHBBMWQ.jpg?smart=true&auth=e8cb9d8fe54c222bc11fd3c570fd8f5727bd5efe79c7931af0c843c7475039cb&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Former EU commissioner Phil Hogan seeks Government backing for senior UN role",
    "desc": "Ex-Fine Gael minister resigned from senior European position in light of Golfgate controversy during pandemic",
    "image": "https://www.irishtimes.com/resizer/v2/TJ4G3A6C6ZGXPDDQGJHZCFUG6A.jpg?smart=true&auth=c2cd70d75918b3a0f85faa5517720561eeb5f6248cfeff2c205e21dc45eff4a1&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Daily Post Nigeria",
    "desc": "Chelsea boss, Liam Rosenior has warned the Blues about two West Ham United players ahead of both sides' Premier League tie. Rosenior's side will host the",
    "image": "https://dailypost.ng/wp-content/uploads/2026/01/Liam-Rosenior-1.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Tanzanian Catholic Bishop Urges Parents to Support Young People in Answering the Call to Priesthood and Religious Life",
    "desc": "Parents in Tanzania’s Catholic Diocese of Morogoro have been encouraged to support and nurture vocations among young people to help grow the number of Priests and members of Institutes of Consecrated Life and Societies of Apostolic Life (ICLSAL).",
    "image": "https://www.aciafrica.org/images/aci-africa-photo-edit-2026-01-30t215738_1769806744.jpg?w=1200&format=jpeg",
    "source": "aciafrica.org"
  }
]