[
  {
    "title": "Museveni awards Muhoozi Kabalega Star for Somalia operations",
    "desc": "President Museveni awards CDF Gen Muhoozi Kainerugaba the Kabalega Star Medal during Tarehe Sita celebrations for his role in Somalia, DRC and South Sudan missions.",
    "image": "https://www.capitalfm.co.ke/news/files/2026/02/MUSEVENI-MOHOOZI-MEDAL.jpg",
    "source": "Capitalfm.co.ke"
  },
  {
    "title": "Professor Kwaku Azar 'challenges' court over reduced sentence in Nana Agradaa case",
    "desc": "US-based Ghanaian legal scholar professor Kwaku Asare, popularly known as Kwaku Azar, has called on the Office of the Attorney General to immediately challenge the recent High Court (Appellate Division) decision that significantly reduced the prison...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/688/68809739.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Bali Police Arrest 39 Indian Nationals in Online Gambling Crackdown",
    "desc": "Bali police have arrested 39 Indian nationals in connection with an online gambling operation",
    "image": "https://img2.beritasatu.com/cache/jakartaglobe/960x620-w/2026/02/1770447426-719x400.webp",
    "source": "Jakarta Globe"
  },
  {
    "title": "US in talks with New Zealand over critical minerals project",
    "desc": "The US hosted a meeting in Washington DC, in which 55 delegations met to discuss creating a trade bloc to counter China’s dominance over the industry.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/us-in-talks-with-new-zealand-over-critical-mineral-extractio-AJQ3AR24RRALTBAT4QFTTCOYUQ.png?auth=4c52efe544d46d379b8fe36654136a078f04264fb1c8c8fdc729bde64a2c1203&quality=70&width=600&height=315&focal=0%2C0",
    "source": "1News"
  },
  {
    "title": "Backed Nutrition Solution for Preventive Heart Care",
    "desc": "NRoute, a nutraceutical company focused on preventive nutrition and healthy ageing, recently hosted a scientific session in Mumbai to introduce Heartisafe, its latest cardiovascular health formulation. The event brought together […]",
    "image": "https://theindianpractitioner.com/wp-content/uploads/2026/02/NRoute-Launches-Heartisafe-a-Science-Backed-Nutrition-Solution-for-Preventive-Heart-Care.jpeg",
    "source": "The Indian Practitioner"
  },
  {
    "title": "COA orders Iloilo province to pay for construction materials delivered in 2021",
    "desc": "The Commission on Audit (COA) has ordered the Iloilo provincial government to pay Conquest Construction Supply and Parts (CCSP) P458,394.41 for the construction...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/07/77566.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Putin’s Ploy",
    "desc": "It is no secret that the Kremlin’s strategy is to divide Europe and cleave it away from the United States. Still, many in Europe are wittingly aiding and abetting that strategy.",
    "image": "https://static.kyivpost.com/storage/2026/02/06/2a55c54323ec5dd158bbefdb6d8f3119.jpg?w=1200&q=90&f=jpg",
    "source": "Kyiv Post"
  },
  {
    "title": "How Basant became Lahore’s signature festival in Pakistan",
    "desc": "After years of restrictions, Lahore cautiously celebrates the return of its iconic spring kite festival.",
    "image": "https://www.aljazeera.com/wp-content/uploads/2026/02/AP26036492836381-1770408683.jpg?resize=1920%2C1440",
    "source": "Al Jazeera"
  },
  {
    "title": "'Sadistic' Stathern camp leader Jon Ruben hid behind mask of normality",
    "desc": "People who knew Jon Ruben say there was little to suggest any wrongdoing at Stathern Lodge.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/0710/live/28b31760-0401-11f1-b7e1-afb6d0884c18.png",
    "source": "BBC"
  },
  {
    "title": "Pre-Season Challenge: Dragons v Knights; Cowboys edge Dogs",
    "desc": "Follow all the action from Round 1 of the 2026 Witzer Pre-Season Challenge on NRL.com's live blog.",
    "image": "https://www.nrl.com/siteassets/2026/pre-season-challenge/week-1/dragons-v-knights/reedk-2plp8545.jpg?center=0.164%2C0.52&preset=share",
    "source": "NRL.com"
  }
]