[
  {
    "title": "Mutapa Investment Fund is not a looting machine",
    "desc": "THE Mutapa Investment Fund (MIF) Chief Executive Officer, John Mangudya has dismissed claims alleging his organisation is a looting vehicle operating with impunity. The remarks come on the back of criticism from certain quarters that the institution lacks parliamentary oversight. Some also fear that the MIF lacks transparency which heightens the potential risk for corruption […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/01/30144105/dr-john-mangudya.jpg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "Kerala for All conclave LIVE: Stress on shared responsibility for inclusive and accessible tourism",
    "desc": "'Kerala for All Conclave': Chief Minister Pinarayi Vijayan to inaugurate. Follow The Hindu's live for more updates.",
    "image": "https://th-i.thgim.com/public/news/national/kerala/8c11wk/article70573305.ece/alternates/LANDSCAPE_1200/WhatsApp%20Image%202026-01-31%20at%2011.30.25.jpeg",
    "source": "The Hindu"
  },
  {
    "title": "MCMC seizes 50 SIM boxes, 5,000 SIM cards in Kajang raid",
    "desc": "The commission says they were used to create fake online accounts on a large scale, bypass security controls on digital platforms and facilitate cybercrimes.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/01/9e5dafdc-sim-box-dan-kad-sim-skmm-pic-310126.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Charli XCX On Whether She'd Do A '007' Theme Song",
    "desc": "With a pop lineage that includes Madonna, Adele, Sam Smith and more, Charli xcx is reluctant to put herself up for the '007' franchise.",
    "image": "https://deadline.com/wp-content/uploads/2026/01/James-Bond-Charli-XCX-2-shot.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Axiom Tops Newcomer Vast In NASA Private ISS Charter",
    "desc": "Axiom Space has been selected by NASA for a fifth private astronaut mission to the International Space Station (ISS), the company announced Jan. 30.",
    "image": "https://aviationweek.com/sites/default/files/AWN_favicon_06122019.png",
    "source": "Aviation Week Network"
  },
  {
    "title": "Thousands protest against immigration operations in US",
    "desc": "Thousands of protesters took to the streets in Minneapolis and students across the United States staged walkouts to demand the withdrawal of federal immigration agents from Minnesota following the fatal shootings of two US citizens.",
    "image": "https://www.rte.ie/images/0023d3e2-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "'Made from synthetic material': CBI chargesheet rules out mixing of animal fats in Tirupati laddu ghee",
    "desc": "The special investigation team of the CBI, in its chargesheet filed in Nellore ACB court, has not made any reference to the ghee supplied to the Tirumala Tirupati Devasthanams (TTD) as being adulterated with animal fats.\nIt, however, said the laboratory tests of the ghee samples revealed that synthetic ghee was supplied for making laddu prasadam. It was not cow ghee at all, but ghee made from synthetic material blended with vegetable oils, it said.\nImmediately after coming to power, TDP supremo and chief minister N Chandrababu Naidu had in Sept 2024 alleged that ghee adulterated with animal fats had been used to make the laddu prasadam during the previous YSRC govt’s tenure (2019 to 2024). The SIT was formed to investigate the allegations that ghee mixed with tallow and lard was supplied to TTD.",
    "image": "https://static.toiimg.com/thumb/msid-127813665,width-1280,height-720,imgsize-1472031,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Venezuela announces mass amnesty plan for political prisoners dating back to Chavez era",
    "desc": "Delcy Rodríguez also plans to close notorious El Helicoide prison as opposition figures remain wary over new leadership",
    "image": "https://i.guim.co.uk/img/media/63a68920a55af3c313a96774b41a2b20bb0b174d/299_0_3760_3008/master/3760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c9a51ae0a253ea799476193bcc733ae1",
    "source": "The Guardian"
  },
  {
    "title": "Charli XCX Poses in Chic Black Dress After ‘Wuthering Heights’ Premiere",
    "desc": "Charli XCX stepped out in a sleek after-premiere look in new paparazzi photos from Los Angeles. The pop star kept the moment minimal and camera-ready after the world premiere of “Wuthering Heights,” then arrived at the Chateau Marmont, per the X post caption. Charli XCX poses in all-black look after ‘Wuthering Heights’ premiere in LA […] The post Charli XCX Poses in Chic Black Dress After ‘Wuthering Heights’ Premiere appeared first on Mandatory.",
    "image": "https://s.yimg.com/os/en/mandatory_995/fafc4fee3197b0f7af27add7dc1113db",
    "source": "Yahoo"
  },
  {
    "title": "Live updates: Arrests made as protesters clash with officers in DTLA after 'ICE Out' protest",
    "desc": "Some tense moments unfolded as police declared a dispersal order following the \"ICE Out\" protest in downtown L.A. on Friday.",
    "image": "https://cdn.abcotvs.com/dip/images/18511710_013026-kabc-ice-out-protest-spilt-tn-img.jpg?w=1600",
    "source": "ABC7 Los Angeles"
  }
]