[
  {
    "title": "India action entertainer realign strategy amid multiple big releases : Bollywood News",
    "desc": "EXCLUSIVE: Adivi Sesh-Mrunal Thakur starrer Dacoit to release on April 10; makers of Pan-India action entertainer realign strategy amid multiple big releases. Bollywood News: Latest Bollywood News, Bollywood News Today, Bollywood Celebrity News, Breaking News, Celeb News, Celebrities News, Bollywood News Hindi, Hindi Bollywood News at Bollywood Hungama.com.",
    "image": "https://stat4.bollywoodhungama.in/wp-content/uploads/2026/02/Adivi-Sesh-1.jpeg",
    "source": "Bollywood Hungama"
  },
  {
    "title": "HDB launches 9,012 BTO and balance flats, including Prime project in Redhill",
    "desc": "HDB has launched 9,012 BTO and balance flats, featuring the Prime project Redhill Peaks in Bukit Merah and other units across Singapore. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/be2796d018125e7a15c67057661a16f1adc1d4f11ddde6e1f44fad601b669e7e",
    "source": "The Straits Times"
  },
  {
    "title": "NYCFC deal for Moussa Sylla from Schalke 04 collapses amid medical dispute",
    "desc": "New York City FC’s proposed move for Mali international Moussa Sylla collapsed late, sending the 26-year-old back to Schalke. The German club blasted NYCFC over a disputed medical, insisting contracts were signed and the striker is fit. With the deal off, NYCFC will pivot as Schalke keep a key scorer. The striker was set to be a Designated Player before talks unraveled abruptly, publicly.",
    "image": "https://assets.goal.com/images/v3/getty-2189919043/crop/MM5DIMRRHA5DEMZXGM5G433XMU5DAORSGIYA====/GettyImages-2189919043.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Kim Seon Ho's Agency Releases Official Statement Regarding Tax Evasion Allegations",
    "desc": "Kim Seon Ho’s agency Fantagio has issued a new statement regarding recent tax evasion allegations. Earlier this week, a news outlet reported that Kim Seon",
    "image": "https://0.soompi.io/wp-content/uploads/2026/02/03191327/kim-seon-ho-3-copy.jpeg",
    "source": "Soompi"
  },
  {
    "title": "Tenaga’s tax credit recovery could possibly stretch over two decades, says CIMB Securities",
    "desc": "Tenaga Nasional Bhd (KL:TENAGA) may immediately utilise tax credits to recoup some of the additional taxes though full recovery could stretch over two decades, CIMB Securities said.",
    "image": "https://assets.theedgemarkets.com/20260122_BLD_TENAGA_NASIONAL_BERHAD_TNB_1_LYY_20260204111958_theedgemalaysia.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "Bundee Aki clarifies feelings about playing for Ireland again",
    "desc": "Ireland have moved quickly to address Bundee Aki’s future after the centre was dropped from the squad last week following a disciplinary issue. Watch the Guinness Six Nations at your…",
    "image": "https://www.ruck.co.uk/wp-content/uploads/2026/02/maxresdefault-3.jpg",
    "source": "Ruck.co.uk"
  },
  {
    "title": "Pune Expressway after gas tanker accident",
    "desc": "Mumbai-Pune Expressway witnessed massive traffic jam after a gas tanker overturned near Adoshi tunnel, causing hazardous leakage and stranding commuters",
    "image": "https://images.mid-day.com/images/images/2026/feb/teagsaaIBsSsdJSsPdSATs11s-1770175386128_d.png",
    "source": "Mid-day"
  },
  {
    "title": "WTO must 'reform or die': talks facilitator",
    "desc": "Successfully reforming the WTO is a matter of life and death for the organisation, warns the facilitator of talks on revamping the global trade body.A full 72 percent of global trade still operates under WTO rules.",
    "image": "https://s.yimg.com/os/en/afp.com/38479d83f3ffcf995ab4858ae741ce4c",
    "source": "Yahoo"
  },
  {
    "title": "Penang smart parking glitch leads to council voiding fines for Feb 3",
    "desc": "GEORGE TOWN: All parking fines issued by Penang Island City Council (MBPP) on Tuesday (Feb 3) will be voided following a temporary disruption to the Penang Smart Parking (PSP) system.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/04/3753057.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "10-hour rehearsals, 30 pairs of shoes each: Avantgardey’s secret to dance perfection",
    "desc": "Japanese dance group Avantgardey reveals rehearsal secrets and visual uniformity ahead of their Mar 11–12 shows at The Theatre at Mediacorp, promising exclusive performances for Singapore fans.",
    "image": "https://dam.mediacorp.sg/image/upload/s--N1w3kHEt--/c_crop,h_900,w_1600,x_0,y_185/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/04/avantgardey_1.jpg?itok=WP50-gKE",
    "source": "CNA Lifestyle"
  }
]