[
  {
    "title": "Spatially explicit datasets of pesticide inputs integrating 146 active ingredients in China from 2001 to 2022",
    "desc": "The escalating environmental risks in China posed by pesticides necessitate precise management and supervision strategies, yet such a national-scale framework is hindered by data gaps. Till now, only statistics of aggregated pesticide inputs are available in China as the sum of inputs of hundreds of active ingredients (AIs), highlighting the need for an AI-specific agricultural input datasets. The dataset was developed through field surveys covering 1181 respondents and 12 crop systems and order-dependent relationship quantitation of crop-specific pesticide usage patterns, combined with multi-objective optimization to minimize provincial-level prediction errors, with official statistics serving as constraint conditions. This approach integrated crop-specific application trends, registration timelines, and spatial disaggregation to produce AI-specific input estimates at 5-arcmin resolution (2001–2022). We performed technical validation by predicting riverine concentrations and further compared with measurements. The generative dataset was designed to follow a computational framework and be updated annually based on pesticide application data from field surveys, offering data support for policy makers for sustainable pesticide management strategies.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Herefordshire and Worcestershire hospital handover delays total 6,000 hours",
    "desc": "Ambulances are stuck waiting outside hospitals in Herefordshire and Worcestershire.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/91f5/live/cd74d9c0-0409-11f1-abf6-4711e1118498.jpg",
    "source": "BBC"
  },
  {
    "title": "Zelensky says US wants Ukraine-Russia peace deal by June, despite failure to reach breakthrough so far",
    "desc": "Ukrainian President Volodymyr Zelensky has said that the United States wants a peace settlement between Ukraine and Russia by early summer, despite repeated rounds of talks failing to reach a breakthrough over the issues of territory and security guarantees.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/ap26025590605995.jpg?c=16x9&q=w_800,c_fill",
    "source": "cnn.com"
  },
  {
    "title": "Spotted! 20 Years On, What Has Blair Waldorf Been Up To?",
    "desc": "“Gossip Girl” author Cecily Von Ziegesar is coming back with “Blair,” a sequel book that will focus on Manhattan socialite Blair Waldorf, now in her 40s.",
    "image": "https://assets.vogue.com/photos/698750de29c9eb70e15fd888/16:9/w_1280,c_limit/09-gossip-girl%20(1).jpg",
    "source": "Vogue"
  },
  {
    "title": "'Our Ties With Malaysia Scaling New Heights': PM Modi Highlights Shared Values In Kuala Lumpur",
    "desc": "PM Modi highlighted that Malaysia had the second-highest Indian community in the world and placed a particular emphasis on Tamil linkages between the two nations.",
    "image": "https://images.news18.com/ibnlive/uploads/2026/02/modi-1-2026-02-b5ab6c2300a032a900f3ca1ceab4a195-16x9.jpg",
    "source": "News18"
  },
  {
    "title": "Bangladesh Hindu leader, ex-minister Ramesh Chandra Sen dies; questions raised on custody death",
    "desc": "Five-time Bangladesh MP and former minister Ramesh Chandra Sen died on Saturday after falling ill in custody. Bangladeshis are claiming a pattern as the death of Sen, a veteran Hindu leader, was similar to other Awami League politicians'. Sen was a mass leader and known for his helpful nature and untainted political career.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/images-of-hasina-era-ex-minister-ramesh-chandra-sen--hands-bound-with-cattle-ropes--surfaced-online-071921249-16x9_0.png?VersionId=c3Cb5uLrgfre1lOcR9oJe8zCduin7WqH",
    "source": "India Today"
  },
  {
    "title": "'It is better to win trophies, always' - Guardiola responds to Slot's style over substance claim",
    "desc": "Liverpool boss Arne Slot said he prefers style over trophies earlier this week, but Manchester City's Pep Guardiola disagrees.",
    "image": "https://prod-media.beinsports.com/image/1770462002059_73bff8b5-495a-4cc8-8a57-181a9997902c.1080.jpg",
    "source": "beIN SPORTS"
  },
  {
    "title": "Trump says he didn't see full racist video before it was posted, says he won't apologize",
    "desc": "President Trump shared a video that included a racist animation of Barack and Michelle Obama, prompting backlash and the White House to later take it down.",
    "image": "https://i.abcnewsfe.com/a/0b5b9457-3602-4b1f-b435-7d54634304f9/trump-wh-af1-feb-6_1770433049681_hpMain_16x9.jpg?w=1600",
    "source": "ABC News"
  },
  {
    "title": "Predicted: Nuno makes major West Ham change and faces late calls for must-win Burnley clash",
    "desc": "Nuno Espirito Santo looks set to make at least one major West Ham change and faces late calls for the must-win Burnley clash.",
    "image": "https://cdn1.hammers.news/uploads/25/2026/02/GettyImages-2245161328-scaled.jpg",
    "source": "Hammers News"
  },
  {
    "title": "George Saunders: Animosity on social media is 'not entirely genuine'",
    "desc": "The Booker Prize-winning writer talks about how social media fuels partisanship, the lessons of death and his new novel Vigil.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--k2fJ6I4m--/t_tohu-badge-facebook/f_auto/q_auto/4JTKTDT_gs_jpg?_a=BAMABkiu0",
    "source": "RNZ"
  }
]