[
  {
    "title": "African Startups Face $1.64B Tech Debt in 2025",
    "desc": "In 2025, African tech startups raised a record $1.64 billion through debt financing, marking a 63% increase from $1.01 billion in 2024. The number of debt deals also rose sharply to 108, up 40% from the previous year. Debt now constitutes 41% of total capital deployed in African tech, up from 17% in 2019, highlighting",
    "image": "https://news.fundsforngos.org/wp-content/uploads/2024/10/cropped-icon-32x32.png",
    "source": "fundsforNGOs News"
  },
  {
    "title": "India-Pakistan cricket matches continue to bring in record numbers despite big gulf between both teams",
    "desc": "The T20 World Cup contest between India and Pakistan this past Sunday fetched the maximum viewership numbers for an ICC T20 World Cup match. | Cricket",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/20/550x309/20260215-DNO-SGH-MN-ICCT20WorldCupEnjoying-009-0_1771572195776_1771572215982.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "New soccer fields, academy and national stadi",
    "desc": "The international soccer federation will invest $75 million under a plan aimed at helping rebuild the area after extensive destruction, though it remains unclear when work will be able to begin",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/20/SkTL5FS0011l/SkTL5FS0011l_0_0_3000_1688_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "BISE Lahore announces overhaul of exam procedures",
    "desc": "LAHORE: The Board of Intermediate and Secondary Education Lahore has announced a major overhaul of its examination procedures, including the central marking of 9th class practical exams and e-marking.Speaking to Geo News, BISE...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-20/l_651914_121551_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "'Peter Parker Is No More': Spider-Man: Brand New Day Synopsis Reveals Key Details on Film's Setting, Including How Long It's Been Since No Way Home",
    "desc": "\"Things are going well, until...\"",
    "image": "https://sm.ign.com/t/ign_za/news/p/peter-park/peter-parker-is-no-more-spider-man-brand-new-day-synopsis-re_jvau.1200.png",
    "source": "IGN Africa"
  },
  {
    "title": "Shahid Afridi issues fiery challenge to Shadab Khan over 'India World Cup' comment",
    "desc": "Cricket News: Shahid Afridi, the former Pakistan captain, has taken a swipe at Shadab Khan following the all-rounder’s post-match comments, reminding him of the cha.",
    "image": "https://static.toiimg.com/thumb/msid-128598014,width-1280,height-720,imgsize-1083231,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "'Clash' in Parliament over bill to revert NIB name to BNI",
    "desc": "Parliament witnessed heated exchanges as the government introduced a proposed Security and Intelligence Agencies Bill aimed at overhauling Ghana’s national security structure and renaming the National Investigations Bureau (NIB) to the Bureau of...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/832/83227121.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "'A load of rubbish!' - Anthony Gordon hits back at Arsenal and Liverpool transfer links after hitting Newcastle form",
    "desc": "Newcastle forward Anthony Gordon has branded rumours linking him with moves to Arsenal or Liverpool as a “load of rubbish”. The England international has been making headlines again after registering four goals for the Magpies in their 6-1 Champions League mauling of Qarabag. Transfer talk has resurfaced, but the 24-year-old forward is paying no attention to that gossip.",
    "image": "https://assets.goal.com/images/v3/blt25178848d9ac253c/GOAL%20-%20Blank%20WEB%20-%20Facebook%20-%202026-02-20T071040.664.png",
    "source": "Goal.com"
  },
  {
    "title": "Uganda Strengthens Ties with Cuba and Russia Amid Calls for Solidarity, Cooperation",
    "desc": "On February 20, 2026, Hon. Okello Henry Oryem, State Minister for Foreign Affairs (International Affairs), held separate high-level meetings with visiting diplomats from Cuba and Russia, underscoring Uganda’s commitment to international solidarity and practical cooperation. Related Stories FREO2 Foundation Hosts Strategic Workshop to Strengthen Oxygen Access in Uganda Uganda Strengthens Petroleum Revenue Management as […]",
    "image": "https://softpower.ug/wp-content/uploads/2026/02/9f876928-1b73-48e3-8da7-506e3b5da381.jpg",
    "source": "SoftPower News"
  },
  {
    "title": "African Union, European Union and United Nations launch Spotlight Initiative Africa Regional Programme to End Violence Against Women and Girls",
    "desc": "ADDIS ABABA, Ethiopia (February 16, 2026) — On the margins of the 39th Ordinary Session of the Assembly of the African Union on Saturday, February 14, the African Union Commission (AUC), the European Union (EU), and the United Nations (UN) officially launched the Spotlight Initiative Africa Regional",
    "image": "https://www.eeas.europa.eu/sites/default/files/2026/image_medium_resolution/SIARP%202.0%20Launch%20together.jpeg",
    "source": "EEAS"
  }
]