[
  {
    "title": "Bassist for Television Was 77",
    "desc": "Fred Smith, bass player for the influential proto-punk band Television, died Thursday. He was 77. The band confirmed his death on Instagram.",
    "image": "https://variety.com/wp-content/uploads/2026/02/GettyImages-635945105-e1770416819430.jpg?crop=0px%2C51px%2C2766px%2C1556px&resize=1000%2C563",
    "source": "Variety"
  },
  {
    "title": "How to Watch 2026 Cricket T20 World Cup Online In the US for Free",
    "desc": "Here’s how to watch the 2026 T20 World Cup online in the U.S., including how to stream the cricket tournament for free with a VPN.",
    "image": "https://www.rollingstone.com/wp-content/uploads/2026/02/GettyImages-2159841475.jpg?w=1600&h=900&crop=1",
    "source": "Rolling Stone"
  },
  {
    "title": "February Fitness Challenge at the Sylvan Lake NexSource Centre",
    "desc": "The February Fitness challenge runs from Feb. 1 to Feb. 28",
    "image": "https://sylvanlakenews.com/wp-content/uploads/sites/34/2026/02/41532176_web1_10139998_web1_170512-RDA-Nexsource-Centre-opens2-.jpg?w=1024",
    "source": "Sylvan Lake News"
  },
  {
    "title": "From Svedka to Anthropic, brands make bold plays with AI in Super Bowl ads",
    "desc": "From the first AI-generated Big Game ad courtesy of Svedka to Anthropic's beef with OpenAI, here are the biggest ads from Super Bowl LX.",
    "image": "https://techcrunch.com/wp-content/uploads/2026/02/svedkasuperbowl2026.png?w=1200",
    "source": "TechCrunch"
  },
  {
    "title": "Fluids, rest, and a broad-spectrum antiviral",
    "desc": "A UBC-led team of researchers has discovered two chemical compounds with potent and wide-ranging antiviral activity that protect mice from influenza A infection",
    "image": "https://science.ubc.ca/sites/default/files/styles/max_650x650/public/feature-images/2026-02/jean-francois-scaled_1.jpeg?itok=xph9uRJL",
    "source": "UBC Science"
  },
  {
    "title": "Researchers create blueprint for designing CD8 killer T cells to kill cancer cells",
    "desc": "Researchers have uncovered new genetic rules that determine how CD8 killer T cells choose between becoming long-lasting, protective defenders or slipping into exhausted, dysfunctional states.  To access this subscriber-only content please log in or subscribe.If your institution has a site license, log in with IP-login or register for a sponsored account.**Not all site licenses are […]",
    "image": "https://cdn.cancerletter.com/media/2021/04/09153233/TCL-logo_1200x627.jpg",
    "source": "The Cancer Letter"
  },
  {
    "title": "Tinubu Pledges Timely Release of Sports Funding in Nigeria",
    "desc": "President Tinubu addresses chronic issues by promising timely sports funding in Nigeria starting in 2026 to boost athlete performance and infrastructure.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2025/12/20110009/Tinubu-Kaftan-black.jpeg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Down Arrow Button Icon",
    "desc": "What caused the massive Bitcoin crash? Clues point to a blow-up at Hong Kong hedge funds",
    "image": "https://fortune.com/img-assets/wp-content/uploads/2026/02/GettyImages-169846542.jpg?resize=1200,600",
    "source": "Fortune"
  },
  {
    "title": "Quantum Error Fix Cuts Processing Time For Complex Problems Significantly",
    "desc": "Researchers have developed a deterministic error mitigation technique that allows for a direct comparison of noisy quantum computations with classical algorithms by reducing the computational cost of interpreting results from quantum experiments on Rydberg arrays.",
    "image": "https://quantumzeitgeist.com/wp-content/uploads/Image_fx-33-30.jpg",
    "source": "Quantum Zeitgeist"
  },
  {
    "title": "Cancer survival fell and deaths rose during first two years of COVID-19",
    "desc": "COVID-19 care disruptions cut U.S. one-year cancer survival, adding 17,390 deaths; see which cancers and groups were hit hardest.",
    "image": "https://cdn.sanity.io/images/0vv8moc6/mhe/9556182705cb65c3c6e74355f40dec60c6444ffa-7026x3545.jpg",
    "source": "Managed Healthcare Executive"
  }
]