[
  {
    "title": "Deepika Padukone bewitches in black at a Dubai event - Pics",
    "desc": "Deepika Padukone brought the drama to the red carpet at an event in Dubai, when she stepped out in a stunning sculpted black gown. The actress, who is.",
    "image": "https://static.toiimg.com/thumb/msid-128060218,width-1280,height-720,imgsize-27354,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Ghana limits foreign investments by local funds to support cedi, boost economic stability",
    "desc": "Ghanas SEC has restricted local fund managers’ overseas investment limits to support the cedi and the macroeconomic landscape. | Business Insider Africa",
    "image": "https://ocdn.eu/pulscms-transforms/1/dxzktkpTURBXy9iODM4MGMxYTBjYTBkNzQyNjI3NmM1YTMzNDc1MGI5MS5wbmeSlQMACc0DmM0CBZMFzQSwzQJ2",
    "source": "Business Insider Africa"
  },
  {
    "title": "Pope: May those who suffer find true peace in the charity of God",
    "desc": "Christian News,World Christian News,Malaysia Church,Religion Christianity",
    "image": "https://heraldmalaysia.s3.ap-southeast-1.amazonaws.com/uploads/news/2026/2/2448136171770533603.jpg",
    "source": "Herald Malaysia Online"
  },
  {
    "title": "England vs Nepal Free Streams: TV Channels, Squads & Preview",
    "desc": "Here's how to watch Pakistan vs Netherlands T20 World Cup 2026 live stream from anywhere in the world, including for FREE.",
    "image": "https://cdn.mos.cms.futurecdn.net/Urm68f8cKhNF9yWv6juLeS-2186-80.jpg",
    "source": "TechRadar"
  },
  {
    "title": "Remarks by IMF Managing Director Kristalina Georgieva at the 2026 AlUla Conference for Emerging Market Economies",
    "desc": "Al salam Alaikum! Welcome everyone! Let me thank Minister Al-Jadaan and the Kingdom of Saudi Arabia for once again hosting this fantastic conference in AlUla.",
    "image": "https://www.imf.org/-/media/project/imf/shared/images/news/twitter-seal.png?h=405&iar=0&w=400",
    "source": "International Monetary Fund | IMF"
  },
  {
    "title": "Here Are the Winners of the 2026 DGA Awards",
    "desc": "At the 2026 Directors Guild of America Awards, winners were thinking about those we’ve lost. Seth Rogen and Evan Goldberg thanked the late Catherine O’Hara for their ‘Studio’ win, and PTA thanked ‘OBAA’ AD Adam Somner.",
    "image": "https://pyxis.nymag.com/v1/imgs/f5f/15f/3a6ba59bc91dc096e5bd47917bc0391bc0-dga-awards.1x.rsocial.w1200.jpg",
    "source": "Vulture"
  },
  {
    "title": "Ancient bones reveal chilling victory rituals after Europe’s earliest wars",
    "desc": "New evidence from Neolithic mass graves in northeastern France suggests that some of Europe’s earliest violent encounters were not random acts of brutality, but carefully staged displays of power. By analyzing chemical clues locked in ancient bones and teeth, researchers found that many victims were outsiders who suffered extreme, ritualized violence after conflict. Severed arms appear to have been taken from local enemies killed in battle, while captives from farther away were executed in a grim form of public spectacle.",
    "image": "https://www.sciencedaily.com/images/1920/late-middle-neolithic-violence-related-human-pits.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Export now driven by certification, not just product quality or price - NEPC",
    "desc": "According to the Nigerian Export Promotion Council (NEPC) who spoke through the Ngozi Ibe, Ngozi Ibe, Regional Coordinator, South...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2026/02/Untitled-design-2026-02-08T074745.563-1.png",
    "source": "Businessday NG"
  },
  {
    "title": "Civil and Muslim marriage registries to return to Canning Rise in 2029 after redevelopment",
    "desc": "The ROM and ROMM have been temporarily relocated to Esplanade Mall from 2025 to 2028 as the Canning Rise site is being redeveloped.",
    "image": "https://dam.mediacorp.sg/image/upload/s--GIbvYuMG--/c_crop,h_3238,w_5756,x_1,y_0/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/08/251222_01_entry_copy.jpg?itok=o5q0d8U-",
    "source": "CNA"
  },
  {
    "title": "New implant could transform diabetes treatment",
    "desc": "The study, which is peer-reviewed and published in Science introduces a “living, cell-based implant” that works as a pancreas and is protected against immune rejection by a novel system.",
    "image": "https://images.jpost.com/image/upload/f_auto,fl_lossy/q_auto/c_fill,g_faces:center,h_720,w_1280/439234",
    "source": "The Jerusalem Post"
  }
]