[
  {
    "title": "Quidditch team from Ugandan village harbours Harry Potter-inspired World Cup dreams",
    "desc": "The sport of Quidditch – inspired by the fictional game in the Harry Potter books – is growing in popularity in Uganda, where there is now a national tournament and more than 200 players. Organisers…",
    "image": "https://s.france24.com/media/display/7f47659e-01b9-11f1-8400-005056bfb2b6/w:1280/p:16x9/000-946W2FF.jpg",
    "source": "France 24"
  },
  {
    "title": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims",
    "desc": "Lawyers for the unnamed woman claim she was 'treated like a prostitute' at Jeffrey Epstein's home.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/44d8/live/f42bd6c0-01b8-11f1-8162-915dd1b9ab69.jpg",
    "source": "BBC"
  },
  {
    "title": "Andrew and Epstein asked exotic dancer for 'sex acts', legal letter claims",
    "desc": "Lawyers for the unnamed woman claim she was 'treated like a prostitute' at Jeffrey Epstein's home.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/44d8/live/f42bd6c0-01b8-11f1-8162-915dd1b9ab69.jpg",
    "source": "BBC"
  },
  {
    "title": "Analysts ramp up gold forecasts as global uncertainties mount",
    "desc": "Gold is set for another record performance in 2026, a Reuters poll showed, as analysts ramp up their forecasts, with geopolitical uncertainty and robust central bank buying still the main drivers.\n...",
    "image": "https://cdn.zonebourse.com/static/resize/0/0//images/reuters/2026-02/2026-02-04T125456Z_1_LYNXMPEM130TD_RTROPTP_4_GLOBAL-PRECIOUS.JPG",
    "source": "marketscreener.com"
  },
  {
    "title": "Microsoft Moves to Retire TLS 1.0, 1.1 in Azure Blob Storage",
    "desc": "Microsoft is ending TLS 1.0 and 1.1 support for Azure Blob Storage, requiring TLS 1.2 and pushing organizations to update legacy clients.",
    "image": "https://petri.com/wp-content/uploads/2022/02/Storage_05.jpg",
    "source": "Petri IT Knowledgebase"
  },
  {
    "title": "'I've got a lot of faith'",
    "desc": "Ireland captain Caelan Doris insisted fly-half Sam Prendergast is making progress on his defensive deficiencies as he backed him to shine during the Guinness Six Nations.",
    "image": "https://www.rte.ie/images/0023d874-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "New dinosaur fossils could provide evolutionary clues: study",
    "desc": "Scientists have said fossils of a small newly discovered dinosaur found in Spain could change ideas on the evolution of ornithopods.",
    "image": "https://static.dw.com/image/75798513_6.jpg",
    "source": "dw.com"
  },
  {
    "title": "‘I’m not bothered about anything that happens outside my life’ - Fella Makafui asserts",
    "desc": "Ghanaian actress and entrepreneur Fella Makafui has opened up about how she deals with public opinion and social media criticism, stating that she has learned not to let online commentary affect her personal life.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/641/64139762.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "I was poisoned by a family member after my song was aired on TV - Lady Ophelia recounts",
    "desc": "Ghanaian gospel artiste Lady Ophelia has shared a harrowing story of how she was poisoned by a family member who believed she had become wealthy after her music was aired on TV.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/238/23862393.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Three Ghanaian pastors dragged online over side chick controversies",
    "desc": "In recent years, several prominent Ghanaian pastors have faced intense scrutiny online over allegations of extramarital affairs.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/305/30516186.jpg",
    "source": "GhanaWeb"
  }
]