[
  {
    "title": "WESCO International, Inc. Announces Upcoming Retirement of Dave Schulz, EVP and CFO, and Appointment of Indraneel Dev as EVP and CFO",
    "desc": "/PRNewswire/ -- WESCO International, Inc. (NYSE: WCC), a leading provider of business-to-business distribution, logistics services and supply chain solutions,...",
    "image": "https://mma.prnewswire.com/media/2069279/WESCO_Logo.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "Over 20,000 hours spent in solitary confinement by patient in new Central Mental Hospital",
    "desc": "The documentary reveals 50 beds at the hospital have remained unused for more than three years after the hospital opened.",
    "image": "https://www.kildare-nationalist.ie/cms_media/module_img/7666/3833214_1_articledetail_cc-central-mental-opening50.jpg",
    "source": "kildare-nationalist.ie"
  },
  {
    "title": "Spotify Reports Fourth Quarter 2025 Earnings",
    "desc": "Today, we announced our fourth quarter 2025 earnings, marking a strong finish to the year with exceptional user growth and continued momentum across the business. Daniel Ek, Founder and Executive Chairman, said: “Today, what we’ve really built is a technology platform for audio – and increasingly, for all the ways creators connect with audiences. And...",
    "image": "https://storage.googleapis.com/pr-newsroom-wp/1/2026/02/2025Q4-Earnings_FTRHeader345038450.png",
    "source": "Spotify"
  },
  {
    "title": "Stargazing for Primary Kids: Exploring the Clear February Night Sky",
    "desc": "February in Ireland offers a unique window into the cosmos. With the sun setting early and the crisp winter air often providing excellent clarity, it is a",
    "image": "https://schooldays.ie/wp-content/uploads/2026/02/easy-lee-PTtW0VT7gZA-unsplash-1024x576.jpg",
    "source": "Schooldays.ie"
  },
  {
    "title": "Gut Microbiota Links to Benign Prostatic Hyperplasia",
    "desc": "Gut Microbiota and Benign Prostatic Hyperplasia research highlights new inflammatory pathways and microbiome targets. Learn more.",
    "image": "https://www.emjreviews.com/wp-content/uploads/2026/02/11am-urol.jpg",
    "source": "European Medical Journal"
  },
  {
    "title": "Earth, air, fire, water: the growing links between climate change and geophysical hazards",
    "desc": "Scientists are uncovering how climate change influences seismic activity, volcanic hazards and extreme weather, as Michael Allen uncovers",
    "image": "https://physicsworld.com/wp-content/uploads/2026/02/2026-02-allen-indonesia-bromo-volcano-featured-crop-2177616484-istock-panya.jpg",
    "source": "Physics World"
  },
  {
    "title": "Segun Johnson makes history with third consecutive APPOEM live band award",
    "desc": "The Nation Newspaper Segun Johnson makes history with third consecutive APPOEM live band award",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/02/10114319/Segun-Johnson.jpeg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "African Energy Chamber (AEC) Endorses Kigali’s Africa CEO Forum as the Continent’s Strategic Hub",
    "desc": "The African Energy Chamber (AEC) (https://EnergyChamber.org) has formally endorsed the upcoming Africa CEO Forum in Kigali,...",
    "image": "http://www.businessghana.com/site/img/../../cms/img/news/2026-02-10-105047AEC.jpg",
    "source": "BusinessGhana"
  },
  {
    "title": "The DJI Power 2000 power station has never been cheaper at Amazon - save $600 right now",
    "desc": "As of Feb. 10, the DJI Power 2000 portable power station is back to its lowest-ever price at Amazon of $699 for Prime members exclusively. This is 46% off its list price of $1,299.",
    "image": "https://helios-i.mashable.com/imagery/articles/033kwmFabIRHKAi1st17a9e/hero-image.fill.size_1200x675.v1770716283.jpg",
    "source": "Mashable"
  },
  {
    "title": "Ringgit climbs to 3.92 vs US dollar ahead of Malaysia's GDP data",
    "desc": "KUALA LUMPUR: The ringgit revisited the 3.92 level to end higher against the US dollar on Tuesday, as investors took positions ahead of the release of Malaysia's gross domestic product (GDP) data on Friday.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/10/3764165.jpeg",
    "source": "The Star | Malaysia"
  }
]