[
  {
    "title": "William and Kate share Valentine's portrait as Meghan offers rare glimpse of Harry with Lilibet",
    "desc": "Meghan shared a photo of Harry with their four-year-old daughter and described her family as her \"forever Valentines\", as William and Kate posted a wholesome snap to mark 14 February.",
    "image": "https://e3.365dm.com/26/02/1600x900/skynews-wales-william-kate_7165391.jpg?20260215041644",
    "source": "Sky News"
  },
  {
    "title": "Bogus cop, State security agent arrested for drug trafficking",
    "desc": "A 35-year-old man wearing full police uniform was arrested for drug peddling and trafficking alongside his accomplice, a State security agent. Norest Jingura (35) and Alison Maredza (43), a member of the state security services, were nabbed with a huge quantity of dagga along the Harare-Beitbridge highway. Zimbabwe Republic Police (ZRP) national spokesperson, Commissioner Paul […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2018/11/02234101/handcuffs.jpg",
    "source": "NewZimbabwe.com"
  },
  {
    "title": "LIVE: West Indies deal body blows to Nepal",
    "desc": "Mumbai plays host to a Group C affair that carries large ramifications at the ICC Men's T20 World Cup, with Nepal looking to keep their tournament hopes alive.",
    "image": "https://images.icc-cricket.com/image/upload/t_ratio16_9-size20-webp/prd/jvi7bzus3jop0vtoyytz",
    "source": "ICC"
  },
  {
    "title": "Chief Justice Maya caught in a judge's alleged misconduct row",
    "desc": "The inmates have accused Chief Justice Maya of downgrading their complaint against Judge Samuel Makamu",
    "image": "https://media.citizen.co.za/wp-content/uploads/2026/02/Chief-Justice-Mandisa-Maya-2.jpg",
    "source": "The Citizen"
  },
  {
    "title": "Ho Chi Minh in Perspectives, with the POCO M8 5G",
    "desc": "During my recent trip to Ho Chi Minh City in Vietnam, I brought along the POCO M8 5G as my everyday device. It was not meant to be a flagship showcase or a",
    "image": "https://walastech.com/wp-content/uploads/2026/02/poco-m8-5g-vietnam_1.jpeg",
    "source": "WalasTech"
  },
  {
    "title": "Is Carrefour (ENXTPA:CA) Pricing Reflect Its Cash Flow Value After Recent Share Price Gains",
    "desc": "If you are wondering whether Carrefour's current share price offers fair value or a potential mismatch to its fundamentals, you are not alone. The stock last closed at €15.68, with returns of 5.6% over 7 days, 13.7% over 30 days, 8.8% year to date, 22.9% over 1 year and 30.8% over 5 years. Recent news around Carrefour has focused on its role as a major European retailer and how it is positioned in the broader consumer sector. This helps frame how investors think about both its resilience and...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/368af49dc36f086fda5eca7ed2c27e62",
    "source": "Yahoo Finance"
  },
  {
    "title": "When Steve Jobs got Google logo changed; told Google: I don't like the way...",
    "desc": "Tech News News: It was a Sunday morning in January 2008. Vic Gundotra, then Google's Senior Vice President of Engineering, was sitting in church with his family when .",
    "image": "https://static.toiimg.com/thumb/msid-128371974,width-1280,height-720,imgsize-801246,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "A Look At Atomera (ATOM) Valuation After Recent Earnings And Sharper Short Term Share Price Moves",
    "desc": "Why Atomera’s latest earnings are drawing fresh attention Atomera (ATOM) is back on investors’ radar after its fourth quarter and full year 2025 earnings report, which detailed low sales levels alongside continued net losses and modestly narrower per share losses. The company reported fourth quarter sales of US$0.05 million with a net loss of US$4.43 million, while full year sales reached US$0.065 million against a net loss of US$20.17 million, giving investors updated visibility on Atomera’s...",
    "image": "https://s.yimg.com/os/en/simply_wall_st__316/98479ef7e2a2339ba3575f02b13c7750",
    "source": "Yahoo Finance"
  },
  {
    "title": "Ukraine сonfirms strike on oil terminal in Russia's Krasnodar Krai, hits air defense system in Crimea",
    "desc": "Ukraine carried out strikes on an oil terminal in southern Russia and a Russian air defense system in Crimea overnight on Feb. 14–15, according to Ukraine's military intelligence (HUR).",
    "image": "https://assets.kyivindependent.com/content/images/2024/02/GettyImages-1209343725--1-.jpg",
    "source": "The Kyiv Independent"
  },
  {
    "title": "Chamisa evokes Tsvangirai's bruised legacy as battle over constitutional changes heats up",
    "desc": "OPPOSITION politician Nelson Chamisa has paid tribute to his late political mentor Morgan Tsvangirai, recalling what he described as scars of persecution, betrayal and “constitutional mutilation.” The 48-year-old former Citizens Coalition for Change (CCC) leader says the proposed alterations to the supreme law threaten to tip Zimbabwe into full-blown dictatorship, the very scourge Tsvangirai battled […]",
    "image": "https://s3-eu-west-2.amazonaws.com/newzimlive/wp-content/uploads/2026/01/23174201/nelson-chamisa-.jpeg",
    "source": "NewZimbabwe.com"
  }
]