[
  {
    "title": "Bic Runga says sadness is no longer her 'shtick'",
    "desc": "Now 50, the award-winning songwriter is feeling \"really happy\" as she releases her first original album in 15 years.",
    "image": "https://media.rnztools.nz/rnz/image/upload/s--SXKbMPcF--/t_tohu-badge-facebook/f_auto/q_auto/4JT9YJT_20260213_Bic_Runga_M101_0H2A3343_jpg?_a=BAMABkiu0",
    "source": "RNZ"
  },
  {
    "title": "South Korea’s President Lee to make three-day state visit to Singapore",
    "desc": "SINGAPORE: South Korea’s President Lee Jae Myung will make a state visit to Singapore from Sunday (Mar 1) to Tuesday, the Ministry of Foreign Affairs (MFA) announced on Saturday. The three-day visit comes at the invitation of President Tharman Shanmugaratnam.Mr Lee will be accompanied by first l",
    "image": "https://dam.mediacorp.sg/image/upload/s--pF9Use3F--/c_crop,h_759,w_1350,x_0,y_1/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2023-11:afp_watermark_14112023,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/27/2_panel_composite_42.png?itok=sdP6M-nI",
    "source": "CNA"
  },
  {
    "title": "Paramount CEO used political ties, deep pockets to buy Warner Bros",
    "desc": "After the board of Warner Bros Discovery Inc concluded a meeting on Thursday afternoon, chief executive officer David Zaslav called David Ellison and Ted Sarandos to let them know the results. The board had deemed Ellison and Paramount Skydance Corp’s latest bid superior to that of Netflix Inc and Sarandos.",
    "image": "https://assets.theedgemarkets.com/Paramount Ellison_Bloomberg.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "Jokowi Highlights Key Talks at Bloomberg New Economy Forum 2026",
    "desc": "Former Indonesian President Jokowi predicts that a major revolution in AI will occur within the next five to fifteen years.",
    "image": "https://statik.tempo.co/data/2026/02/27/id_1461038/1461038_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "10 Best Ways for Indie Artists to Promote Their Music Online",
    "desc": "If you're an independent artist looking to create, promote and grow your online presence, creating a home base and foundation of your work is key.",
    "image": "https://www.billboard.com/wp-content/uploads/2026/02/Bandzoogle-billboard-1800.jpg?w=1024",
    "source": "Billboard"
  },
  {
    "title": "Miami (Ohio) RedHawks vs. Western Michigan Broncos Live Score and Stats",
    "desc": "Get real-time Men's College Basketball coverage and scores as Miami (Ohio) RedHawks takes on Western Michigan Broncos. We bring you the latest game previews, live stats, expert picks and recaps on CBS Sports",
    "image": "https://sportsfly.cbsistatic.com/fly-467/bundles/sportsmediacss/images/fantasy/default-article-image-large.png",
    "source": "CBS Sports"
  },
  {
    "title": "Sabah, Sarawak hold key to control of Putrajaya in GE16, says Salleh",
    "desc": "The former Sabah chief minister says if no party wins a strong majority in the next general election, Borneo becomes the tipping point.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2024/08/d006ac34-salleh-said-keruak-bernama-220824-1.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Statement by Secretary of State van Koeverden on the representation of Russia and Belarus at the Milano Cortina 2026 Paralympic Winter Games",
    "desc": "Canada strongly opposes the decision of the International Paralympic Committee to allocate ten competition slots to the National Paralympic Committees of Russia and Belarus at the Milano Cortina 2026 Paralympic Winter Games",
    "image": "https://www.canada.ca/content/dam/pch/images/news/PCH2025-SM-PressRoom-Statement-eng.jpg",
    "source": "canada.ca"
  },
  {
    "title": "Facing threats of war, Denmark turns to a new weapon: women",
    "desc": "Denmark is fast-tracking female conscription as it muscles up to Russia and faces threats of invasion from the US.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ea1f5f3d569500fe078772e380e136a8?impolicy=wcms_watermark_news&cropH=663&cropW=1179&xPos=0&yPos=425&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "China’s pivot from GDP obsession sparks cadre confusion, testing local governance",
    "desc": "Governors and mayors must reconcile Beijing’s people-centric mandates with traditional growth targets, navigating vague appraisal changes and performance concepts.",
    "image": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/canvas/2026/02/27/2ca82981-d93b-4e89-8d7b-341ecf1b337b_2d927f65.jpg?itok=YTV43JX-&v=1772186638",
    "source": "South China Morning Post"
  }
]