[
  {
    "title": "The Essential Lifestyle App for the AI Era",
    "desc": "SINGAPORE, Feb. 25, 2026 /PRNewswire/ — As AI integrates into daily life, remote connectivity is transforming from an IT support […]",
    "image": "https://technode.global/wp-content/uploads/2023/09/TNGlobal-featured.jpg",
    "source": "TNGlobal"
  },
  {
    "title": "LeBron James, Luka Doncic Break Down Lakers' Failed Final Play in Videos After Loss to Magic",
    "desc": "Los Angeles Lakers stars LeBron James and Luka Dončić explained what went wrong on the final play of the game during their 110-109 loss to the Orlando Magic on Tuesday night.",
    "image": "https://gsp-image-cdn.wmsports.io/cms/prod/bleacher-report/getty_images/2026-02/2261544281_large_cropped.jpg?w=3800&h=2000",
    "source": "Bleacher Report"
  },
  {
    "title": "10 Tanzanians awarded the Samia Scholarship to study Master’s Degree courses",
    "desc": "ARUSHA: TEN Tanzanian students have been awarded the scholarship for Master’s degree studies in Data Science, Artificial Intelligence, and Computational Science under the Samia Scholarship Extended (SSE DS/AI+) programme. The Ministry of Education, Science and Technology announced this in Dar es Salaam today, Febuar 25, 2026, noting that the government has already begun offering scholarships",
    "image": "https://dailynews.co.tz/wp-content/uploads/2025/09/Partial-Scholarship-780x470-1.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Gucci criticised for 'AI slop' images ahead of major fashion show",
    "desc": "Users of social media - where the marketing campaign has been launched - say it is out of keeping with Gucci's reputation for luxury.",
    "image": "https://s.yimg.com/os/en/bbc_us_articles_995/64f68d93b7ec1b82597074ef63dcf9ba",
    "source": "Yahoo"
  },
  {
    "title": "Know Your Nominees: GhanaWeb Excellence Awards Music, Drama, Dance category",
    "desc": "GhanaWeb recently announced the nominees for the 2025 Edition of its annual GhanaWeb Excellence Awards.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/835/83542442.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Iran-US tensions live: Tehran delegation heads to Geneva for third round of negotiations",
    "desc": "Iran-US tensions live: Trump hit out at Iran and called it ‘World’s no 1 sponsor of terrorism.' He also claimed that the clerical regime in Iran killed 32,000 people following the protests that started in December 2025. | World News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/25/550x309/president_trump__1772007558458_1772007558573.jpg",
    "source": "Hindustan Times"
  },
  {
    "title": "I use this simple repetition trick with ChatGPT when it misses the point - and it works every time",
    "desc": "The easiest AI upgrade is saying the same thing twice",
    "image": "https://cdn.mos.cms.futurecdn.net/Eakjt4xkTm7Zjoy54bJVY-1920-80.jpg",
    "source": "TechRadar"
  },
  {
    "title": "Jubilee House to host 69th Independence celebration",
    "desc": "Jubilee House to host 69th Independence celebration",
    "image": "https://www.graphic.com.gh/images/2026/Feb/25/jbilee.jpg",
    "source": "Graphic Online"
  },
  {
    "title": "Stan Wawrinka bids farewell to Dubai after 'one last chance' vs. Daniil Medvedev",
    "desc": "Stan Wawrinka was honoured under the desert sun on Wednesday afternoon, when he played his final match at the Dubai Duty Free Tennis Championships.",
    "image": "https://www.atptour.com/-/media/images/news/2026/02/25/12/23/wawrinka-dubai-2026-farewell-ceremony.jpg",
    "source": "ATP Tour"
  },
  {
    "title": "Easy-to-use blood test score can help identify alcohol-related fatty liver disease",
    "desc": "Researchers at University of California San Diego School of Medicine have developed a new, easy-to-use blood test score that can help identify when fatty liver disease is being driven by excessive alcohol use, an important distinction that often goes unrecognized in routine care.",
    "image": "https://www.news-medical.net/image-handler/picture/2016/3/Blood_Testing_6c4f4bff47c24f5ba754ed98c75bd512-620x480.jpg",
    "source": "News-Medical"
  }
]