[
  {
    "title": "Sino-African Cooperation: A New Turning Point [Business Africa]",
    "desc": "According to data from Boston University, Africa now sends more financial flows to China than it receives. This shift marks a significant change in the nature of economic relations between Beijing and the African continent.",
    "image": "https://images.euronews.com/articles/stories/09/63/73/96/1024x538_cmsv2_a963e3c3-011b-5838-91f8-3fbad8429872-9637396.jpg",
    "source": "africanews.com"
  },
  {
    "title": "grown man”: ALS robbed him of almost everything but God gave him something else more precious — Salt&Light",
    "desc": "The room is quiet but for the soft, rhythmic whoosh of the ventilator. An electronic voice breaks the silence. “Left foot, cover. Right eyebag.” “We have crossed the five-year mark.” With gentle hands, Yeo Wanqi tugs at the blanket to make sure that it fully covers her husband’s nearly six-foot frame. Then she reaches out […]",
    "image": "https://saltandlight.sg/wp-content/uploads/2026/02/kiss-1.jpeg",
    "source": "Salt&Light"
  },
  {
    "title": "Nollywood actor, Timini opens up on love life",
    "desc": "Nollywood actor, Timini Egbuson has opened up about his love life and past relationship experiences, reflecting on how his views have evolved over the",
    "image": "https://dailypost.ng/wp-content/uploads/2026/02/Timini-Egbuson.jpg",
    "source": "Daily Post Nigeria"
  },
  {
    "title": "Winter Olympics 2026: All you need to know about Milan-Cortina Games",
    "desc": "The Winter Olympics opening ceremony takes place on Friday, and for the 16 days that follow many eyes of sport lovers worldwide will be focused on the Milan-Cortina Games.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/fe06/live/a0be9e90-01c8-11f1-a741-e552072fc91c.jpg",
    "source": "BBC"
  },
  {
    "title": "ASUS IoT Introduces PE1000U Rugged Fanless DIN-Rail Industrial PC",
    "desc": "ASUS IoT, a global leader in AIoT solutions, today announced PE1000U, a compact DIN-rail-mountable edge computer powered by an Intel Core Ultra Series 2 processor. Measuring just 63 x 110 x 160 mm, PE1000U features extensive I/O connectivity to address the growing demand for real-time intelligence a...",
    "image": "https://www.techpowerup.com/img/cVTqc6c6NSzLDoA6.jpg",
    "source": "TechPowerUp"
  },
  {
    "title": "Singapore platform operators warn of longer delivery times following tighter laws on mobility aids",
    "desc": "The speed limit for personal mobility aids (PMAs) will be reduced from 10kmh to 6kmh from Jun 1, 2026.",
    "image": "https://dam.mediacorp.sg/image/upload/s--1C6Mdcbn--/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2024/12/17/lta_pmd_mobility_004.jpg?itok=bSZUoB6a",
    "source": "CNA"
  },
  {
    "title": "Fraud victims to be compensated up to Rs 25k under RBI's new customer protection measures",
    "desc": "India Business News: MUMBAI: The RBI is proposing to compensate customers for losses arising from small-value digital frauds, with payouts of up to Rs 25,000, as part of a.",
    "image": "https://static.toiimg.com/thumb/msid-127975944,width-1280,height-720,imgsize-498612,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "Times of India"
  },
  {
    "title": "Singapore platform operators warn of longer delivery times following tighter laws on mobility aids",
    "desc": "The speed limit for personal mobility aids (PMAs) will be reduced from 10kmh to 6kmh from Jun 1, 2026.",
    "image": "https://dam.mediacorp.sg/image/upload/s--1C6Mdcbn--/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2024/12/17/lta_pmd_mobility_004.jpg?itok=bSZUoB6a",
    "source": "CNA"
  },
  {
    "title": "Man stabbed to death as police cordon off Wythenshawe street",
    "desc": "A man in his 20s has died after a stabbing in a street in Northern Moor, the BBC understands.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/1f09/live/6af77ee0-0339-11f1-9d05-c7b737bbaef1.jpg",
    "source": "BBC"
  },
  {
    "title": "MACC detains IJM Corp chairman in graft probe",
    "desc": "KUALA LUMPUR: The chairman of IJM Corporation Bhd has been detained in connection with investigations into corporate governance issues, procurement processes, financial transactions and the ownership of overseas assets estimated to be worth about RM2.5bil.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/06/3757794.jpeg",
    "source": "thestar.com.my"
  }
]