[
  {
    "title": "CELLIANT Infrared Technology Expands Into Beauty With New Skincare Mask Line in Partnership With IKS",
    "desc": "/PRNewswire/ -- Hologenix, the creator of CELLIANT® infrared (IR) technology, has teamed up with Innovative Korean Solutions (iKs) to bring a new level of...",
    "image": "https://mma.prnewswire.com/media/2921656/Hologenix_CELLIANT_Logo.jpg?p=facebook",
    "source": "PR Newswire"
  },
  {
    "title": "Ghana Armed Forces rescue stranded fishermen after armed sea attack",
    "desc": "The Ghana Armed Forces has successfully rescued dozens of stranded Ghanaian fishermen who were attacked by suspected sea robbers off the coast of the Central Region.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/690/69093470.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Justice Department Exposed Cooperating Witnesses in Epstein Files",
    "desc": "The disclosure is the latest example of how the urgent push to release the files led to the government publicizing information it would normally keep under wraps.",
    "image": "https://static01.nyt.com/images/2026/02/19/multimedia/19met-epstein-witnesses-mqbh/19met-epstein-witnesses-mqbh-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "'Bridgerton' Seasons 5 & 6 Leads Confirmed: Who Will Lead Netflix Series Next",
    "desc": "‘Bridgerton’ Seasons 5 & 6 Leads Confirmed: Who Will Lead Netflix Series Next Who will be the lead for Bridgerton season five and six? Well, we do know the answers...we just don't know specifics just yet. Season 1 focused on Daphne…",
    "image": "https://cdn01.justjared.com/wp-content/uploads/headlines/2026/02/bridgerton-season-five-subject1.jpg",
    "source": "Just Jared"
  },
  {
    "title": "Australian government launches wind turbine manufacturing consultation",
    "desc": "The federal government is exploring the feasibility of manufacturing wind energy infrastructure locally, with the federal minister for industry saying he is \"sick of the naysayers\" who say local manufacturing is not sustainable.",
    "image": "https://live-production.wcms.abc-cdn.net.au/176ac94f35a97612bd406ae4334eeec3?impolicy=wcms_watermark_news&cropH=2088&cropW=3712&xPos=0&yPos=85&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "90% of Prostate Cancer Tumors Contain Microplastics, New Study Raises Concerns",
    "desc": "A recent study by NYU Langone Health has found microplastics in 90% of prostate cancer tumors, revealing a potential link between plastic exposure and cancer development.",
    "image": "https://indiandefencereview.com/wp-content/uploads/2026/02/90-of-prostate-cancer-tumors-contain-microplastics-new-study-raises-concerns-scaled.png",
    "source": "Indian Defence Review"
  },
  {
    "title": "Old Testament Themed Hymns Join Hymns for Home and Church",
    "desc": "The release of the new hymnbook of The Church of Jesus Christ of Latter-day Saints continues with the addition of 12 new songs to the “Hymns for Home and Church” collection in English, Spanish, Portuguese and French.",
    "image": "https://newsroom.churchofjesuschrist.org/media/640x480/frame_602.jpg",
    "source": "newsroom.churchofjesuschrist.org"
  },
  {
    "title": "The Saga of NASA's Space Station Evacuation Keeps Getting Stranger",
    "desc": "A NASA astronaut has voluntarily stepped forward, announcing in a NASA statement that it was he who had \"experienced a medical event.\"",
    "image": "https://futurism.com/wp-content/uploads/2026/02/nasa-space-station-medical-evacuation-saga.jpg?quality=85&w=1200",
    "source": "Futurism"
  },
  {
    "title": "Rachel Reeves eyes concessions for student loans",
    "desc": "The Treasury is considering lifting the debt threshold for graduates to quell Labour backbenchers unrest",
    "image": "https://www.thetimes.com/imageserver/image/%2Fc6d3b958-a44a-4d25-8c7a-ab48fb944272.jpg?crop=2480%2C1395%2C0%2C17&resize=1200",
    "source": "The Times"
  },
  {
    "title": "Kali Linux Introduces AI-Driven Penetration Testing Through Claude Integration",
    "desc": "A New Chapter in Offensive Cybersecurity Kali Linux, the widely used penetration testing distribution maintained by Offensive Security, has unveiled a major advancement in cybersecurity tooling: native support for artificial intelligence–assisted penetration testing. By integrating Anthropic’s Claud",
    "image": "https://media.licdn.com/dms/image/v2/D4E12AQGwmD4rxgt-ig/article-cover_image-shrink_720_1280/B4EZybLNZeJgAQ-/0/1772129941936?e=2147483647&v=beta&t=mO1g3dOUOpsZRKAZavNm9ZD1K5gPvNe-CmDlZnmw8X8",
    "source": "LinkedIn"
  }
]