[
  {
    "title": "ICE protest song Streets of Minneapolis",
    "desc": "The Boss has blasted the Trump administration and ICE agents in a new song responding to \"the state terror being visited\" on Minneapolis and dedicated to Renee Good and Alex Pretti.",
    "image": "https://live-production.wcms.abc-cdn.net.au/3f9c274014441b53ea27c76c8b26b4da?impolicy=wcms_watermark_news&cropH=2702&cropW=4804&xPos=116&yPos=95&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "17 Movies That Went From Beloved To Hated",
    "desc": "\"It's now mostly remembered for its ugliest choices: casual racism, and a general vibe that says, 'We didn’t think this through.'\"",
    "image": "https://img.buzzfeed.com/buzzfeed-static/static/2026-01/10/01/thumb/cmHKpiyO0.jpg?crop=1250:654;0,46%26downsize=1250:*",
    "source": "BuzzFeed"
  },
  {
    "title": "PH’s Christina Vanhefflin is Miss Intercontinental 2025 4th Runner-Up",
    "desc": "Christina Labareño Vanhefflin was named 4th Runner-Up at the Miss Intercontinental 2025 pageant held in Egypt.",
    "image": "https://images.gmanews.tv/webpics/2026/01/Screenshot_2026-01-30_at_09_2026_01_30_09_29_38.png",
    "source": "GMA Network"
  },
  {
    "title": "童年經典回歸！《Backyard Sports》動畫特別篇 YouTube 正式上線，《The Cuphead Show》團隊操刀製作",
    "desc": "經典運動電玩系列《Backyard Sports》正式跨足動畫領域。官方於今（30）日宣佈，動畫特別篇《Backyard Sports: The Animated Special》現已正式上線，玩家與觀眾可直接透過官方 YouTube 頻道收看這部改編作品。",
    "image": "https://i0.wp.com/www.ludens.com.tw/wp-content/uploads/2026/01/11261-1.jpg",
    "source": "Ludens Media"
  },
  {
    "title": "Daldal review Bhumi Pednekar shines in gritty thriller bogged down by repetition",
    "desc": "Bhumi Pedneker's crime-thriller Daldal explores social realities amid an ongoing crime investigation. However, bold themes and strong performances can't fully salvage the series, hampered by redundant flashbacks and clichés. Here's our review.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202601/daldal-review-293257517-16x9_0.jpg?VersionId=Bnn6xcwT6LJlBRRd6d68VaCMZfcrZExu",
    "source": "India Today"
  },
  {
    "title": "PRIYA trial links teen B12 intake to long-term health in babies",
    "desc": "The PRIYA trial links adolescent B12 intake to improved long-term health outcomes in babies, emphasising the need for supplementation.",
    "image": "https://th-i.thgim.com/public/sci-tech/science/l20z63/article70561345.ece/alternates/LANDSCAPE_1200/raghavendra-v-konkathi-LMhBpSI2-rM-unsplash.jpg",
    "source": "The Hindu"
  },
  {
    "title": "Insights from Wood Anatomy and Historical Analysis",
    "desc": "The arrival of the Portuguese Court in Rio de Janeiro in 1808 intensified wood extraction, compromising the city’s water supply. The Tijuca massif—largely deforested by 19th-century coffee cultivation—subsequently became the target of urgent imperial reforestation efforts, which resulted in one of the world’s earliest large-scale successful reforestation programs and established the Tijuca Forest as the largest planted tropical urban forest. Despite its scientific and cultural significance, the locations of early silvicultural experiments and the species employed had remained unidentified until recently. In this study, tree-ring dating combined with cartographic, ecological, and historiographic analyses was used to recover 19th-century planting data. This approach mapped trees planted from 1862 onward, based on growth-ring analysis of Cedrela odorata L., Copaifera lucens Dwyer, and Lafoensia glyptocarpa Koehne. The results highlight the value of wood anatomy and dendrochronology for reconstructing the historical development of Brazilian forests—methods seldom applied for this purpose. Identifying trees planted more than 150 years ago provides a basis for future research on climate change and urbanization in Rio de Janeiro and supports forest management strategies amid the global climate crisis, underscoring the urgent need for ecological restoration across Brazilian ecosystems.",
    "image": "https://file.scirp.org/image/gep2025010716304140.png",
    "source": "SCIRP Open Access"
  },
  {
    "title": "Man killed after bulldozer rolls at Port of Brisbane worksite",
    "desc": "A man has been killed after a bulldozer rolled at the Port of Brisbane this morning.Paramedics were called ...",
    "image": "https://imageresizer.static9.net.au/JORc2dEtB3Sb5C7_8tgadR4xte0=/324x98:1835x949/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2F93ed5692-64f9-46da-9d42-b4cdd52b9dc1",
    "source": "9News.com.au"
  },
  {
    "title": "Nicki Minaj declared herself Trump's 'No. 1 fan.' Why is that controversial?",
    "desc": "Rapper Nicki Minaj on Wednesday declared herself U.S. President Donald Trump’s “No. 1 fan,” before showing off a gold card visa.",
    "image": "https://i.cbc.ca/ais/4af8ec72-8a3e-4751-b4a1-72468a2b7d3f,1769730165226/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C88%2C4651%2C2616%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Missing baby feared dead after mom’s remains found in St. Albert apartment",
    "desc": "RCMP believe 23-year-old Ayla Egotik-Learn was killed on or near Dec. 5, 2025 and her missing child, nine-month-old daughter Braylee Beasley, is also dead.",
    "image": "https://globalnews.ca/wp-content/uploads/2026/01/AYLA-Braylee.jpg?quality=65&strip=all&w=720&h=379&crop=1",
    "source": "Global News"
  }
]