[
  {
    "title": "NPP China and Belgium branches boost Patriotic Institute with financial and training support",
    "desc": "The Patriotic Institute on Thursday, 19 February 2026, received donations from two external branches of the New Patriotic Party (NPP), in a move described as a significant boost to its political education and capacity-building efforts.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/1-75.jpg",
    "source": "MyJoyOnline"
  },
  {
    "title": "NASA Investigates How People Respond to Air Taxi Noise",
    "desc": "New kinds of aircraft taking to the skies could mean unfamiliar sounds overhead — and where you’re hearing them might matter, according to new NASA research.",
    "image": "https://www.asdnews.com/NewsImages/b/96004/104074_O.jpg",
    "source": "ASDNews"
  },
  {
    "title": "The huge challenge King Charles faces after Andrew's arrest revealed",
    "desc": "The latest scandal involving Andrew Mountbatten-Windsor will be a tough one for King Charles to tackle, an expert has claimed.",
    "image": "https://cdn.images.express.co.uk/img/dynamic/106/1200x630/6754564.jpg",
    "source": "Daily Express"
  },
  {
    "title": "Barcelona learn staggering asking price for Julian Alvarez from Atletico Madrid",
    "desc": "Barcelona’s search for Robert Lewandowski’s successor has hit a massive roadblock after Atletico Madrid slapped a record-breaking valuation on Julian Alvarez.",
    "image": "https://assets.goal.com/images/v3/bltf680b1025ba4423f/Julian%20Alvarez.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Olu urges prayer, spiritual reawakening",
    "desc": "The Nation Newspaper Sanwo-Olu urges prayer, spiritual reawakening",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/01/21064652/Sanwo-Olu-1200x686-1.png",
    "source": "The Nation Newspaper"
  },
  {
    "title": "Eric Dane, Grey's Anatomy and Euphoria actor, dead at 53",
    "desc": "Dane died from amyotrophic lateral sclerosis, known also as Lou Gehrig’s disease, less than a year after he announced his diagnosis.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/eric-dane-YBUBAI6TWFG53MCGYA7AJ43BAU.jpg?auth=25d68f2bc7583af576576539763a2ece149d040aeaa2e94d05ffc944fec3a6d1&quality=70&width=600&height=315&focal=1694%2C844",
    "source": "1News"
  },
  {
    "title": "Roll Initiative On My Wallet: 5 Board Games I’m Blaming On Community Game Day",
    "desc": "Ahead of NAG’s first Community Board Game Day, here are five wishlist games I’m ready to add to my shelves, strategy, chaos and all.",
    "image": "https://www.nag.co.za/wp-content/uploads/2026/02/board-game-02.jpg",
    "source": "nag.co.za"
  },
  {
    "title": "Yungblud Completes ‘Idols’ With Part",
    "desc": "\"Idols (Complete)\" includes a fresh batch of seven tracks, including a new version of “Zombie” featuring The Smashing Pumpkins.",
    "image": "https://www.billboard.com/wp-content/uploads/2026/02/Yungblud-2026-press-billboard-1800.jpg?w=1024",
    "source": "Billboard"
  },
  {
    "title": "Complainant felt offended over not sharing stage with Amitabh Bachchan, says Rajpal Yadav’s lawyer",
    "desc": "Rajpal Yadav has been granted interim bail by the Delhi High Court and released from Tihar Jail in a case filed against him by businessman Madhav Gopa.",
    "image": "https://static.toiimg.com/thumb/msid-128600356,width-1280,height-720,imgsize-37104,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Construction bosses say tougher laws needed to stop return of Building Bad",
    "desc": "Former IBAC chief Alistair Maclean says he is “shocked” by the lack of resolve from government, the public service and integrity agencies to tackle corruption.",
    "image": "https://static.ffx.io/images/$zoom_0.2648%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_39/t_crop_custom/q_86%2Cf_auto/d97dccf8c731e133c5dace48aedca6bb208105bd",
    "source": "The Age"
  }
]