[
  {
    "title": "Mahama’s Accra Reset calls for sovereignty and private capital to drive job creation",
    "desc": "President John Dramani Mahama recently used iconic global convenings such as the United Nations General Assembly, the World Economic Forum in Davos, and the African Union Summit to make a case for what he calls a new sovereign future for Africa and the wider Global South.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/WhatsApp-Image-2026-02-26-at-14.58.24-2.jpeg",
    "source": "MyJoyOnline"
  },
  {
    "title": "From Baramulla to the brink of history: Auqib Nabi's defining Ranji Trophy season",
    "desc": "Cricket News: Hubballi: Auqib Nabi — a name that has echoed across the Indian domestic circuit over the past couple of seasons — is one the Karnataka camp will want.",
    "image": "https://static.toiimg.com/thumb/msid-128818362,width-1280,height-720,imgsize-94424,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Genting falls into the red on impairment hit; GenM swings to profit on forex gains",
    "desc": "Genting Bhd (KL:GENTING) sank into the red in its financial year 2025 (FY2025), as a sharp rise in impairment losses in its final quarter eclipsed earlier gains. In contrast, its 73.88%-owned subsidiary Genting Malaysia Bhd (KL:GENM) swung to a net profit in the same period, bolstered by the strengthening of the ringgit and robust overseas operations.",
    "image": "https://assets.theedgemarkets.com/genting_8_2_1_0.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "Japan aims to draw up international recommendation to curb space debris near Moon",
    "desc": "The area of the Moon is an extremely challenging environment for space debris removal. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/80ecfc84e11c14a54aecee845b0b92d0ce404d423901b869aa954820b14a0ac0",
    "source": "The Straits Times"
  },
  {
    "title": "Tim Cook Confirms Multi-Day Apple Reveals, Starting on Monday",
    "desc": "'A big week ahead,' the Apple CEO tweeted this morning.",
    "image": "https://sm.pcmag.com/t/pcmag_au/news/t/tim-cook-c/tim-cook-confirms-multi-day-apple-reveals-starting-on-monday_qavh.1200.jpg",
    "source": "PCMag Australia"
  },
  {
    "title": "Sarah Spain Goes On Deranged, Unhealthy Rant About U.S. Hockey, Trump And Men",
    "desc": "Former ESPN commentator Sarah Spain posted several emotional clips on Bluesky Wednesday night, targeting the U.S. men’s hockey team for visiting President Donald Trump.",
    "image": "https://static.outkick.com/www.outkick.com/content/uploads/2024/07/f33cc95d-sarah-spain-scaled.jpg",
    "source": "OutKick"
  },
  {
    "title": "Cancer Treatment Costs Undermine Hope, Life Satisfaction",
    "desc": "Cancer treatment can take a profound financial toll, and new research shows the damage does not stop at the bank account. Nearly half of patients",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=images.unsplash.com%2Fphoto-1584515933487-779824d29309%3Fixlib%3Drb-4.0.3%26amp%3Bixid%3DMnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8%26amp%3Bauto%3Dformat%26amp%3Bfit%3Dcrop%26amp%3Bw%3D1170%26amp%3Bq%3D80",
    "source": "Mirage News"
  },
  {
    "title": "FSG Limited Appoints Alice Wellio-Moyo",
    "desc": "FSG Limited is pleased to announce the appointment of Ms. Alice Wellio-Moyo, FCCA, FCPA, to its Board of Directors as an Independent Non-Executive Director, effective 1 February 2026. The appointment follows receipt of all requisite regulatory approvals. The appointment forms part of FSG Limited’s deliberate and ongoing governance evolution and reflects a continued strategic build of Board depth - in tandem with strengthened executive capability - undertaken over the past year. It reinforces the Group’s commitment to institutional resilience, financial stewardship, and robust independent oversight as core pillars of long-term value creation. This progression comes as the Group continues to deepen its regional footprint and impact in insurance and risk solutions, with an established presence across Botswana, Zambia and South Africa, further necessitating strengthened governance and independent perspective at Board level. Commenting on the appointment, FSG Limited Board Chair, Mr. Bame Pule, said “The appointment of Alice Wellio-Moyo as an…",
    "image": "https://botswanaunplugged.com/wp-content/uploads/2026/02/ALICE-WELLIO-MOYO-INDEPENDENT-NON-EXECUTIVE-DIRECTOR-.jpg?v=1772140258",
    "source": "Botswana Unplugged"
  },
  {
    "title": "RTÉ confirms receipt of payment for its share of GAAGO",
    "desc": "RTÉ has confirmed that it has today received payment from the GAA for its 50% share of GAAGO. RTÉ confirmed in February 2025 that it had agreed in principle with the GAA to sell its interest in GAAGO and to reinvest the revenue raised in the provision of services to the public. RTÉ also stated […]",
    "image": "https://about.rte.ie/wp-content/uploads/2026/02/9f95m6yf.png",
    "source": "RTE.ie"
  },
  {
    "title": "UN rights chief says Taliban decree expands executions, deepens repression",
    "desc": "Taliban decree expands death penalty, bans dissent. UNDecree not yet released; UN urges Taliban to rescind it.Turk likens Taliban system to gender apartheid.A new decree from Afghanistan's Taliban government is set to further crush...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-02-26/l_653106_074537_updates.jpg",
    "source": "Geo News"
  }
]