[
  {
    "title": "Vulnerable mum took her own life after benefits were cut due to DWP ‘error’",
    "desc": "A VULNERABLE mum took her own life after her benefits were cut due to a DWP error.\nTamara Jade Logan, a make-up artist from Glossop, Derbyshire,...",
    "image": "https://www.thesun.co.uk/wp-content/uploads/2026/01/newspress-collage-l7hf9s26m-1769503183003.jpg?quality=90&strip=all&1769503233&w=1920&h=1080&crop=1",
    "source": "The Sun"
  },
  {
    "title": "King Charles prepares new ‘secret weapon' for monarchy",
    "desc": "King Charles, ever since his ascension to the throne, faced some troublesome circumstances as he handled the reins of the monarchy even with his exceptionally long waiting period for the position.There had been the growing anti-monarchy...",
    "image": "https://www.geo.tv/assets/uploads/updates/2026-01-27/l_647470_023911_updates.jpg",
    "source": "Geo News"
  },
  {
    "title": "When do Jannik Sinner & Novak Djokovic play their Australian Open QF matches on Wednesday?",
    "desc": "Jannik Sinner and Novak Djokovic will both take to court on Wednesday at the Australian Open. But what time are they in action...?",
    "image": "https://www.atptour.com/-/media/images/news/2026/01/27/09/35/djokovic-schedule-ao-2026-qf.jpg",
    "source": "ATP Tour"
  },
  {
    "title": "Max Verstappen causes early red flag at Barcelona testing",
    "desc": "Max Verstappen started his first day of testing in Barcelona with a small trip through the gravel, causing a red flag early in the day.",
    "image": "https://cdn.racingnews365.com/2026/Verstappen/_1800x945_crop_center-center_75_none/G_W9gk7XoAAooJz_2026-01-25-112513_rlyx.jpg?v=1769340701",
    "source": "racingnews365.com"
  },
  {
    "title": "Strange white rocks on Mars hint at millions of years of rain",
    "desc": "Bright white rocks spotted by NASA’s Perseverance rover are rewriting what we thought we knew about ancient Mars. These aluminum-rich clays, called kaolinite, usually form on Earth only after millions of years of heavy rainfall in warm, humid environments—conditions similar to tropical rainforests. Their presence on today’s cold, dry Mars suggests the planet once had abundant rain, flowing water, and possibly lush oases long ago. Even more puzzling, the rocks are scattered across the landscape with no obvious source nearby, hinting at dramatic ancient events like floods, river transport, or asteroid impacts.",
    "image": "https://www.sciencedaily.com/images/1920/mars-rock-light-colored-dots.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "Shin Bet investigating suspected Israeli-linked smuggling funneling goods from Israel",
    "desc": "Israel Police and the Shin Bet are investigating a multi-suspect case under a sweeping gag order, amid security officials’ admission that thousands of items were smuggled into Gaza over the past year, possibly with Israeli involvement",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2025/11/14/SkMTtpwNeWx/SkMTtpwNeWx_0_313_3000_1688_0_large.jpg",
    "source": "ynetnews.com"
  },
  {
    "title": "Tanzania artists to brighten La Diva’s Environmental Conservation campaign",
    "desc": "MORONI: COMOROS' musician Samra Athouman La Diva said here that plans are underway to invite Tanzanian musicians in a joint event aimed to promoter environmental conservation in the Indian Ocean Isles. The Tanzanian Ambassador to the Union of the Comoros, Saidi Yakubu, met with renowned Comorian musician Samra Athoumani, popularly known as La Diva, after",
    "image": "https://dailynews.co.tz/wp-content/uploads/2022/07/favicon.ico",
    "source": "dailynews.co.tz"
  },
  {
    "title": "Why Chelsea FC beating Napoli may not guarantee Champions League last 16 place",
    "desc": "Blues require a big win to ensure progression",
    "image": "https://static.standard.co.uk/2026/01/21/22/26/Chelsea-FC-v-Pafos-FC-UEFA-Champions-League-202526-League-Phase-MD7-sl1ejobb.jpeg?width=1200&auto=webp&quality=75",
    "source": "standard.co.uk"
  },
  {
    "title": "What are Scotland's World Cup preparations looking like?",
    "desc": "BBC Scotland looks at the national team's warm-up schedule, Steve Clarke's injury concerns, and what sort of shape his side's opponents are in.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e78d/live/e2ebeb30-fad7-11f0-b5f7-49f0357294ff.png",
    "source": "BBC"
  },
  {
    "title": "What are Scotland's World Cup preparations looking like?",
    "desc": "BBC Scotland looks at the national team's warm-up schedule, Steve Clarke's injury concerns, and what sort of shape his side's opponents are in.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/e78d/live/e2ebeb30-fad7-11f0-b5f7-49f0357294ff.png",
    "source": "BBC"
  }
]