[
  {
    "title": "Alex de Minaur receives feedback from Carlos Alcaraz after Australian Open loss",
    "desc": "Alex de Minaur acknowledges he needs improvement in his game, as Carlos Alcaraz moves on to the Australian Open semifinals.",
    "image": "https://live-production.wcms.abc-cdn.net.au/d3c677d5488ea9b68115d344dde25db1?impolicy=wcms_watermark_news&cropH=2813&cropW=5000&xPos=0&yPos=220&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "British Army officer dies after incident during live fire training",
    "desc": "The 25-year-old died on Sunday after the incident at an army training site in Northumberland.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b16d/live/3558a6a0-fbb5-11f0-ab9d-51dbb3242e9b.jpg",
    "source": "BBC"
  },
  {
    "title": "Shooting near US–Mexico border: One critical after Border Patrol",
    "desc": "US News: One person was shot and is in critical condition after a shooting near the US–Mexico border in Arizona on Tuesday, officials said, reported Associated.",
    "image": "https://static.toiimg.com/thumb/msid-127650636,width-1280,height-720,imgsize-233656,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Thomas Frank confirms two Tottenham stars involved in car accident prior to Champions League trip to Eintracht Frankfurt",
    "desc": "Tottenham stars Wilson Odobert and Kolo Muani were involved in a car accident on the busy M25 motorway in Hertfordshire on Tuesday afternoon, head coach Thomas Frank has confirmed. The incident occurred shortly after midday, between the busy junctions 24 and 25, just a day before the pivotal Champions League clash. The car involved was Kolo Muani's, with Odobert following behind as they travelled to the airport for their flight to Germany.",
    "image": "https://assets.goal.com/images/v3/getty-2256761108/crop/MM5DGNJQGA5DCOJWHE5G433XMU5DAORRHAZA====/GettyImages-2256761108.jpg",
    "source": "Goal.com"
  },
  {
    "title": "Radiation Induces Red Tilt In Quantum Bouncing Cosmology , Resolving The Spectrum",
    "desc": "Researchers have demonstrated that incorporating both matter and radiation into ‘bouncing cosmology’ models, alternatives to the Big Bang theory, can naturally explain the observed large-scale structure of the universe without requiring complex adjustments.",
    "image": "https://quantumzeitgeist.com/wp-content/uploads/Image_fx-2026-01-27T080444.077.jpg",
    "source": "Quantum Zeitgeist"
  },
  {
    "title": "Winnie Odinga accuses Oketch Salah of lying about Raila’s final moments",
    "desc": "Winnie Odinga has disputed claims by Oketch Salah about being by Raila Odinga’s side during his final moments, questioning the accuracy and credibility of the account. - Kenya breaking news | Kenya news today | Capitalfm.co.ke",
    "image": "https://www.capitalfm.co.ke/news/files/2026/01/Winnie-OD-e1769542635237.jpg",
    "source": "capitalfm.co.ke"
  },
  {
    "title": "Adult ADHD across the lifespan",
    "desc": "Psychiatrist Sidhesh Phaldessai reviews how adult attention deficit hyperactivity disorder presents across the lifespan – from young adulthood to midlife and later life – and what each phase means for recognition and care",
    "image": "https://s3.ap-southeast-2.amazonaws.com/nzdoctor.files/production/public/2026-01/FRAZ%20ADHD%202026%20cartoon.jpg",
    "source": "NZDoctor"
  },
  {
    "title": "State apology to be given to industrial school victims",
    "desc": "A State apology is to be given by the Taoiseach to people who suffered abuse in industrial and reformatory schools.",
    "image": "https://www.rte.ie/images/0023cf13-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Magnetic superhighways discovered in a starburst galaxy's winds",
    "desc": "Using the Atacama Large Millimeter/submillimeter Array (ALMA), an international team of astronomers has mapped a magnetic highway driving a powerful galactic wind into the nearby galaxy merger of Arp 220, revealing for the first time that its fast, molecular outflows are strongly magnetized and likely helping to drive metals, dust, and cosmic rays into the space around the galaxy.",
    "image": "https://scx2.b-cdn.net/gfx/news/2026/magnetic-superhighways.jpg",
    "source": "Phys.org"
  },
  {
    "title": "How Gayton McKenzie's Department of Sport, Arts and Culture's inaction cost J-Bay its premier surfing competition",
    "desc": "A lack of commitment from the Department of Sport, Arts and Culture costs the Eastern Cape dearly as the only World Surf League event on the African continent is cancelled.",
    "image": "https://cdn.dailymaverick.co.za/i/ihuGgdIcBJmjvNp53BksyupWD5w=/800x0/smart/filters:strip_exif()/file/attachments/orphans/JBaySurf1_306039.jpg",
    "source": "Daily Maverick"
  }
]