[
  {
    "title": "Telecel Turns Up University of Ghana with Black Sherif, KiDi & Kweku Smoke on Val’s Day",
    "desc": "Telecel Ghana is set to transform the University of Ghana into the hub of music and dance this Valentine’s Day, as Black Sherif, KiDi, and Kweku Smoke headline the telco’s high-energy campus party dubbed Telecel TurnUp.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/image-701.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "Climate storytelling often ignores young people - arts-based research can change that",
    "desc": "Young people are often overlooked in discussions about climate crisis. And yet they stand to be most profoundly affected by it.",
    "image": "https://images.theconversation.com/files/711632/original/file-20260109-56-f7os02.jpg?ixlib=rb-4.1.0&rect=0%2C91%2C1319%2C659&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "Campbell defends comments to President over Derry speech",
    "desc": "DUP MP Gregory Campbell has defended the comments he made to President Catherine Connolly, saying that her speech in Derry on her first State visit to Northern Ireland \"did not attempt to reach across the divide\".",
    "image": "https://www.rte.ie/images/0023d9c8-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "The Super Bowl/Winter Olympics weekend begins early today and won't end until we find out if the Seahawks have hoisted the Lombardi Trophy once more",
    "desc": "A GRIP ON SPORTS • Are there any sports worth watching this weekend on your TV? Besides Sunday’s Super Bowl, I mean? Or the Winter Olympics? Or a Saturday filled with ranked college basketball showdowns? Is that all there is? Well, no.",
    "image": "https://thumb.spokesman.com/61IkWiXgHxkJMkvBOGMDUAvdkEw=/1200x630/smart/media.spokesman.com/photos/2024/05/01/web_sig_grippi.png",
    "source": "The Spokesman-Review"
  },
  {
    "title": "World skiing body FIS aims to quash penis-enlargement sideshow",
    "desc": "World skiing's governing body has moved swiftly to quash talk of ski jumpers injecting their penises with paraffin or hyaluronic acid to gain a competitive edge, but scientists and ski jumpers at the ​Winter Olympics say if true, it would make perfect sense.",
    "image": "https://i.cbc.ca/ais/15ed46a7-a22d-45c9-817e-ef338840ca51,1770391338564/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C209%2C5172%2C2909%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Lymph Node Examination Should be Expanded to Accurately Assess Metastasis in NSCLC, Research Says",
    "desc": "Using data from the STS General Thoracic Surgery Database—the largest clinical thoracic surgical database in North America, with nearly 800,000 procedure records and more than 900 participating surgeo...",
    "image": "https://ascopost.com/media/14024054/advanced-lung-cancer.jpeg",
    "source": "The ASCO Post"
  },
  {
    "title": "Commemorating Professor Kairuki’s legacy of visionary development in Tanzania health sector",
    "desc": "Twenty-seven years have passed since the late Professor Hubert Clemence Kairuki, founder of Kairuki Hospital, passed away.",
    "image": "https://www.thecitizen.co.tz/resource/image/5351010/landscape_ratio3x2/1200/800/1fef6e214d9ea017ef67bfabccdbee7b/zb/kairuki-1.jpg",
    "source": "thecitizen.co.tz"
  },
  {
    "title": "Artist Giles Tettey Nartey Launches Mule at Dover Street Market: Info",
    "desc": "Demon Footwear has teamed up with London-based British-Ghanaian artist and architect Giles Tettey Nartey on a new slip-on GTN Mule silhouette.",
    "image": "https://wwd.com/wp-content/uploads/2026/02/GTN.jpg?w=1000&h=563&crop=1",
    "source": "WWD"
  },
  {
    "title": "Scotland 'have to show we've grown' against Italy",
    "desc": "Sione Tuipulotu may not have played in Scotland's loss away to Italy two years ago, but he's under no illusions as to the scars that were left that day.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/5569/live/433c0890-0379-11f1-ae43-f3b28e80f533.jpg",
    "source": "BBC"
  },
  {
    "title": "Nintendo Showcases Every Switch And Switch 2 Partner Direct Game In New Infographic",
    "desc": "Logos galore! - Nintendo's latest Partner Direct showcase arrived yesterday, bringing with it a boatload of Switch and Switch 2 games to add to the ol' wishl...",
    "image": "https://images.nintendolife.com/b1e786d1532d5/large.jpg",
    "source": "Nintendo Life"
  }
]