[
  {
    "title": "Polish short-track speedskater recovering from surgery after blade cuts her face during fall",
    "desc": "The Polish short-track speedskater who was taken off the ice on a stretcher after a terrifying fall is recovering from surgery after a blade cut her face. (AP Photo)",
    "image": "https://media.kagstv.com/assets/CCT/images/a8bbe975-0dc4-46b3-b35d-2a47534a2faa/20260220T203426/a8bbe975-0dc4-46b3-b35d-2a47534a2faa_1140x641.jpg",
    "source": "kagstv.com"
  },
  {
    "title": "EC publishes Kerala’s final electoral roll for Assembly elections 2026",
    "desc": "Following the three-month Special Intensive Revision (SIR) exercise conducted by the Election Commission of India, the number of voters in the state.Kerala electoral roll, Thiruvananthapuram voters, final electoral roll Kerala, Voter list update Kerala, election commission Kerala, Kerala voter count, Special Intensive Revision Kerala, how to check Kerala electoral roll, new voters Kerala, electoral roll deletion Kerala, LLM for voter data analysis, AI voter roll updates, Kerala election roll statistics, voter registration Kerala, electoral roll corrections Kerala",
    "image": "https://img.onmanorama.com/content/dam/mm/en/archive/kerala/top-news/images/2025/12/9/local-body-elections.jpg",
    "source": "Onmanorama"
  },
  {
    "title": "Pope Leo remembers late Cardinal Polycarp Pengo as a “wise and gentle pastor”",
    "desc": "In a telegram, Pope Leo XIV offers his condolences for the passing of Cardinal Polycarp Pengo, Archbishop Emeritus of Dar es Salaam, Tanzania.",
    "image": "https://www.vaticannews.va/content/dam/vaticannews/multimedia/2026/02/20/PENGO-Card.-Polycarp-03085_28022013.jpg/_jcr_content/renditions/cq5dam.thumbnail.cropped.1500.844.jpeg",
    "source": "Vatican News"
  },
  {
    "title": "Charge or Release Nasir El-Rufai",
    "desc": "An ADC chieftain urges the ICPC to follow due process by either charging former governor Nasir El-Rufai in court or releasing him from detention.",
    "image": "https://cdn.punchng.com/wp-content/uploads/2023/05/16090658/114405690_elrufai.jpeg",
    "source": "Punch Newspapers"
  },
  {
    "title": "Burkina Faso attack: Hajia Amenu urges support for local produce; calls for protection of women, children",
    "desc": "Women’s Organiser for the United Party, Hajia Gloria Amenu, has called on Ghanaians to prioritise locally produced goods and for the government to take urgent measures to safeguard women and children, particularly in light of the recent killing of eight Ghanaian citizens in a terrorist attack in neighbouring Burkina Faso.",
    "image": "https://www.myjoyonline.com/wp-content/uploads/2026/02/Screenshot-95.png",
    "source": "MyJoyOnline"
  },
  {
    "title": "This tool can help prevent satellite collisions in Earth's orbit",
    "desc": "Researchers at the University of Manchester have developed a system that could prevent satellites from colliding in Earth's crowded orbits.",
    "image": "https://i.cdn.newsbytesapp.com/images/l200_34351771668525.jpg",
    "source": "NewsBytes"
  },
  {
    "title": "Ellah Lakes to refund applicants after N235bn public offer records low subscription",
    "desc": "Ellah Lakes Plc, an integrated agro-industrial company, says its N235 billion public offer failed to meet the minimum subscription threshold.",
    "image": "https://www.thecable.ng/wp-content/uploads/2025/10/Ellah-Lakes-scaled.jpg",
    "source": "TheCable"
  },
  {
    "title": "Vast Takes a Giant Leap Towards Building a Private Space Station",
    "desc": "Dark horse space station company Vast gallops past its rivals with a big astronaut announcement.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fg.foolcdn.com%2Feditorial%2Fimages%2F856635%2Fiss-international-space-station-orbiting-over-a-hurricane.jpg&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "Mira Murati's AI start-up loses another executive to OpenAI",
    "desc": "OpenAI has rehired another employee from Mira Murati's $12 billion AI startup, Thinking Machines Lab, amidst a series of high-profile departures.",
    "image": "https://i.cdn.newsbytesapp.com/images/l200_24241771662983.jpg",
    "source": "NewsBytes"
  },
  {
    "title": "Why Android killed wide foldables and how it's resurrecting them",
    "desc": "A previous version of Android made some apps uglier and less usable on wider foldables, but Google has now fixed that issue.",
    "image": "https://www.androidauthority.com/wp-content/uploads/2024/09/google-pixel-9-pro-fold-vs-pixel-fold-internal-display-opened.jpg",
    "source": "Android Authority"
  }
]