[
  {
    "title": "Nintendo Responds To Dispatch Switch Censorship With Official Statement",
    "desc": "Following a response from AdHoc Studio - The superhero comedy Dispatch is out on the Switch and Switch 2 this week and as we've already highlighted in our re...",
    "image": "https://images.nintendolife.com/bbfc7cb0d6d7d/large.jpg",
    "source": "Nintendo Life"
  },
  {
    "title": "Agnes AI hits 5m users & open-sources SEA-focused LLM",
    "desc": "Agnes AI tops 5m users in six months and open-sources an 8B-parameter SEA-focused language model aimed at cross-cultural productivity use.",
    "image": "https://itbrief.asia/uploads/story/2026/01/30/compatible_unnamed__3_.jpg",
    "source": "IT Brief Asia"
  },
  {
    "title": "Understanding the Gift of Faith and Its Impact on Church Growth",
    "desc": "This Journal Article is designed to explore the application of the supernatural Gift of Faith as it relates to Church Growth. By and large, it is generally believed that there is a correlation between Faith and Church growth. Moreover, this research proves that in essence, the supernatural Gift of Faith has a direct impact on Church growth. The qualitative methodology was applied to collect data for analysis. Data were collected through the structured interview of a credible Pastoral figure. The Pastor confirmed that the supernatural Gift of Faith had a one-hundred percent direct impact on Church Growth. He reiterated the fact that a stable Church needed to have a Triad of Church Growth. In other words, a progressive Church must focus on three dimensions of numerical growth, spiritual growth and financial growth. While spontaneous growth strategy is characteristic of some Churches, the Senior Pastor interviewed upheld that such growth was unsustainable. He preferred the Kurt Lewin theory of incremental or gradual change: two steps forward and one step backwards. Rapid and radical transformation may be difficult to manage in real-time strategic growth systems of Church ministry. The Pastor’s Faith, vision and divine propinquity played a critical role in facilitating a salubrious Church growth genre. The research proved beyond reasonable doubt that indeed the supernatural Gift of Faith impacted Church growth directly.",
    "image": "https://file.scirp.org/image/oalibj2016030109584288.jpg",
    "source": "SCIRP Open Access"
  },
  {
    "title": "PM Modi Speaks To Athlete PT Usha, Condoles Husband’s Passing",
    "desc": "Srinivasan, husband of Indian Olympic Association President and Rajya Sabha MP PT Usha, died in the early hours of Friday.",
    "image": "https://images.news18.com/ibnlive/uploads/2026/01/NW18-2026-01-30T090133.214-2026-01-f2deacd80c972b0466118f69cd2d385b-16x9.png",
    "source": "News18"
  },
  {
    "title": "Data breach at Canada Computers & Electronics leaks personal customer information",
    "desc": "Canada Computers & Electronics says a data breach has leaked information about some of its customers, though several say they are unhappy with the scant details the retailer has provided — including how many of them were affected, and when the breach occurred.",
    "image": "https://i.cbc.ca/ais/b545ae1c-489f-43ac-b348-12c34e5e2b64,1769722666539/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C434%2C4592%2C2583%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "PCG: Amejara life jackets, debris found",
    "desc": "DAVAO CITY – The Philippine Coast Guard Station in the coastal town of Kiamba in Sarangani province confirmed on Friday, Jan. 30, that local fishermen have...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/30/75356.webp",
    "source": "mb.com.ph"
  },
  {
    "title": "Australian Open 2026 LIVE updates: Aussies win doubles title; Zverev battles Alcaraz, Djokovic faces Sinner in blockbuster semis",
    "desc": "The 2026 Australian Open reaches day13 at Melbourne Park with matches from 11am AEDT and this live blog will include results, live match updates, pictures, tennis news and colour stories. Coverage will include both the day and night sessions. Olivia Gadecki, John Peers, Kristina Mladenovic, Manuel Guinard,, Carlos Alcaraz, Alexander Zverev, Novak Djokovic , Jannik Sinner are among the players on court during day 13. Nine and Stan Sport will be broadcasting the tournament live.",
    "image": "https://static.ffx.io/images/$zoom_0.5515625%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_42/t_crop_custom/q_86%2Cf_auto/t_metro_live_no_age_social_wm/e08b5be6c8c23d36b93f2f3d88ac57f2168a694bb358fd2a8b3474511b3b0dd3",
    "source": "theage.com.au"
  },
  {
    "title": "Conte focused on Serie A after Napoli's Champions League exit",
    "desc": "Injury-hit Napoli must now refocus on the defence of their league title following their ignominious Champions League elimination, coach Antonio Conte said.",
    "image": "http://localhost:8080/media/5uid0gn1/antonio-conte-looks-2601-g-2000.jpg",
    "source": "Super Sport"
  },
  {
    "title": "Actor-singer Dylan Wang brings his fashion brand D.Desirable to Singapore in first international pop-up store",
    "desc": "Chinese actor and singer Dylan Wang is bringing his fashion brand D.Desirable to Singapore from Jan 30 to Feb 25 at Ion Orchard in its international debut.",
    "image": "https://dam.mediacorp.sg/image/upload/s--VZk-UC-W--/c_crop,h_599,w_1064,x_2,y_481/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2026/01/30/ion-orchard-image-credit-singapore-tourism-board.jpg?itok=q6gJ_4in",
    "source": "CNA Lifestyle"
  },
  {
    "title": "War Threats and Ambiguous Evidence: Trump Again Confronts Iran",
    "desc": "There is little sign that Iran has made significant progress in reconstituting its nuclear program, leaving questions about the timing and motive behind potential plans for further attacks.",
    "image": "https://static01.nyt.com/images/2026/01/29/multimedia/29dc-intel-iran/29dc-prexy-jwvl-facebookJumbo.jpg",
    "source": "The New York Times"
  }
]