[
  {
    "title": "Open Call: Humanities Travelling Fellowships Program (Australia)",
    "desc": "Deadline: 29-Mar-2026 The Humanities Travelling Fellowships Program provides funding of up to AUD 4,000 to support early career researchers in the humanities for overseas research essential to their projects and professional development. Fellowships cover travel, accommodation, research expenses, and living costs, with special opportunities under the David Philips Travelling Fellowship for research on racial, religious,",
    "image": "https://fundsforngosmedia.s3.amazonaws.com/wp-content/uploads/2023/12/19141120/icon.png",
    "source": "fundsforNGOs"
  },
  {
    "title": "Nani’s The Paradise: ‘Aaya Sher’ Promo Packs High Energy and Mass Beats; Full Song on February 24",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2026/02/aaya.webp",
    "source": "123telugu.com"
  },
  {
    "title": "Starting on the right foot: Sounders top Rapids in opener",
    "desc": "Sounders win 2-0 over Rapids on a rainy night at Lumen Field.",
    "image": "https://www.sounderatheart.com/content/images/size/w1200/2026/02/SEA-COL-06185.jpg",
    "source": "Sounder at Heart"
  },
  {
    "title": "Teenager says he was verbally abused and punched in alleged antisemitic attack at scouts event in Victoria",
    "desc": "A teenager says he was verbally abused and punched at a scouts event in regional Victoria for wearing a kippah and Israeli flag.",
    "image": "https://live-production.wcms.abc-cdn.net.au/4fcc74d9d21f36763dd48f9d1552f900?impolicy=wcms_watermark_news&cropH=1080&cropW=1920&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "A designer’s tips on building the garden of your dreams",
    "desc": "With some careful thought and a clear plan, even the simplest garden can be transformed",
    "image": "https://www.irishtimes.com/resizer/v2/XVQ63WOJH5HXHMTNPR7PD7YTQQ.jpg?smart=true&auth=4fcdfaad635a3c23cbee93b82dfe2c842b06e3b48d9d20a9c63fa2cb35e0e305&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Kossan's 4Q earnings surge on lower production costs",
    "desc": "Kossan Rubber Industries Bhd (KL:KOSSAN) posted a sharp rise in net profit for the fourth quarter ended Dec 31, 2025 (4QFY2025), as improved production efficiencies helped lower costs and offset weaker sales.",
    "image": "https://assets.theedgemarkets.com/KOSSAN_Tower_3_kossan_20260223134552_Kossan.jpg",
    "source": "The Edge Malaysia"
  },
  {
    "title": "PLDT stakes unbeaten record vs Cignal",
    "desc": "PLDT stakes its unbeaten record against a Cignal crew aching to get back on track in the Premier Volleyball League All-Filipino Conference at the Filoil Centre...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/23/81208.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "The ANC won’t, and can’t, arrest its decline in Gauteng",
    "desc": "With local elections expected later this year, the ANC in Gauteng is weaker than it’s ever been. Many of the problems have piled up over the […]",
    "image": "https://d4f7y6nbupj5z.cloudfront.net/wp-content/uploads/2026/02/Screen-Shot-2026-02-23-at-7.44.08-AM.png",
    "source": "The Namibian -"
  },
  {
    "title": "QuickCheck: Did a JPJ officer get pelted with firecrackers during an operation?",
    "desc": "VIDEOS and photographs of enforcement operations often go viral on social media.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/23/3782249.jpg",
    "source": "thestar.com.my"
  },
  {
    "title": "Police warn against online incitement to crime",
    "desc": "DAR ES SALAAM: THE police force has assured the public that it is closely monitoring individuals using social media platforms to incite people to engage in criminal activities, stressing that such conduct violates the country’s laws. In a statement issued yesterday, the Police said they would not hesitate to take legal action against anyone involved",
    "image": "https://dailynews.co.tz/wp-content/uploads/2022/10/social-media.jpg",
    "source": "dailynews.co.tz"
  }
]