[
  {
    "title": "Corporate Travel Management founder Jamie Pherous resigns amid overcharging scandal",
    "desc": "Corporate Travel Management boss Jamie Pherous has exited from all his executive and board roles as he moves to a \"strategic advisory role.\"",
    "image": "https://live-production.wcms.abc-cdn.net.au/ed6e6dab1476c4ea9ced7feeb20d4f40?impolicy=wcms_watermark_news&cropH=984&cropW=1749&xPos=65&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Post Malone Leads All-Star Tribute to Ozzy Osbourne at Grammy Awards",
    "desc": "Post Malone was joined by Slash, Watt, Duff McKagan and Chad Smith for a tribute to Ozzy Osbourne during the 2026 Grammys.",
    "image": "https://variety.com/wp-content/uploads/2026/02/Ozzy-Osbourne-Tribute-Grammys.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "HPV vaccine: Jab that could save future of Kenyan girls",
    "desc": "Countries that introduced HPV vaccination early are already reporting dramatic reductions in severe cervical disease and cancer.",
    "image": "https://cdn.standardmedia.co.ke/images/articles/thumbnails/ZNj2Ktk6c2Ik0rhRkMDNDwHmZqFvpnkVQo77m5wS.jpg",
    "source": "standardmedia.co.ke"
  },
  {
    "title": "Fact Check: Claim That Roasted Cloves Cure Cavities Is Misleading",
    "desc": "Fact check - Direct use of cloves as recommended in the video is unsafe and inappropriate for treating cavities.",
    "image": "https://statik.tempo.co/data/2026/01/28/id_1455767/1455767_720.jpg",
    "source": "Tempo.co English"
  },
  {
    "title": "Chappell Roan at Grammys 2026",
    "desc": "Chappel Roan is nominated for her standalone single \"The Subway,\" and will also be presenting at the ceremony.",
    "image": "https://www.usatoday.com/gcdn/authoring/authoring-images/2026/02/02/USAT/88468015007-chappell-roan-grammys-3.jpg?crop=3332,1874,x0,y750&width=3200&height=1800&format=pjpg&auto=webp",
    "source": "USA Today"
  },
  {
    "title": "Taiwan aces brace for Summit Point test in PH",
    "desc": "(UPDATE) THREE of Taiwan’s top four players, led by No. 2 Min Lee, headline a powerhouse Taiwanese contingent primed to test its mettle against the region’s best in the ICTSI Philippine Ladies Masters unfolding on Wednesday at the Summit Point Golf and Country Club in Lipa City, Batangas.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/01/920476.jpeg",
    "source": "The Manila Times"
  },
  {
    "title": "Ranveer Singh's Dhurandhar smashes Rs 1,300 crore globally despite Netflix release",
    "desc": "Ranveer Singh's Dhurandhar has smashed Rs 1,300 crore globally despite its Netflix release. The film's success highlights the strong audience demand for theatrical spy thrillers and builds excitement for the upcoming sequel.",
    "image": "https://akm-img-a-in.tosshub.com/indiatoday/images/story/202602/ranveer-singh-dhurandhar-024250996-16x9_0.jpg?VersionId=3hQ7vOnlMElckrt87iHf4obPv8q2fbe.",
    "source": "India Today"
  },
  {
    "title": "Baby dinosaurs were the backbone of the Jurassic food chain",
    "desc": "Despite growing into the largest animals ever to walk on land, sauropods began life small, exposed, and alone. Fossil evidence suggests their babies were frequently eaten by multiple predators, making them a key part of the Jurassic food chain. This steady supply of easy prey may explain why early predators thrived without needing extreme hunting adaptations. The findings offer a rare glimpse into how dinosaur ecosystems truly worked.",
    "image": "https://www.sciencedaily.com/images/1920/dinosaurs-baby-sauropods.webp",
    "source": "ScienceDaily"
  },
  {
    "title": "APC E-Registration: ADC Alleges Forced Registration Of Civil Servants",
    "desc": "ABUJA - The African Democratic Con­gress (ADC) has raised the alarm over reports that civil servants across several states are being coerced to register for the All Progressives Congress’ (APCs) ongoing e-registration exercise. The party, which described the practice as economic coer­cion and forced membership, added that the civil servants are allegedly under pressure from...",
    "image": "https://independent.ng//wp-content/uploads/Mallam-Bolaji-Abdullahi.webp",
    "source": "Independent Newspaper Nigeria"
  },
  {
    "title": "Design of Risk Prevention and Control System of Budget Management in Colleges and Universities Based on Internal Control Framework",
    "desc": "With the rapid development of higher education and diversified funding sources, university budget management has become increasingly crucial in resource allocation and strategic implementation, while also facing more complex risk challenges. Based on the COSO internal control integration framework and considering the public welfare and complexity of university budget management, establishing a scientific and efficient risk prevention system has become a key task in financial management. This paper first analyzes the practical significance of risk prevention in university budget management. It then focuses on the entire process of budget preparation, execution, and supervision to identify current risk points and internal control deficiencies. Finally, it proposes specific design approaches for a university budget management risk prevention system from five dimensions: control environment, risk assessment, control activities, information and communication, and supervision evaluation. These insights provide theoretical support and practical references for universities to enhance budget management capabilities and mitigate financial risks.",
    "image": "https://file.scirp.org/image/ojbm2015012714294541.jpg",
    "source": "SCIRP Open Access"
  }
]