[
  {
    "title": "Revealed: Cheap grocery-store supplement that reverses hair loss, boosts bone density and even protects mental health... experts say EVERYONE can benefit",
    "desc": "When Dr Bernadette Atanga moved from her hometown of Houston to Michigan, she felt exhausted. But a cheap grocery store supplement reversed it.",
    "image": "https://i.dailymail.co.uk/1s/2026/02/11/18/106305125-0-image-m-9_1770836212543.jpg",
    "source": "Daily Mail"
  },
  {
    "title": "Four astronauts arrive at space station after prior crew's early departure",
    "desc": "Four new crew members, including two from the United States, received a warm welcome after arriving at the International Space Station on Saturday",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-02/260213-nasa-rs-176247.jpg",
    "source": "NBC News"
  },
  {
    "title": "Why Nigerian Youth Shun the Capital Market: An Expert View",
    "desc": "Explore why young investors avoid the Nigerian capital market, preferring fast money in crypto. An expert discusses challenges like onboarding and unclaime",
    "image": "https://cdn.punchng.com/wp-content/uploads/2026/02/14232942/Oluseyi-Owoturo.jpg",
    "source": "Punch Newspapers"
  },
  {
    "title": "‘Even more special’: Jakara Anthony dusts off Winter Olympics heartbreak for historic triumph",
    "desc": "Freestyle skier becomes Australia’s first two-time Winter Games gold medallist with victory in dual moguls Olympic debut just days after shock defeat",
    "image": "https://i.guim.co.uk/img/media/a7c9da6642f6a7cb4cb6f8af5ece1ddcf0d7a5e0/147_0_2419_1936/master/2419.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f08e7ba0898847e953d7194412505362",
    "source": "The Guardian"
  },
  {
    "title": "Death Notice of Rachel Osborne (née Smith) (Celbridge, Kildare)",
    "desc": "The death has occurred of Rachel Osborne (née Smith) of Celbridge, Kildare Ireland, on 12/02/2026. You can view the full death notice and add your condolences here.",
    "image": "https://img-dedicated.rip.ie/w188/Picture_24e4412382749b4550e92fc2e548e1645cd376ca203ae029.jpg",
    "source": "RIP.ie"
  },
  {
    "title": "Secret Filming of Ghanaian Women: Russian man to be extradited to Ghana - Sam George",
    "desc": "The Minister of Communications, Digital Technology and Innovations, Samuel Nartey George, has announced that the government has started processes to get the Russian man accused of filming his sexual escapades with several Ghanaian women.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/602/60266456.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Join The Passion! www.racecoast.co.za Maiden Plate",
    "desc": "Follow horse racing with Alex Hammond on Sky Sports - get live racing results, racecards, news, videos, photos, stats (horses & jockeys), plus daily tips.",
    "image": "https://www.skysports.com/favicon.ico?bypass-service-worker",
    "source": "Sky Sports"
  },
  {
    "title": "Overloaded and undermanned: CHED faces growing strain in safeguarding Philippine college quality",
    "desc": "On paper, the Philippines has never invested more in higher education: college tuition is free in state universities, enrollment has surged, and thousands of...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/15/79441.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "WHICH TOP LEGITIMATE USDT RECOVERY SERVICE HANDLES DEFI AND CONTRACT SCAMS CASES",
    "desc": "Community takeaways for: WHICH TOP LEGITIMATE USDT RECOVERY SERVICE HANDLES DEFI AND CONTRACT SCAMS CASES Source: https://streamlinefeed.co.... | Discussion in",
    "image": "https://lh3.googleusercontent.com/a/ACg8ocLKZgLUl0Fs3uus9NhR8AmBzAyTGL7tKoKMD8PvQu8slIOfLA=s96-c",
    "source": "streamlinefeed.co.ke"
  },
  {
    "title": "Opposition draws battlelines on nuclear and capital gains tax changes",
    "desc": "Deputy Liberal leader Jane Hume says Australia needs to be \"open minded\" on nuclear power if the country is to bring down emissions and make power cheaper.",
    "image": "https://live-production.wcms.abc-cdn.net.au/57cbf291027a61ad85293bf78ab09415?impolicy=wcms_watermark_news&cropH=900&cropW=1600&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  }
]