[
  {
    "title": "Ethiopian National Defense Forces Undergoes Historic Modernization Drive: Field Marshal Birhanu",
    "desc": "Addis Ababa, February 22, 2026 (ENA) –Ethiopia has established a modern, reliable and versatile military institution strengthened by skilled manpower, professionalism and advanced technology, Chief of General Staff of the Ethiopian National Defense Forces, Field Marshal Birhanu Jula, affirmed.\nSpeaking at the grand closing ceremony marking the 65th anniversary of the Special Operations Command at Hawassa International Stadium, Birhanu said comprehensive reforms have transformed the country’s defense institution into a capable, cohesive and technologically equipped force.\nHe noted that Ethiopia’s military, formally structured in the mid-twentieth century, has undergone successive reform phases aimed at enhancing professionalism, strengthening institutional capacity and reinforcing national unity within its ranks.\nAccording to the Chief of General Staff, recent reforms carried out under the leadership of Commander-in-Chief of the Armed Forces and Prime Minister Abiy Ahmed have focused on restructuring command systems, elevating training standards and integrating advanced technologies into operations.\nHe emphasized that Ethiopia has navigated complex internal and external security challenges while simultaneously rebuilding and modernizing its armed forces.\nIn line with national reform efforts, new commands and specialized units have been organized, alongside stabilization measures implemented in various regions.\n“The defense force has been built with quantity, quality and technology,” Field Marshal Birhanu stated, underscoring that modernization efforts have progressed in tandem with strengthened discipline, efficiency and operational readiness.\nHe described the Special Operations Command as an elite formation composed of members drawn from across the country, reflecting unity and diversity within the armed forces.\nOver the past six decades, the Command has continuously enhanced its training and operational capacity, contributing to the development of specialized formations, including the Republican Guard.\nThe Command has participated in numerous missions across different parts of the country, earning a reputation for resilience, professionalism and effectiveness through decades of dedicated service, he added.\nField Marshal Birhanu reaffirmed that the defense force will continue to uphold its constitutional mandate of safeguarding national sovereignty and ensuring lasting peace.\n“The army will remain committed to defending the country and protecting the people while fulfilling its mission with discipline and responsibility,” he said.\nThe ceremony was attended by Prime Minister Abiy Ahmed, First Lady Zinash Tayachew, Speaker of the House of People’s Representatives Tagese Chafo, Sidama Regional State President Desta Ledamo, senior military generals, and federal as well as regional government officials.",
    "image": "https://www.ena.et/documents/42142/0/Birhanu1.jpg/1ea4e02d-0578-19b7-e5c3-ddc07fcc671e?version=1.0&t=1771749389470&download=true",
    "source": "ENA English"
  },
  {
    "title": "West Ham owners react to record-breaking Bournemouth draw and make Nuno demand",
    "desc": "West Ham's owners have reacted to the record-breaking draw with Bournemouth and make a demand of head coach Nuno Espirito Santo.",
    "image": "https://cdn1.hammers.news/uploads/25/2026/01/nuno-and-players-exclusive-1767632523355.jpg",
    "source": "Hammers News"
  },
  {
    "title": "Woman, 80s, dies in Co Galway road crash",
    "desc": "A woman in her 80s has died following a road crash in Co Galway yesterday evening.",
    "image": "https://www.rte.ie/images/0021cae4-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Canada hit back at cheating jibes after Team GB suffer curling heartbreak",
    "desc": "Canada's controversial curlers let rip and hit back at the cheating jibes that have plagued their team en route to a gold medal triumph at the Winter Olympics.",
    "image": "https://metro.co.uk/wp-content/uploads/2026/02/SEI_286215848-fbe2_1771749568.jpg?quality=90&strip=all&w=1200&h=630&crop=1",
    "source": "Metro.co.uk"
  },
  {
    "title": "BI arrests 4 suspected foreign scammers",
    "desc": "Four foreigners who were allegedly engaged in scamming activities have been arrested in Angeles City in Pampanga, the Bureau of Immigration (BI) said on Sunday,...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/22/81081.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Why late former President John Evans Atta Mills is trending",
    "desc": "The late former President John Evans Atta Mills has returned to social media trends since Saturday, February 21, 2026, following a remark by the Minister of Finance, Dr Cassiel Ato Forson, directed at the Customs Division of the Ghana Revenue...",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/150/15034018.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Uhuru politely declines youth visit to Ichaweri residence",
    "desc": "“We encourage organisers of such initiatives to formally communicate with the Office in advance.\"",
    "image": "https://cdn.radioafrica.digital/image/2026/02/6bcd8558-2c8b-4731-9c4d-63a6808721b1.png?1771755443086",
    "source": "the-star.co.ke"
  },
  {
    "title": "Sandro Marcos says these 2 LEDAC bills are up for House plenary approval",
    "desc": "House bills on the proposed Presidential Merit Scholarship Program and the National Land Use Act are now ripe for plenary approval, Majority Leader Ilocos...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/22/81084.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "WhatsApp Reportedly Working On Scheduled Messages Feature",
    "desc": "WhatsApp could soon introduce a long-requested feature that allows users to schedule messages in advance, according to WABetaInfo.",
    "image": "https://www.lowyat.net/wp-content/uploads/2022/11/whatsapp-icon-01a.jpg",
    "source": "Lowyat.NET"
  },
  {
    "title": "Groups launch centre for Nigerian HR professionals",
    "desc": "To empower Nigerian HR professionals to transit from traditional personnel management to strategic leadership roles, We-Are HR in...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2026/02/Nigerian-HR-professionals.png",
    "source": "Businessday NG"
  }
]