[
  {
    "title": "Lipid nanoparticle discovery could increase drug delivery efficiency",
    "desc": "Study findings offer potential to accelerate development of RNA-based medicines.",
    "image": "https://www.europeanpharmaceuticalreview.com/wp-content/uploads/shutterstock_2206732985.jpg",
    "source": "European Pharmaceutical Review"
  },
  {
    "title": "From Panama Canal to Shibuya Station: 5 Iconic Works in Film",
    "desc": "From the Panama Canal to the Shibuya Scramble Crossing, via the Brooklyn Bridge: discover 5 major works transformed into visual icons and narrative symbols.",
    "image": "https://prodmediawebuildvalue.alkemy.digital/wp-content/uploads/2026/02/Immagine4-7.jpg",
    "source": "We Build Value"
  },
  {
    "title": "Tanzania tasks nutrition experts to educate the public on an accurate nutrition system",
    "desc": "DODOMA: THE Tanzanian government’s Chief Medical Officer, Dr Grace Magembe, has asked the country’s nutrition professionals to provide accurate and standardized nutrition education to the public, ensuring communities fully benefit from their expertise. She made the call when officially opening the 4th Annual Conference of the Tanzania Nutrition Professionals Association 2026, held at Mabeyo Hall",
    "image": "https://dailynews.co.tz/wp-content/uploads/2025/09/Nutrition_.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "'Phew': Comedian Magda Szubanski says cancer is in remission",
    "desc": "The Kath and Kim star shared the news on Friday, about nine months after being diagnosed with a \"rare and fast-moving blood cancer\".",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/magda-szubanski-ZGJKZVO5INGVLNYEUPX2BXWWCA.jpg?auth=a7d9fba1f85632d518b2dc7b7eb52efba6cc6bf73ca288b7b2410d4f61736005&quality=70&width=600&height=315&focal=2592%2C1458",
    "source": "1News"
  },
  {
    "title": "\"I was prescribed twelve antibiotics in one year\" One Irish woman shares the agony of her recurrent UTIs",
    "desc": "Niamh Devereux investigates urinary tract infections and shares one Irish woman's agony of recurrent UTIs.",
    "image": "https://irishcountrymagazine.ie/wp-content/uploads/2026/02/pexels-shvets-production-9742764.jpg",
    "source": "Irish Country Magazine"
  },
  {
    "title": "Standard prefixed number for police, WhatsApp spoofing safeguards as efforts ramp up against scams",
    "desc": "Government officials impersonation scams more than doubled in 2025 from the year before and saw the highest average amount lost per case.",
    "image": "https://dam.mediacorp.sg/image/upload/s--Tk-SxfE_--/c_crop,h_842,w_1498,x_0,y_56/c_fill,g_auto,h_676,w_1200/f_auto,q_auto/v1/mediacorp/cna/image/2022/05/12/istock-1158778974.jpg?itok=O-qPEymz",
    "source": "CNA"
  },
  {
    "title": "Champions League draw results: Man City get Real Madrid, more",
    "desc": "The brackets for the Champions League and Europa League knockout stages are set",
    "image": "https://sportshub.cbsistatic.com/i/r/2026/02/27/f673ac45-1122-42e7-98ff-823e4731e1df/thumbnail/1200x675/3767af6658364800964985346510b1a6/untitled-design-2026-02-27t112431-709.png",
    "source": "CBS Sports"
  },
  {
    "title": "Samsung Brings Satellite Communication Support to Galaxy Smartphones Across the Globe",
    "desc": "Collaboration with leading telecom operators across North America, Europe and Japan supports satellite-based communication on select Galaxy smartphones, including the Galaxy S26 series",
    "image": "https://img.global.news.samsung.com/uk/wp-content/uploads/2026/02/Galaxy-S26-Series.jpg",
    "source": "Samsung Global Newsroom"
  },
  {
    "title": "PERIOD POVERTY : A Product Of The Cost Of Living",
    "desc": "Young Reporter is a scheme that gives 14 to 18-year-old school students a chance to write for a real newspaper.",
    "image": "https://www.london-now.co.uk/resources/images/20310653/",
    "source": "London Now"
  },
  {
    "title": "BREAKING: Court validates 2025 PDP Convention in Ibadan",
    "desc": "The Nation Newspaper BREAKING: Court validates 2025 PDP Convention in Ibadan",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/02/03180215/PDP.jpg",
    "source": "The Nation Newspaper"
  }
]