[
  {
    "title": "New Zealand knocks Sri Lanka out of Twenty20 World Cup in super eight match in Colombo",
    "desc": "New Zealand knocks tournament co-hosts Sri Lanka out of the Twenty20 World Cup with a 61-run win in their super eights game in Colombo.",
    "image": "https://live-production.wcms.abc-cdn.net.au/3f65697f00a35802df5c4e95905bb371?impolicy=wcms_watermark_news&cropH=1218&cropW=2165&xPos=0&yPos=14&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Deadly bird flu found in California elephant seals for the first time",
    "desc": "LA Times The H5N1 bird flu virus that devastated South American elephant seal populations has been confirmed in seals at California’s Año Nuevo State Park, researchers from UC Davis and UC Santa Cr…",
    "image": "https://s0.wp.com/i/blank.jpg",
    "source": "University of Nebraska Medical Center"
  },
  {
    "title": "US to offer passport services to citizens in illegal West Bank settlements",
    "desc": "Israel welcomes move described by Palestinian Authority as undermining possibility of an independent state",
    "image": "https://i.guim.co.uk/img/media/28ddfdd6d560cddfc1e60036a571d3f4ed6658d4/947_264_2754_2203/master/2754.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=98286eea90dfd969fc5baecb21369c44",
    "source": "The Guardian"
  },
  {
    "title": "2026 Preview: Dale Coyne Racing",
    "desc": "A series of 2026 NTT INDYCAR SERIES team previews concludes with a look at this organization that welcomes a veteran of the team from 2021 and a rookie to its 2026 lineup.",
    "image": "https://www.indycar.com/-/media/IndyCar/News/Standard/2026/02/02-25-DCR-Preview.jpg?vs=1&d=20260223T141745Z",
    "source": "INDYCAR.com"
  },
  {
    "title": "US, Iran To Meet For Nuclear Talks Amid Fears Of Military Conflict",
    "desc": "US and Iranian officials are set to hold a fresh round of nuclear talks in Geneva on February 26 for what is seen as a last-ditch attempt to avoid a major military conflict between the foes.",
    "image": "https://gdb.rferl.org/38464537-2129-4a24-3825-08dd765c2cd7_w1200_h630.jpg",
    "source": "Radio Free Europe/Radio Liberty"
  },
  {
    "title": "Cellular Droplet Architecture Unveils Cancer, Neuro Targets",
    "desc": "LA JOLLA, CA— Cells rely on biomolecular condensates to coordinate essential biological processes without surrounding membranes. These droplet-like",
    "image": "https://cdn1.miragenews.com/tmp_cache?cdn=cdn.pixabay.com%2Fphoto%2F2019%2F07%2F17%2F19%2F17%2Fhands-4344711_960_720.jpg",
    "source": "Mirage News"
  },
  {
    "title": "Cuba says four killed after U.S. boat violates territorial waters",
    "desc": "A U.S. registered speedboat violated Cuban territorial waters, kicking off an armed confrontation with Cuban border guard troops in which four people were killed, Cuban officials said.",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2026-02/260225-havana-cuba-mn-1530-c4e838.jpg",
    "source": "NBC News"
  },
  {
    "title": "What was promised in the Sona vs what Treasury funded",
    "desc": "Daily Maverick looked at what President Cyril Ramaphosa promised the country during his State of the Nation Address on 12 February 2026 and how the 2026 Budget lived up to those promises.",
    "image": "https://cdn.dailymaverick.co.za/i/4MVrqdkXEgQLnP-dSb5FNkI29UQ=/800x0/smart/filters:strip_exif()/file/dailymaverick/wp-content/uploads/2024/12/Ramaphosa-_2138.jpg",
    "source": "Daily Maverick"
  },
  {
    "title": "Astrophysicists Propose New Method to Measure Hubble Constant",
    "desc": "Astrophysicists from the University of Illinois and the University of Chicago have developed an innovative method to measure the Hubble constant -- the rate at which the Universe is expanding -- using the subtle background hum of gravitational waves.",
    "image": "https://cdn.sci.news/images/2026/02/image_14582f-Universe.jpg",
    "source": "Sci.News"
  },
  {
    "title": "'Real Housewives of Salt Lake City' Filming Postponed After Mary Cosby's Son's Death",
    "desc": "Mary Cosby wasn't shooting \"The Real Housewives of Salt Lake City\" when she found out her son, Robert Jr., had passed away ... but that doesn't mean it won't be mentioned.",
    "image": "https://imagez.tmz.com/image/91/16by9/2026/02/25/917bba1eb1bf476f86f73892f51e14e5_xl.png",
    "source": "TMZ"
  }
]