[
  {
    "title": "The Exhibition of Achievements in Compiling A Comprehensive Collection of Ancient Chinese Paintings Opens in Hong Kong with Academic Symposium",
    "desc": "HONG KONG, Jan. 31, 2026 /PRNewswire/ -- The Compilation of Classics in the Flourishing Age: Exhibition of Achievements in Compiling A Comprehensive Collection of Ancient Chinese Paintings is on display at the City University of Hong Kong (CityUHK) from January 15 to February 6. The exhibition is presented through an institutional collaboration led by the Information Office of the Zhejiang Provincial People's Government, the Zhejiang Provincial Department of Culture, Radio, Television and Tourism, Zhejiang University, and CityUHK, and is supported by the CityUHK Cultural Exchange Oasis and Zhejiang University Press.",
    "image": "https://cdn4.premiumread.com/?url=https://www.manilatimes.net/theme_manilatimes/images/TMT_1920x1008.jpg&w=1920&q=100&f=webp&v=1",
    "source": "The Manila Times"
  },
  {
    "title": "Inner plexiform layer substrata: Possible biomarker of retinal health",
    "desc": "Ophthalmology Times connects eye care professionals with surgery, imaging, gene therapy, & diagnostic advances to enhance clinical and patient care.",
    "image": "https://cdn.sanity.io/images/0vv8moc6/ophtalmology/2b155a094a1d40a7e9bee13573ee88bfe162e84a-1200x800.jpg",
    "source": "Ophthalmology Times"
  },
  {
    "title": "Elena Rybakina stuns Aryna Sabalenka to win Australian Open women’s singles final - live",
    "desc": "Game-by-game report: Join Katy Murrells for updates from the women’s singles final in Melbourne",
    "image": "https://i.guim.co.uk/img/media/73e0668807e4f341c8e8fd658707a422800b5342/458_0_4583_3667/master/4583.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&precrop=40:21,offset-x50,offset-y0&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=d5167321994371a514c2275aa3466b40",
    "source": "The Guardian"
  },
  {
    "title": "Elena Rybakina wins Australian Open for 2nd Grand Slam title",
    "desc": "Elena Rybakina won the Australian Open title with a 6-4, 4-6, 6-4 victory over top-ranked Aryna Sabalenka that avenged her loss in the championship decider in 2023.",
    "image": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2026%2F0131%2Fr1608355_1296x729_16%2D9.jpg",
    "source": "ESPN"
  },
  {
    "title": "Mohammad Rasoulof's 'Sense of Water' Acquired by Films Boutique",
    "desc": "'Seed of the Sacred Fig' director Mohammad Rasoulof’s new work 'Sense of Water' has been acquired by Films Boutique",
    "image": "https://variety.com/wp-content/uploads/2026/01/Sense-of-Water.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Togolese escapes human trafficking ring",
    "desc": "The Nation Newspaper Togolese escapes human trafficking ring",
    "image": "https://cdn.thenationonlineng.net/wp-content/uploads/2026/01/31115822/human-trafficking-ring.jpg",
    "source": "The Nation Newspaper"
  },
  {
    "title": "US Government Shuts Down Again But Quick Resolution Expected",
    "desc": "US Government Shuts Down Again But Quick Resolution Expected",
    "image": "https://www.channelstv.com/wp-content/uploads/2026/01/Washinton.jpg",
    "source": "Channels Television"
  },
  {
    "title": "Elena Rybakina beats world number one to win Australian Open in thrilling tennis final",
    "desc": "Belarussian tennis player Aryna Sabalenka faced off against Kazakhstani tennis player Elena Rybakina in Melbourne’s Rod Laver Arena.",
    "image": "https://img2.thejournal.ie/article/6943592/river/?height=400&version=6943690",
    "source": "The Journal"
  },
  {
    "title": "GABRIELA blasts Indang police's 'Iwas Rape Tips' as victim-blaming",
    "desc": "Women’s alliance GABRIELA has denounced as victim-blaming the “Iwas Rape Tips” recently posted on social media by the Indang Municipal Police Station in...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/01/31/75861.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "MCMC shuts down illegal transceiver station used to send scam messages",
    "desc": "KUALA LUMPUR: The Malaysian Communications and Multimedia Commission (MCMC) has detected and shut down an illegal base transceiver station in Genting Highlands, Pahang used for fraudulent purposes.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/31/3747842.jpg",
    "source": "thestar.com.my"
  }
]