[
  {
    "title": "Man City player ratings vs Newcastle: Bring on Arsenal! Omar Marmoush double gives Pep Guardiola's side another Wembley trip as impressive James Trafford frustrates hapless Magpies in Carabao Cup semi",
    "desc": "Rating the Manchester City players from their 3-1 win over Newcastle which booked their place in the Carabao Cup final against Arsenal",
    "image": "https://assets.goal.com/images/v3/blt57308d12525e3b4f/Goal%20HIC%20-%20LinkedIn%20(4)%20(1).jpg",
    "source": "Goal.com"
  },
  {
    "title": "Man City player ratings vs Newcastle: Bring on Arsenal! Omar Marmoush double gives Pep Guardiola's side another Wembley trip as impressive James Trafford frustrates hapless Magpies in Carabao Cup semi",
    "desc": "Rating the Manchester City players from their 3-1 win over Newcastle which booked their place in the Carabao Cup final against Arsenal",
    "image": "https://assets.goal.com/images/v3/blt57308d12525e3b4f/Goal%20HIC%20-%20LinkedIn%20(4)%20(1).jpg",
    "source": "Goal.com"
  },
  {
    "title": "Man City player ratings vs Newcastle: Bring on Arsenal! Omar Marmoush double gives Pep Guardiola's side another Wembley trip as impressive James Trafford frustrates hapless Magpies in Carabao Cup semi",
    "desc": "Rating the Manchester City players from their 3-1 win over Newcastle which booked their place in the Carabao Cup final against Arsenal",
    "image": "https://assets.goal.com/images/v3/blt57308d12525e3b4f/Goal%20HIC%20-%20LinkedIn%20(4)%20(1).jpg",
    "source": "Goal.com"
  },
  {
    "title": "Man City player ratings vs Newcastle: Bring on Arsenal! Omar Marmoush double gives Pep Guardiola's side another Wembley trip as impressive James Trafford frustrates hapless Magpies in Carabao Cup semi",
    "desc": "Rating the Manchester City players from their 3-1 win over Newcastle which booked their place in the Carabao Cup final against Arsenal",
    "image": "https://assets.goal.com/images/v3/blt57308d12525e3b4f/Goal%20HIC%20-%20LinkedIn%20(4)%20(1).jpg",
    "source": "Goal.com"
  },
  {
    "title": "Gavin McKenna Facing Felony Charge After Incident On January 31",
    "desc": "McKenna faces up to 20 years in prison if found guilty.",
    "image": "https://cdn.onwardstate.com/uploads/2025/09/DSC02610.jpg",
    "source": "Onward State"
  },
  {
    "title": "Shadow of foreign influence ops seen in divisive posts ahead of Japan's general election",
    "desc": "TOKYO -- Amid an unusually short campaign for the Feb. 8 House of Representatives election, there remain concerns about the spread of fake and inaccur",
    "image": "https://cdn.mainichi.jp/vol1/2026/02/04/20260204p2a00m0na016000p/0c10.jpg?1",
    "source": "毎日新聞"
  },
  {
    "title": "Even Local Dust Storms Can Drive Water Loss on Mars, Study Suggests",
    "desc": "Planetary scientists have identified a previously unrecognized pathway for water loss on Mars -- observed, for the first time, during the opposite season.",
    "image": "https://cdn.sci.news/images/2018/07/image_6224_1-Mars-Dust-Storm.jpg",
    "source": "Sci.News"
  },
  {
    "title": "A weighted gene co-expression network analysis characterises the common defence responses of Eucalyptus to diverse biotic challenges",
    "desc": "Eucalyptus is a globally important forestry genera cultivated for paper, pulp and biofuel production. These trees are increasingly threatened by a range of emerging pests and pathogens. While previous studies have focused on the transcriptomes of single Eucalyptus-pathogen interactions, the core transcriptional networks underlying defence across multiple biotic challenges remain poorly understood. Here we integrated 180 Eucalyptus-biotic stress RNA-sequencing libraries to characterise the common defence gene network during interactions with five distinct pathosystems. We constructed a comprehensive weighted gene co-expression network and identified 38 modules of highly co-expressed genes consisting of between 40 and 3,328 genes. The network revealed distinct modules that were induced by pathogen infection, enriched for defence responses including salicylic acid signalling and secondary metabolite biosynthesis and notably nitrate transport and responses, suggesting a potential link between nitrogen metabolism and immunity. Transcription factor enrichment analysis highlighted WRKY family genes as key regulators of induced responses, with WRKY6 emerging as a candidate hub gene in broad-spectrum resistance. Together, this study provides the first integrative transcriptome network of Eucalyptus responses to diverse biotic stressors, and offers candidate genes and pathways for future functional validation to enhance disease resistance resource in long-lived trees.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Power Outage Disrupts Winter Olympics Opening Events",
    "desc": "The 2026 Olympic Games ain't exactly off to an electric start.",
    "image": "https://imagez.tmz.com/image/b8/16by9/2026/02/04/b8d32e623c134105b40f64d9a2e0f937_xl.jpg",
    "source": "TMZ"
  },
  {
    "title": "Thailand Election 2026: Debt worries, economic uncertainty loom large on voters’ minds",
    "desc": "With Thai households under financial strain, economists say debt and global trade risks could hugely impact who voters pick on Sunday (Feb 8).",
    "image": "https://dam.mediacorp.sg/image/upload/s--FrKdYdmE--/c_fill,g_auto,h_676,w_1200/fl_relative,g_south_east,l_mediacorp:cna:watermark:2021-08:cna,w_0.1/f_auto,q_auto/v1/mediacorp/cna/image/2026/02/04/hero.jpg?itok=kS8Y8UgC",
    "source": "CNA"
  }
]