[
  {
    "title": "Jaywick XL bully owner's arrogance killed our mum, say daughters",
    "desc": "Esther Martin's daughters speak to the BBC after a man is convicted over the attack.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/58d3/live/7ff0ba70-0e63-11f1-9120-a910fc22c6ac.jpg",
    "source": "BBC"
  },
  {
    "title": "‘Fuyoh! More than Najib’: Rafizi says public will not believe ‘overkill’ claims linked to RM3.6b MACC probe",
    "desc": "KUALA LUMPUR, Feb 20 — Datuk Seri Rafizi Ramli has dismissed allegations linking him to RM3.6 billion in financial scandals, saying the claims were exaggerated and that no...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/20/326301.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "Australia vs Oman, T20 World Cup 2026 Live streaming: When and where to watch",
    "desc": "Cricket News: Australia will take the field for their final group-stage game against Oman on February 20, hoping to end their campaign on a high note after a turbul.",
    "image": "https://static.toiimg.com/thumb/msid-128592970,width-1280,height-720,imgsize-1161579,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "'He would have fetched at least 20 crores': Ex-Indian cricketer predicts huge IPL deal for this fast bowler",
    "desc": "Cricket News: Former India cricketer Mohammad Kaif said that if the Indian Premier League (IPL) 2026 auction had taken place after the ICC Men's T20 World Cup, Zimb.",
    "image": "https://static.toiimg.com/thumb/msid-128592715,width-1280,height-720,imgsize-78848,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Jin's liquor brand IGIN is coming to PH supermarkets",
    "desc": "IGIN, the South Korean liquor brand by Jin of BTS, is hitting local supermarkets!",
    "image": "https://images.gmanews.tv/webpics/2026/02/igin_2026_02_20_13_11_37.jpg",
    "source": "GMA Network"
  },
  {
    "title": "Rafizi appears uninterested in reconciling with PKR leadership, says KJ",
    "desc": "The former Umno Youth chief says the Pandan MP may even welcome being sacked so he can claim the moral high ground.",
    "image": "https://www.freemalaysiatoday.com/cdn-cgi/image/quality=75,format=auto,fit=cover,dpr=1,width=1200,height=630,gravity=center/https://media.freemalaysiatoday.com/wp-content/uploads/2026/02/58976165-khairy-jamaluddin-and-shahril-hamdan-ss-yt-200226.webp",
    "source": "Free Malaysia Today"
  },
  {
    "title": "Dollar set for best week in four months on hawkish Fed, geopolitics",
    "desc": "The dollar was buoyed on Friday by a run of better-than-expected economic data, a more hawkish Federal Reserve outlook, and tensions between the U.S. and Iran.",
    "image": "https://image.cnbcfm.com/api/v1/image/103634547-GettyImages-83077314.jpg?v=1771552802&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "US envoy Sergio Gor shares fresh update on possible Modi-Trump meeting - ‘stay tuned’",
    "desc": "The two leaders met last time when President Trump hosted PM Modi for an official working visit in Washington, DC, on 13 February 2025. Throughout 2025, Modi and Trump maintained regular communication, especially around trade negotiations.",
    "image": "https://www.livemint.com/lm-img/img/2026/02/20/1600x900/logo/USA-INDIA-RUSSIA-OIL-2_1765462824866_1765462847649_1771564112227.JPG",
    "source": "Mint"
  },
  {
    "title": "Dense fog closes key motorways across Punjab",
    "desc": "Dense fog blanketed large parts of Punjab during the night between Thursday and Friday, severely disrupting routine life and forcing the closure of several major",
    "image": "https://www.nation.com.pk/digital_images/large/2026-02-20/dense-fog-closes-key-motorways-across-punjab-1771564944-4033.jpeg",
    "source": "The Nation (Pakistan )"
  },
  {
    "title": "Measles case confirmed in ACT as authorities list possible exposure sites",
    "desc": "The ACT's health authorities are urging a high alert after a traveller with measles was unknowingly infectious in the community.…",
    "image": "https://region.com.au/wp-content/uploads/2023/11/IMG_2465-1-scaled-1200x630.jpg",
    "source": "Region Canberra"
  }
]