[
  {
    "title": "Nova draws the line on Jin Wei's role",
    "desc": "PETALING JAYA: There will be no more experimental forays for Goh Jin Wei. Her coach Nova Armada has issued a firm reminder for the shuttler to focus solely on her main discipline, the women's singles, especially now that she is beginning to show signs of progress.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/22/3780845.jpeg",
    "source": "thestar.com.my"
  },
  {
    "title": "How To Watch On TV & Streaming",
    "desc": "The 2026 BAFTA Film Awards will air on BBC One on Sunday, February 22. E! will broadcast in North America at 8pm ET.",
    "image": "https://deadline.com/wp-content/uploads/2026/02/FotoJet-2025-12-17T142529.774.jpg?w=1024",
    "source": "Deadline"
  },
  {
    "title": "Mourinho praises goalscorer Bah for amazing comeback after more than a year on sidelines",
    "desc": "The Danish international Alexander Bah made his comeback on Saturday, stepping onto the field a year and 13 days after suffering a serious injury while playing for Benfica, in the home match against AFS in Liga Portugal.",
    "image": "https://livesport-ott-images.ssl.cdn.cra.cz/r1200xfq60/3104c79f-1e7e-4e03-9b2f-c795b0d8ef12.jpeg",
    "source": "Flashscore.com"
  },
  {
    "title": "Reform predicts Tory wipeout in London",
    "desc": "Farage’s party expected to win six councils in the capital in local elections",
    "image": "https://www.telegraph.co.uk/content/dam/briefs/2026/02/20/TELEMMGLPICT000421310367_17715901751820_trans_NvBQzQNjv4BqY4-XNG_7v-V2jIZ3ghNYKOB8VXEHCs73yexWqFsf2H4.jpeg?impolicy=OG-Standard",
    "source": "The Telegraph"
  },
  {
    "title": "South Korea protests Japanese event over disputed islands",
    "desc": "Calls Japan to drop what it described as groundless claims and to face history with humility",
    "image": "https://i.tribune.com.pk/media/images/2026-02-22t061754z-1512938336-rc2quz9u02l7-rtrmadp1771745515-0/2026-02-22t061754z-1512938336-rc2quz9u02l7-rtrmadp1771745515-0-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Israeli members of Trump’s Board of Peace vow Hamas will disarm 'one way or another'",
    "desc": "The plan ties Gaza’s reconstruction and billions in pledged funding to full demilitarization, with a staged weapons handover, financial incentives and a proposed international stabilization force set to deploy at Rafah",
    "image": "https://ynet-pic1.yit.co.il/picserver6/crop_images/2026/02/19/rk11mvaE0011x/rk11mvaE0011x_0_170_3000_1689_0_large.jpg",
    "source": "Ynetnews"
  },
  {
    "title": "African deal to boost indigenous tech distribution across 43 markets",
    "desc": "Zinox Technologies has entered into strategic partnership with continental distributor TD Africa, a move designed to scale African-built...",
    "image": "https://cdn.businessday.ng/wp-content/uploads/2026/02/Reps_-of-Zinox-and-TD-Africa-at-the-event-scaled.jpeg",
    "source": "Businessday NG"
  },
  {
    "title": "DHS suspends trusted-traveler programs TSA PreCheck and Global Entry as partial shutdown drags on",
    "desc": "The Department of Homeland Security is temporarily halting TSA PreCheck and Global Entry, two of the most widely used trusted-traveler programs in the United States, amid a partial government shutdown.",
    "image": "https://media.cnn.com/api/v1/images/stellar/prod/gettyimages-2190861792.jpg?c=16x9&q=w_800,c_fill",
    "source": "CNN"
  },
  {
    "title": "Built on trust: How Etiqa sets the standard for stability and global collaboration",
    "desc": "ETIQA, a leading provider of group medical and insurance solutions in the Philippines, continues to strengthen market trust through financial credibility, operational excellence and strategic global partnerships – guided by its purpose of making the world a better place through responsible and reliable protection.",
    "image": "https://www.manilatimes.net/manilatimes/uploads/images/2026/02/22/946215.jpg",
    "source": "The Manila Times"
  },
  {
    "title": "Vice President Jane Opoku-Agyemang's dance courts reactions from Abronye",
    "desc": "The Bono Regional Chairman of the New Patriotic Party (NPP), Kwame Baffoe, popularly known as Abronye DC, has reacted to Vice President Professor Jane Naana Opoku-Agyemang's viral video showing her dancing at the Jubilee House.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/559/55969249.jpg",
    "source": "GhanaWeb"
  }
]