[
  {
    "title": "German minister says Europe-US ties stronger than China's as Western leaders step up Beijing visits",
    "desc": "At the 2026 Munich Security Conference, Germany's Foreign Minister Johann Wadephul reaffirmed strong US-Europe ties despite rising German investment in China. Tariffs and policy rifts under Donald Trump have fueled debate over Europe's strategic shift",
    "image": "https://www.livemint.com/lm-img/img/2026/02/16/1600x900/logo/GERMANY-DIPLOMACY-SECURITY-MSC-167_1771225780016_1771225802692.jpg",
    "source": "Mint"
  },
  {
    "title": "Brian and Arthur: 'We might bicker but we're a good team'",
    "desc": "\"I think the hardest time for us – and it's probably the case in a lot of relationships – was when we were trying to have a family\", Brian tells Janice Butler.",
    "image": "https://www.rte.ie/images/0023e408-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "NSW Police chases under scrutiny after two women die in crash as data shows rise in practice",
    "desc": "Lee Casuscelli and Maureen Crosland died when their car was hit in Camden by an allegedly stolen car that police had been pursuing.",
    "image": "https://live-production.wcms.abc-cdn.net.au/f7db0463d8d8e7cef507e3318b722116?impolicy=wcms_watermark_news&cropH=281&cropW=500&xPos=0&yPos=28&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Cost, consumer preference put rice imports high",
    "desc": "The United States Department of Agriculture’s (USDA) Grain and Feed 2025 Report reveals that local consumer preference is contributing largely to the country’s sustained interest in foreign rice consumption.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/313/31354588.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Avalanche crashes into train in the Swiss Alps causing ‘several casualties’",
    "desc": "Police launched a rescue operation after the train derailed near Goppenstein while carrying around 80 passengers.",
    "image": "https://metro.co.uk/wp-content/uploads/2026/02/SEI_285356096-7f5c_1771229667.jpg?quality=90&strip=all&w=1200&h=630&crop=1",
    "source": "Metro.co.uk"
  },
  {
    "title": "Ski jumper banned from Winter Olympics because his shoes were too big",
    "desc": "Austrian ski jumper Daniel Tschofenig's Winter Olympic dreams were dashed after he was found to be wearing oversized shoes.",
    "image": "https://metro.co.uk/wp-content/uploads/2026/02/SEI_284242259-79d9_1771227951.jpg?quality=90&strip=all&w=1200&h=630&crop=1",
    "source": "Metro.co.uk"
  },
  {
    "title": "'Love Go Go Go!' Opens at No. 1",
    "desc": "Romantic comedy 'Love Go Go Go!' debuted atop the China box office for the Feb. 13–15 weekend, taking $5.2 million.",
    "image": "https://variety.com/wp-content/uploads/2026/02/Love-Go-Go-Go.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "How much is Heidi Klum's net worth after Project Runway, AGT and fashion empire success",
    "desc": "Heidi Klum's net worth has drawn curiosity after years on Project Runway, AGT, and her fashion empire. Explore how her fortune grew and her income streams.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/ea9c2a70d8b2468e.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "PM pledges full implementation of people",
    "desc": "TANGA: PRIME Minister Dr Mwigulu Nchemba has reaffirmed the government’s commitment to prioritising projects that directly improve the lives of Tanzanians, asserting that ‘visible marks’ are being left across the country through strategic infrastructure investment. During a high-profile working tour of the Tanga Region, the Premier inspected the 107bn/- Pangani Bridge, describing the 525-metre engineering",
    "image": "https://dailynews.co.tz/wp-content/uploads/2026/02/DKT.-MWIGULU-AWEKA-JIWE-LA-MSINGI-UJENZI-WA-CHUO-KIKUU-MZUMBE-KAMPASI-YA-TANGAWAZIRI-MKUU-Dkt.jpg",
    "source": "dailynews.co.tz"
  },
  {
    "title": "taking paedophile from Wolverhampton raped girls grabbing one by throat",
    "desc": "Gurpreet Randhawa preyed on young girls online persuading them to meet up with him, ythen raping them, with one as young as 12 forced to send indecent images",
    "image": "https://i2-prod.birminghammail.co.uk/article33431134.ece/ALTERNATES/s1200/0_Gurpreet-Randhawa.jpg",
    "source": "Birmingham Live"
  }
]