[
  {
    "title": "Dublin woman Gail Slater exits Trump administration less than a year after appointment",
    "desc": "Former anti-trust chief departs after months of internal acrimony over light-touch regulation",
    "image": "https://www.irishtimes.com/resizer/v2/46GTSV7JPHFLFF5XUINK2JXNWQ.jpg?smart=true&auth=a6ffb0161dcb7917e93f4b6c4046b95fbeada82dd85888f3adddd0c03ce8cea9&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Winter Olympics 2026: Xandra Velzeboer storms to women's 500m short track gold",
    "desc": "The Dutch star backed up a world-record semi-final with a commanding performance to capture Olympic gold on Thursday (12 February).",
    "image": "https://img.olympics.com/images/image/private/t_social_share_thumb/f_auto/primary/ooe3fsl2grzqxrzvttvl",
    "source": "Milano Cortina 2026"
  },
  {
    "title": "Intelligence Dispute Centers on Kushner Reference in Intercepted Communication",
    "desc": "A whistle-blower has accused Tulsi Gabbard, the director of national intelligence, of blocking distribution of a report that Jared Kushner’s name came up in an intercepted communication about Iran.",
    "image": "https://static01.nyt.com/images/2026/02/12/multimedia/00dc-intel-top-zbvq/00dc-intel-top-zbvq-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Single's Inferno",
    "desc": "Five of Netflix's \"Single's Inferno 5\" cast members answered no when asked if women and men can be friends, during an interview with ELLE Korea.",
    "image": "https://image.koreaboo.com/2026/02/thu.jpg",
    "source": "Koreaboo"
  },
  {
    "title": "Brainwaves: What happens between life and death?",
    "desc": "A tunnel. A bright light. Reuniting with deceased loved ones. Many people who have near-death experiences have remarkably similar stories. Why?",
    "image": "https://wordpress.wbur.org/wp-content/uploads/2026/02/GettyImages-2180757575-1920x1440.jpg",
    "source": "WBUR"
  },
  {
    "title": "It Took Seven Hours, but a Streamer Grape-Pressed Almost Every Single NPC in Hitman's Winery Level at Once",
    "desc": "With enough patience and determination, anything is possible.",
    "image": "https://sm.ign.com/t/ign_ap/news/i/it-took-se/it-took-seven-hours-but-a-streamer-grape-pressed-almost-ever_f6tf.1200.jpg",
    "source": "IGN Southeast Asia"
  },
  {
    "title": "Despite travel warnings from Canada, U.S. and China, South Africa records historic 10.5 million visitors in 2025",
    "desc": "South Africa’s tourism sector reached a historic milestone in 2025, welcoming a record 10.5 million international visitors despite travel warnings issued by Canada, the U.S., China and Australia, surpassing pre-pandemic figures and signalling renewed global confidence in the country as a premier travel destination. | Business Insider Africa",
    "image": "https://ocdn.eu/pulscms-transforms/1/_cdktkpTURBXy9lNWYwYjI1ZjliMzg4ZmFlNjNlN2E1ZDhhNWQ3ODkzMi5qcGeSlQMAAM0DGs0Bv5MFzQSwzQJ2",
    "source": "Business Insider Africa"
  },
  {
    "title": "Jordan Binnington showing Canada that winning big games is just a part of his process",
    "desc": "Canadian goaltender Jordan Binnington was spectacular on those few occasions when he had to be. The rest of the Canada's 5-0 win over Czechia, he was smooth, calm, unhurried.",
    "image": "https://i.cbc.ca/ais/5ec99569-8dd7-411a-979e-04991e602fd1,1770923031441/full/max/0/default.jpg?im=Crop%2Crect%3D%280%2C150%2C2885%2C1622%29%3BResize%3D620",
    "source": "CBC"
  },
  {
    "title": "Guard Troops Fully Withdraw From Chicago, Portland and Los Angeles",
    "desc": "President Trump initially deployed the troops in those cities to support law enforcement efforts to tamp down protests against immigration raids and protecting buildings.",
    "image": "https://static01.nyt.com/images/2026/02/12/multimedia/12nat-guard-1-vgzq/12nat-guard-1-vgzq-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Uganda, Ethiopia strengthen bilateral ties during fore",
    "desc": "Oryem underscored that the two countries play key roles in the region and that they have established a strong relationship at the highest leadership level.",
    "image": "https://newvision-media.s3.amazonaws.com/cms/2214da77-0692-4d79-88ec-282d03aee023.jpg",
    "source": "NewVision.co.ug"
  }
]