[
  {
    "title": "[CROI 2026] Life4me+: GLP-1 receptor agonists at CROI 2026: Revolution, hype - or the beginning of a new era?",
    "desc": "Are GLP-1 receptor agonists a cure for everything?",
    "image": "https://www.eatg.org/wp-content/uploads/2026/02/63983.jpg",
    "source": "European AIDS Treatment Group"
  },
  {
    "title": "Arsenal face Chelsea title test, troubled Spurs in spotlight",
    "desc": "Premier League leaders Arsenal face a title test from London rivals Chelsea on Sunday.",
    "image": "https://s.france24.com/media/display/4bc8d688-137c-11f1-9930-005056a97e36/w:1280/p:16x9/0766795206e723d5d850e4df63481585df8195dc.jpg",
    "source": "France 24"
  },
  {
    "title": "What death of cartel leader 'El Mencho' in Mexico means for flow of drugs, violence into Chicago",
    "desc": "Notorious drug boss \"El Mencho,\" Jalisco New Generation Cartel leader, was killed by the Mexican military, impacting the flow of crime into Chicago.",
    "image": "https://cdn.abcotvs.com/dip/images/18655477_022626-wls-rivera-iteam-el-mencho-6p-vid.jpg?w=1600",
    "source": "ABC7 Chicago"
  },
  {
    "title": "Vance Continues to Criticize Democrats’ Attitude During State of the Union",
    "desc": "Speaking in Wisconsin to support Republicans ahead of the midterm elections, Vice President JD Vance reminded his audience that Democrats had not stood up at the president’s behest on Tuesday.",
    "image": "https://static01.nyt.com/images/2026/02/26/multimedia/26dc-vance-wcvm/26dc-vance-wcvm-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Company behind Australian cultural icon Hills Hoist could soon be sold",
    "desc": "The company behind one of Australia's most iconic brands is set to be put up for sale as its American owner...",
    "image": "https://imageresizer.static9.net.au/MfsV2yD2jYWXuIGtZzM-FcfBsck=/1200x628/smart/https%3A%2F%2Fprod.static9.net.au%2Ffs%2Fcb9e96bc-8fa4-4c83-87f2-e17133ba539d",
    "source": "9News.com.au"
  },
  {
    "title": "Arsenal face Chelsea title test, troubled Spurs in spotlight",
    "desc": "Premier League leaders Arsenal face a title test from London rivals Chelsea on Sunday.Defiant Man City vow to keep fighting\nPep Guardiola has warned Arsenal that Manchester City will \"never give up\" as they chase the seventh Premier League title of his glittering reign.",
    "image": "https://s.yimg.com/os/en/afp.co.uk/822bd46f80ced8ac4a810c0274833250",
    "source": "Yahoo Sports UK"
  },
  {
    "title": "India slips to fourth in MSCI EM Index as weight falls below 14%",
    "desc": "China currently holds the largest weight in the index at 26.58 percent, followed by Taiwan at 21.04 percent and South Korea at 15.65 percent. Brazil accounts for 4.63 percent, while other markets together make up 18.75 percent of the index weight.",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260221023745_sensex_nifty_stock-stocks_stock.jpg",
    "source": "Moneycontrol.com"
  },
  {
    "title": "Caught on camera: Black hole seen tearing a star apart for the first time",
    "desc": "Science News: Astronomers have reported an unusually high-energy event that may represent a rare form of black hole feeding. The transient, named EP250702a, was fir.",
    "image": "https://static.toiimg.com/thumb/msid-128814193,width-1280,height-720,imgsize-69680,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Supreme Court Lawyer Who Moonlighted in High-Stakes Poker Is Convicted of Tax Fraud",
    "desc": "The lawyer Thomas C. Goldstein, who co-founded the SCOTUSblog website, hid millions in gambling income from the government, federal prosecutors said.",
    "image": "https://static01.nyt.com/images/2026/01/04/magazine/26xp-goldstein/04mag-goldstein-03-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Ringgit opens higher vs greenback, regional currencies",
    "desc": "KUALA LUMPUR: The ringgit opened marginally firmer against the US dollar and other major currencies on Friday, supported by a pullback in United States Treasury yields and early Asian session positioning, despite the US dollar index (DXY) closing slightly higher.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/02/27/3789819.jpg",
    "source": "The Star"
  }
]