[
  {
    "title": "President Mahama urges African Leaders to fast-track continental financial institutions",
    "desc": "By: Celestine Avi and Seth Eyiah",
    "image": "https://i0.wp.com/www.gbcghanaonline.com/wp-content/uploads/2026/02/IMG-20260214-WA0053.jpg",
    "source": "GBC Ghana Online"
  },
  {
    "title": "Brazil's Pinheiro Braathen wins gold, and South America's first Winter Olympics medal",
    "desc": "Once a racer for Norway, Pinheiro Braathen switched to Brazil, his mother's home country. In winning the Olympic giant slalom on Saturday, he earned South America's first medal at a Winter Games.",
    "image": "https://npr.brightspotcdn.com/dims3/default/strip/false/crop/5819x3273+0+0/resize/1400/quality/85/format/jpeg/?url=http%3A%2F%2Fnpr-brightspot.s3.amazonaws.com%2Fd2%2F63%2F63ce2e114b9fa0ddbc5697160df6%2Fap26045527227529.jpg",
    "source": "NPR"
  },
  {
    "title": "'Too soon' - Ella Toone set to miss Man Utd's League Cup final date with Chelsea as latest injury update also rules England star out of Lionesses first camp of 2026",
    "desc": "Lionesses star Ella Toone is \"probably\" going to miss Manchester United's League Cup final clash with Chelsea due to a hip injury, one also set to rule her out of England's first camp of 2026",
    "image": "https://assets.goal.com/images/v3/blta85838b924c2832d/GOAL%20-%20Blank%20WEB%20-%20Facebook%20(3).jpg",
    "source": "Goal.com"
  },
  {
    "title": "The IOC’s ban of a Ukrainian athlete over his helmet reveals troubling double standards",
    "desc": "The IOC has failed, yet again, to be a global leader in the promotion of peace and human rights.",
    "image": "https://images.theconversation.com/files/718289/original/file-20260213-56-y266l8.jpg?ixlib=rb-4.1.0&rect=0%2C301%2C3610%2C1805&q=45&auto=format&w=1356&h=668&fit=crop",
    "source": "The Conversation"
  },
  {
    "title": "Dr Amoakohene, Kumasi Mayor visit Kotoko squad ahead of Hearts of Oak clash",
    "desc": "Ashanti Regional Minister Dr Frank Amoakohene and Kumasi Mayor Richard Ofori paid a visit to Asante Kotoko ahead of their high-stakes game against Accra Hearts of Oak on February 15, 2026.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/975/97506445.jpg",
    "source": "GhanaWeb"
  },
  {
    "title": "Anthony Kim completes stunning comeback from golfing obscurity to win LIV Golf Adelaide",
    "desc": "40-year-old American struggled with drug and alcohol addictions after his promising career went off the rails following injury",
    "image": "https://www.irishtimes.com/resizer/v2/TVGKLY35PAX76JZA2AVFWNIMCI.jpg?smart=true&auth=cad7b502364ef08b2cc96c31ff3bd42e149de6fa55089f31cfda49bff6a40c39&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Arundhati Reddy, Renuka Thakur fuel India's DLS victory",
    "desc": "Sophie Molineux's tenure as Australia's new T20I captain got off to a forgettable start as her batting unit crumbled under relentless pressure",
    "image": "https://static.cricbuzz.com/a/img/v1/540x303/i1/c860827/arundhati-reddy-was-the-chief-destroyer-with-a-four-wicket-haul.jpg",
    "source": "Cricbuzz.com"
  },
  {
    "title": "Italy's Mosca brothers on T20 World Cup, Andrea Bocelli, Mario Balotelli and facing England",
    "desc": "From meeting Mario Balotelli and Paolo Maldini to singing Andrea Bocelli and Ed Sheeran on the bus after their maiden T20 World Cup win, BBC Sport takes a look inside Italy's tournament.",
    "image": "https://ichef.bbci.co.uk/ace/branded_sport/1200/cpsprodpb/31c9/live/37a28e40-0a69-11f1-9972-d3f265c101c6.jpg",
    "source": "BBC"
  },
  {
    "title": "DOH flags critical shortage of dentists nationwide",
    "desc": "A shortage of dentists in the Philippines has resulted in a wide gap between the number of practicing dental professionals and the country’s population, a health official said on Sunday.",
    "image": "https://images.gmanews.tv/webpics/2026/02/Screenshot_2026-02-15_205236_2026_02_15_20_52_29.png",
    "source": "GMA Network"
  },
  {
    "title": "'Definite line of inquiry' into fatal Limerick crash",
    "desc": "Gardaí say they are following a definite line of inquiry following a three-car collision in Co Limerick, which claimed the life of a nurse who was on her way to work on Friday night.",
    "image": "https://www.rte.ie/images/0023e5b9-1600.jpg",
    "source": "RTE.ie"
  }
]