[
  {
    "title": "Bird rescued after being caught by fishing line at Lower Seletar Reservoir",
    "desc": "The bird was seen hanging off a tree, weakly flapping its wings, for at least an hour. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/7f4757e14d4e9accf48d870debb7717df70975cf7086eb3686b77840c284e61b",
    "source": "The Straits Times"
  },
  {
    "title": "DUBAI: Union in ground-breaking retreat for boda boda leaders, transport sector partners",
    "desc": "Dubai, UAE | LOUIS JADWONG | Over 50 leaders of Uganda’s Boda-Boda Riders Cooperative Union, together with key partners in the transport sector, are in Dubai for a two-day retreat that will not only mark its first anniversary but also champion electric mobility in the boda, matatu and bus sectors in the East African country. …",
    "image": "https://www.independent.co.ug/wp-content/uploads/2025/06/Ssenoga-union-app.jpg",
    "source": "The Independent Uganda"
  },
  {
    "title": "LPG prices hiked effective February 1",
    "desc": "Prices of liquefied petroleum gas (LPG) increased on Sunday, February 1, after LPG firms Petron and Solane announced a price hike on Saturday, January 31.",
    "image": "https://media.philstar.com/photos/2024/03/25/30_2024-03-25_19-04-57.jpg",
    "source": "Philstar.com"
  },
  {
    "title": "The Jay Walker Podcast Debuts at #3 on Apple Podcasts Lifestyle Chart and #12 on iHeart Podcast Charts on Premiere Day",
    "desc": "Arts & Entertainment, Broadcasting & Entertainment, GlobeNewswire | ATLANTA, Jan. 31, 2026 (GLOBE NEWSWIRE) -- The Jay Walker Po",
    "image": "https://macaubusiness.com/favicon.ico",
    "source": "Macau Business"
  },
  {
    "title": "Inside Mariah Carey's 2026 MusiCares Person of the Year gala",
    "desc": "The veteran pop-soul singer was honored Friday night by the Recording Academy for her philanthropy and cultural impact.",
    "image": "https://ca-times.brightspotcdn.com/dims4/default/3ba39e8/2147483647/strip/true/crop/3024x1588+0+158/resize/1200x630!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fe3%2F29%2F8435bfef4fb08871e3e8500c48e1%2Fgettyimages-2258576461.jpg",
    "source": "Los Angeles Times"
  },
  {
    "title": "Four teenage boys credited with saving three swept out by rip at Tasmanian beach",
    "desc": "Police have praised the efforts of four teenage boys who helped three other young people swept out by a rip at a Tasmanian beach, with a dad saying his son was probably \"30 seconds from drowning\".",
    "image": "https://live-production.wcms.abc-cdn.net.au/649270efba329c0552182bb90b9f0b7d?impolicy=wcms_watermark_news&cropH=576&cropW=1023&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Tbr2-dependent parallel pathways regulate the development of distinct ipRGC subtypes",
    "desc": "The intrinsically photosensitive retinal ganglion cells (ipRGC) are the conduit between the retina and brain regions responsible for non-image-forming and image-forming vision. In mice, six ipRGC subtypes have been discovered based on morphological characteristics, functions, and molecular profiles. All ipRGCs arise from Tbr2-expressing RGCs during developmental stages and subsequently diverge and differentiate into the six mature, distinct subtypes in adult retinas. However, the cellular and molecular mechanisms controlling the formation and maturation of the six ipRGC subtypes remain elusive. Here, we demonstrate that two Tbr2-dependent transcription factors, Iroquois‑related homeobox 1 (Irx1) and T-box containing factor 20 (Tbx20), are key downstream transcription factors guiding lineage segregations of Tbr2-expressing RGC into distinct adult ipRGC subtypes. Both factors also control Opn4 expression. Irx1 is expressed in the M3, M4, and M5 subtypes, while Tbx20 is predominantly expressed in M1, M2, M6, and subgroups of M3 and M5. When Irx1 is ablated during retinal development, Opn4 expression is significantly reduced in the M3, M4, and M5 ipRGC groups; however, the formation of Irx1-expressing ipRGCs is not affected. In contrast, when Tbx20 is deleted, a significant number of Tbx20-expressing cells fail to develop while Opn4 expression is down-regulated. These findings reveal two parallel transcription cascades downstream of Tbr2 for controlling ipRGC subtype formation, fate divergence, and maintenance in the adult retina. Two parallel transcription cascades via Irx1 and Tbx20, which are downstream of Tbr2, regulate ipRGC subtype formation, fate divergence, and maintenance in the retina.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Wood qualifying controversy resolved in NZ Grand Prix u-turn",
    "desc": "Ryan Wood will start the 70th New Zealand Grand Prix from seventh after withdrawing his disqualification appeal. - Australia's #1 motorsport news website - Speedcafe.com",
    "image": "https://speedcafe.com/wp-content/uploads/2026/02/55068962972_4490fc5b56_6k.jpg",
    "source": "Speedcafe.com"
  },
  {
    "title": "Noah Kahan Documentary Set for Netflix Debut",
    "desc": "A documentary on Noah Kahan's breakthrough success with 'Stick Season' is coming to Netflix.",
    "image": "https://www.billboard.com/wp-content/uploads/2026/01/noah-kahan-dec-2025-billboard-1800.jpg?w=1024",
    "source": "Billboard"
  },
  {
    "title": "Snow forecast updates for southeastern Virginia",
    "desc": "The weather service says Norfolk, Portsmouth, Suffolk and most of Chesapeake and Virginia Beach is likely to see 3-4 inches of snow. Higher amounts are possible.",
    "image": "https://www.pilotonline.com/wp-content/uploads/2026/01/snowfall-4-pm-sat.jpg?w=864&h=613",
    "source": "The Virginian-Pilot"
  }
]