[
  {
    "title": "Bangladesh election: Can India reset ties with a BNP-led government",
    "desc": "A reset of the frayed relationship is possible, say analysts. But it will require restraint - and reciprocity.",
    "image": "https://ichef.bbci.co.uk/ace/branded_news/1200/cpsprodpb/8644/live/668e1290-08d1-11f1-b5e2-dd58fc65f0f6.jpg",
    "source": "BBC"
  },
  {
    "title": "Gang raids in Nigerian villages leave more than 30 people dead",
    "desc": "Assailants shot dead or cut the throats of their victims, lit homes on fire and abducted multiple people in Niger state, Nigeria.",
    "image": "https://ichef.bbci.co.uk/news/1024/branded_news/b773/live/6da5c8b0-0a0d-11f1-97b1-d35b39d52f67.jpg",
    "source": "BBC"
  },
  {
    "title": "'We’ll make independent choices': EAM Jaishankar’s sharp signal after US links trade deal to Russian oil",
    "desc": "S Jaishankar says India will make independent energy choices after US cites commitment on Russian oil in trade pact, as imports fall sharply.",
    "image": "https://images.moneycontrol.com/static-mcnews/2026/02/20260214170600_S-jaishankar-munich.png",
    "source": "Moneycontrol"
  },
  {
    "title": "'Appalling': Hamilton woman assaulted at home by intruders",
    "desc": "The woman was admitted to hospital after she confronted two men attempting to enter her Fairfield address.",
    "image": "https://tvnz-1-news-prod.cdn.arcpublishing.com/resizer/v2/police-generic-U5EKXXN3NFG6XGEJHNFHDUYDAU.png?auth=8b97033dffec02aaafaa9eb3d939ba774590a9a4fb9d3968000873c1225a0e16&quality=70&width=600&height=315&focal=832%2C376",
    "source": "1News"
  },
  {
    "title": "Beyond the glam: Fundraising goal achieved, GMA Gala 2025 wins big at the TikTok Awards 2025",
    "desc": "The 2025 GMA Gala, a celebration of GMA Network’s 75th Anniversary and Sparkle GMA Artist Center’s 30th Anniversary, was recognized at the TikTok Live...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/15/79437.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "Victorian opposition pledge royal commission into CFMEU corruption if elected",
    "desc": "Opposition leader Jess Wilson has pledged to investigate an alleged $15 billion blowout to Victoria's Big Build projects if elected.",
    "image": "https://live-production.wcms.abc-cdn.net.au/63d8d45cb1facd7e128914972be31cb6?impolicy=wcms_watermark_news&cropH=810&cropW=1440&xPos=0&yPos=309&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Daily Voice: Sell-off on AI disruption fears shows earnings catching up, but structural thesis intact, says Sonam Srivastava",
    "desc": "If global risk appetite improves and domestic earnings remain in the mid-teens range, India can deliver relative outperformance, though returns are likely to be more moderate than the previous post-pandemic surge, said Sonam Srivastava of Wright Research PMS.",
    "image": "https://images.moneycontrol.com/static-mcnews/2021/11/Sonam_Srivastava1280.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "How former TV newsreader Leanne Malcolm built a new music career in her sixties",
    "desc": "Ask broadcaster-turned-singer-songwriter Leanne Malcolm what’s the most rock’n’roll thing she’s ever done and she pauses thoughtfully. There’s certainly been...",
    "image": "https://www.nzherald.co.nz/resizer/v2/ZHUBNFE2MFFHFDUHE3NXFZ26VU.JPG?auth=ccffb89d9d4e6989663b19b5d1cfe180d3ef6a8fe70cb5e77011cf17bce87182&width=1200&height=675&quality=70&focal=1418%2C751&smart=false",
    "source": "NZ Herald"
  },
  {
    "title": "Is the iShares MSCI China ETF a Buy After Nipun Capital Scooped Up Shares Worth $7.3 Million?",
    "desc": "iShares MSCI China ETF provides broad exposure to large- and mid-cap Chinese equities, tracking the MSCI China Index for investors.",
    "image": "https://g.foolcdn.com/image/?url=https%3A%2F%2Fcdn.content.foolcdn.com%2Fimages%2F1umn9qeh%2Fproduction%2F6692d59793d1ea90a718aa18b7a3ace7f41e99ee-1401x1251.png%3Frect%3D76%2C0%2C1251%2C1251%26w%3D384%26h%3D384%26q%3D75%26fit%3Dcrop%26auto%3Dformat&w=1200&op=resize",
    "source": "The Motley Fool"
  },
  {
    "title": "\"The King's Warden\" Stars Celebrate As Film Surpasses 2 Million Moviegoers",
    "desc": "“The King’s Warden” has reached another exciting milestone at the box office! On February 15, the Korean Film Council announced that as of 12:36 a.m. KST",
    "image": "https://0.soompi.io/wp-content/uploads/2026/02/14165149/The-Kings-Warden-9.jpg",
    "source": "Soompi"
  }
]