[
  {
    "title": "Osun Local Govt Funds: Court Orders Arrest Of UBA Senior Executives Over Unauthorised Accounts",
    "desc": "An Osogbo Chief Magistrate Court has issued a bench warrant against United Bank for Africa (UBA) Plc and three of its senior executives over alleged involvement in the opening and operation of unauthorised accounts for local government funds in Osun State. The bench warrant was issued on Friday, January 30, 2026, following the bank’s failure to appear before the court in a case instituted by the Osun State government through the Office of the Attorney General. The court also adjourned further hearing in the matter to February 10, 2026.",
    "image": "https://saharareporters.com/themes/custom/octavia_sahara/favicon.ico",
    "source": "Sahara Reporters"
  },
  {
    "title": "Conservative campaign manager acknowledges grassroots calls for change ahead of next election",
    "desc": "Steve Outhouse says ballot-box question of the campaign will still centre on Canadians’ everyday concerns",
    "image": "https://www.theglobeandmail.com/resizer/v2/B3ZGZMOWSRBP3LJJ33CKRULHTU.JPG?auth=7e972c1965cdbd9bd30f54d33968f68c8bd42ebcfdb6be6fc255af4be27debe3&width=1200&height=800&quality=80&smart=true",
    "source": "The Globe and Mail"
  },
  {
    "title": "WWE SmackDown Spoiler Results for January 30, 2026",
    "desc": "The January 30, 2026 episode of Friday Night SmackDown airs from the King Abdullah Financial District in Riyadh, Saudi Arabia. This is the final episode",
    "image": "https://www.ringsidenews.com/wp-content/uploads/2025/04/potential-spoiler-on-return-ahead-of-418-wwe-smackdown-in-las-vegas-47.jpg",
    "source": "Ringside News"
  },
  {
    "title": "Battlefield 6 Update to Alter 2 Controversial Cosmetics After Fans Accuse EA of AI",
    "desc": "Battlefield Studios and EA have published Battlefield 6 version 1.1.3.6 patch notes, revealing the next update will alter the controversial “Call of Duty: Ghosts” skin and a seemingly AI-generated sticker.",
    "image": "https://assets-prd.ignimgs.com/2026/01/30/battlefield-6-objective-ace-1769796630513.png?width=1280&format=jpg&auto=webp&quality=80",
    "source": "IGN"
  },
  {
    "title": "Holding on to gold despite surging price",
    "desc": "IPOH: Despite the price of gold surging past RM650 per gram, the folks here are not rushing to cash in their gold.",
    "image": "https://apicms.thestar.com.my/uploads/images/2026/01/31/3747189.jpg",
    "source": "The Star | Malaysia"
  },
  {
    "title": "Giannis Antetokounmpo, Bucks are focal point as trade deadline nears",
    "desc": "Suitors aplenty may be lining up deals for Milwaukee's superstar with the Feb. 5 trade deadline quickly approaching.",
    "image": "https://cdn.nba.com/manage/2026/01/giannis-1.jpg",
    "source": "NBA"
  },
  {
    "title": "DOJ opens federal civil rights probe into death of Alex Pretti",
    "desc": "Deputy Attorney General Todd Blanche says the Justice Department has opened a federal civil rights investigation into the death of Alex Pretti, the Minneapolis resident killed by Border Patrol officers.",
    "image": "https://dims.apnews.com/dims4/default/7688bd2/2147483647/strip/true/crop/8640x5757+0+1/resize/980x653!/quality/90/?url=https%3A%2F%2Fassets.apnews.com%2F59%2F5e%2F8ad6aa031cb03a86306823e06148%2F605f5532982e4de4a7fbd26a6507f057",
    "source": "AP News"
  },
  {
    "title": "AI tool predicts six-month risks for cancer patients after heart attack",
    "desc": "Cancer patients who suffer a heart attack face a dangerous mix of risks, which makes their clinical treatment particularly challenging. As a result, patients with cancer have been systematically excluded from many clinical trials and available risk scores. Until now, doctors had no standard tool to guide treatment in this vulnerable group.",
    "image": "https://scx2.b-cdn.net/gfx/news/hires/2024/heart-attack-5.jpg",
    "source": "Medical Xpress"
  },
  {
    "title": "Watch: Runaway barge rescued amid Kilkenny flooding",
    "desc": "A runaway barge which broke free from its moorings during flooding was intercepted on the River Barrow amid fears it would hit a bridge further downstream.",
    "image": "https://www.rte.ie/images/0023d37d-1600.jpg",
    "source": "RTE.ie"
  },
  {
    "title": "Trump threatens 50 percent tariff against Canadian aircraft sold in U.S.",
    "desc": "The president accused Canada of blocking the sale of U.S.-made Gulfstream aircraft and said he would raise tariffs in the latest dispute to rock the once-chummy relationship.",
    "image": "https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/JHKZS4USMOIFP3JLDD77DC6CL4.JPG&w=1440",
    "source": "The Washington Post"
  }
]