[
  {
    "title": "Bruce Highway blocked after excavator strikes Ilkley Road bridge at Tanawha on Sunshine Coast",
    "desc": "Traffic is piling up and diversions are in place after an excavator that was being carried by a truck struck the Ilkley Road bridge and fell onto the Bruce Highway north of Brisbane.",
    "image": "https://live-production.wcms.abc-cdn.net.au/ee973fc199da45a2db7eedcaec90325c?impolicy=wcms_watermark_news&cropH=873&cropW=1552&xPos=247&yPos=62&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Bitcoin drops below US$61,000, wiping out gains since Trump’s win",
    "desc": "Bitcoin tumbles below US$61,000, erasing gains since Trump's election due to unwinding leveraged bets and broader market turbulence. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/642b9d862e375cf38dcba2586fed5f6f95ddbc6431c3743a13119dc4b5460fe1",
    "source": "The Straits Times"
  },
  {
    "title": "After back-to-back flops, star hero opens up about his next",
    "desc": "Latest Telugu cinema news, Movie reviews, OTT Updates, OTT reviews, Box office collections, OTT release dates, OTT, News, Prabhas, Mahesh Babu, Allu Arjun",
    "image": "https://cdn.123telugu.com/content/wp-content/uploads/2025/09/sivakarthikeyan-1.webp",
    "source": "123telugu.com"
  },
  {
    "title": "Why are ASX 200 tech shares diving 13% this week?",
    "desc": "The S&P/ASX 200 Information Technology Index (ASX: XIJ) has lost more than 20% of its value in 2026 as share prices fall. What's happening?",
    "image": "https://www.fool.com.au/wp-content/uploads/2021/07/GettyImages-1168083132-1-1200x675.jpg",
    "source": "The Motley Fool Australia"
  },
  {
    "title": "Single-shot incoherent imaging with extended and engineered field of view using coded phase apertures",
    "desc": "A large field of view of an optical system is needed for many applications, and optical systems with high magnification often suffer from a limited field of view due to the limited size of the camera sensor. This study proposes a novel technique for engineering the field of view of an optical system without compromising the magnification. In the proposed method, an object response pattern is recorded on a camera by introducing a coded phase mask (CPM) in the imaging system. The coded phase mask is a multiplexing of N distinct scattering phases, where N − 1 represents the number of isolated object areas to be brought within the field of view. Each scattering phase yields a point spread function of a unique sparse dot pattern on the camera. With the introduction of a coded phase mask, the objects’ images are brought within the region of the camera sensor, which, without the CPM, would have remained outside the inherent field of view of the system. To reconstruct the original object plane with N objects at their respective locations, the zero-padded object response pattern is deconvolved with the system’s zero-padded and shifted point spread function. A simulation study followed by experimental results for N = 2 and N = 3 is presented in this article.",
    "image": "https://www.nature.com/static/images/favicons/nature/favicon-48x48-b52890008c.png",
    "source": "Nature"
  },
  {
    "title": "Fees for foreign-registered vehicles entering Singapore to increase from Jan 1, 2027",
    "desc": "Singapore to increase Vehicle Entry Permit (VEP) fees for foreign-registered cars, motorcycles, and goods vehicles from January 1, 2027. Read more at straitstimes.com.",
    "image": "https://cassette.sphdigital.com.sg/image/straitstimes/fb4c5cfd10006e2206076c39ad557278bce5d9931e1da0c72c1b1d2a1fdd954f",
    "source": "The Straits Times"
  },
  {
    "title": "Gaza casualties mount as patients go through Rafah crossing",
    "desc": "OCHA and its partners welcomed the returnees from Egypt in a reception area, with protection specialists, psychologists, medical personnel and other support.",
    "image": "https://www.chinadailyhk.com/upload/main/image/2026/02/06/cf192815235ffdf3deda214c3cec1c35.png",
    "source": "chinadailyasia.com"
  },
  {
    "title": "Uber Is Responsible for Rape by Driver, Jury Finds",
    "desc": "In the first of federal trial of thousands of sexual assault cases, the ride-hailing giant was ordered to pay $8.5 million to Jaylynn Dean, who said a driver raped her in 2023.",
    "image": "https://static01.nyt.com/images/2026/02/05/multimedia/05Biz-Uber-Verdict-01-fghl/05Biz-Uber-Verdict-01-fghl-facebookJumbo.jpg",
    "source": "The New York Times"
  },
  {
    "title": "Malaysian actress Vanidah Imran eyes Tamil cinema debut as she continues to light up local drama scene",
    "desc": "KUALA LUMPUR, Feb 6 — Malaysian actress, model and television host Vanidah Imran said she would love to star in a local Tamil film in the future.Fans nationwide know that the...",
    "image": "https://www.malaymail.com/malaymail/uploads/images/2026/02/05/323995.jpg",
    "source": "Malay Mail"
  },
  {
    "title": "Akeso Receives Fifth Breakthrough Therapy Designation from NMPA for Ivonescimab in First-Line Treatment of Advanced Biliary Tract Cancer",
    "desc": "/PRNewswire/ -- Akeso, Inc. (9926.HK) is pleased to announce that ivonescimab, its global first-in-class bispecific antibody targeting PD-1 and VEGF, has been...",
    "image": "https://www.prnewswire.com/content/dam/prnewswire/icons/2019-Q4-PRN-Icon-32-32.png",
    "source": "PR Newswire"
  }
]