[
  {
    "title": "Australian Chamber Orchestra welcomes 416yo Italian viola into its collection",
    "desc": "The instrument is believed to be one of the finest tenor violas in existence and the only surviving example of its kind.",
    "image": "https://live-production.wcms.abc-cdn.net.au/fbc4f370253bc6abbd7c6a86e4c59d07?impolicy=wcms_watermark_news&cropH=909&cropW=1616&xPos=0&yPos=41&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Timothee Chalamet shares major learnings after working with 'favourite' director Christopher Nolan",
    "desc": "Timothée Chalamet has opened up about what it was like working with acclaimed filmmaker Christopher Nolan.\nThe actor recently sat down with his Interstellar co-star Matthew McConaughey for a...",
    "image": "https://www.thenews.com.pk/assets/uploads/2026-02-25/1393599_123313_updates.jpg",
    "source": "The News International"
  },
  {
    "title": "England Lions Beat Pakistan A by 2 Wickets",
    "desc": "England Lions chase 163 to beat Pakistan A by 2 wickets in the 3rd T20 in UAE as Jordan Cox smashes 58 off 21 balls.",
    "image": "https://www.cricketworld.com/media/img/a/d/161275.jpg",
    "source": "Cricket World"
  },
  {
    "title": "Premier League clubs avoid points deductions by selling women’s teams",
    "desc": "Entire top flight complied with Profitability and Sustainability Rules last season — although some, such as Aston Villa, breached Uefa spending rules and will be hit with heavy fines",
    "image": "https://www.thetimes.com/imageserver/image/%2F4d079737-30b2-4335-91e1-4d37384cee06.jpg?crop=1643%2C924%2C110%2C92&resize=1200",
    "source": "The Times"
  },
  {
    "title": "Government blocks 5 OTT platforms for streaming obscene content",
    "desc": "Government blocks five OTT platforms for streaming obscene content to uphold public decency and enforce ethical digital practices.",
    "image": "https://th-i.thgim.com/public/incoming/ijbtgg/article69242297.ece/alternates/LANDSCAPE_1200/iStock-1455409825-ott.jpg",
    "source": "The Hindu"
  },
  {
    "title": "Reps panel probes 'mismanagement' of FG’s renewable energy projects, summons REA MD",
    "desc": "The house of representatives committee on renewable energy has commenced an investigation into the alleged mismanagement of the federal government’s investments in the sector.",
    "image": "https://www.thecable.ng/wp-content/uploads/2024/05/HOUSE-OF-REPS.jpeg",
    "source": "TheCable"
  },
  {
    "title": "Donald Trump to address Congress amid SCOTUS tariff ruling and Iran tensions",
    "desc": "US News: US President Donald Trump will address a joint session of Congress on Tuesday (US local time), delivering his State of the Union speech at a political.",
    "image": "https://static.toiimg.com/thumb/msid-128761753,width-1280,height-720,imgsize-595090,resizemode-6,overlay-toi_sw,pt-32,y_pad-600/photo.jpg",
    "source": "The Times of India"
  },
  {
    "title": "Beta Film Boards Premium Drama Series on the Fairytale King 'Ludwig'",
    "desc": "Beta Film has boarded as international distributor on a crime series about the death of King Ludwig II of Bavaria.",
    "image": "https://variety.com/wp-content/uploads/2026/02/Ludwig.jpg?w=1000&h=563&crop=1",
    "source": "Variety"
  },
  {
    "title": "Gearing Up: All Is Fresh, Equal, Exciting Entering St. Pete Opener",
    "desc": "The 18-race NTT INDYCAR SERIES season takes the green flag at noon (ET) Sunday at the Firestone Grand Prix of St. Petersburg.",
    "image": "https://www.indycar.com/-/media/IndyCar/News/Standard/2026/02/02-24-StPete-Start.jpg?vs=1&d=20260224T192903Z",
    "source": "INDYCAR.com"
  },
  {
    "title": "Head of Bolt's Azerbaijan office sacked over bribery, abuse of office claims",
    "desc": "A corruption scandal has erupted at Bolt's Azerbaijan operations after fleet owners and drivers filed complaints directly with the company's headquarters in",
    "image": "https://citinewsroom.com/wp-content/uploads/2026/02/bolt.jpg",
    "source": "CitiNewsroom.com"
  }
]