[
  {
    "title": "Reconfigurable robotic fish reveals how stiffness and wave propagation shape swimming performance",
    "desc": "How can some fish, like tuna, achieve remarkable speed while others, like eels, excel in maneuverability? A research team from Peking University (PKU) has developed a novel robotic platform that sheds new light on this classic biomechanical puzzle.",
    "image": "https://scx2.b-cdn.net/gfx/news/2026/how-do-fish-swim-fast.jpg",
    "source": "Phys.org"
  },
  {
    "title": "Homebuyers are backing out of deals at the fastest pace since 2017",
    "desc": "More than 16% of signed contracts on homes in December were canceled, as consumers face continued uncertainty in the economy and rising inventory.",
    "image": "https://image.cnbcfm.com/api/v1/image/108108420-1740667756457-gettyimages-2157834117-EXISTING_HOME_SALES.jpeg?v=1769535632&w=1920&h=1080",
    "source": "CNBC"
  },
  {
    "title": "One person in critical condition after being shot in incident involving Border Patrol in Arizona",
    "desc": "A person was shot in an incident involving U.S. Border Patrol in Arizona on Tuesday, according to a Pima County Sheriff spokeswoman.",
    "image": "https://media-cldnry.s-nbcnews.com/image/upload/t_nbcnews-fp-1200-630,f_auto,q_auto:best/rockcms/2025-04/250422-border-patrol-agent-patch-uniform-2019-ac-739p-d71533.jpg",
    "source": "NBC News"
  },
  {
    "title": "Nyeri Family in Agony as Son Who Works for Water Company Goes Missing for 2 Weeks",
    "desc": "Elijah Nderitu Kinyua, an employee at MAWASCO, was last seen on Friday 9/02/26 boarding a matatu to work. His sudden disappearance raises concerns.",
    "image": "https://cdn.tuko.co.ke/images/1200x675/e3ef6abf44a6f471.jpeg?v=1",
    "source": "Tuko News"
  },
  {
    "title": "Model hopeful gave up career after laser hair removal left her with burns, court hears",
    "desc": "Woman awarded €80,000 in damages following treatment that left her with scarring",
    "image": "https://www.irishtimes.com/resizer/v2/KQMVTDQY5JAAVKCAQVPPBWF3DM.jpg?smart=true&auth=9b4c3331409b3cc3527bc55e91a69ef3c5dd46c45a21979ecc96b7989a8bba85&width=1200&height=630",
    "source": "The Irish Times"
  },
  {
    "title": "Scientists shed new light on the brain's role in heart attack",
    "desc": "Researchers discovered a feedback loop between nerve cells, the immune system and the heart. They think it shows promise as a target for future therapies.",
    "image": "https://www.wliw.org/wp-content/uploads/sites/128/2026/01/gettyimages-1074197908.jpeg",
    "source": "WLIW"
  },
  {
    "title": "Grassroots to the Olympics: the past, present and hoped-for future of rugby in Singapore",
    "desc": "Rupert Cox, the voice of HSBC SVNS rugby on Rugbypass TV, uncovers the state of a thriving game in Singapore and the ambitions - and challenges - for the next phases in the sevens and XVs game",
    "image": "https://resources.worldrugby-rims.pulselive.com/worldrugby/photo/2026/01/27/06f4edd6-6da8-4f70-8369-fb90db379e69/Singapore-junior-rugby-piece.jpg",
    "source": "HSBC SVNS Series"
  },
  {
    "title": "St Patrick's Athletic vying with Derry City for signature of League One ace who used to play for Shamrock Rovers",
    "desc": "ST PAT’S are hoping to tie up the signing of Barry Cotter after landing English striker Ryan Edmondson.\nEdmondson has joined the club from...",
    "image": "https://www.thesun.ie/wp-content/uploads/sites/3/2026/01/crop-16448855.jpg?quality=90&strip=all&w=1920&h=1080&crop=1",
    "source": "The Irish Sun"
  },
  {
    "title": "UH psychologist provides guidance to improve mental health of sexual violence victims",
    "desc": "A psychologist at the University of Houston is providing guidance to improve the mental health of victims of sexual violence, recognized by major health organizations as a public health crisis with serious implications on victims' physical, mental and reproductive health.",
    "image": "https://www.news-medical.net/image-handler/picture/2014/7/Anxiety-620x480.jpg",
    "source": "News-Medical"
  },
  {
    "title": "Grounded 2 Update: The Toxic Tangle - Available Now",
    "desc": "The Toxic Tangle update is available now, expanding Grounded 2 with a massive new Garden biome,, new creatures and gear including a new mount, the mysterious Tang effect, and much more.",
    "image": "https://xboxwire.thesourcemediaassets.com/sites/2/2026/01/G2_LADYBUG_Hero-f18e0641ff659fe61d63.jpg",
    "source": "Xbox Wire"
  }
]