[
  {
    "title": "Ministry of Education Orders Crackdown on School Imposing High Prices on Uniforms",
    "desc": "The prices of school uniforms have been a matter of particular concern in 2026, especially to students who were transitioning to Grade 10 in senior schools.",
    "image": "https://www.kenyans.co.ke/files/styles/article_style/public/images/media/kcse_candidates_sit_for_exams.jpg?itok=ZOcB5JY9",
    "source": "Kenyans.co.ke"
  },
  {
    "title": "New Nipah-like bat virus in Bangladesh is becoming more deadly, scientists warn",
    "desc": "PRV infections are typically mild, but that has not been the case in these newly documented cases",
    "image": "https://s.yimg.com/os/en/the_independent_635/6918b8b297923cdd7939f3c8d30a67f9",
    "source": "Yahoo News Canada"
  },
  {
    "title": "The TechTrends Podcast | When a Nation Talks: The Safaricom Sale Question",
    "desc": "In this episode of The TechTrends Podcast, we capture sentiment on what the Safaricom sale could mean Kenya.",
    "image": "https://techtrendske.co.ke/wp-content/uploads/2026/02/techtrends-podcast.png",
    "source": "TechTrendsKE"
  },
  {
    "title": "Nairobi leads UDA aspirants as 12,353 attend State House forum",
    "desc": "Nairobi alone recorded 968 hopefuls across all elective positions",
    "image": "https://cdn.radioafrica.digital/image/2026/02/857d9e4a-fce7-4e1b-9cc0-f63c2b576267.jpeg?1770232447450",
    "source": "the-star.co.ke"
  },
  {
    "title": "Four more years for Imran's attacker in illegal arms case",
    "desc": "Convict already serving two life terms for 2022 assassination attempt on former premier",
    "image": "https://i.tribune.com.pk/media/images/imran-khan1758591716-3/imran-khan1758591716-3-640x480.webp",
    "source": "The Express Tribune"
  },
  {
    "title": "Men’s T20 World Cup 2026 Warm-Up: Day 3 Wrap",
    "desc": "Namibia, Afghanistan get key wins with India set to take on South Africa up next in the ICC Men's T20 World Cup 2026 warm-ups..",
    "image": "https://images.icc-cricket.com/image/upload/t_ratio16_9-size20-webp/prd/cftrijhdsiqn0fwwo5aj",
    "source": "ICC"
  },
  {
    "title": "Mandation not needed to boost UK pension investment, industry argues",
    "desc": "Industry figures have continued to express concern about the government’s proposed reserve asset allocation powers, warning that they risk harming savers’ outcomes and distracting from the real barriers to domestic investment",
    "image": "https://www.pensionsage.com/pa/images/shutterstock_2682847047.jpg",
    "source": "Pensions Age"
  },
  {
    "title": "Iran’s Information Warfare During the December 2025 - January 2026 Protests and Its Continued Influence on Israel and the West",
    "desc": "In this article, Daniel Haberfeld analyzes Iran's information-warfare strategy that reframed domestic unrest as a foreign conspiracy, using narrative control and external influence operations against Israel and the West as core tools of regime survival.",
    "image": "https://ict.org.il/wp-content/uploads/2026/02/Publication-Covers-7.png",
    "source": "International Institute for Counter-Terrorism"
  },
  {
    "title": "Turkish Airlines flight with 236 onboard makes emergency landing in Kolkata over engine fire",
    "desc": "The aircraft safely landed at Netaji Subhash Chandra Bose International Airport (NSCBIA) at 14:49 hours with 236 people on board",
    "image": "https://images.moneycontrol.com/static-mcnews/2023/12/MixCollage-01-Dec-2023-03-00-PM-4087.jpg",
    "source": "Moneycontrol"
  },
  {
    "title": "Watch video of Nkansah's GH¢100k scholarship allegation that triggered NIB probe",
    "desc": "President John Dramani Mahama has directed the National Investigations Bureau (NIB) to immediately investigate allegations of corruption in the award of government foreign scholarships.",
    "image": "https://cdn.ghanaweb.com/imagelib/pics/618/61858425.jpg",
    "source": "GhanaWeb"
  }
]