[
  {
    "title": "Is Trump reconsidering Taiwan arms deal after Xi Jinping's warning? US president says 'I’m talking...'",
    "desc": "US President Donald Trump said a decision on sending more weapons to Taiwan will be made soon after talks with Xi Jinping. China warned against the move, calling Taiwan a core issue, as tensions rise with military drills and strong reactions from Taipei and Beijing.",
    "image": "https://cdn1.wionews.com/prod/wion/images/2026/20260217/image-1771296658371.jpg?imwidth=1200&imheight=900",
    "source": "WION"
  },
  {
    "title": "GOSSIP GIRL: Daniel Fernando brings Oasis of Love's 'Senakulo: A Healing Concert' to Malolos",
    "desc": "Today, Feb. 18, Catholics and many Christians in the Philippines observe Ash Wednesday as the solemn doorway into the sacred season of Lent. As ashes are gently...",
    "image": "https://mb.com.ph/manilabulletin/uploads/images/2026/02/17/79831.webp",
    "source": "Manila Bulletin"
  },
  {
    "title": "$56 billion AI scare tests resilience of TCS, Infosys and other Indian IT stocks",
    "desc": "Indian IT stocks, including TCS and Infosys, faced a $56 billion market hit amid global AI-related concerns. The sell-off tested the sectors resilience as investors reacted to fears of automation-driven disruptions and changing technology dynamics. Despite short-term volatility, analysts say strong fundamentals and long-term growth prospects could help these companies navigate the turbulence and recover over time.",
    "image": "https://img.etimg.com/thumb/msid-128447078,width-1200,height-630,imgsize-53640,overlay-etmarkets/articleshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "‘India’s most happening city’: Sergio Gor’s Bengaluru evening with BJP MP features auto ride, dosa diplomacy | Watch",
    "desc": "A video shared by the BJP MP shows the two travelling in an auto rickshaw through the city’s streets, with Sergio Gor recording the roads on his phone. | Bengaluru News",
    "image": "https://www.hindustantimes.com/ht-img/img/2026/02/17/550x309/gor_in_auto_1771297452571_1771297459677.png",
    "source": "Hindustan Times"
  },
  {
    "title": "Top Nifty picks! Infosys, Tata Steel among 11 stocks with EPS CAGR potential of up to 106%",
    "desc": "Indian markets appear set for a stronger performance in CY26, especially after underperforming by around 26% in USD terms versus MSCI EM in CY25, according to Motilal Oswal. Across market capitalisation segments, large caps saw 16% YoY earnings growth, in line with the broader market. Here’s the full list of the brokerage’s preferred picks. Money-making Plays",
    "image": "https://img.etimg.com/thumb/msid-128447003,width-1200,height-900,overlay-etmarkets/slideshow.jpg",
    "source": "The Economic Times"
  },
  {
    "title": "Four men again jailed for life for killing Albanian refugee Urim Gjabri in Adelaide",
    "desc": "Four men who faced a retrial over the murder of Albanian refugee Urim Gjabri in Adelaide's north in 2018 are again jailed for life, with the judge saying their crime was motivated by \"greed and [a] desire to rob him of the cannabis\".",
    "image": "https://live-production.wcms.abc-cdn.net.au/5accad854a40d7628cbc46d0d3a27d7f?impolicy=wcms_watermark_news&cropH=1152&cropW=2048&xPos=0&yPos=0&width=862&height=485&imformat=generic",
    "source": "Australian Broadcasting Corporation"
  },
  {
    "title": "Zimbabwe look to beat Ireland with maiden Super 8s berth in sight",
    "desc": "Zimbabwe look to beat Ireland with maiden Super 8s berth in sight",
    "image": "https://dailypioneer.com/uploads/2026/story/images/big/zimbabwe-look-to-beat-ireland-with-maiden-super-8s-berth-in-sight-2026-02-17.jpg",
    "source": "Daily Pioneer"
  },
  {
    "title": "WWE will pay tribute to AJ Styles on Raw next week",
    "desc": "Next week’s episode of Monday Night Raw in Atlanta will be a tribute to the star who recently lost a retirement match.",
    "image": "https://platform.cagesideseats.com/wp-content/uploads/sites/54/2026/02/AJ.png?quality=90&strip=all&crop=0%2C2.682559728175%2C100%2C94.63488054365&w=1200",
    "source": "Cageside Seats"
  },
  {
    "title": "Arkia to launch four new routes",
    "desc": "In addition to the new routes to Malaga, Ibiza, Vilnius and Lithuania, the Israeli airline will introduce business class for the first time in its history.",
    "image": "https://res.cloudinary.com/globes/image/upload/t_800X392/v1596285196/old/1686738.jpg",
    "source": "Globes - Israel Business News"
  },
  {
    "title": "Navy seizes 496 tons of smuggled tin",
    "desc": "The Indonesian Navy has seized nearly tons of smuggled tin worth about Rp billion or roughly",
    "image": "https://i.petromindo.com/petromindo-og-default.png",
    "source": "Petromindo"
  }
]